{
    "top_news": [
      {
        "news": [
          {
            "id": 258530518,
            "title": "Haryana Elections 2024 LIVE: Polling Begins, Over 2 Crore Voters To Decide Fate Of 1,031 Candidates Today; CM Saini, Vinesh Phogat In Fray",
            "text": "Haryana Elections 2024 LIVE: The fate of Chief Minister Nayab Singh Saini, Congress leader Bhupinder Singh Hooda, and wrestler Vinesh Phogat, along with JJP’s Dushyant Chautala and 1,027 other candidates, will be decided as elections for the 90-member Haryana Assembly is set to take place on Saturday, with over 2 crore people eligible to vote. The ruling BJP is aiming for a hat-trick of wins in the state, while the Congress hopes to make a comeback after a decade. The counting of votes is scheduled for October 8. A total of 1,031 candidates are contesting across all 90 assembly constituencies, including 101 women, with 464 running as independents. Haryana’s Chief Electoral Officer, Pankaj Agarwal, had said that 20,632 polling booths have been set up for voting. The key parties in the contest include the BJP, Congress, AAP, INLD-BSP, and the JJP-Azad Samaj Party.",
            "summary": "The ruling BJP is aiming for a hat-trick of wins in the state, while the Congress hopes to make a comeback after a decade",
            "url": "https://www.news18.com/elections/haryana-elections-2024-voting-live-updates-assembly-elections-voter-turnout-bjp-congress-liveblog-9074120.html",
            "image": "https://images.news18.com/ibnlive/uploads/2024/10/haryana-2024-10-78e299128b367fb0f4de3f45c310a038-16x9.jpg",
            "video": null,
            "publish_date": "2024-10-05 01:23:23",
            "author": "News18",
            "authors": [
              "News18"
            ],
            "language": "en",
            "catgory": "politics",
            "source_country": "in",
            "sentiment": -0.136
          },
          {
            "id": 258531386,
            "title": "Haryana Assembly polls 2024 LIVE: Voting begins across all 90 seats, 1,031 candidates in fray",
            "text": "Haryana is fully prepared for the 15th Legislative Assembly elections scheduled for today. According to Haryanas Chief Electoral Officer, Pankaj Agarwal 2,03,54,350 voters, including 1,07,75,957 males, 95,77,926 females, and 467 third-gender voters, are expected to vote today. A total of 1,031 candidates are contesting in 90 constituencies, with 20,632 polling booths set up for the election. The Chief Electoral Officer also mentioned that all polling stations will be monitored via webcasting at three levels on election day. Control rooms have been established at the state, district, and assembly levels to facilitate smooth oversight during the voting process. For security, 225 companies of the Central Armed Police Forces have been deployed.Key parties in the fray include the BJP, Congress, Aam Aadmi Party (AAP), along with the pre-poll alliances of Indian National Lok Dal-Bahujan Samaj Party (INLD-BSP) and Jannayak Janta Party (JJP)-Azad Samaj Party (ASP). BJP is aiming for a third consecutive term in power, while the Congress is looking to make a comeback after a decade out of office. The results of the Haryana Assembly elections will be announced on October 8, alongside those of Jammu and Kashmir. The decline in vote shares for smaller parties has been more pronounced in Lok Sabha elections, but the trend is also evident in state Assembly elections. In the 2024 Lok Sabha elections, smaller parties were virtually wiped out. The BJP and Congress, along with its ally Aam Aadmi Party, captured nearly 94 percent of the total votes. Among the smaller parties, the Dushyant Chautala-led Jannayak Janta Party (JJP) managed just 0.87 percent of the vote share. The Indian National Lok Dal (INLD) and Bahujan Samaj Party (BSP) secured 1.74 percent and 1.28 percent, respectively.Since 2014, the BJP in Haryana has focused on appealing to all communities except Jats, successfully winning the 2014 and 2019 assembly elections by creating a Jat vs non-Jat divide. The party built a strong non-Jat coalition, with substantial support from Dalits, as well as Other Backward Classes (OBCs), Punjabi Khatris, and upper castes. However, there is debate over whether Dalits vote as a unified bloc. While some analysts believe the Dalit vote will favor the Congress, others argue that a significant portion of the community remains a core support base for the BJP. To better understand Dalit voting patterns in Haryana, one must consider the various sub-castes within the community..storycontent div {margin:10px 0;}",
            "summary": "Haryana Assembly election Polls 2024 Live Updates: Catch all the latest Haryana election updates here",
            "url": "https://www.business-standard.com/elections/haryana-elections/haryana-elections-2024-live-updates-bjp-congress-pm-modi-rahul-gandhi-voting-percentage-124100500056_1.html",
            "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-10/01/full/1727757255-0021.jpg",
            "video": null,
            "publish_date": "2024-10-05 01:32:47",
            "author": "Bs Web Team",
            "authors": [
              "Bs Web Team"
            ],
            "language": "en",
            "catgory": "politics",
            "source_country": "in",
            "sentiment": 0.167
          },
          {
            "id": 258534534,
            "title": "Haryana polls: Voting begins across all 90 seats",
            "text": "The voting for the Haryana Assembly elections began on Saturday across all 90 constituencies of the state. Polling began at 7 am and will end at 6 pm. More than two crore voters are eligible to cast their votes in Haryana across 20,630 polling booths. More than 1,030 candidates are in the fray, including 302 from national parties, 121 from parties based in the state and 464 Independents. The Bharatiya Janata Party, which is fighting to win a third-consecutive term, is facing a challenge from the Congress led by former Chief Minister Bhupinder Singh Hooda. The Indian National Lok Dal has tied up with the Bahujan Samaj Party and the Dushyant Chautala-led Jannayak Janata Party has allied with MP Chandrashekhar Azad’s Azad Samaj Party (Kanshi Ram). The Aam Aadmi Party, which is the Congress’ ally at the national level, is contesting the polls alone. The counting of votes will take place on Tuesday, alongside that of the Jammu and Kashmir Assembly polls. The Union territory had voted in three phases over the past three weeks. Also read: Why the Congress and AAP failed to forge an alliance in Haryana Key battles Among the key battles in the polls, wrestler Vinesh Phogat is contesting from Jind district’s Julana constituency on a Congress ticket. The BJP has fielded Captain Yogesh Bairagi against her. The Aam Aadmi Party has picked wrestling entertainment star Kavita Dalal for the seat. In January 2023, several top Indian wrestlers, including Phogat, launched a protest against former Wrestling Federation of India chief and BJP leader Brij Bhushan Sharan Singh accusing him of intimidation and sexual harassment. The protestors were manhandled by the police at Delhi’s Jantar Mantar on May 3, 2023. Also read: Vinesh Phogat is winning over Haryana’s women – but is still wrestling with a tough election Chief Minister Nayab Singh Saini is contesting from Kurukshetra’s Ladwa constituency. He had been elected to the Karnal seat in a bye-election held there in May. Bhupinder Singh Hooda is fighting from the Garhi Sampla-Kiloi constituency, which is considered his stronghold. He Former Deputy Chief Minister Dushyant Chautala is contesting from Jind district’s Uchana Kalan seat. Former state home minister and BJP leader Anil Vij is fighting against Congress’ Parvinder Pal Pari in the Ambala Cantonment constituency. Indian National Lok Dal leader Abhay Singh Chautala is seeking re-election from the Ellenabad seat in Sirsa district. He is fighting against the BJP’s district chief Amir Chand Talwara and Congress’ Bharat Singh Beniwal. Savitri Jindal, the chairperson emeritus of the OP Jindal Group, is contesting as an Independent candidate from Hisar. She had quit the Congress and joined the BJP in March. Also read: Organised chaos: Why BJP is encouraging multiple chief minister claimants in Haryana In the 2019 Haryana elections, the BJP won 40 seats in the 90-member Assembly. Having fallen short of the majority mark, it had formed the government with the support of the Jannayak Janta Party. The Congress had won 31 seats. Manohar Lal Khattar, who had been the state’s chief minister since October 2014, retained his position and Dushyant Chautala became his deputy. In March, weeks ahead of the Lok Sabha elections, the BJP replaced Khattar with Saini as the chief minister. The ties between the Hindutva party and the Jannayak Janta Party also snapped, leading to Dushyant Chautala’s resignation. In the general elections, the BJP-led National Democratic Alliance and the Opposition INDIA bloc won five seats each. Haryana has 10 Lok Sabha constituencies. The BJP had won all 10 seats in the 2019 Lok Sabha polls. Exit polls for Haryana and the Jammu and Kashmir elections will be released after polling concludes on Saturday evening. Also read: Why is pollution not an issue in the Haryana elections?Why gau rakshaks are not unconditionally backing BJP in Haryana’s elections",
            "summary": "More than two crore voters are eligible to cast their votes across 20,630 polling booths.",
            "url": "https://scroll.in/latest/1074097/haryana-polls-voting-begins-across-all-90-seats",
            "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/129590-bebxbwilij-1571770723.jpg",
            "video": null,
            "publish_date": "2024-10-05 02:32:00",
            "author": "Scroll Staff",
            "authors": [
              "Scroll Staff"
            ],
            "language": "en",
            "catgory": "politics",
            "source_country": "IN",
            "sentiment": 0.032
          },
          {
            "id": 258535076,
            "title": "Haryana election: Voting begins for all 90 seats, 1,031 candidates in fray",
            "text": "Polling for all the 90 Assembly seats in Haryana began on Saturday morning amid tight security arrangements, officials said.The fate of Chief Minister Nayab Singh Saini, Congress leaders Bhupinder Singh Hooda and Vinesh Phogat, besides the JJPs Dushyant Chautala and 1,027 other candidates, will be decided in the polls in which more than two crore people are eligible to vote.The ruling Bharatiya Janata Party (BJP) is eyeing a hat-trick of Assembly election wins in the state, while the Congress is hoping to return to power after 10 years.The counting of votes will be taken up on October 8.The voting is being held from 7 am 6 pm.Haryana\"s Chief Electoral Officer (CEO) Pankaj Agarwal had earlier said 2,03,54,350 voters, including 8,821 centurions, are eligible to exercise their franchise.A total of 1,031 candidates are contesting the election, including 101 women and 464 Independent nominees.A total of 20,632 polling booths have been set up, Agarwal had said.Besides the BJP and the Congress, the key contesting parties are the Aam Aadmi PArty (AAP) and the INLD-BSP and JJP-Azad Samaj Party alliances.In the last Assembly polls in 2019, the BJP had won 40 seats, the Congress 31 and the Jannayak Janta Party (JJP) 10.The Congress has left the Bhiwani seat for its INDIA bloc partner CPI(M), while the BJP is not contesting the Sirsa seat, from where Haryana Lokhit Party chief Gopal Kanda is seeking re-election.Most seats are likely to see a direct fight between the BJP and the Congress.Prominent among those in the fray are Chief Minister Saini (from Ladwa), Leader of Opposition B S Hooda (Garhi Sampla-Kiloi), Indian National Lok Dal\"s (INLD) Abhay Singh Chautala (Ellenabad), JJP\"s Dushyant Chautala (Uchana Kalan), BJP\"s Anil Vij (Ambala Cantonment), Captain Abhimanyu (Narnaund) and O P Dhankar (Badli), AAP\"s Anurag Dhanda (Kalayat) and Congress\"s Phogat, a former wrestler, from Julana.From Tosham, former MP Shruti Choudhry of the BJP and Anirudh Chaudhary, both cousins, are contesting.From Dabwali, Devi Lal\"s grandson Aditya Devi Lal, an INLD candidate, is taking on the JJP\"s Digvijay Singh Chautala, the great grandson of the former deputy prime minister.The BJP has fielded former chief minister late Bhajan Lal\"s grandson Bhavya Bishnoi from Adampur in Hisar while its nominee from Ateli in Mahendragarh is Arti Rao, whose father Rao Inderjit Singh is a Union minister.Among the independent candidates are Savitri Jindal (Hisar), Ranjit Chautala (Rania) and Chitra Sarwara (Ambala Cantonment).Taking on Dushyant Chautala from Uchana is the Congress\"s Brijendra Singh, son of former Union minister Birender Singh.A few rebels from both the Congress and the BJP are also in the fray.Director General of Police (DGP) Shatrujeet Kapur on Friday said the Haryana Police is fully prepared to ensure a free, fair and peaceful conduct of the election.Nearly 30,000 police personnel and 225 paramilitary companies have been deployed. An adequate number of home guard personnel have also been deployed.Adequate police presence will be maintained at the polling booths and other locations. More than 3,616 polling booths have been classified as sensitive and 145 deemed vulnerable, necessitating additional security measures.To maintain law and order and ensure compliance with the Model Code of Conduct, the state has also formed 516 flying squads, 469 static-surveillance teams and 32 quick-response teams. Additionally, 1,156 patrolling parties are actively monitoring the situation, the DGP said.Agarwal said of the total voters, 1,07,75,957 are men, 95,77,926 are women and 467 belong to the third gender.There are 5,24,514 voters aged between 18 and 19 years and 1,49,142 differently-abled voters, of whom 93,545 are male, 55,591 are female and six belong to the third gender.A total of 2,31,093 voters are aged above 85 years, comprising 89,940 males and 1,41,153 females.There are 8,821 voters aged over 100 years, including 3,283 males and 5,538 females. The total number of service voters is 1,09,217 -- 1,04,426 males and 4,791 females.The voter turnout recorded in the 2019 Assembly polls was around 68 per cent.A total of 144 polling stations have been designated as model ones. Besides, 115 polling stations will be entirely managed by women staff, 114 by young government employees and 87 by differently-abled employees.Webcasting will be conducted at all the polling stations on election day, Agarwal had said earlier.The CEO had said including reserved units, a total of 27,866 electronic voting machines (ballot units) will be used in this election.In 2019, the BJP formed the government with the support of the JJP while most of the Independent MLAs had also extended support to the saffron party. However, the JJP\"s post-poll tie-up with the BJP ended after the latter replaced Manohar Lal Khattar with Saini as the chief minister in March..storycontent div {margin:10px 0;}",
            "summary": "Polling for all the 90 Assembly seats in Haryana began on Saturday morning amid tight security arrangements, officials said.\nThe fate of Chief Minister Nayab Singh Saini, Congress leaders Bhupinder Singh Hooda and Vinesh Phogat, besides the JJPs Dushyant Chautala and 1,027 other candidates, will be decided in the polls in which more than two crore people are eligible to vote.\nThe ruling Bharatiya Janata Party (BJP) is eyeing a hat-trick of Assembly election wins in the state, while the Congress is hoping to return to power after 10 years.\nThe counting of votes will be taken up on October 8.\nThe voting is being held from 7 am 6 pm.\nHaryanas Chief Electoral Officer (CEO) Pankaj Agarwal had earlier said 2,03,54,350 voters, including 8,821 centurions, are eligible to exercise their franchise.\nA total of 1,031 candidates are contesting the election, including 101 women and 464 Independent nominees.\nA total of 20,632 polling booths have been set up, Agarwal had said.\nBesides the BJ",
            "url": "https://www.business-standard.com/elections/haryana-elections/haryana-election-voting-begins-for-all-90-seats-1-031-candidates-in-fray-124100500060_1.html",
            "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-10/01/full/1727761589-3654.jpg",
            "video": null,
            "publish_date": "2024-10-05 03:25:44",
            "author": "Press Trust of India",
            "authors": [
              "Press Trust of India"
            ],
            "language": "en",
            "catgory": "politics",
            "source_country": "in",
            "sentiment": -0.099
          }
        ]
      },
      {
        "news": [
          {
            "id": 258531034,
            "title": "Voting begins for Haryana Assembly elections; Union Minister Manohar Lal Khattar cast his vote",
            "text": "Voting began for 90 assembly seats in Haryana on Saturday after days of hectic campaigning by major political parties, including the ruling Congress and the Bharatiya Janata Party (BJP).Meanwhile, Union Minister and former Haryana Chief Minister Manohar Lal Khattar cast his vote at GGSSS Prem Nagar, Karnal. “People should cast their vote today. The administration has made all the arrangements and elections will be held peacefully. BJP is confident of winning and we will form the government in the state for the 3rd time,” Khattar told reporters before casting the vote. This election is a high-stakes battle as the BJP is eyeing a third straight term to power in the state, the Congress party is aiming to wrest back power riding on anti-incumbency, and issues of farmer protests and wrestler protests.The key contesting parties in Haryana include the BJP, Congress, and Aam Aadmi Party (AAP), as well as the pre-poll alliance between the Indian National Lok Dal-Bahujan Samaj Party (INLD-BSP) and the Jannayak Janta Party (JJP)-Azad Samaj Party (ASP).Voting in Haryana will be held from 7 am to 6 pm. A total of 1,031 candidates are contesting in all 90 assembly constituencies, and 20,632 polling booths have been set up for voting. The results for the Haryana Assembly elections will be declared along with those of Jammu and Kashmir on October 8.According to Haryana’s Chief Electoral Officer, Pankaj Agarwal, 2,03,54,350 voters, including 1,07,75,957 males, 95,77,926 females, and 467 third-gender voters, will cast their votes in the Assembly Elections on October 5. A total of 1,031 candidates are contesting across 90 constituencies, and 20,632 polling booths have been set up for the election.The Chief Electoral Officer highlighted that a total of 29,462 police personnel, 21,196 home guards, and 10,403 Special Police Officers (SPO) have been deployed across the state. Strict surveillance will be maintained at every corner of the state to allow citizens to cast their votes without fear.Manohar Lal Khattar served as the Chief Minister of Haryana for around 9.5 years. He was succeeded by Nayab Singh Saini in March this year. BJP is contesting the polls under his leadership. Saini is contesting from the Ladwa constituency.One of the prominent faces in the elections is wrestler Vinesh Phogat. She joined the Congress party on September 6, along with Olympian wrestler Bajrang Punia, following her disqualification from the women’s 50 kg final at the Paris Olympics.The JJP-ASP alliance will contest all 90 Assembly constituencies in Haryana, with the JJP fielding candidates in 70 seats and the ASP in 20.In the 2019 Assembly elections, the BJP won 40 of the 90 seats, forming a coalition government with the JJP, which won 10 seats. The Congress secured 31 seats. However, JJP later broke out of the coalition",
            "summary": "The News Mill",
            "url": "https://thenewsmill.com/2024/10/voting-begins-for-haryana-assembly-elections-union-minister-manohar-lal-khattar-cast-his-vote/",
            "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
            "video": null,
            "publish_date": "2024-10-05 01:38:31",
            "author": "ANI",
            "authors": [
              "ANI"
            ],
            "language": "en",
            "catgory": "politics",
            "source_country": "in",
            "sentiment": -0.429
          },
          {
            "id": 258531588,
            "title": "Voting begins for Haryana Assembly elections",
            "text": "Karnal (Haryana): Voting began for 90 assembly seats in Haryana on Saturday after days of hectic campaigning by major political parties, including the ruling Congress and the Bharatiya Janata Party (BJP).Meanwhile, Union Minister and former Haryana Chief Minister Manohar Lal Khattar cast his vote at GGSSS Prem Nagar, Karnal.People should cast their vote today. The administration has made all the arrangements and elections will be held peacefully. BJP is confident of winning and we will form the government in the state for the 3rd time, Khattar told reporters before casting the vote.This election is a high-stakes battle as the BJP is eyeing a third straight term to power in the state, the Congress party is aiming to wrest back power riding on anti-incumbency, and issues of farmer protests and wrestler protests.The key contesting parties in Haryana include the BJP, Congress, and Aam Aadmi Party (AAP), as well as the pre-poll alliance between the Indian National Lok Dal-Bahujan Samaj Party (INLD-BSP) and the Jannayak Janta Party (JJP)-Azad Samaj Party (ASP).A total of 1,031 candidates are contesting in all 90 assembly constituencies, and 20,632 polling booths have been set up for voting. The results for the Haryana Assembly elections will be declared along with those of Jammu and Kashmir on October 8.According to Haryana\"s Chief Electoral Officer, Pankaj Agarwal, 2,03,54,350 voters, including 1,07,75,957 males, 95,77,926 females, and 467 third-gender voters, will cast their votes in the Assembly Elections on October 5. A total of 1,031 candidates are contesting across 90 constituencies, and 20,632 polling booths have been set up for the election.The Chief Electoral Officer highlighted that a total of 29,462 police personnel, 21,196 home guards, and 10,403 Special Police Officers (SPO) have been deployed across the state. Strict surveillance will be maintained at every corner of the state to allow citizens to cast their votes without fear.Manohar Lal Khattar served as the Chief Minister of Haryana for around 9.5 years. He was succeeded by Nayab Singh Saini in March this year. BJP is contesting the polls under his leadership. Saini is contesting from the Ladwa constituency.One of the prominent faces in the elections is wrestler Vinesh Phogat. She joined the Congress party on September 6, along with Olympian wrestler Bajrang Punia, following her disqualification from the women\"s 50 kg final at the Paris Olympics.The JJP-ASP alliance contesting all 90 Assembly constituencies in Haryana, with the JJP fielding candidates in 70 seats and the ASP in 20.",
            "summary": "",
            "url": "https://www.deccanchronicle.com/nation/current-affairs/voting-begins-for-haryana-assembly-elections-1828183",
            "image": "https://www.deccanchronicle.com/h-upload/2024/10/05/1848528-ani-20241005013745.webp",
            "video": null,
            "publish_date": "2024-10-05 01:48:09",
            "author": "ANI",
            "authors": [
              "ANI"
            ],
            "language": "en",
            "catgory": "politics",
            "source_country": "in",
            "sentiment": -0.332
          },
          {
            "id": 258533972,
            "title": "Haryana Assembly Election: BJP Aims For Hat-Trick While Congress Eyes To Rise From The Ashes",
            "text": "The political fate of key figures like Chief Minister Nayab Singh Saini, Congress leaders Bhupinder Singh Hooda and Vinesh Phogat, JJPs Dushyant Chautala, and over 1,000 other candidates will be decided today as Haryana voters head to the polls for 90 assembly seats.The ruling BJP is aiming for a third consecutive term, while the Congress is looking to reclaim power in Haryana after ten years. Other major contenders include the Aam Aadmi Party (AAP), Indian National Lok Dal (INLD), Bahujan Samaj Party (BSP), Jannayak Janta Party (JJP), and Azad Samaj Party (ASP).The BJPs campaign was led by Prime Minister Narendra Modi, who held four rallies where he criticised the Congress on various issues, accusing them of stalling critical matters, including the Ram temple issue.On the other hand, Congress leader Rahul Gandhi addressed several public meetings, predicting a Congress storm in Haryana and promising a government focused on the poor and farmers, with a mohabbat ki dukan in every corner of the state.In an alliance move, Congress left the Bhiwani seat to its INDIA bloc partner, the Communist Party of India (Marxist) or CPI(M), while the BJP chose not to contest the Sirsa seat, where Gopal Kanda, the Haryana Lokhit Party leader, is seeking re-election.Most constituencies are expected to witness a direct contest between the BJP and Congress. Key candidates include Chief Minister Saini (Ladwa), Leader of Opposition Hooda (Garhi Sampla-Kiloi), INLDs Abhay Singh Chautala (Ellenabad), JJPs Dushyant Chautala (Uchana Kalan), BJPs Anil Vij (Ambala Cantt), Capt Abhimanyu (Narnaund), OP Dhankar (Badli), AAPs Anurag Dhanda (Kalayat), and Congresss Vinesh Phogat (Julana).The BJP has fielded Bhavya Bishnoi, grandson of former Chief Minister Bhajan Lal, from Adampur in Hisar, while its candidate for Ateli in Mahendragarh is Arti Rao, daughter of Union Minister Rao Inderjit Singh. Notable independents include Savitri Jindal (Hisar), Ranjit Chautala (Rania), and Chitra Sarwara (Ambala Cantt).Congresss Brijendra Singh, son of former Union minister Birender Singh, is challenging Dushyant Chautala in Uchana. In Tosham, cousins and former BJP MP Shruti Choudhry and Anirudh Chaudhary are contesting against each other. In Dabwali, INLDs Aditya Devi Lal, grandson of former Deputy Prime Minister Devi Lal, is up against JJPs Digvijay Singh Chautala, Devi Lals great-grandson.In the 2019 assembly elections, the BJP secured 40 seats, Congress won 31, and JJP claimed 10. The BJP formed a government with JJPs support, along with most independents. However, the JJPs alliance with the BJP ended when the BJP replaced Manohar Lal Khattar with Nayab Singh Saini as Chief Minister in March.Director General of Police Shatrujeet Kapur assured that Haryana Police are fully prepared to ensure free, fair, and peaceful elections, with over 30,000 police officers and 225 paramilitary companies deployed.The state has 1.07 crore male voters, 95 lakh female voters, and 467 transgender voters. Vote counting is set for October 8.Among the electorate, 8,821 voters are over 100 years old, including 3,283 men and 5,538 women, with 1.09 lakh service voters registered. The voter turnout in the 2019 assembly elections was approximately 68%.(With PTI inputs)",
            "summary": "The political fate of key figures like Chief Minister Nayab Singh Saini, Congress leaders Bhupinder Singh Hooda and Vinesh Phogat, JJPs Dushyant Chautala, and over 1,000 other candidates will be decided today as Haryana voters head to the polls for 90",
            "url": "https://www.oneindia.com/india/haryana-election-bjp-looks-to-score-hat-trick-while-congress-eyes-to-rise-from-the-ashes-3952599.html",
            "image": "https://imagesvs.oneindia.com/img/2024/10/hary-1728096182.jpg",
            "video": null,
            "publish_date": "2024-10-05 02:53:20",
            "author": "Amit Vasudev",
            "authors": [
              "Amit Vasudev"
            ],
            "language": "en",
            "catgory": "politics",
            "source_country": "in",
            "sentiment": -0.089
          }
        ]
      }
    ],
    "language": "en",
    "country": "in"
  }