[
    {
        "id": 256754576,
        "title": "CTET 2024: Exam Cities Reduced, Dates Remain Unchanged, Check Revised Schedule",
        "text": "HomeEducationCTET 2024: Exam Cities Reduced, Dates Remain Unchanged, Check Revised Schedule CTET 2024: Exam Cities Reduced, Dates Remain Unchanged, Check Revised Schedule Applicants have until October 16 to complete the CTET form, giving them a month to apply. Megha Chowdhury_Updated: Thursday, September 19, 2024, 11:29 AM IST Representational image The application process for the 20th edition of the Central Teacher Eligibility Test (CTET) December 2024 has been initiated by the Central Board of Secondary Education (CBSE). This eligibility test is for the appointment of teachers in Classes 1 to 8. The registration link for CTET Dec 2024 is available on the official website, ctet.nic.in. According to the CTET notification, the number of exam cities has been reduced to 136. Applicants have until October 16 to complete the CTET form, giving them a month to apply. CTET Paper 1 will be conducted for those aiming to teach classes 1 to 5, while Paper 2 is for those wishing to teach classes 6 to 8. The syllabus will cover topics such as child development and pedagogy, mathematics, environmental studies, social studies, and social science, with a total of 150 questions worth 150 marks. The exam is scheduled to be conducted in twenty languages across exam centres nationwide. In the last session, 8,30,242 candidates registered for Paper 1 and 16,99,823 for Paper 2. Of these, 1,27,159 qualified in Paper 1 and 2,39,120 in Paper 2. The CTET December 2024 exam is set for December 1, with Paper 2 in the morning shift from 9:30 AM to 12:00 noon, and Paper 1 in the afternoon from 2:30 PM to 5:00 PM. In cities with a higher number of registered candidates, the exam may also take place on November 30. FPJ Shorts CTET 2024: Exam Cities Reduced, Dates Remain Unchanged, Check Revised Schedule NTPC Shares Zoom To Life High Level After Green Energy Arm Files For ₹10,000 Crore IPO Tupperware Bankruptcy: Netizens Reminisce & React To The Fallen Icon Of Kitchenware Maharashtra CM Eknath Shinde Participates In 'Swachhata Hi Seva' Drive At Girgaon Chowpatty; Visuals Surface Candidates must provide four options for exam centres in order of preference. While efforts will be made to allocate a centre based on the candidate's choices, the board reserves the right to assign a different centre if necessary. When filling out the CTET application form, candidates must upload a photograph and signature in the specified formats. The photograph should be in jpg/jpeg format, sized between 10 to 100 KB (3.5 cm x 4.5 cm), and the signature must also be in jpg/jpeg format, sized between 3 to 30 KB (3.5 cm x 4.5 cm). Follow us on RECENT STORIES CTET 2024: Exam Cities Reduced, Dates Remain Unchanged, Check Revised Schedule Union Cabinet Approves Setting Up Of National Centre Of Excellence For Animation, Visual Effects,... Bihar: Holiday Announced For 76 Patna Schools Until Sept 21 As Ganga Surges Past Danger Mark RPSC RAS 2024: Rajasthan Public Service Commission's Registration Begins Today For 733 Positions NEET PG 2024 Counselling: MCC NEET PG Round 1 Schedule Aawaited At mcc.nic.in",
        "summary": "",
        "url": "https://www.freepressjournal.in/education/ctet-2024-exam-cities-reduced-dates-remain-unchanged-check-revised-schedule",
        "image": "https://media.assettype.com/freepressjournal/2021-07/ea24597c-32b3-4b7c-a2f5-19be8f3ba2b1/CET_Counselling.jpg",
        "video": null,
        "publish_date": "2024-09-19 05:59:09",
        "author": "Megha Chowdhury",
        "authors": [
            "Megha Chowdhury"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.251
    },
    {
        "id": 256759724,
        "title": "RSMSSB CET 2024: When & where to download your admit card? Details inside",
        "text": "The admission cards for Graduate Level Common Eligibility Test (CET) will be made available by the Rajasthan Staff Selection Board (RSMSSB) on Wednesday (September 19) at 6:00 pm. The hall passes will be available for download from the official website at rsmssb.rajasthan.gov.in for candidates upon release.The CET Graduate Level Exam will be conducted on September 27 and September 28. There will be two shifts for the exam – from 3 pm to 6 pm and from 9 am to 12 pm. Platoon Commander, Jailer, Hostel Superintendent Grade II, Junior Accountant, Patwari, Tehsildar, Village Development Officer, Supervisor (Male and Female), and Tehsil Revenue Accountant are among the roles that will be filled through the CET exam. A record 13 lakh applicants have submitted applications for this hiring test.The CET for graduates will be conducted across 25 districts in Rajasthan, including Jaipur, Jodhpur, Ajmer, Bikaner, Udaipur, Bharatpur, Kota, Baran, Beawar, Bhilwara, Bundi, Chittorgarh, Dausa, Dungarpur, Sikar, Pali, Tonk, Alwar, Sri Ganganagar, Hanumangarh, Jhalawar, Kotputli, Nagaur, Rajsamand, and Sawai Madhopur.RSMSSB CET 2024 Admit Card: How to downloadStep 1. Visit the official website at recruitment.rajasthan.gov.inStep 2. Press on the \"Get Admit Card\" option on the homepageStep 3. A new page will be displayed on the screenStep 4. Fill in your login detailsStep 5. View your admit card and download itStep 6. Take a printout for future use.RSMSSB CET 2024: Important guidelinesIn order to check full security and get a seat in the exam hall on time, candidates should arrive at the exam centre two hours ahead of time.The exam centre's entrance gate will close exactly one hour prior to the start of the test. It is imperative that applicants arrive on time because, beyond this, they will not be permitted access under any circumstances.Candidates must bring their original photo ID, their Aadhaar card (with the date of birth specified), and their provisional e-admit card to the exam centre.In exceptional circumstances, matching will be conducted using a voter ID card, passport, PAN card, or driver's licence. Additionally, candidates must submit a current, original colour photo that is no older than one month and has not been altered, morphed, combined, or altered in any other way. Every photograph will be used to investigate using software. .storycontent div {margin:10px 0;}",
        "summary": "Rajasthan Staff Selection Board is scheduled to issue admit cards for the graduate-level Common Entrance Test (CET) today at 6 pm on the official website at recruitment.rajasthan.gov.in",
        "url": "https://www.business-standard.com/education/news/rsmssb-cet-2024-when-where-to-download-your-admit-card-details-inside-124091900466_1.html",
        "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-06/20/full/1718852058-5988.jpg",
        "video": null,
        "publish_date": "2024-09-19 07:12:48",
        "author": "Sonika Nitin Nimje",
        "authors": [
            "Sonika Nitin Nimje"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.266
    },
    {
        "id": 256770190,
        "title": "RSMSSB CET admit card 2024 releasing today; here’s how to download",
        "text": "The Rajasthan Subordinate and Ministerial Services Selection Board (RSMSSB) will release the admit cards for the Common Eligibility Test (Graduation Level) 2024 today, September 19 at 6.00 PM. Once out, candidates can download their hall tickets from the official website rsmssb.rajasthan.gov.in. The CET 2024 will be conducted on September 27 and 28 in two shifts — 9.00 AM to 12 noon and 3.00 PM to 6.00 PM. The applicants are directed to report two hours before the commencement of the exam. The candidates are required to bring their admit card, valid ID proof, and a colour photograph of themselves. More details in the notification below: The applications were invited from August 9 to September 7, 2024. Steps to download CET admit card 2024 Visit the official website rsmssb.rajasthan.gov.inOn the homepage, click on the CET (Graduation Level) 2024 admit card linkKey in your login details and submitCheck and download the admit cardTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their hall tickets from the official website rsmssb.rajasthan.gov.in.",
        "url": "https://scroll.in/announcements/1073479/rsmssb-cet-admit-card-2024-releasing-today-heres-how-to-download",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/119065-luiitzzakm-1594376748.jpg",
        "video": null,
        "publish_date": "2024-09-19 08:40:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.122
    },
    {
        "id": 256775532,
        "title": "KMAT 2024 admit card released at kmatindia.com, here’s direct link",
        "text": "The Karnataka Private Post Graduate Colleges Association (KPPGCA) has released the admit card for the Karnataka Management Aptitude Test (KMAT) 2024. Eligible candidates can download their hall tickets from the official website kmatindia.com. The exam will be conducted on September 22, 2024. KMAT 2024 will be held for admissions to various institutes in Karnataka for the MBA, MCA, and PGDM courses. The applications were invited till September 17, 2024. Steps to download KMAT admit card 2024 Visit the official website www.kmatindia.comOn the homepage, click on the KMAT 2024 admit card linkKey in your login details and submitCheck and download the admit cardTake a printout future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their hall tickets from the official website kmatindia.com.",
        "url": "https://scroll.in/announcements/1073487/kmat-2024-admit-card-released-at-kmatindia-com-heres-direct-link",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/178829-wmzziyglky-1661223742.jpg",
        "video": null,
        "publish_date": "2024-09-19 09:50:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.356
    },
    {
        "id": 256838982,
        "title": "CBSE Board Exams 2025 To Begin From This Date",
        "text": "The Central Board of Secondary Education (CBSE) is expected to begin with the 2025 board exams for Classes 10 and 12 from February 15, 2025. While CBSE has not yet released any official notification for the boards, the exam date is speculated based on an earlier post by PTI on X.\"Board exams for Classes 10 and 12 for academic session to be conducted from February 15, next year: CBSE,\" the post by PTI read.The exam are likely to begin in February and will conclude in April. Since 2023, CBSE is conducting the board exam on February 15. In 2021, the exam was conducted on May 4-June 7 and in 2022 the board exam was held in April 26-May 24. The exam will be held in pen and paper format. The Board will release a separate date sheet for practical examinations. The practical exam for Class 12 will be held under the supervision of an external examiner visiting schools, however the Class 10 practical exam will be conducted in the presence of school teachers only. The CBSE Class 10 and 12 date sheet will comprise the exam days, dates, timings, and general instructions for students. Biannual exams Meanwhile, CBSE is exploring a semester system involving biannual exams. Currently, the board exams for Classes 10 and 12 are conducted in February-March.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");According to officials, consultations are on and no decision has been made yet about when and in which format the plan to conduct board exams twice a year will be implemented.The board has told the Union education ministry that more than 150 steps are required to conduct board exams of Classes 10 and 12 in the current system. The ministry's initial plan was to introduce biannual board exams from the 2024-25 academic session. However, it has been pushed back by a year. Prepared by the Union government-appointed national steering committee, led by former ISRO chairman K Kasturirangan, in line with the National Education Policy (NEP) 2020, the new NCF proposed a semester system for students of Classes 11 and 12.",
        "summary": "Since 2023, CBSE is conducting the board exam on February 15.",
        "url": "https://www.ndtv.com/education/cbse-board-exams-2025-to-begin-from-this-date-6606898",
        "image": "https://c.ndtvimg.com/2024-03/5vle8elg_rbse-8th-board-exam-2024_625x300_28_March_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-09-20 04:21:19",
        "author": "Puniti Pandey",
        "authors": [
            "Puniti Pandey"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -0.164
    },
    {
        "id": 256847786,
        "title": "RSMSSB CET Admit Card 2024 Declared; Know How To Download and Check Details Here",
        "text": "RSMSSB CET Admit Card 2024: The link for the RSMSSB CET Admit Card 2024 is activated by the Rajasthan Staff Selection Board (RSMSSB) on the official website, recruitment.rajasthan.gov.in. Candidates who are going to appear for the Common Eligibility Test 2024 will be able to download the admit card via the website. All concerned students must download the RSMSSB CET admit card on time. You will not be allowed to sit for the entrance exam without downloading the admit card. Make sure to check the announcements carefully.The RSMSSB CET Admit Card 2024 is an important document. You must download it from the official website - recruitment.rajasthan.gov.in before the exam starts. All the important details such as exam date, time, and other updates are mentioned on the admit card. You can contact the officials in case of any queries.SSC MTS Admit Card 2024 Havaldar Exam To Be Out Soon On Official WebsiteIt is pertinent to note that the Rajasthan Common Eligibility Test 2024 is scheduled to be held on 27 and 28 September. The first shift of the exam will be held from 9 am to 12 pm and the second shift will be held from 3 pm to 6 pm.All the aspiring candidates who have applied for the CET 2024 examination must have their admit cards and other essential documents ready for appearing in the examination.On the exam day, candidates are requested to reach the venue two hours before the exam. Gates will be closed one hour before the exam time. All students should read the rules of the exam to avoid any confusion.NEET SS 2024 Exam Dates Declared; Check the Latest Details and AnnouncementsHere are the easy steps you must follow to download the RSMSSB CET Admit Card 2024 online:Visit the official website - recruitment.rajasthan.gov.in.Click on the active link \"RSMSSB CET Admit Card 2024\" on the homepage.Enter the required details in the given space.Click on submit and your CET admit card will open on the screen.Check the details and download the admit card from the website.Save a copy of the CET admit card for the exam days and carry it to the hall.Candidates must follow all the instructions to appear for the exam on the scheduled dates.(Disclaimer: Parts of this article were generated by AI and published after the content was editorially modified and verified by a human based on their own judgement and expertise. The Quint does not publish AI-generated content without direct human involvement and oversight).ICAI CA Result 2024 Date: When Will CA Inter, Final May Exam Results be Declared(At The Quint, we question everything. Play an active role in shaping our journalism by becoming a member today.)",
        "summary": "RSMSSB CET Admit Card 2024: You can download the admit card from the website - recruitment.rajasthan.gov.in.",
        "url": "https://www.thequint.com/news/education/rsmssb-cet-admit-card-2024-declared-know-how-to-download-and-check-details-here",
        "image": "https://images.thequint.com/thequint/2024-09-20/sb82hjqf/iStock-905497700.jpg?auto=format,compress&fmt=webp&format=webp&w=1200&h=900&dpr=1.0",
        "video": null,
        "publish_date": "2024-09-20 07:01:05",
        "author": "Raajwrita Dutta",
        "authors": [
            "Raajwrita Dutta"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.062
    },
    {
        "id": 256862018,
        "title": "HP SET result 2023 declared at hppsc.hp.gov.in, download link here",
        "text": "The Himachal Pradesh Public Service Commission (HPPSC) has announced the results of the Himachal Pradesh State Eligibility Test 2023 or (HP SET 2023). Candidates can download their results from the official website hppsc.hp.gov.in. A total of 1315 candidates have been declared qualified. HP SET 2023 was conducted on April 28, 2024. The exam was conducted for 24 subjects and is the qualifying examination for candidates who wish to be employed as Assistant Professor at Universities and institutions located in Himachal Pradesh. “Although every care has been taken in preparing the result, possibility of inadvertent/technical error cannot be ruled out. The Commission reserves the right to rectify the same later on,” reads the notification. Steps to download HP SET result 2023 Visit the official website hppsc.hp.gov.inOn the homepage, click on the HP SET result 2023 linkThe result will appear on the screenCheck and download the resultTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their results from the official website hppsc.hp.gov.in.",
        "url": "https://scroll.in/announcements/1073528/hp-set-result-2023-declared-at-hppsc-hp-gov-in-download-link-here",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/119065-luiitzzakm-1594376748.jpg",
        "video": null,
        "publish_date": "2024-09-20 10:20:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.091
    },
    {
        "id": 256905630,
        "title": "UPSC result 2024 released for CDS II, NDA/NAE II; download link here",
        "text": "The Union Public Service Commission (UPSC) has declared the results of the Combined Defence Services (CDS) Examination II 2024 and the National Defence Academy and Naval Academy (NDA/NA) Exam (II) 2024. Eligible candidates can download their hall tickets from the official website upsc.gov.in. A total of 8796 candidates have been shortlisted to appear for the CDS II interview round by the Service Selection Board of the Ministry of Defence, for admission to Indian Military Academy, Indian Naval Academy, Air Force Academy, Officers Training Academy, and Officers Training Academy. The applicants who have qualified the NDA/ NA II exams will also be called for the interview round. The exams were conducted on September 1, 2024. The Commission has notified a total of 459 CDS 2 vacancies and 404 NDA/ NA 2 vacancies. Steps to download CDS II, NDA/ NA II result 2024 Visit the official website upsc.gov.inOn the homepage, click on the CDS II and NDA/ NA result 2024 linkKey in your login details and submitCheck and download the resultTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their results from the official website upsc.gov.in.",
        "url": "https://scroll.in/announcements/1073553/upsc-result-2024-released-for-cds-ii-nda-nae-ii-download-link-here",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/53914-igtwbgvvna-1489895182.jpg",
        "video": null,
        "publish_date": "2024-09-21 09:11:04",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.393
    },
    {
        "id": 257053118,
        "title": "IBPS RRB Clerk Result 2024: How To Check Prelims Results; Latest Updates Here",
        "text": "IBPS RRB Clerk Result 2024: The Institute of Banking Personnel Selection (IBPS) is anticipated to release the RRB Clerk Prelims result 2024 soon. The institute has announced the RRB PO Prelims exam results and scorecards. The RRB Clerk Prelims results are tentatively scheduled for September, with the main examination expected to be held on 6 October 2024. According to the latest official details, the IBPS RRB Clerk Result 2024 will be declared on the official website - ibps.in. Make sure to check the latest announcements.Once the IBPS RRB Clerk Result 2024 for prelims examination is declared on the website - ibps.in, concerned candidates can enter the required details and download the scorecards. Review the details mentioned on the result carefully and contact the officials in case of any queries.SSC MTS Admit Card 2024 Havaldar Exam To Be Out Soon On Official WebsiteThe IBPS RRB PO Mains examination is tentatively scheduled for 29 September 2024. Those interested in applying for the positions in the public sector can visit the official website of IBPS at ibps.in to download the prelims result 2024 and scorecards.Candidates are required to have the registration number, roll number, and password/date of birth in hand to download the documents.IBPS RRB Clerk and PO will fill 9,923 officer and assistant vacancies at regional rural banks. The IBPS PO mains admit card has been released for Officer Scale I, II, and III. The call letter links can be downloaded from the official website of IBPS.UGC NET Result 2024: When and How To Check NTA Scorecards; Latest Details HereTo know all the latest updates regarding the scorecards, you must update the website. The details will be announced on the site so that it is easier for people to check them.Here are the easy steps you should know to download the IBPS RRB Clerk Result 2024 online:Go to the official website - ibps.in.A new page will open on the screen and you can enter the login credentials.Click on submit.The IBPS RRB Clerk result will appear on your screen.Check the details carefully.Download the scorecard from the website and save a copy on your device.You can also take a printout of the result to take a better look.(Disclaimer: Parts of this article were generated by AI and published after the content was editorially modified and verified by a human based on their own judgement and expertise. The Quint does not publish AI-generated content without direct human involvement and oversight).CBSE Board Exam 2025: Registration for Classes 9 and 11 To Start Soon; Details(At The Quint, we question everything. Play an active role in shaping our journalism by becoming a member today.)",
        "summary": "IBPS RRB Clerk Result 2024: You can download the result from the official website - ibps.in.",
        "url": "https://www.thequint.com/news/education/ibps-rrb-clerk-result-2024-how-to-check-prelims-results-latest-updates-here",
        "image": "https://images.thequint.com/thequint/2024-09-23/wylib1jl/iStock-1166371279.jpg?auto=format,compress&fmt=webp&format=webp&w=1200&h=900&dpr=1.0",
        "video": null,
        "publish_date": "2024-09-23 06:31:12",
        "author": "Raajwrita Dutta",
        "authors": [
            "Raajwrita Dutta"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.092
    },
    {
        "id": 257064090,
        "title": "JNVST 2025 Class 6 Registration Last Date Today, Check Steps To Download",
        "text": "JNVST 2025: The Navodaya Vidyalaya Samiti (NVS) will close the registration window for the Jawahar Navodaya Vidyalaya Selection Test (JNVST) 2025 for Class 6 today.Interested and eligible students can apply for Class 6 admission for the 2025-26 academic session by visiting the official website, cbseitms.rcil.gov.in.Earlier, the last date for form submission was September 16, which has been revised to September 23.JNVST 2025: Steps To ApplyStep 1. Go to the official website of Navodaya Vidyalaya Samiti, cbseitms.rcil.gov.inStep 2. In the \"Important News\" section, click on the Class 6 application linkStep 3. Click on the registration link and enter all required detailsStep 4. Log in to fill out the online application formStep 5. Submit the application fee and save the confirmationJNVST 2025: Direct Link HereJNVST 2025: Exam PatternMental Ability: 40 questions, 50 marks, 60 minutesArithmetic: 20 questions, 25 marks, 30 minutesLanguage: 20 questions, 25 marks, 30 minutesTotal: 80 objective questions for 100 marks across all sectionsDocuments Required To Be UploadedCandidate's signature (Size: 10-100 KB)Parent's signature (Size: 10-100 KB)Candidate's photograph (Size: 10-100 KB)Certificate signed by parent and candidate and verified by the headmaster (Size: 50-300 KB)Residence certificate of the parent issued by a competent Government Authority if the candidate does not possess an Aadhaar NumberAdmission to Class 6 is based on the merit of students. The schools adhere to the three-language formula and promote national integration. Applicants must have been born between May 1, 2013, and July 31, 2015.",
        "summary": "JNVST 2025: Admission to Class 6 is based on the merit of students.",
        "url": "https://www.ndtv.com/education/jnvst-2025-class-6-registration-fees-form-last-date-today-at-official-website-cbseitms-rcil-gov-in-6629332",
        "image": "https://c.ndtvimg.com/2024-09/cqrq03no_dd_625x300_10_September_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-09-23 07:35:35",
        "author": "Lavkesh Singh",
        "authors": [
            "Lavkesh Singh"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -0.043
    },
    {
        "id": 257211002,
        "title": "What Is NREGA Job Card List & How To Download?",
        "text": "The scheme, originally named as the National Rural Employment Guarantee Act (NREGA), is one of the largest social security programs globally. The scheme is now known as the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA).",
        "summary": "",
        "url": "https://www.freepressjournal.in/latest-news/what-is-nrega-job-card-list-how-to-download",
        "image": "https://media.assettype.com/freepressjournal/2024-09-24/0vhigsvr/Untitled-design-16.jpg",
        "video": null,
        "publish_date": "2024-09-24 10:05:42",
        "author": "Fpj Web Desk",
        "authors": [
            "Fpj Web Desk"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.308
    },
    {
        "id": 257221710,
        "title": "WBJEEB result 2024 is out for ANM/GNM exam; here's how to check, download",
        "text": "The West Bengal Joint Entrance Examinations Board (WBJEEB) has announced the Auxiliary Nursing and Midwifery (ANM) and General Nursing and Midwifery (GNM) 2024 exam results on its official website, i.e., wbjeeb.nic.in. Candidates who appeared for the examination can download their WBJEE ANM, GNM rank cards online. The board has released the final answer keys for the exam. Candidates who have appeared for the examination can check and download their exam results through the official website by entering their application number and date of birth. The ANM, GNM 2024 exam was held on August 4 in a single shift, from 12 pm to 1:30 pm, which was scheduled to be held on July 14.How to download WBJEEB ANM, GNM Results 2024?Here are the simple steps to check and download WBJEEB ANM, GNM Results 2024:Firstly, visit the official website, i.e., wbjeeb.nic.in/anm-gnm/On the home page, check for the rank card shared below.Enter your application number, date of birth, and security pin.Once you enter your credentials, your result will appear on your screen.You can download and take printouts for future reference.The WBJEEB ANM and GNM entrance examinations had five sections comprising 100 questions. Each section is divided into two categories; Category 1 had 85 questions carrying one mark each, while Category 2 included 15 questions carrying two marks each. For every wrong answer, there is a negative marking of 0.25 marks and the duration of the examination was 90 minutes. The candidates can calculate their scores using machine-read responses and publish the final answer keys. Candidates can also demand a calculation sheet from the examination body by submitting a demand draft of Rs 500 in favour of the ‘West Bengal Joint Entrance Examinations Board,’ payable at Kolkata. The facility will be available for 60 days once the result is declared or until the counselling process concludes, whichever is later..storycontent div {margin:10px 0;}",
        "summary": "Strap: WBJEE ANM, GNM Results 2024: The West Bengal Joint Entrance Examinations Board (WBJEEB) has released the results of the ANM and GNM exams. Check details",
        "url": "https://www.business-standard.com/education/news/wbjeeb-result-2024-is-out-for-anm-gnm-exam-here-s-how-to-check-download-124092400772_1.html",
        "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-07/02/full/1719912119-0219.jpg",
        "video": null,
        "publish_date": "2024-09-24 11:17:56",
        "author": "Sudeep Singh Rawat",
        "authors": [
            "Sudeep Singh Rawat"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.109
    },
    {
        "id": 257314258,
        "title": "GATE 2025: Registration Window Without Late Fee Closes Tomorrow",
        "text": "GATE 2025: The registration window for the Graduate Aptitude Test in Engineering (GATE) 2025 will close tomorrow. Interested and eligible candidates who wish to appear in the exam can visit the official GATE 2025 website to complete their registration.However, candidates can still apply with a late fee until October 7, 2024.The exam is scheduled for February 1, 2, 15, and 16, 2025, for admission to postgraduate engineering programs. GATE 2025 will be conducted in a computer-based test (CBT) mode, with city centers divided into eight zones. The results will be announced on March 19, 2025.GATE 2025: Exam PatternGATE 2025 will consist of 30 examination papers, allowing candidates to choose one or two papers from permissible combinations. The exam will have a duration of 3 hours, and GATE scores will be valid for three years from the result announcement date.Negative MarkingFor a wrong answer in an MCQ, there will be negative markingFor a 1-mark MCQ, 1/3 mark will be deducted for a wrong answerFor a 2-mark MCQ, 2/3 mark will be deducted for a wrong answerEligibility CriteriaCandidates are advised to ensure they meet the eligibility criteria for GATE 2025 before submitting an application. Candidates who are in the 3rd year or higher of any undergraduate degree program or who have completed any government-approved degree program in Engineering, Technology, Architecture, Science, Commerce, Arts, or Humanities are eligible to appear for the GATE exam.The GATE exam is a nationwide test that assesses candidates' knowledge in various undergraduate-level disciplines. Successful candidates can pursue Master's and Doctoral programs, with potential financial aid. GATE scores are also used by educational institutions and Public Sector Undertakings (PSUs) for recruitment purposes(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\")",
        "summary": "The GATE exam is a nationwide test that assesses candidates' knowledge in various undergraduate-level disciplines.",
        "url": "https://www.ndtv.com/education/gate-2025-registration-window-without-late-fee-closes-tomorrow-6644174",
        "image": "https://c.ndtvimg.com/2024-08/haqo9c8_gate_625x300_28_August_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-09-25 05:09:45",
        "author": "Lavkesh Singh",
        "authors": [
            "Lavkesh Singh"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.178
    },
    {
        "id": 257341080,
        "title": "OPSC OJS 2023 Mains exam schedule out, check details at www.opsc.gov.in",
        "text": "The Odisha Public Service Commission (OPSC) has released the examination schedule for the Odisha Judicial Service Mains exam-2023 (Advt. No. 30 of 2023-24). Eligible candidates can check the exam schedule through the official website www.opsc.gov.in. The commission has shortlisted 680 candidates through the prelims exam for mains examination. The Commission aims to fill up a total of 34 vacancies, of which 11 vacancies are reserved for women candidates. For more details, candidates can check the official notification. Exam Schedule The compulsory paper will be held on November 3 — Paper I (9.30 AM to 12 Noon) and Paper II (2.00 PM to 4.30 PM). The optional papers will be held on November 4, 5, and 6. Steps to check OPSC OJS schedule Visit the official notification www.opsc.gov.inGo to the what’s new tab Click on ‘Main Written Examination Program Notice - OJS-2023’ Check the exam schedule Print it out for future reference Selection Process The applicants will be shortlisted on the basis of Preliminary Written Exam, Main Written Exam, and the Interview round. For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can check the exam schedule through the official website www.opsc.gov.in.",
        "url": "https://scroll.in/announcements/1073707/opsc-ojs-2023-mains-exam-schedule-out-check-details-at-www-opsc-gov-in",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/146982-vbojxlnrui-1599195166.jpg",
        "video": null,
        "publish_date": "2024-09-25 09:15:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.145
    },
    {
        "id": 257372032,
        "title": "JSSC JMLCCE 2023 admit card released, here’s download link",
        "text": "Jharkhand Staff Selection Commission (JSSC) has released the admit card for the Jharkhand Matric Level Combined Competitive Exam (JMLCCE 2023) today, September 25. Eligible candidates can download their hall tickets from the official website jssc.nic.in. The JSSC JMLCCE 2023 exam is scheduled to be conducted on September 29, 2024. Earlier, the exam was scheduled to be conducted on July 28, 2024. The recruitment drive aims to fill up a total of 455 vacancies. The registration window for the exam was open from July 3 to August 3, 2023. Steps to download JMLCCE admit card 2024 Visit the official website jssc.nic.inOn the homepage, click on ‘Link to Download Admit card for Jharkhand Matric Level Combined Competitive Examination- 2023’Key in your login details and submitCheck and download the admit cardTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their hall tickets from the official website jssc.nic.in.",
        "url": "https://scroll.in/announcements/1073725/jssc-jmlcce-2023-admit-card-released-heres-download-link",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/125174-ooyfpzksdh-1565185260.jpg",
        "video": null,
        "publish_date": "2024-09-25 12:40:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.579
    },
    {
        "id": 257440994,
        "title": "GATE 2025: Registration Without Late Fee Closes Today; Exams Starts From This Date",
        "text": "Registration window (without a late fee) will close today while registration with a late fee is open until October 7. The GATE 2025 exam will be held on February 1, 2, 15, and 16 in two daily shifts. Check the admit card and exam dates below...",
        "summary": "",
        "url": "https://www.freepressjournal.in/education/gate-2025-registration-without-late-fee-closes-today-exams-starts-from-this-date",
        "image": "https://media.assettype.com/freepressjournal/2024-08-11/bu4gbxd3/Screenshot 2024-08-11 180250.png",
        "video": null,
        "publish_date": "2024-09-26 03:14:02",
        "author": "Megha Chowdhury",
        "authors": [
            "Megha Chowdhury"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": -0.618
    },
    {
        "id": 257451342,
        "title": "HSSC PRT admit card 2024 released, here’s download link",
        "text": "The Haryana Staff Selection Commission (HSSC) has released the admit card for the Primary Teachers (PRT) written examination 2024 (Advt. No. 05/2024). Eligible candidates can download their hall tickets from the official website hssc.gov.in. As per the notification, the exam will be conducted on September 28 from 3.45 PM to 5.30 PM. The Commission aims to fill up a total of 1456 Primary Teacher (Mewat Cadre) vacancies. Steps to download PRT admit card 2024 Visit the official website hssc.gov.inOn the homepage, click on the Pubic Notice—Intimation to the Candidates to download the Admit Card for Written examination/skill test for the post of Primary Teacher (Mewat Cadre) as advertised in Advt. No. 05/2024Click on the PRT admit card 2024 linkKey in your login details and submitDownload and take a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their admit cards from the official website hssc.gov.in.",
        "url": "https://scroll.in/announcements/1073742/hssc-prt-admit-card-2024-released-heres-download-link",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/150996-bygpmyzpuq-1606119205.jpg",
        "video": null,
        "publish_date": "2024-09-26 04:46:09",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.315
    },
    {
        "id": 257465224,
        "title": "HSSC PRT Admit Card 2024: Primary Teacher Exam Hall Tickets Declared; Details",
        "text": "HSSC PRT Admit Card 2024: The Haryana Staff Selection Commission (HSSC) has released the admit card for the written examination for primary teacher classes. Candidates who have applied for the Mewat Cadre examination can download the admit card via the official website of the commission, hssc.gov.in. Concerned candidates are requested to download the admit card soon from the website. Make sure to check the details carefully and contact the officials in case of any queries.No candidate will be allowed to appear for the exam without the HSSC PRT Admit Card 2024. Everyone should check and download it from the website - hssc.gov.in. Keep your login credentials handy before downloading the hall ticket. Check the exam date, time, and other important details mentioned on the admit card carefully.UGC NET Result 2024: June Re-Exam Scorecards and Final Answer Key To Be Out SoonIt is pertinent to note that the Haryana State Board of Teachers is scheduled to hold the written examination for primary teachers on 28 September.The examination will be held in the evening session, from 3:45 pm to 5:30 pm. In view of the ongoing recruitment drive for 1,456 group C teacher vacancies, the commission has decided to do away with the weightage of socio-economic marks as per a recent high court order and the written test will be held only for 95 marks.As per the new initiative, all the questions asked in the exam will be compulsory. The question paper will be bilingual (English and Hindi). There will be no negative marking for wrong answers.Candidates will be given five extra minutes to mark the fifth option. The total time allowed for the paper is 105 minutes.WBJEE ANM & GNM Result 2024 Declared: Download Rank Cards at wbjeeb.inIf any candidate is found to indulge in any malpractice during the examination or after the examination, his/her eligibility for the examination will be cancelled and he/she will be debarred from the examinations held by the commission for 2 to 5 years, depending on the nature of the offence committed.Let's read the steps to download the HSSC PRT Admit Card 2024 from the website:Browse through the website - hssc.gov.in.Open the HSSC PRT Admit Card 2024 notification on the homepage.Open the admit card notice.The link to download the hall tickets is present inside.Enter your User ID and password in the given space.Log in to your account and download the admit card.(Disclaimer: Parts of this article were generated by AI and published after the content was editorially modified and verified by a human based on their own judgement and expertise. The Quint does not publish AI-generated content without direct human involvement and oversight).SSC MTS Admit Card 2024 Havaldar Exam To Be Out Soon On Official Website(At The Quint, we question everything. Play an active role in shaping our journalism by becoming a member today.)",
        "summary": "HSSC PRT Admit Card 2024: You can download the hall ticket from the official website - hssc.gov.in.",
        "url": "https://www.thequint.com/news/education/hssc-prt-admit-card-2024-primary-teacher-exam-hall-tickets-declared-details",
        "image": "https://images.thequint.com/thequint/2024-09-26/ogqaz3i6/iStock-1291770278.jpg?auto=format,compress&fmt=webp&format=webp&w=1200&h=900&dpr=1.0",
        "video": null,
        "publish_date": "2024-09-26 07:39:19",
        "author": "Raajwrita Dutta",
        "authors": [
            "Raajwrita Dutta"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.126
    },
    {
        "id": 257472896,
        "title": "SSC CHSL 2024: Exam date declared at ssc.gov.in; check complete schedule",
        "text": "The date for the 2024 Tier-II Combined Higher Secondary (10+2) Level Examination has been announced by the Staff Selection Commission. The Commission has decided to hold the Combined Higher Secondary (10+2) Level Examination, 2024 (Tier-II) on November 18, 2024, as per the official notice.This announcement came after the SSC published the Tier-I results and category-wise cut-off marks earlier. Just 41,465 of the thousands of applicants who took the Tier-I exam are eligible to move to the next round. These shortlisted applicants are competing for 3,712 positions in various government departments and offices as LDCs (Lower Division Clerks), JSAs (Junior Secretariat Assistants), and DEOs (Data Entry Operators).SSC CHSL 2024: Important dates There are two tiers to the written exam used in the SSC CHSL recruiting procedure. Tier-I evaluated candidates' proficiency in General Reasoning, Quantitative Aptitude, English Language, and General Awareness. It was already held between July 1 and July 11, 2024.On November 18, 2024, Tier-II will assess candidates' writing skills and subject-matter expertise related to the selected position. It is recommended that candidates consult the official SSC website and notification for a comprehensive syllabus and exam pattern for Tier-II.SSC CHSL 2024: What's next?Those who have been shortlisted should concentrate on their Tier II preparation till November 18. Ahead of the exam date, more information about admit cards and exam centres will probably be made available on the SSC website. All candidates should make sure to remain up to date by visiting the official SSC website.SSC CHSL: OverviewThe Staff Selection Commission holds the SSC CHSL exam annually to fill positions in multiple ministries/departments/organisations of the Government of India. The full form of SSC CHSL is the Staff Selection Commission Combined Higher Secondary Level Examination. The Staff Selection Commission (SSC) held the Combined Higher Secondary Level (CHSL, 10+2) Exam for the following positions:-• Data Entry Operator (DEO)• Data Entry Operator (Grade A)• Lower Divisional Clerk (LDC)/ Junior Secretariat Assistant (JSA). .storycontent div {margin:10px 0;}",
        "summary": "SSC CHSL 2024 tier 2 exam dates have been declared by the Staff Selection Commission (SSC). Applicants can view the exam schedule by visiting the official website of SSC at ssc.gov.in",
        "url": "https://www.business-standard.com/education/news/ssc-chsl-2024-exam-date-declared-at-ssc-gov-in-check-complete-schedule-124092600558_1.html",
        "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-07/17/full/1658056983-9684.jpg",
        "video": null,
        "publish_date": "2024-09-26 09:01:36",
        "author": "Sonika Nitin Nimje",
        "authors": [
            "Sonika Nitin Nimje"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.253
    },
    {
        "id": 257477626,
        "title": "SSC MTS admit card 2024 released; here's how to check and download",
        "text": "The Staff Selection Commission (SSC) has released the admit card for the upcoming written examination for the post of Multi Tasking Staff (Non-Technical) and Havaldar (CBIC & CBN).The admit card is released for eight regions including North Region, Southern Region, Central Region, Western Region, Eastern Region, North Western Region, North Eastern Region, and Madhya Pradesh Region. The admit card for the Kerala Karnataka Region will be out soon. Earlier, the SSC released the admit card for Madhya Pradesh, Central, Western, Northwestern, and Northeast regions.The MTS exam will be held between September 30 and November 14. Candidates who have applied for the examination can check and download their admit card through the official website.Also Read: SSC CHSL 2024: Exam date declared at ssc.gov.in; check complete scheduleSSC MTS Exam Date 2024The exams aim to fill a total of 9,583 vacancies. All the questions in the examination are objective type, comprising a total of 270 marks. There will be no negative marking in session 1. However, in session 2, one mark will be deducted for each wrong answer. There would be more than 13 regional languages in the examination – including Assamese, Bengali, Gujarati, Kannada, Konkani, Malayalam, Manipuri (Metei or Meithei), Marathi, Odia (Oriya), Punjabi, Tamil, Telugu, and Urdu.How to check and download SSC MTS Admit Card 2024?Here are the steps to check and download the SSC MTS Admit Card 2024First, visit the official website of the Staff Selection Commission (SSC).On the home page check for the Multi-Tasking Staff (Non-Technical) and Havaldar (CBIC & CBN) examination.Then, enter your credentials such as your registration number and password. Once you enter your credentials, your admit card will appear on your screen. You can download and take printouts for future reference. The admit card will have important details like your name, roll number, exam date, time, venue, and other important information.storycontent div {margin:10px 0;}",
        "summary": "The Staff Selection Commission (SSC) has released the admit cards for the upcoming Multi-Tasking Staff (Non-Technical) and Havaldar (CBIC & CBN) examinations, scheduled to begin on September 30, 2024",
        "url": "https://www.business-standard.com/education/news/ssc-mts-admit-card-2024-released-here-s-how-to-check-and-download-124092600591_1.html",
        "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-10/07/full/1570423488-569.jpg",
        "video": null,
        "publish_date": "2024-09-26 09:34:29",
        "author": "Sudeep Singh Rawat",
        "authors": [
            "Sudeep Singh Rawat"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.208
    },
    {
        "id": 257482298,
        "title": "OSSSC MPHW result 2023 declared; here’s download link",
        "text": "The Odisha Sub-Ordinate Staff Selection Commission (OSSSC) has declared the results of the Multipurpose Health Worker (Female) 2023. Eligible candidates can download their results from the official website osssc.gov.in. “It is clarified here that the COVID marks awarded earlier by the H and FW Department have been thoroughly scrutinized and revised by the H and FW Department in view of the orders in Hon’ble High Court and taking into consideration of Grievances of candidates,” reads the notification. The category of some candidates have been revised corrected during document verification. The provisional master merit list has been redrawn. The recruitment drive aims to fill up a total of 2753 vacancies. Steps to download MPHW Female result 2023 Visit the official website www.osssc.gov.inOn the homepage, click on MPHW (F) result 2023 linkThe result will appear on the screenCheck and download the resultTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their results from the official website osssc.gov.in.",
        "url": "https://scroll.in/announcements/1073766/osssc-mphw-result-2023-declared-heres-download-link",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/151346-bdiyulgujp-1609828842.jpg",
        "video": null,
        "publish_date": "2024-09-26 10:10:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.777
    },
    {
        "id": 257586044,
        "title": "UPPSC UMO admit card 2024 out, here’s how to download",
        "text": "The Uttar Pradesh Public Service Commission (UPPSC) has released the Unani Medical Officer admit card for the screening test. The candidates can download their hall tickets from the official website uppsc.up.nic.in. The screening test will be conducted on October 6 from 9.30 am to 11.30 am. The applicants are directed to report 1 hour 30 minutes before the commencement of the exam. The recruitment drive aims to fill up a total of 26 vacancies. Steps to download Unani Medical Officer admit card Visit the official website uppsc.up.nic.inClick on the UMO admit card 2023 linkKey in your login details and submitCheck and download the admit cardTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their hall tickets from the official website uppsc.up.nic.in.",
        "url": "https://scroll.in/announcements/1073787/uppsc-umo-admit-card-2024-out-heres-how-to-download",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/103190-xxmvgstmya-1539677211.jpg",
        "video": null,
        "publish_date": "2024-09-27 04:35:49",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.28
    },
    {
        "id": 257596458,
        "title": "MPESB result 2024 out for GNMTST/ PNST, here’s download link",
        "text": "The Madhya Pradesh Employees Selection Board (MPESB) has declared the results of the Pre-Nursing Selection Test (PNST) - 2024 and the General Nursing and Midwifery Training Selection Test (GNMTST) 2024. Eligible candidates can download their results from the official website esb.mp.gov.in. The exam was conducted on September 9 to 13, 2024. The applications were invited from July 31 to August 14, 2024. The form edit window was open till August 19, 2024. Steps to download GNMTST/ PNST result 2024 Visit the official website esb.mp.gov.inOn the homepage, click on the GNMTST/ PNST result 2024 linkKey in your login details and submitCheck and download the resultTake a printout for future reference For more details candidates are advised to visit the official website here.",
        "summary": "Candidates can download their results from the official website esb.mp.gov.in.",
        "url": "https://scroll.in/announcements/1073797/mpesb-result-2024-out-for-gnmtst-pnst-heres-download-link",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/151346-bdiyulgujp-1609828842.jpg",
        "video": null,
        "publish_date": "2024-09-27 07:15:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.345
    },
    {
        "id": 257611434,
        "title": "MPPSC SFS Mains admit card 2024 released, here’s download link",
        "text": "The Madhya Pradesh Public Service Commission (MPPSC) has released the State Forest Service Mains admit card 2024. Eligible candidates can download their hall tickets from the official website mppsc.mp.gov.in. The SFS Mains 2024 is scheduled to be conducted on October 6, 2024. The recruitment drive aims to fill up a total of 14 vacancies. Steps to download SFS Mains admit card 2024 Visit the official website mppsc.mp.gov.inOn the homepage, click on the SFS Mains 2024 admit card linkKey in your login details and submitCheck and download the admit cardTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their hall tickets from the official website mppsc.mp.gov.in.",
        "url": "https://scroll.in/announcements/1073802/mppsc-sfs-mains-admit-card-2024-released-heres-download-link",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/53914-igtwbgvvna-1489895182.jpg",
        "video": null,
        "publish_date": "2024-09-27 09:15:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.328
    },
    {
        "id": 257610508,
        "title": "IBPS RRB Clerk Prelims Result 2024 OUT; Check Now!",
        "text": "Aspirants will need to enter their login credentials sent at the time of registration, such as registration number, roll number, password, or birthdate by email or SMS in order to receive the IBPS RRB Clerk Prelims Result 2024.",
        "summary": "",
        "url": "https://www.freepressjournal.in/education/ibps-rrb-clerk-prelims-result-2024-out-check-now",
        "image": "https://media.assettype.com/freepressjournal/import/2017/07/IBPS-RRB-notification.jpg",
        "video": null,
        "publish_date": "2024-09-27 09:57:40",
        "author": "Sunidhi V",
        "authors": [
            "Sunidhi V"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -0.793
    },
    {
        "id": 257625598,
        "title": "SSC MTS 2024 region wise admit card released at ssc.gov.in, check details here",
        "text": "The Staff Selection Commission (SSC) has released the admit card for the post of Multi-Tasking Staff and Havaldar for all the regions. Eligible candidates can download their admit cards through the official website ssc.gov.in. The SSC MTS exam is scheduled to be conducted from September 30 to November 14. Steps to download the SSC MTS admit card Visit the official website ssc.gov.inUnder about us tab, go to the regional network Click on the relevant site and click on the admit card linkFill your details Download the admit card Print it for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their region-wise admit card from the official website ssc.gov.in",
        "url": "https://scroll.in/announcements/1073811/ssc-mts-2024-region-wise-admit-card-released-at-ssc-gov-in-check-details-here",
        "image": "https://d1u4oo4rb13yy8.cloudfront.net/article/86122-cddpichrtx-1522845634.jpg",
        "video": null,
        "publish_date": "2024-09-27 10:56:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.2
    },
    {
        "id": 257627374,
        "title": "Umeed and SVP launch ‘Sahyog-train the trainer’ to empower Telangana educators",
        "text": "Hyderabad: Sahyog, a ‘train the trainer’ program by Umeed, a nonprofit organization in partnership with the Commissionerate of Collegiate Education, and Social Venture Partners, India-Hyderabad Chapter, was launched here on Friday. Umeed is a women empowerment and career readiness training organisation working in Telangana for the last 10 years. Led by two women leaders, Udita Chadha and Gauri Mahendra, Umeed has successfully delivered multiple training and empowerment programs across the state. Sahyog, their second partnership with the Education Department, was launched today at RUSA Resource Center Hyderabad, in the presence of Prof. G. Yadgiri, Joint Director, Prof. DSR Rajendra Singh, Joint Director, Prof. P Bala Bhaskar, Academic Guidance Officer (AGO), Chandrasekhar, TSKC Incharge, Gauri Mahendra, Co-Founder & President, Umeed, Aamrapali Sharma, CEO, SVP India-Hyderabad Chapter, Suravaram Sujatha Reddy, Partner, SVP India-Hyderabad Chapter. ‘Sahyog’, aims to strengthen the already existing employability structures of the education department. The program is designed to train Full time Mentors (FTMs) of the Telangana Skills and Knowledge Centre (TSKC.) Through the training, FTMs will gain hands on experience of skills, knowledge, values and network required to execute their mentorship role effectively.",
        "summary": "Umeed is a women empowerment and career readiness training organisation working in Telangana for the last 10 years.",
        "url": "https://telanganatoday.com/umeed-and-svp-launch-sahyog-train-the-trainer-to-empower-telangana-educators",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/09/ume.jpg",
        "video": null,
        "publish_date": "2024-09-27 11:55:57",
        "author": "Telangana Today",
        "authors": [
            "Telangana Today"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.499
    },
    {
        "id": 257638802,
        "title": "IBPS RRB Clerk Prelims Result 2024 Out, Check Steps To Download",
        "text": "IBPS RRB Clerk Result 2024: The Institute of Banking Personnel Selection (IBPS) has released the results of the preliminary recruitment examination for the office assistant position. Those who took the prelims can access their results by visiting the recruitment company's official website, ibps.in, and entering their registration number or roll number along with their date of birth or password.The institute will release call letters and an information handout for the main examination on its website in due course. The recruitment exams aim to fill a total of 9,923 vacancies for officers and assistants at regional rural banks (RRB).IBPS RRB Clerk Result 2024: Steps To CheckGo to the official IBPS website, ibps.in.On the homepage, select the link for the IBPS RRB Clerk Prelims Result 2024.A new page will appear, prompting candidates to enter their login details.Click on submit, and your result will be displayed.Review the result and download the page.Keep a printed copy for future reference.Previously, the results for the RRB PO Prelims exam were announced on September 4 for a select group of candidates, and the result for Officer Scale I was released on September 13.According to the examination calendar, the single examination for Officer Scale 2 and 3, as well as the mains examination for Officer Scale 1 (IBPS RRB PO Mains), is scheduled for September 29, 2024.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");The IBPS RRB PO mains exam is set to be held on September 29.",
        "summary": "IBPS RRB Clerk Result 2024: Those who took the prelims can access their results at ibps.in by entering their registration number or roll number, along with their date of birth or password.",
        "url": "https://www.ndtv.com/education/ibps-rrb-clerk-result-2024-office-assistant-prelims-result-out-at-ibps-in-september-27-6663859",
        "image": "https://i.ndtvimg.com/i/2017-12/exam-result_650x400_71513240887.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-09-27 13:19:23",
        "author": "Rahul Kumar",
        "authors": [
            "Rahul Kumar"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.088
    },
    {
        "id": 257736484,
        "title": "NABARD Grade A Result 2024 Released, Check Steps To Download",
        "text": "NABARD Recruitment 2024: The National Bank for Agriculture and Rural Development (NABARD) has released the results of the Assistant Manager Preliminary Examination. The recruitment aims to fill 100 positions for Assistant Manager (Rural Development and Banking Service) and 2 positions for Assistant Manager (Rajbhasha).Interested and eligible candidates can check the result by visiting the official website, nabard.org.NABARD Grade A Result 2024: Steps To DownloadStep 1. Visit the official website, nabard.orgStep 2. Click on the link titled \"Assistant Manager in Grade 'A' (RDBS/ Rajbhasha) - 2024 - Date of Preliminary Examination: 01 September 2024 - List of Roll Nos. of shortlisted candidates for Phase II - Main Examination\" on the homepageStep 3. A new page will appear on the screenStep 4. Check the result and download itStep 5. Take a printout for future referenceAssistant Manager Grade A EligibilityGeneral: Applicants must possess a Bachelor's degree with at least 60% marks.Chartered Accountant: A Bachelor's degree in any discipline from a recognized University/Institution and Membership of the Institute of Chartered Accountants of India (ICAI), obtained on or before July 1, 2024.Finance: BBA (Finance/Banking) or BMS (Finance/Banking) from a recognized University/Institution with 60% marks (55% for SC/ST/PWBD applicants).Computer/Information Technology: A four-year Bachelor's degree in Engineering/Technology in Computer Science, Computer Engineering, Information Technology, Electronics, Electronics & Telecommunications, Electronics & Communication, Electronics & Instrumentation, Data Science, Machine Learning, or Artificial Intelligence from a recognized University/Institution with 60% marks (55% for SC/ST/PWBD applicants).(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Assistant Manager in Grade 'A' (Rajbhasha): A Bachelor's Degree from a recognized university in English or Hindi medium with Hindi and English as compulsory or elective subjects, achieving at least 60% marks (55% for SC/PWBD applicants), or an equivalent in aggregate, and a PG Diploma in Translation (minimum one year) in Hindi to English and vice-versa. Candidates must have studied both English and Hindi for at least two years during their Bachelor's degree course at any recognized University.NABARD Assistant Manager Recruitment 2024: Age Limit Applicants' age should be between 21 and 30 years.",
        "summary": "NABARD Grade A Result 2024: Applicants' age should be between 21 and 30 years.",
        "url": "https://www.ndtv.com/education/nabard-grade-a-result-2024-released-at-official-website-nabard-org-6670197",
        "image": "https://c.ndtvimg.com/2024-07/ggjgacog_jobs_625x300_17_July_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-09-28 11:10:00",
        "author": "Lavkesh Singh",
        "authors": [
            "Lavkesh Singh"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.099
    },
    {
        "id": 257762428,
        "title": "Bihar Board Class 10 Exam 2025 Registration Last Date Extended",
        "text": "Bihar Board Class 10 Exam 2025: The Bihar School Examination Board (BSEB) has extended the last date for the online registration process for the Bihar Board Class 10 exam 2025 until October 9, 2024.Schools can visit the official website of the board, i.e., secondary.biharboardonline.com, to complete the registration process.The official notice reads: \"The extended date for online submission of the application form for the Secondary Annual Exam 2025 is from September 28 to October 9, 2024. The last date for application fee payment is October 6, 2024.\"BSEB Bihar Board Exam 2025: Steps to RegisterStep 1. Visit the official website, secondary.biharboardonline.comStep 2. Click on the link - 'Click Here For Intermediate Registration'Step 3. A new page will open on the screenStep 4. Fill out the BSEB Inter Exam 2025 application formStep 5. Submit the required documentsStep 6. Make the payment of the feeStep 7. Check and download the confirmation pageBihar Board Class 10 Exam 2025: Important Points To ConsiderThe name, subject, gender, marital status, and caste category of the student, mother, and father should be filled in the application form with complete accuracy to avoid any errors on the mark sheet issued after the examinationA correct color photograph of the student should be affixed to the application form, and the correct signature should be provided to avoid any errors related to the photograph or signature on the mark sheet. This ensures that the correct photograph and signature are maintained in the committee's recordsThe schools should enter only a valid mobile number and email ID in the prescribed columns of the application form.One mobile number can be used to fill the registration application form for only one student",
        "summary": "Schools can visit the official website of the board to complete the registration process.",
        "url": "https://www.ndtv.com/education/bseb-bihar-board-exam-2025-class-10-registration-last-date-extended-6672409",
        "image": "https://c.ndtvimg.com/2024-07/hturlvv8_counselling-registration-_625x300_10_July_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-09-28 17:12:53",
        "author": "Lavkesh Singh",
        "authors": [
            "Lavkesh Singh"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -0.061
    },
    {
        "id": 257791024,
        "title": "IBPS RRB Clerk Mains Admit Card 2024 Released: Check Exam Date & Steps To Download Admit Card Inside",
        "text": "The Institute of Banking Personnel Selection (IBPS) has officially released the IBPS RRB Clerk Mains Admit Card 2024. Candidates who have successfully cleared the preliminary examination and are now set to appear for the main examination can download their Office Assistant (Multipurpose) call letter from the official website of IBPS at ibps.in. The admit card will be accessible on the website until October 6.Only those candidates who passed the prelims are eligible to appear for the main examination. The IBPS RRB Office Assistant Main Examination is scheduled for October 6. It will be conducted online, featuring an objective-type, multiple-choice format. The test will consist of 200 questions covering topics such as Reasoning, Computer Knowledge, General Awareness, English, and Hindi. The maximum mark for the examination is 200.Steps to Download IBPS RRB Clerk Mains Admit Card 2024Candidates can follow these simple steps to download their admit card:1. Visit the official IBPS website: ibps.in.2. On the homepage, click on the IBPS RRB Clerk Mains Admit Card 2024 link.3. A new page will open where candidates need to enter their login details.4. Click Submit, and the admit card will be displayed.5. Check the details on the admit card and download it.6. Keep a printed copy of the admit card for future use.Candidates must carry both their preliminary exam call letter and the main exam call letter, along with other required documents as mentioned in the information handout.It is important to note that there will be a penalty for incorrect answers in the objective test. For each wrong answer, one-fourth (0.25) of the assigned marks will be deducted to calculate the final score.",
        "summary": "The Institute of Banking Personnel Selection (IBPS) has officially released the IBPS RRB Clerk Mains Admit Card 2024. Candidates who have successfully cleared the preliminary examination and are now set to appear for the main examination can download their Office Assistant",
        "url": "https://www.oneindia.com/india/ibps-rrb-clerk-mains-admit-card-2024-released-check-exam-date-steps-to-download-admit-card-inside-3947405.html",
        "image": "https://imagesvs.oneindia.com/img/2024/09/large2-1727582089.jpg",
        "video": null,
        "publish_date": "2024-09-29 03:55:55",
        "author": "Zainab Ashraf",
        "authors": [
            "Zainab Ashraf"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.189
    },
    {
        "id": 257875788,
        "title": "CBSE Board Exams 2025 Datesheet To Be Released Soon, Check Details",
        "text": "CBSE Board Exams 2025: The Central Board of Secondary Education (CBSE) is likely to release the examination schedule for classes 10 and 12 in December. However, the Board has not yet provided an official date or time for the release. The CBSE board exams for the 2025 session are set to commence on February 15 and are expected to conclude in April. The board will also release a separate schedule for practical exams. For Class 10, practicals will be conducted under the supervision of school teachers, while Class 12 practicals will involve an external examiner visiting the schools.Based on previous years, CBSE released the exam schedule on December 12, 2023. Practical exams or internal assessments for classes 10 and 12 were held between January 1 and February 14, 2024, while practical exams for winter-bound schools took place from November 14 to December 14, 2023. The 2024 board exams ran from February 15 to April 2, and the results were declared on May 13, 2024. Supplementary exams for classes 10 and 12 were conducted from July 15 to July 22, 2024.The board has announced a mandatory Closed-Circuit Television (CCTV) policy for schools designated as examination centres for the upcoming Class 10 and 12 board examinations. With around 44 lakh students expected to participate in these exams across India and 26 countries in 2025, the board will designate approximately 8,000 schools as examination centres.CBSE has issued a set of Frequently Asked Questions (FAQs) to help affiliated schools submit the List of Candidates (LOC) for the 2024-25 exams accurately and on time. (function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");\"CBSE is making all efforts to streamline the LOC data submission process to ensure that all affiliated schools make accurate and timely submission of data. In this regard, circulars dated 04/09/2024 and 12/09/2024 have been issued. A set of Frequently Asked Questions (FAQs) has been compiled for general queries on the circular. These FAQs are designed to assist the schools in navigating the LOC procedures more effectively and to address common queries that may arise,\" the Board stated in an official notice.",
        "summary": "CBSE Board Exams 2025: The CBSE board exams for the 2025 session are set to commence on February 15 and are expected to conclude in April.",
        "url": "https://www.ndtv.com/education/cbse-board-exams-2025-datesheet-to-be-released-soon-10th-and-12th-papers-from-february-15-6680660",
        "image": "https://c.ndtvimg.com/2024-07/oh1drin_exam-representative-image_625x300_01_July_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-09-30 02:36:08",
        "author": "Rahul Kumar",
        "authors": [
            "Rahul Kumar"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.211
    },
    {
        "id": 257886804,
        "title": "IBPS RRB Clerk Mains Admit Card 2024 Declared: How to Download; Latest Details",
        "text": "IBPS RRB Clerk Mains Admit Card 2024: The link for the IBPS RRB Clerk Mains Admit Card 2024 is activated by the Institute of Banking Personnel Selection (IBPS) on the official website at ibps.in. Candidates who qualified for the preliminary examination can visit the website to download the admit card. One should check the details printed on the admit card carefully to avoid any confusion on the exam day. You can contact the officials in case of any queries regarding the main exam.Important details such as the exam date and time are mentioned on the IBPS RRB Clerk Mains Admit Card 2024. You can download it only from the official website - ibps.in. Keep your login credentials ready before downloading the admit card. Make sure to download the hall ticket before the exam day.HSSC PRT Admit Card 2024: Primary Teacher Exam Hall Tickets Declared; DetailsThe IBPS RRB Clerk Mains Examination 2024 is scheduled to take place on 6 October. The online course will consist of multiple-choice questions with 200 questions covering topics such as reasoning, computer knowledge, general awareness, English, and Hindi. The maximum score available is 200.Those who have successfully passed the preliminary examination are eligible to appear for the main examination.Qualifying candidates will be required to submit the preliminary examination call letter and other essential documents along with the main examination call letter at the time of appearing for the main examination.For each question answered incorrectly, one-fourth or 0.25 of the marks assigned to that question will be deducted as a penalty.Selected candidates should read all the latest announcements by the officials. You can also contact them directly. No candidate will be allowed to appear for the IBPS RRB Clerk Main exam without their admit card.UGC NET Result 2024: June Re-Exam Scorecards and Final Answer Key To Be Out SoonLet's take a look at the step-by-step process you must follow to download the IBPS RRB Clerk Mains Admit Card 2024 online:Go to the official website - ibps.in.Click on the active option \"IBPS RRB Clerk Mains Admit Card 2024\" on the homepage.A new page will appear on the screen and candidates can enter their login credentials.Click on submit.Your exam admit card will appear on the screen and you can check the details.Download the hall ticket and save a copy for the exam day.(Disclaimer: Parts of this article were generated by AI and published after the content was editorially modified and verified by a human based on their own judgement and expertise. The Quint does not publish AI-generated content without direct human involvement and oversight).TS EAMCET Pharmacy Seat Allotment Result 2024 Today, 27 September: How to Check?(At The Quint, we question everything. Play an active role in shaping our journalism by becoming a member today.)",
        "summary": "IBPS RRB Clerk Mains Admit Card 2024 Declared: You can download the admit card from ibps.in.",
        "url": "https://www.thequint.com/news/education/ibps-rrb-clerk-mains-admit-card-2024-declared-how-to-download-latest-details",
        "image": "https://images.thequint.com/thequint/2024-09-30/m4u570cf/iStock-1291770278.jpg?auto=format,compress&fmt=webp&format=webp&w=1200&h=900&dpr=1.0",
        "video": null,
        "publish_date": "2024-09-30 04:52:46",
        "author": "Raajwrita Dutta",
        "authors": [
            "Raajwrita Dutta"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.045
    },
    {
        "id": 257902480,
        "title": "Bihar Board Class 10 Exam 2025: Deadline for Registration Extended; Details Here",
        "text": "Bihar Board Class 10 Exam 2025: The Bihar School Examination Board (BSEB) has extended the last date for online registration for Class 10 exams to 9 October 2024. Schools can visit the official website of the board to complete the registration process. The website that you must visit to complete the Bihar Board Class 10 exam 2025 registration is secondary.biharboardonline.com. All candidates are requested to finish the necessary steps on time if they wish to appear for the upcoming exam.Concerned students must keep their documents ready before filling out the Bihar Board Class 10 exam 2025 registration form. You can check the rules and the latest announcements on the official website - secondary.biharboardonline.com. Make sure to read the details carefully before filling out the form. Recheck all the details and then submit the registration form to avoid confusion later on.HSSC PRT Admit Card 2024: Primary Teacher Exam Hall Tickets Declared; Details“The online examination form of the students will be filled by the heads of the respective schools through the website secondary.biharboardonline.com till the extended date 09.10.2024,” mentioned the notice. However, the last date to pay the application fee is 6 October 2024.In case of any inconvenience in filling out the online examination form or depositing the fee, the helpline number 0612-2232074 can be contacted for further assistance.All concerned students should remember the important dates carefully. You can contact the officials in case of any queries.The exam date, time, and other important details will be available on the official website. You can check them whenever you want and prepare for the exam accordingly.UGC NET Result 2024: June Re-Exam Scorecards and Final Answer Key To Be Out SoonLet's take a look at the step-by-step process you must follow to finish the Bihar Board Class 10 exam 2025 registration:Visit the website - secondary.biharboardonline.com.Click the option \"Bihar Board Class 10 Exam 2025 Registration\" on the homepage.Register yourself to access the form.Fill out the details and upload the documents.Review the information and pay the application fee online.Click on submit after completing all the steps carefully.You can download the form from the website.Candidates can save a printout of the registration form and refer to it whenever required.(Disclaimer: Parts of this article were generated by AI and published after the content was editorially modified and verified by a human based on their own judgement and expertise. The Quint does not publish AI-generated content without direct human involvement and oversight).TS EAMCET Pharmacy Seat Allotment Result 2024 Today, 27 September: How to Check?(At The Quint, we question everything. Play an active role in shaping our journalism by becoming a member today.)",
        "summary": "Bihar Board Class 10 Exam 2025: You can register for the exam on the website - secondary.biharboardonline.com.",
        "url": "https://www.thequint.com/news/education/bihar-board-class-10-exam-2025-deadline-for-registration-extended-details-here",
        "image": "https://images.thequint.com/thequint/2024-09-30/iyadosev/iStock-1134264053 (2).jpg?auto=format,compress&fmt=webp&format=webp&w=1200&h=900&dpr=1.0",
        "video": null,
        "publish_date": "2024-09-30 06:27:57",
        "author": "Raajwrita Dutta",
        "authors": [
            "Raajwrita Dutta"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.159
    },
    {
        "id": 257890852,
        "title": "Telangana DSC Results: Check Here",
        "text": "Hyderabad: Telangana Chief Minster A. Revanth Reddy will release DSC results on Monday. The government had issued notification for 11,062 teacher vacancies on March 1. The exams were conducted from July 18 to August 5. A total of 2.45 lakhs of candidates had taken the exam.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/telangana/telangana-dsc-results-check-here-1826996",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/30/1846769-dsc.webp",
        "video": null,
        "publish_date": "2024-09-30 06:29:02",
        "author": "DC Correspondent",
        "authors": [
            "DC Correspondent"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -1.0
    },
    {
        "id": 258008064,
        "title": "AIIMS NORCET 7 Stage II admit card expected today; here's how to download",
        "text": "The All India Institute of Medical Sciences (AIIMS), New Delhi will likely release the admit card for the Nursing Officer Recruitment Common Eligibility Test (NORCET 7) Stage II 2024. Once out, candidates can download their hall tickets from the official website aiimsexams.ac.in. As per the notification, 7829 candidates have been called for the NORCET-07 Stage-II exam scheduled to be conducted on October 4. The recruitment drive aims to fill 1487 vacancies. Steps to download NORCET 7 Stage II admit card 2024 Visit the official website www.aiimsexams.ac.inOn the homepage, click on the login tabKey in you login credentials and submitCheck and download the admit cardTake a printout for future reference The Stage I CBT was held on September 15, 2024. For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their hall tickets from the official website aiimsexams.ac.in.",
        "url": "https://scroll.in/announcements/1073917/aiims-norcet-7-stage-ii-admit-card-expected-today-here-s-how-to-download",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/178829-wmzziyglky-1661223742.jpg",
        "video": null,
        "publish_date": "2024-10-01 02:43:35",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.01
    },
    {
        "id": 258010434,
        "title": "UGC NET Result 2024 Awaited, Check Steps To Download",
        "text": "The National Testing Agency (NTA) will soon release the results for the UGC-NET June 2024 exam. Candidates who appeared in the entrance exam will be able to check their results by visiting the official website of the UGC NET. Applicants will be required to enter their login credentials to check the results.UGC NET 2024 Result: Steps To Download ResultStep 1. Visit the official website, ugcnet.nta.nic.inStep 2. On the homepage, select the link titled \"UGC-NET Result 2024\"Step 3. Enter your login details, such as your application number and date of birth.Step 4. Submit the details, and your result will appear on the screen.Step 5. Download the scorecard and save it for future reference.NTA had earlier released the provisional answer keys for the exam. The candidates who were not satisfied with the key had time till September 13, 2024 to raise challenges against any answer in the key. Applicants were required to pay a fee of Rs 200 per question as a non refundable processing fee for raising challenge against one answer. Challenges made by the candidates would be verified by a panel of subject experts. In case any of the challenge by the candidate is found to be correct, the experts would revise the response of all the candidates accordingly. The results will be prepared and declared based on the revised final answer key. The agency will also publish the final answer key of UGC NET along with the results. The final answer key will be adjusted on the basis of candidates' response of the provisional answer key. The exam was conducted from August 21 to September 4, 2024 in two shifts.UGC NET exam is conducted to determine the eligibility of candidates for ‘Assistant Professor' as well as ‘Junior Research Fellowship and Assistant Professor' in Indian universities and colleges. The exam is being conducted by the NTA in Computer Based Test (CBT) mode.UGC-NET is conducted twice every year in the months of June and December.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\")",
        "summary": "UGC NET exam was conducted from August 21 to September 4, 2024 in two shifts.",
        "url": "https://www.ndtv.com/education/ugc-net-result-2024-awaited-check-steps-to-download-6689130",
        "image": "https://c.ndtvimg.com/2024-04/68dksut8_online-exam_625x300_15_April_24.png?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-01 03:26:09",
        "author": "Puniti Pandey",
        "authors": [
            "Puniti Pandey"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.354
    },
    {
        "id": 258010390,
        "title": "RSMSSB Stenographer/ PA admit card 2024 released; check exam details here",
        "text": "The Rajasthan Staff Selection Board (RSMSSB) has released the admit card for the posts of Stenographer and Personal Assistant recruitment exam 2024. Eligible candidates can download their hall tickets from the official website rsmssb.rajasthan.gov.in or recruitment.rajasthan.gov.in. The recruitment exam will be conducted on October 5 in two shifts — 9.00 am to 12.00 noon and 2.30 pm to 5.30 pm. The recruitment drive aims to fill up a total of 194 Stenographer vacancies. Steps to download Steno/ PA admit card 2024 Visit the official website recruitment.rajasthan.gov.inGo to the Get Admit Card tabNow click on the Stenographer/ PA admit card 2024 linkKey in your login details and submitDownload the admit card and take a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their hall tickets from the official website rsmssb.rajasthan.gov.in.",
        "url": "https://scroll.in/announcements/1073920/rsmssb-stenographer-pa-admit-card-2024-released-check-exam-details-here",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/151346-bdiyulgujp-1609828842.jpg",
        "video": null,
        "publish_date": "2024-10-01 03:35:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.345
    },
    {
        "id": 258014376,
        "title": "CBSE Board Exams 2025 Date Sheet To Be Out Soon, Check Details",
        "text": "The Central Board of Secondary Education (CBSE) will soon release the date sheet for Class 10 and 12 board exams. The board is expected to begin with the 2025 board exams for Classes 10 and 12 from February 15, 2025. While CBSE has not yet released any official notification for the boards, the exam date is speculated based on an earlier post by PTI on X. The exam are likely to begin in February and would conclude in April.Since 2023, CBSE is conducting the board exam on February 15. In 2021, the exam was conducted on May 4-June 7 and in 2022 the board exam was held in April 26-May 24. The CBSE Class 10 and 12 date sheet will comprise the exam days, dates, timings, and general instructions for students.The exam will be held in pen and paper format. The Board will release a separate date sheet for practical examinations. The practical exam for Class 12 will be held under the supervision of an external examiner visiting schools, however the Class 10 practical exam will be conducted in the presence of school teachers only. The board has announced a mandatory Closed-Circuit Television (CCTV) policy for schools designated as examination centres for the upcoming board examinations. With around 44 lakh students expected to participate in these exams across India and 26 countries in 2025, the board will designate approximately 8,000 schools as examination centres.CBSE has issued a set of Frequently Asked Questions (FAQs) to help affiliated schools submit the List of Candidates (LOC) for the 2024-25 exams accurately and on time.Meanwhile, CBSE is also exploring a semester system involving biannual exams. Currently, the board exams for Classes 10 and 12 are conducted in February-March. According to officials, consultations are on and no decision has been made yet about when and in which format the plan to conduct board exams twice a year will be implemented.",
        "summary": "The board is expected to begin with the 2025 board exams for Classes 10 and 12 from February 15, 2025.",
        "url": "https://www.ndtv.com/education/cbse-board-exams-2025-date-sheet-to-be-out-soon-check-details-6689534",
        "image": "https://c.ndtvimg.com/2024-03/t020p8u_cbse_625x300_27_March_24.png?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-01 04:44:41",
        "author": "Puniti Pandey",
        "authors": [
            "Puniti Pandey"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.062
    },
    {
        "id": 258056934,
        "title": "Telangana TS DSC Result 2024 Declared: Follow Direct Link to Download Ranks",
        "text": "The Department of School Education, Telangana has announced the results of the direct recruitment examination for teacher posts on the official website at tgdsc.aptonline.in. The TS DSC direct recruitment examination for teacher posts was conducted in two shifts from 18 July to 5 August 2024. Approximately 2,46,584 candidates appeared for the examination, which was held for 11,062 School Assistant, Language Bandit, Secondary Grade Teacher, and Physical Education Teacher vacancies.The TS DSC result 2024 can be checked on the official website, by using personal login details like hall ticket number and password. The department issued the provisional answer key on 13 August 2024, and invited objections from candidates. The final answer key was released on 6 September 2024. TS EAMCET Pharmacy Seat Allotment Result 2024 Today, 27 September: How to Check?Visit the official website at tgdsc.aptonline.in.On the home page, click on the direct link for TS DSC Result 2024.A login page will open on the screen.Enter the required login details.Hit the submit option.Your result will show up on the screen.Check the result carefully.Download, save, and print a copy for future reference.You can also follow the direct link to check TS DSC Results 2024.UGC NET Result 2024: June Re-Exam Scorecards and Final Answer Key To Be Out Soon(At The Quint, we question everything. Play an active role in shaping our journalism by becoming a member today.)",
        "summary": "Telangana TS DSC Result 2024 has been published at tgdsc.aptonline.in. Details",
        "url": "https://www.thequint.com/news/education/telangana-ts-dsc-result-2024-declared-follow-direct-link-to-download-ranks",
        "image": "https://images.thequint.com/thequint/2024-05/871eb3a2-2d81-4465-8cd6-6c4807e3d043/iStock_1218586447.jpg?auto=format,compress&fmt=webp&format=webp&w=1200&h=900&dpr=1.0",
        "video": null,
        "publish_date": "2024-10-01 04:48:02",
        "author": "Saima Andrabi",
        "authors": [
            "Saima Andrabi"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.357
    },
    {
        "id": 258025278,
        "title": "RSMSSB CET 12th Level registration ends today; check exam schedule here",
        "text": "Rajasthan Subordinate and Ministerial Services Selection Board (RSMSSB) will close the online application window for the Common Eligibility Test (Senior Secondary Level) 2024 today, October 1. Eligible candidates can apply for the exam on the official website rsmssb.rajasthan.gov.in. The CET (Senior Secondary Level) 2024 will be conducted from October 22 to 24 in two shifts — 9.00 AM to 12.00 noon and 3.00 PM to 6.00 PM. Candidates can check the eligibility criteria, educational qualification, pay scale, and other details available in the notification below: Application Fee Candidates from unreserved/BC/EBC (creamy layer) are required to pay the fee of Rs 600, whereas Rs 400 is applicable to candidates from BC/EBC (non-creamy layer), EWS category, SC, ST category candidates. Steps to apply for RSMSSB CET 12th level 2024 Visit the official website recruitment.rajasthan.gov.inOn the homepage, click on the apply link for ‘COMMON ELIGIBILITY TEST (SENIOR SECONDARY LEVEL) - 2024Go to registration and complete the registrationLogin and apply for the desired postFill the application form, upload documents, and pay the feeSubmit the form and take a printout For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can apply for the exam on the official website rsmssb.rajasthan.gov.in.",
        "url": "https://scroll.in/announcements/1073928/rsmssb-cet-12th-level-registration-ends-today-check-exam-schedule-here",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/53914-igtwbgvvna-1489895182.jpg",
        "video": null,
        "publish_date": "2024-10-01 06:40:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.498
    },
    {
        "id": 258050586,
        "title": "Dasara holidays schedule revised for schools in Andhra Pradesh",
        "text": "The School Education department has revised the schedule of Dasara holidays. In a statement on October 1 (Tuesday), Director, School Education, V. Vijay Rama Raju said as per the academic calendar 2024-25, Dasara holidays were originally scheduled from October 4 to October 13, 2024 (10 days) for all primary and high schools in the State, under all managements, including private and unaided schools. In response to requests by certain teacher associations, the government has revised Dasara holidays to October 3 to 13, 2024. The schools will re-open on October 14, 2024 (Monday), said the statement.",
        "summary": "The holidays to begin one day earlier",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/dasara-holidays-schedule-revised-in-andhra-pradesh/article68704924.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-10-01 10:15:04",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -0.26
    },
    {
        "id": 258113918,
        "title": "GATE 2025: Registration Window Without Late Fee Closes Tomorrow",
        "text": "GATE 2025: The Indian Institute of Technology (IIT) Roorkee will close the online application window for the Graduate Aptitude Test in Engineering (GATE) 2025 without a late fee tomorrow.Interested and eligible candidates can submit their applications by visiting the official website. The final submission date for those applying with a late fee is October 7, 2024. The examination is scheduled for February 1, 2, 15, and 16, 2025, and the results will be declared on March 19. Admit cards will be issued on January 2.GATE 2025: Steps To ApplyStep 1. Visit the official website: gate2024.iisc.ac.inStep 2. Click on the \"Apply Online\" tabStep 3. Complete the registration processStep 4. Fill in the required details, pay the application fee, and submit the formStep 5. Keep a copy for future referenceEligibility CriteriaEligibility includes students currently enrolled in the third year or later of any undergraduate program, as well as those who have already completed a government-recognized degree in Engineering, Technology, Architecture, Science, Commerce, Arts, or Humanities.Application FeeFemale/SC/ST/PwD (per paper): Rs 900Other candidates, including foreign nationals (per paper): Rs 1800Examination DurationThe GATE 2025 examination will last for 3 hours (or 4 hours for candidates requiring compensatory time) and will include 65 questions, totaling 100 marks. The examination will automatically end once the allotted time has expired.The Graduate Aptitude Test in Engineering (GATE) is a national-level exam that assesses a candidate's knowledge of various undergraduate subjects in Engineering, Technology, Science, Architecture, and Humanities. It is used for admission to Master's and Doctoral programs and recruitment by certain Public Sector Undertakings (PSUs).(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\")",
        "summary": "The GATE 2025 examination will last for 3 hours and will include 65 questions, totaling 100 marks.",
        "url": "https://www.ndtv.com/education/gate-2025-registration-window-without-late-fee-closes-at-official-website-gate2025-iitr-ac-in-6695620",
        "image": "https://c.ndtvimg.com/2024-10/odra0gj_trttrr_625x300_02_October_24.jpeg",
        "video": null,
        "publish_date": "2024-10-01 18:39:16",
        "author": "Lavkesh Singh",
        "authors": [
            "Lavkesh Singh"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.078
    },
    {
        "id": 258149946,
        "title": "IBPS Clerk Prelims result 2024 declared; here’s download link",
        "text": "The Institute of Banking Personnel Selection (IBPS) has announced the CRP Clerk XIV Preliminary Exam 2024 results. Candidates can download their results from the official website ibps.in. The results will be available to download till October 7, 2024. The Preliminary exam was conducted on August 24, 25 and 31, 2024. IBPS aims to fill up a total of 6,148 Clerk vacancies in 11 participating banks, reports Hindustan Times. The Main exam is likely to be held on October 13, 2024. Steps to download IBPS Clerk XIV result 2024 Visit the official website ibps.inOn the homepage, click on the CRP Clerk XIV result linkKey in your login details and submitCheck and download the resultTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their results from the official website ibps.in.",
        "url": "https://scroll.in/announcements/1073966/ibps-clerk-prelims-result-2024-declared-heres-download-link",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/103196-vepmvmjmtn-1539678605.jpg",
        "video": null,
        "publish_date": "2024-10-02 03:27:45",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.609
    },
    {
        "id": 258203024,
        "title": "CGPSC State Services Exam DV and interview schedule out; check details here",
        "text": "The Chhattisgarh Public Service Commission (CGPSC) has released the document verification and interview schedule for the State Service (Mains) Exam 2023. Eligible candidates can download their results from the official website psc.cg.gov.in. The interview will be conducted from October 15 to November 11. The process of verification of documents of the candidates shortlisted for interview will be done one day before the interview date in the first shift from — 10.00 am to 01.00 pm and the second shift — 02.00 pm to 05.00 pm. “The candidates must ensure to be present at the Commission's office for document verification/interview in the first shift at 09.30 am and second shift at 01.30 pm. Candidates who are absent during document verification will not be allowed to appear in the interview,” reads the notification. Steps to check DV and interview schedule Visit the official notification psc.cg.gov.inOn the homepage, click on ‘Notification Regarding Document Verification and Interview of State Service Exam -2023’ link Check the schedule Save the schedule Take a print out for future reference Candidates can also download interview call letter through and required performa. Candidates can refer to the official notification for more details. For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can check the document verification and interview schedule through the official website psc.cg.gov.in.",
        "url": "https://scroll.in/announcements/1074000/cgpsc-state-services-exam-dv-and-interview-schedule-out-check-details-here",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/201578-vkqiwxfauc-1718856110.jpg",
        "video": null,
        "publish_date": "2024-10-02 11:45:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": -0.214
    },
    {
        "id": 258251218,
        "title": "RJS Mains Result 2024 Declared, Check Steps To Download",
        "text": "RJS Mains Result 2024: The Rajasthan High Court has released the results for the Rajasthan Judicial Service (RJS) Exam 2024. Candidates who appeared for the mains examination for Direct Recruitment to the Cadre of Civil Judge 2024 can check their results by visiting the official site, hcraj.nic.inRJS Mains Result 2024: Steps To CheckStep 1. Visit the Rajasthan High Court's official website, hcraj.nic.inStep 2. On the homepage, click on the \"Latest Updates\" linkStep 3. A new page will appear on the screenStep 4. Click on the notice titled \"Declaration of Result of Main Examination for Direct Recruitment to the Cadre of Civil Judge 2024\"Step 5. Open the PDF and check your roll numberStep 6. Save the document and print a hard copy for future referenceCutoff Marks For Various CategoriesThe cutoff marks for various categories are detailed as follows: For the General category, the cutoff is set at 131 marks. Candidates in the General (widow) category have a cutoff of 130.5 marks, while those in the General (divorcee) category need to score 122 marks. Both the Scheduled Caste and Scheduled Tribe categories share the same cutoff of 105 marks. For candidates belonging to the Other Backward Class-NCL (Non-Creamy Layer), the required cutoff is 123 marks, and for those in the Other Backward Class-NCL (divorcee) category, the cutoff is 122 marks. The More Backward Class-NCL category also has a cutoff of 122 marks. Finally, candidates in the Economically Weaker Sections (EWS) need to achieve a cutoff of 126.5 marks.After successfully passing the mains examination, candidates will be invited for a personal interview. This stage assesses their legal knowledge, communication skills, and overall suitability for the role.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\")",
        "summary": "After successfully passing the mains examination, candidates will be invited for a personal interview.",
        "url": "https://www.ndtv.com/education/rjs-mains-result-2024-declared-check-steps-to-download-6702869",
        "image": "https://c.ndtvimg.com/2024-04/68dksut8_online-exam_625x300_15_April_24.png?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-02 18:41:50",
        "author": "Lavkesh Singh",
        "authors": [
            "Lavkesh Singh"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.182
    },
    {
        "id": 258279444,
        "title": "TNPSC CSE result 2023 released; here’s download link",
        "text": "The Tamil Nadu Public Service Commission (TNPSC) has announced the result of the Combined Engineering Services Examination (Notification No. 23/2023). Eligible candidates can download their results from the official website tnpsc.gov.in. The applicants have been shortlisted for the appointment. The Physical Certificate Verification and Oral Test was held on August 28, 29 and Counselling was held on September 10, 2024. Steps to download CSE result 2023 Visit the official website tnpsc.gov.inUnder ‘recruitment tab’, click on the CSE result 2023 linkThe result will appear on the screenCheck and download the resultTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their results from the official website tnpsc.gov.in.",
        "url": "https://scroll.in/announcements/1074015/tnpsc-cse-result-2023-released-heres-download-link",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/125174-ooyfpzksdh-1565185260.jpg",
        "video": null,
        "publish_date": "2024-10-03 03:22:22",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.334
    },
    {
        "id": 258310728,
        "title": "PSSSB admit card 2024 out for various posts, here's download link",
        "text": "The Punjab Subordinate Services Selection Board (PSSSB) has released the admit card for various posts. Eligible candidates can download the admit card from the official website sssb.punjab.gov.in. The board has released the admit card for Junior Environmental Engineer, Data Entry Operator, A.C. Operator-cum-Mechanic, Glass Blower-cum-Storekeeper, Law Officer, Junior Scientific Officer, Assistant Programmer Librarian-12/2024, Librarian-04/2023, Assistant Librarian, Library Assistant Programmer and Care Taker posts. The examination is scheduled to be held on October 5 and 6. The Junior Environmental Engineer exam will be held on October 5 from 9.00 AM to 11.30 AM. For more details related to the Junior Environmental Engineer exam candidates can refer to the official notification. The board has advised the candidates to re-visit the website 2 days before the examination to check the examination center address details. Steps to download the admit card Visit the official website sssb.punjab.gov.inOn the homepage, go to the current news section Click on the download admit card link Download the admit card using roll number or application number Download the admit card Print it out for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "The examination will be held on October 5 and 6.",
        "url": "https://scroll.in/announcements/1074032/psssb-admit-card-2024-out-for-various-posts-here-s-download-link",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/103200-tlddnrjedn-1539679319.jpg",
        "video": null,
        "publish_date": "2024-10-03 09:00:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.374
    },
    {
        "id": 258340176,
        "title": "APSC TDO written exam schedule out; check details here",
        "text": "The Assam Public Service Commission (APSC) has released the examination schedule for the post of Tourism Development Officer (Grade-II) under the Directorate of Tourism, Government of Assam under Advt. No. 05/2024. Eligible candidates can check the written exam schedule through the official website apsc.nic.in. The examination will be held on October 20. The examination will be held in two shifts — 09:30 AM to 12:30 PM (Shift I) and 2:00 PM to 04:00 PM (Shift II). In Shift I General English (Descriptive type) exam will be held and in Shift II GK & Arithmetic (MCQ) exam will be conducted. For more details, candidates can refer to the official website. The recruitment drive aims to fill up a total of 12 vacancies. The salary for the posts will be Rs 22,000 to Rs 97,000 as per the Pay Band 3. Candidates can refer to the official notification for more details related to posts. For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can check the Tourism Development Officer written exam through the official website apsc.nic.in.",
        "url": "https://scroll.in/announcements/1074044/apsc-tdo-written-exam-schedule-out-check-details-here",
        "image": "https://s02.sgp1.cdn.digitaloceanspaces.com/article/33477-18681967059_4248974080_o.jpg",
        "video": null,
        "publish_date": "2024-10-03 12:40:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": -0.055
    },
    {
        "id": 258348174,
        "title": "UPSC IFS Mains 2024 exam schedule out at upsc.gov.in; check details here",
        "text": "The Union Public Service Commission (UPSC) has released the exam timetable for the Indian Forest Services (IFS) mains exams. Eligible candidates can check the exam schedule through the official website upsc.gov.in. The UPSC conducted the IFS Preliminary Exam 2024 on June 16, and the results were released on July 1. Candidates had to submit the DAF by September 5. Steps to check the IFS Mains exam schedule Visit the official website upsc.gov.inOn the homepage, go to the what’s new tab Click on ‘Examination Time Table: Indian Forest Service (Main) Examination, 2024’ linkCheck the exam schedule Download and print the exam schedule for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can check the UPSC Indian Forest Services exam schedule through the official website upsc.gov.in.",
        "url": "https://scroll.in/announcements/1074049/upsc-ifs-mains-2024-exam-schedule-out-at-upsc-gov-in-check-details-here",
        "image": "https://s02.sgp1.cdn.digitaloceanspaces.com/article/89830-qgmgqchpjh-1526475211.jpg",
        "video": null,
        "publish_date": "2024-10-03 14:30:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.387
    },
    {
        "id": 258442292,
        "title": "NIOS Class 10th, 12th admit card released; download link here",
        "text": "The National Institute of Open Schooling (NIOS) has released the admit card for the theory exam of the Secondary (Class 10) and Senior Secondary (Class 12) for the October and November 2024 sessions. Candidates can download their hall tickets from the official websites nios.ac.in or sdmis.nios.ac.in. NIOS Class 10th and 12th exams will commence on October 22 and conclude on November 30 in both Indian and overseas exam centers. Candidates can check the detailed exam schedule in the notification below: Steps to download NIOS Class 10th, 12th admit card Visit the official website sdmis.nios.ac.inOn the homepage, go to the Exams and Results tabClick on the Examination—Hall Ticket Oct/Nov 2024 linkLogin and download the admit cardTake a printout for future reference For more details, candidates are advised to visit the official website here.",
        "summary": "Candidates can download their hall tickets from the official website nios.ac.in",
        "url": "https://scroll.in/announcements/1074073/nios-class-10th-12th-admit-card-released-download-link-here",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/178829-wmzziyglky-1661223742.jpg",
        "video": null,
        "publish_date": "2024-10-04 08:48:39",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": -0.019
    },
    {
        "id": 258540876,
        "title": "UP NEET UG Counselling 2024 Round 3 Schedule Out, Check Registration Dates",
        "text": "The Director General of Medical Education and Training (DME), Uttar Pradesh has released the schedule for third round of online counselling for Uttar Pradesh National Eligibility Entrance Test (NEET) UG counselling 2024. The counselling has been released for admission to MBBS, BDS programmes of government and private medical and dental colleges in Uttar Pradesh through NEET UG 2024.The date for online registration and upload of documents has been scheduled for October 7 to October 9, 2024. The date for deposition of registration and security money will be open from October 7 to October 9, 2024. The registration and deposition of money can be submitted for three days. The merit list of the third counselling process will be released on October 10, 2024. The date of on-line choice filling will be open from October 11 to October 15, 2024. The results for the allotment of counselling seats is scheduled for October 18, 2024. The allotment and admission letters can be downloaded from October 19 and October 21 to 23, October 2024.Candidates who have already registered need not to register again.Those who have already registered and could not deposit the registration fee and security amount can participate in the counselling process by depositing their registration fee and security amount.Candidates, who have not taken admission in the allotted / re-allotted seat through second round of counselling or have resigned from the seat, can participate in the counselling of third round depositing the prescribed security amount' again.Candidates should assess their eligibility themselves as per the instructions contained in the Government Order/Brochure of UP NEET UG 2024.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\")",
        "summary": "The counselling has been released for admission to MBBS, BDS programmes of government and private medical colleges in Uttar Pradesh.",
        "url": "https://www.ndtv.com/education/up-neet-ug-counselling-2024-round-3-schedule-released-check-registration-dates-6720395",
        "image": "https://c.ndtvimg.com/2023-02/j3nulf8_medical-student-generic-medicine-generic-doctor-generic_625x300_25_February_23.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-05 05:04:16",
        "author": "Puniti Pandey",
        "authors": [
            "Puniti Pandey"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -0.569
    },
    {
        "id": 258585492,
        "title": "Amendment to GHMC Act to empower HYDRAA",
        "text": "A recently published Ordinance effecting an amendment to the Greater Hyderabad Municipal Corporation Act, 1955, enables the government to assign the powers of the the Greater Hyderabad Municipal Corporation or its Commissioner to any officer or agency or authority in order to protect public assets. Approval of the Ordinance by the Governor is perceived as an effort on part of the government to clear the legal hurdles for the Hyderabad Disaster Response and Asset Protection Agency (HYDRAA) which is entrusted with the responsibility of protection of lakes and government lands in and around the State capital. The Telangana Ordinance No. 4 of 2024 published in the Telangana Gazette on October 3, inserts a Section 374B, which stipulates that the government can empower any officer/agency/authority to exercise the powers vested with the corporation/the commissioner for protection of public assets such as roads, drains, public streets, water bodies, open spaces and public parks and preserve them from illegal encroachments. The government sought to justify the amendment by saying unforeseen contingencies and disasters necessitated the requirement of specialised agencies whose services can be roped in by GHMC to strategise and implement effective resilient systems for natural calamities and disasters. While the Ordinance legally accords enforcement powers to HYDRAA with regard to GHMC Act, it also restricts its authority to GHMC alone. As per the government order constituting HYDRAA, the authority’s jurisdiction includes area under GHMC and all urban and rural local bodies up to the Outer Ring Road. The government may be specifically include or exclude areas from HYDRAA’s purview from time to time as per the orders. Telangana Municipalities Act, 2019 already has provisions for the government or the municipal commissioner to empower district level task force/agency towards enforcement with regard to removal of unauthorised structures. As per the sources, a government order has already been issued empowering the HYDRAA to take action in the urban local bodies too. However, the same is not available in public domain.",
        "summary": "The Ordinance is part of efforts of the government to clear the legal hurdles for the Hyderabad Disaster Response and Asset Protection Agency, which is entrusted with the responsibility of protection of lakes and government lands in and around the State capital",
        "url": "https://www.thehindu.com/news/national/telangana/amendment-to-ghmc-act-to-empower-hydraa/article68722166.ece",
        "image": "https://th-i.thgim.com/public/incoming/jf4k4i/article68722293.ece/alternates/LANDSCAPE_1200/240824_Thammidi%20kunta%20lake%2006.jpg",
        "video": null,
        "publish_date": "2024-10-05 15:07:13",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -0.145
    },
    {
        "id": 260386360,
        "title": "SSC CGL 2024: Results Expected Before Diwali—Check How To Download Your Score",
        "text": "The Staff Selection Commission (SSC) will announce the results for the Combined Graduate Level Examination (CGL) 2024 shortly on its official website, ssc.gov.in. Although the exact date for the result release has not been confirmed, it is anticipated to be published before Diwali.Based on previous trends, candidates can expect their results on October 28. Applicants are advised to keep their application number and date of birth handy to check and download their scorecards.On October 3, the Commission released the provisional answer key, allowing candidates to raise objections until 8 October. The Commission will review these objections and may revise the answer key if necessary. The final answer key is expected to be released alongside the results.SSC CGL 2024: Key DetailsExam Conducting Body: Staff Selection Commission (SSC)Exam Name: SSC CGL 2024Vacancies: Over 17,000 postsExam Dates: Tier 1 from 9 September to 26 September 2024Answer Key Released: 3 October 2024Objection Window Closed: 8 October 2024Expected Result Date: End of October 2024Selection Process: Tier 1, Tier 2 exams, and Document VerificationHow To Check SSC CGL 2024 Results1. Visit the official website, ssc.gov.in.2. Look for the Latest News section on the homepage.3. Click on the link for the SSC CGL Tier I Result.4. The result will appear on your screen.5. Review the results and download them.6. Print the scorecard for future reference.Only candidates who pass the Tier I exam will be eligible to take the Tier II exam. The admit card for the Tier II exam will be released separately on the official website. This recruitment drive will fill a total of 17,727 positions. For more information, please visit the official website.",
        "summary": "The Staff Selection Commission (SSC) will announce the results for the Combined Graduate Level Examination (CGL) 2024 shortly on its official website, ssc.gov.in. Although the exact date for the result release has not been confirmed, it is anticipated to be published",
        "url": "https://www.oneindia.com/india/ssc-cgl-2024-results-expected-before-diwali-check-how-to-download-your-score-3965297.html",
        "image": "https://imagesvs.oneindia.com/img/2024/10/large-1729420341.jpg",
        "video": null,
        "publish_date": "2024-10-20 10:33:01",
        "author": "Zainab Ashraf",
        "authors": [
            "Zainab Ashraf"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -0.059
    },
    {
        "id": 260456864,
        "title": "OPSC OCS Prelims Admit Card 2024 OUT; Check Now!",
        "text": "HomeEducationOPSC OCS Prelims Admit Card 2024 OUT; Check Now!\n\nOPSC OCS Prelims Admit Card 2024 OUT; Check Now!\n\nAt various test locations throughout the state on October 27, the preliminary exam will take place.\n\nSunidhi VUpdated: Monday, October 21, 2024, 11:29 AM IST\n\nOPSC OCS 2024 | Representative image\n\nAdmit cards for the Odisha Civil Services (OCS) preliminary exam 2023 have been made available by the Odisha Public Service Commission. On the commission's website, opsc.gov.in, candidates who plan to take the exam can get their admit cards or admission certificates as well as the instructions for the exam day.\n\nAt various test locations throughout the state on October 27, the preliminary exam will take place.\n\nThe candidate's name, roll number, mother’s and father’s names, date of birth, exam date, exam centre address, reporting time, and other crucial exam day instructions are all contained on the OPSC admit card.\n\nHow to download?\n\nOPSC OCS Prelims Admit Card 2024 OUT; Check Now!\n\nIndiaMart Shares Fall By A Colossal 13% After Q2 Results Decline In Collection Growth\n\n'Some Khalistani Extremists Are Deep Assets Of Canada Security Intelligence Service': Recalled Envoy To Canada Sanjay Verma Makes Shocking Claims; Watch Full Interview\n\nToyota Glanza Festival Limited Edition Launched – Includes Free Accessory Package for All Grades\n\n-Visit opsc.gov.in.\n\n-\"Download Admission Certificate & Instructions for the Odisha Civil Services-2023 Preliminary examination (Advt. No. 20 of 2023-24)\" is the link to click.\n\n-Enter your birthdate, PPSAN, and login credentials, then choose the exam name.\n\nICAI CA Final 2024: Admit Card OUT; Check Latest Update\n\n-Check and submit your admissions card.\n\n-Verify the exam day standards, paper scheduling, and reporting times.\n\n-Print the admit card in the format that is necessary.\n\nOn the day of the OPSC OCS exam, candidates must provide a hard copy of their admission card.\n\nOPSC OCS 2024\n\nThe five zones—Balasosre, Berhampur, Bhubaneshwar, Cuttack, and Sambalpur—will host examinations. Paper I will be administered from 10:00 am to 12:00 pm, and Paper II from 1:30 pm to 3:30 pm. The exam will be held in two shifts. Examinations will be administered in an objective manner, with 180 multiple-choice questions.\n\nFollow us on",
        "summary": "",
        "url": "https://www.freepressjournal.in/education/opsc-ocs-prelims-admit-card-2024-out-check-now",
        "image": "https://media.assettype.com/freepressjournal/2020-08/e7234fc7-3676-4ae8-be42-24be3eb7fb13/omr_3723128_1920.jpg",
        "video": null,
        "publish_date": "2024-10-21 05:59:42",
        "author": "Sunidhi V",
        "authors": [
            "Sunidhi V"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.03
    },
    {
        "id": 260472420,
        "title": "NEET PG 2024 Counselling Schedule Expected Soon: How to Download at MCC.nic.in?",
        "text": "The Medical Counselling Committee (MCC) is expected to release the NEET PG 2024 Counselling schedule soon. The schedule, once released, will be available on the MCC's official website at MCC.nic.in.The NEET PG counselling schedule will provide crucial information for candidates who have qualified for the All India Quota seats, which constitute 50 percent of the total seats in Central Universities.To be eligible for the counselling process, candidates must have successfully qualified for the NEET PG exam, conducted by the National Board of Examinations (NBE).ADRE Grade 3 Result 2024 May be Out Soon: How to Check HSSLC, HSLC Driver ResultWhile the registration process for all India quota (AIQ) PG admissions is ongoing, candidates are awaiting the detailed schedule outlining important dates like registration deadlines, seat allotment result announcements, and reporting dates. The MCC had previously activated the registration link for Round 1 on 20 September 2024, without releasing the schedule.It is important to note that candidates can submit only one NEET-PG Counselling application/registration form. Multiple applications will lead to disqualification from the allotment process, cancellation of candidature, and potential further action by the MCC.HSSC Group C, D Result 2024 Releasing Today: How to Check Recruitment Results?Candidates who are satisfied with their allotted seat after the counselling process can proceed to complete the admission formalities at the designated medical or dental college. The required original documents must be presented at the time of joining.Visit the official website at MCC.nic.in.On the homepage, click on the direct link for downloading the NEET PG Counselling Schedule 2024.A PDF file will show up on the screen.Click on the PDF.Check the counselling schedule carefully.Download, save, and print a copy for further use.(Disclaimer: Parts of this article were generated by AI and published after the content was editorially modified and verified by a human based on their own judgement and expertise. The Quint does not publish AI-generated content without direct human involvement and oversight).UGC NET Result 2024: When Will the June Re-exam Results be Declared?(At The Quint, we question everything. Play an active role in shaping our journalism by becoming a member today.)",
        "summary": "MCC to announce NEET PG 2024 Counselling schedule soon; check details on MCC.nic.in.",
        "url": "https://www.thequint.com/news/education/neet-pg-2024-counselling-schedule-expected-soon-how-to-download-at-mccnicin",
        "image": "https://images.thequint.com/thequint/2024-09-11/uv7z4gis/iStock-617759118.jpg?auto=format,compress&fmt=webp&format=webp&w=1200&h=900&dpr=1.0",
        "video": null,
        "publish_date": "2024-10-21 06:15:55",
        "author": "Saima Andrabi",
        "authors": [
            "Saima Andrabi"
        ],
        "language": "en",
        "category": "education",
        "source_country": "IN",
        "sentiment": 0.042
    },
    {
        "id": 260466726,
        "title": "TGPSC Group-1 Mains Exam Begins",
        "text": "Hyderabad: The main examinations for filling 563 Group-1 posts in the state begin on Monday. Police have been placed on high alert in response to calls for postponement. Extensive arrangements have been made at 46 examination centers under the jurisdictions of Hyderabad, Cyberabad, and Rachakonda Police commissionerates. Section 163 of the BNSS has been enforced at all centers, prohibiting the gathering of more than five people within 200 meters of the premises.At each center, six constables, including one female constable stationed under the supervision of a Sub-Inspector (SI). CCTV cameras have been installed in the exam rooms, around the Chief Superintendent's area, and in surrounding zones, with real-time monitoring of the situation. A route map has been prepared for the GPS-equipped vehicles that will transport the question papers and answer sheets daily for the examinations scheduled from October 21 to 27.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/telangana/tgpsc-group-1-mains-exam-begins-1831702",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854426-group1.webp",
        "video": null,
        "publish_date": "2024-10-21 07:32:40",
        "author": "DC Correspondent",
        "authors": [
            "DC Correspondent"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": -0.139
    }
]