[
    {
        "id": 260487276,
        "title": "ECI Approves Appointment Of Ajay Kumar Singh As Jharkhand's Director General Of Police Ahead Of Assembly Elections",
        "text": "Ajay Kumar Singh, who is the senior IPS officer in the cadre, was selected from the panel of three IPS officers sent by the State Government after the Commission had ordered the immediate removal of acting DGP Anurag Gupta.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/eci-approves-appointment-of-ajay-kumar-singh-as-jharkhands-director-general-of-police-ahead-of-assembly-elections",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/44s9ocsd/Untitled-design-26.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:24:23",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.321
    },
    {
        "id": 260489944,
        "title": "Road accident kills driver, injures 14 in Afghanistan",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Kabul, Oct 21 (IANS) The driver of a mini-bus lost his life and 14 commuters sustained injuries as the vehicle plunged into a ravine in eastern Afghanistan&#8217;s Laghman province, provincial police spokesperson Mohammad Yunus Yusufzai said on Monday. Blaming reckless driving for the accident that occurred on Sunday night, the police official said that the [&#8230;]",
        "url": "https://bhaskarlive.in/road-accident-kills-driver-injures-14-in-afghanistan/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410213246831.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 10:25:01",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260489934,
        "title": "MVA’s expiry date arriving soon, says Mumbai BJP chief Shelar (IANS Exclusive Interview)",
        "text": "Mumbai, Oct 21 (IANS) Mumbai BJP chief Ashish Shelar says the Mahayuti-led by the Bharatiya Janata Party (BJP), Shiv Sena and Nationalist Congress Party (NCP) remains unified with a clear and mutually-agreed seat sharing formula, while the Maha Vikas Aghadi (MVA) comprising the Congress, Shiv Sena(UBT) and NCP(SP) is facing internal squabbles over constituency allocation.\n\nIn an exclusive interview with IANS, Shelar claims that the Mahayuti government will come back to power after the elections. Here are some excerpts:\n\nIANS: Although the BJP has announced the first list, talks for seat sharing among the Mahayuti are not yet concluded. Is it due to differences? The MVA is also struggling to arrive at an understanding. What is your take?\n\nShelar: There is remarkable unity and discipline within the Mahayuti alliance. We have finalised our seat-sharing proportions and accordingly our list of candidates has also been declared. There is also clarity that the elections will be contested under the leadership of Chief Minister Eknath Shinde. However, within the MVA, there is no consensus, no balanced seat-sharing arrangement and all their allied partners are embroiled in internal debates. Either before arriving at a consensus over seat sharing or immediately after the results, the MVA is sure to be in tatters after November 23. The MVA’s expiry date is arriving soon.\n\nIANS: How confident are you about the Mahayuti forming the government once again in Maharashtra?\n\nShelar: Absolutely confident. Every election is different in terms of the prevailing issues, subjects, developments and the overall ecosystem. We, as the Mahayuti, are confident of winning the elections as we have only focussed on working for the development of the state. We have decided to go out to the people of Maharashtra with the list of development works and initiatives undertaken.\n\nIANS: Do you fear fake narratives will impact the results like during the Lok Sabha elections?\n\nShelar: Fake narratives were spread during the Lok Sabha elections which had impacted us. Today, once again, conspiracies to spread lies and fake narratives are being made. It is our job to stop the fake narrative and to speak in the interest of the people of Mumbai and Maharashtra. Shiv Sena (UBT) leader Aaditya Thackeray alleged that 1,000-odd acres of land has been transferred in the name of Adani. I challenged him to give evidence to prove his statement. If Aaditya Thackeray has the courage, he should come forward for an open discussion and counter our questions. He is behaving like a spokesperson of urban Naxals and deliberately trying to spread lies, disturbance and unrest and create an image that there is anarchy in the state.\n\nIANS: You have been targeting the MVA over ‘Vote Jihad’. What is your comment?\n\nShelar: The MVA leaders are resorting to doing politics of appeasement. We have always believed in ‘Sabka Saath, Sabka Vikas’. Our Hindutva also revolves around development of all elements of society. We believe in taking everybody together in our march of progress. Why should Uddhav Thackeray and his son Aaditya get worried about it? The Mahayuti government is working towards ensuring homes for the poor in Dharavi. But they are making attempts to incite Dharavikars and spread fear in the minds of the poor Marathi, Muslim, Dalits making them believe that they will never get their rightful homes in Dharavi.\n\nIANS: What is the Mahayuti’s agenda for the forthcoming Assembly elections?\n\nShelar: Our agenda is development. The Mahayuti government believes in delivering on its promises. The government launched the Coastal Road, the Mumbai-Nagpur Samruddhi Mahamarg, the Mumbai-Delhi corridor, bullet train and much more. Through schemes like the Mukhyamantri Ladki Bahin Yojana, the government started transferring money in the bank accounts of women, made ST travel free, deposited money in the bank accounts of senior citizens, and gave waivers to farmers over electricity bills. Today, the common citizen is concerned about the development of his city, state and the nation and we believe in favour of development.\n\n(Sanjay Jog can be reached at sanjay.j@ians.in)",
        "summary": "Mumbai, Oct 21 (IANS) Mumbai BJP chief Ashish Shelar says the Mahayuti-led by the Bharatiya Janata Party (BJP), Shiv Sena and Nationalist Congress Party (NCP) remains unified with a clear and mutually-agreed seat sharing formula, while the Maha Vikas Aghadi (MVA) comprising the Congress, Shiv Sena(UBT) and NCP(SP) is facing internal squabbles over constituency allocation. [&#8230;]",
        "url": "https://bhaskarlive.in/mvas-expiry-date-arriving-soon-says-mumbai-bjp-chief-shelar-ians-exclusive-interview/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410213246848.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 10:25:12",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.163
    },
    {
        "id": 260489938,
        "title": "Assam bypolls: BJP’s ally UPPL announces candidate",
        "text": "Guwahati, Oct 21 (IANS) BJP’s ally in Assam, United People’s Party Liberal (UPPL) on Monday announced its candidate for the upcoming bypolls to the Sidli Assembly seat.\n\nThe party has given the ticket to Nirmal Kumar Brahma, who is the current district president of UPPL in Chirang.\n\nUPPL in a statement said, “The president of the party, Pramod Boro has nominated Nirmal Kumar Brahma as a candidate for the upcoming byelection supported by National Democratic Alliance in the state.”\n\nByelections in five Assembly constituencies — Dholai, Samaguri, Behali, Bongaigaon, and Sidli — became due following the elections of five legislators to the Lok Sabha.\n\nThe Dholai Assembly constituency is reserved for the Scheduled Caste (SC) community and the Sidli seat is reserved for the Scheduled Tribe (ST).\n\nExcept in Samaguri, where Congress heavyweight Rakibul Hussain has been winning since 2001, the rest four seats are with the BJP-led alliance.\n\nThe BJP has announced candidates for three seats — Dholai, Samaguri and Behali.\n\nDiplu Ranjan Sarma has been given a ticket in Samaguri while Diganta Ghatowar and Nihar Ranjan Das will fight for the BJP in Behali and Dholai Assembly segments respectively.\n\nBJP’s former cabinet Minister Parimal Suklabaidya successfully contested the Silchar Lok Sabha seat and his earlier Assembly seat, Dholai, fell vacant. Another senior BJP leader Ranjit Dutta, MLA from the Behali Assembly seat, was also elected to the Lok Sabha.\n\nCongress leader Rakibul Hussain defeated the three-time AIUDF MP and party chief Badruddin Ajmal in the Dhubri Lok Sabha seat with a margin of more than 10 lakh votes reinforcing his status as a five-time legislator from the Samuguri Assembly seat.\n\nMeanwhile, another ally of the BJP — Asom Gana Parishad (AGP) — will contest polls from the Bongaigaon Assembly constituency.",
        "summary": "Guwahati, Oct 21 (IANS) BJP’s ally in Assam, United People’s Party Liberal (UPPL) on Monday announced its candidate for the upcoming bypolls to the Sidli Assembly seat. The party has given the ticket to Nirmal Kumar Brahma, who is the current district president of UPPL in Chirang. UPPL in a statement said, “The president of [&#8230;]",
        "url": "https://bhaskarlive.in/assam-bypolls-bjps-ally-uppl-announces-candidate/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410213246851.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 10:25:18",
        "author": "IANS,National Democratic Alliance",
        "authors": [
            "IANS",
            "National Democratic Alliance"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.211
    },
    {
        "id": 260488814,
        "title": "'Was planned by BJP': Akhilesh blames ruling party for Bahraich violence",
        "text": "NEW DELHI: Samajwadi Party President Akhilesh Yadav on Monday alleged that the BJP was responsible for the recent violence in Bahraich during a Durga idol immersion procession that led to the death of a 22-year-old man.\"Whatever happened in Bahraich was planned by the BJP in view of the upcoming elections in the state,\" Akhilesh Yadav told news agency ANI.— ANI (@ANI) The violence erupted on Sunday in Maharajganj, located under Mahsi tehsil, after an alleged dispute over loud music being played outside a place of worship during the immersion procession. The clash led to the tragic death of Ram Gopal Mishra, a 22-year-old who succumbed to gunshot injuries.Following the incident, the area descended into chaos, with mobs engaging in widespread vandalism and arson, targeting homes, shops, showrooms, hospitals, and vehicles.Local authorities have responded by registering multiple FIRs against both unidentified rioters and some named individuals. As of now, the police have detained 55 suspects and increased security measures in the town, which has a mixed population.This marks the third major communal incident in Bahraich, following previous outbreaks in 2009 and 2014.In October 2009, violence erupted in the same area after rumors circulated about objectionable materials being thrown at a religious site, leading to arson and destruction. A similar incident occurred in January 2014, triggered by disputes over loud DJ music, which also affected the Nanpara area.",
        "summary": "",
        "url": "https://timesofindia.indiatimes.com/india/was-planned-by-bjp-akhilesh-yadav-blames-ruling-party-for-bahraich-violence/articleshow/114425307.cms",
        "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-114425324/114425324.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:26:23",
        "author": "TOI NEWS DESK",
        "authors": [
            "TOI NEWS DESK"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": -0.2
    },
    {
        "id": 260488518,
        "title": "Online share trading scam: Six held by T.N. police for duping man of ₹14 crore",
        "text": "The Cyber Crime Wing of the Tamil Nadu Police has busted a six-member gang reportedly involved in running an online share trading scam and duping a person of ₹14 crore. \n\nAdditional Director General of Police, Cyber Crime, Sandeep Mittal, said the online trading scam involved “fraudulent individuals misleading victims into investing in fake share trading opportunities, promising high returns.”\n\n“Cybercriminals, forming a group via WhatsApp, have created share investment apps, misleading people into believing they can earn up to 500 times their investment by trading shares online. They have circulated false information suggesting that many people are making significant profits through these apps, thereby cheating the public under the guise of online share trading,” he said in a statement. \n\nThe police said the complainant in this case was contacted via WhatsApp by a member of the gang in April, introducing himself as someone who represented an institution called Black Rock Asset Management Business School. He falsely claimed that investing in Black Rock would yield a 500% profit within two months, while also stating that the company was SEBI-approved. \n\nThe man convinced the complainant to invest with a stipulation that he must pay a 20% service charge on the profits generated from the investment. The complainant was then persuaded to download a mobile app through a link and subsequently invested ₹14 crore into various bank accounts, the police said. \n\nWhen the complainant realised that the invested money was not being returned, he filed a complaint with the National Cyber Crime Reporting Portal. Based on this, an FIR was registered at Cyber Crime Wing Headquarters, Chennai – SCCIC (State Cyber Crime Investigation Centre), and the police retrieved the money from 13 bank accounts. \n\nAfter analysing the call records and money trail, the special team of police arrested V. Subramanian, 39, from Chengalpattu, who is the first-layer beneficiary ICICI Bank account holder of the fraudulent transaction of ₹21.5 lakh. \n\nBased on his confession, the other suspects were arrested. They are: M. Madan, 43, from Neelankarai, who owns a chit company in T. Nagar; R. Saravanapriyan, 34, from Thiruvallur, who is an associate producer in the film industry; Sathish Singh, 46, from Avadi, who is an associate of Saravanapriyan; Shafahed, 38, from Pulianthope, who owns a shop that converts currency; and D. Manikandan, 30, from Madurai, who previously worked at a cine producer’s office in Chennai.\n\nAdditionally, two cryptocurrency wallet accounts were frozen. Action is being taken to arrest a gang based in north India that allegedly masterminded these cybercrimes and recover the defrauded money, said Mr. Mittal.",
        "summary": "“Cybercriminals, forming a group via WhatsApp, have created share investment apps, misleading people into believing they can earn up to 500 times their investment by trading shares online,” said Additional Director General of Police, Cyber Crime, Sandeep Mittal",
        "url": "https://www.thehindu.com/news/national/tamil-nadu/online-share-trading-scam-six-held-by-tn-police-for-duping-man-of-14-crore/article68778314.ece",
        "image": "https://th-i.thgim.com/public/incoming/b03idn/article68778724.ece/alternates/LANDSCAPE_1200/IMG_image_2_1_8RCB92NR.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:26:42",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.649
    },
    {
        "id": 260495704,
        "title": "'Stunning security failures of Secret Service led to Trump assassination bid': House panel's scathing report",
        "text": "A House panel report has revealed that the assassination attempt on former US President Donald Trump at Pennsylvania rally was \"preventable\" and happened due to \"stunning security failures.\"\"Federal, state, and local law enforcement officers could have engaged Thomas Matthew Crooks at several pivotal moments,\" the report said.Lawmakers said that \"as Crooks's behaviour became increasingly suspicious, fragmented lines of communication allowed Crooks to evade law enforcement.\"\"Put simply, the evidence obtained by the Task Force to date shows the tragic and shocking events of July 13 were preventable and should not have happened,\" it said, as quoted by the Associated Press.However, the report offers few new insights, as the shortcomings of the Secret Service's response have already been outlined in previous investigations, including those by an independent commission, an interim Senate report, and various congressional testimonies and media inquiries. Similar to earlier reports, the House findings do not pinpoint any specific individuals responsible for the failures.The preliminary findings are based on thousands of pages of documents, nearly twenty transcribed interviews with state and local officials, and a range of briefings—both classified and unclassified—from senior officials at the Secret Service and FBI.Meanwhile, the task force has initiated an investigation into the second assassination attempt on Trump from last month, involving an individual with a rifle who was found camped outside one of his golf courses in southern Florida.",
        "summary": "A House panel report has determined that the assassination attempt on former President Trump at a Pennsylvania rally was \"preventable\" due to significant security failures. It noted that law enforcement could have engaged the suspect, Thomas Matthew Crooks, at several critical moments but failed to communicate effectively. The report reiterates previous findings about the Secret Service's shortcomings and does not identify specific individuals responsible. Meanwhile, an investigation is underway into a second assassination attempt involving a man with a rifle outside one of Trump's golf courses in Florida.",
        "url": "https://timesofindia.indiatimes.com/world/us/stunning-security-failures-of-secret-service-led-to-trump-assassination-bid-house-panels-scathing-report/articleshow/114424841.cms",
        "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-114425336/114425336.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:28:13",
        "author": "Toi World Desk",
        "authors": [
            "Toi World Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.303
    },
    {
        "id": 260488326,
        "title": "Priyanka Gandhi to file nomination for Wayanad bypoll on Wednesday",
        "text": "New Delhi: Congress leader Priyanka Gandhi Vadra will file her nomination for the Wayanad Lok Sabha bypoll on Wednesday, party sources said. Congress president Mallikarjun Kharge, former party chiefs Sonia Gandhi and Rahul Gandhi will be present on the occasion, they said.Ahead of her nomination filing, Priyanka Gandhi met party chief Kharge here on Monday and took his blessings. On Wednesady, Rahul Gandhi and Priyanka Gandhi will also lead a roadshow from Kalpetta New Bus Stand at 11 AM. The nomination will be filed before the district collector at 12 noon on October 23, they said.Priyanka Gandhi is the UDF candidate for the Wayanad parliamentary byeelection. \"The Congress general secretary will officially file her nomination on Wednesday before the Returning Officer in Kalpetta,\" a source said.Congress Chief Ministers, along with prominent national and state leaders, are also likely to be present to show their support, the sources said. With the Election Commission (EC) announcing the bypoll to the Wayanad Lok Sabha seat last week, the stage was set for Priyanka Gandhi's electoral debut from the Kerala constituency that could see her enter Parliament five years after joining active politics.Soon after the EC announced the Wayanad bypoll, the Congress declared that Priyanka Gandhi (52) would be its candidate from the seat in Kerala. With the Congress fielding the AICC general secretary from Wayanad, party workers had put up posters in the constituency which had \"Wayanadinte Priyankari (Wayanad's beloved)\" written on it.Days after the Lok Sabha polls, the Congress had announced in June itself that Rahul Gandhi will retain the Rae Bareli parliamentary constituency in Uttar Pradesh and vacate the Wayanad seat in Kerala, from where his sister Priyanka Gandhi will make her electoral debut.If elected, this will be the first time that Priyanka Gandhi will enter Parliament as an MP. This will also be the first time that the three Gandhi family members -- Sonia, Rahul and Priyanka -- will be in Parliament together.The EC last Tuesday announced bypolls to the Wayanad and Nanded Lok Sabha seats as well as in 48 Assembly constituencies. The bypoll to the Wayanad parliamentary seat and 47 Assembly seats will be held on November 13, along with the first phase of polling for the Jharkhand Assembly. The results will be announced on November 23.Since her entry into active politics in 2019, Priyanka Gandhi has often been projected as a possible challenger to Prime Minister Narendra Modi from Varanasi and also, as a successor to Congress veteran Sonia Gandhi in the family pocket borough of Rae Bareli.However, the Congress has decided to field her from Wayanad, the parliamentary seat that her elder brother Rahul won for two consecutive elections. Priyanka Gandhi was earlier the Congress in-charge of Uttar Pradesh.She emerged as the party's strategist and star campaigner, helping the Congress make impressive gains in some states as well as in the Lok Sabha polls held earlier in the year. After her name was announced for the Wayanad bypoll in June, Priyanka Gandhi had said, \"I am not nervous at all.... I am very happy to be able to represent Wayanad. All I will say is that I will not let them feel his (Rahul Gandhi's) absence. I will work hard and try my best to make everybody happy and be a good representative.\"\"I have a good relationship with Rae Bareli as I worked there for 20 years and that relationship will never break,\" she had said, adding that both she and her brother will work together in both the constituencies.Priyanka Gandhi's poll debut comes at a time when the Congress has been jolted by an electoral defeat in Haryana and it would be interesting to see if she would be able to steer the Wayanad campaign, along with the canvassing for the Jharkhand and Maharashtra polls, to put the grand old party back on track.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/priyanka-gandhi-to-file-nomination-for-wayanad-bypoll-on-wednesday-1831746",
        "image": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-0eek2bgcq6st2dk9fm30d2pgg6-20231228121152.Medi.jpeg",
        "video": null,
        "publish_date": "2024-10-21 10:28:22",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.387
    },
    {
        "id": 260489936,
        "title": "Telangana Group-I exams begin after Supreme Court declines stay",
        "text": "Hyderabad, Oct 21 (IANS) The Telangana State Public Service Commission (TGSPSC) Group-I Main examinations began on Monday after the Supreme Court declined to grant a stay on their conduct.\n\nThe exams began at 46 centres in the afternoon after the apex court rejected the petitions filed by some candidates challenging the Telangana High Court order refusing to order postponement of the exams.\n\nA section of candidates have been protesting for the last few days to demand the postponement of the exam till the High Court decides on their pleas challenging Government Order (GO) 29, which tweaked the reservation rules. Opposition parties, the BRS and the BJP had backed their demand.\n\nAfter the apex court refused to pass interim orders to stop the exam, the TGSPSC went ahead with the conduct of the exam to fill 563 Group-I posts in various departments of the state government.\n\nCandidates, who had reached the exam centres much before the scheduled time of 2 p.m., were anxiously waiting for the Supreme Court orders. Once it became clear that the Supreme Court dismissed the petitions, the authorities went ahead with the conduct of the exams at all 46 centres in Hyderabad, Rangareddy, and Medchal Malkajgiri districts.\n\nA total of 31,383 candidates have applied for the exams, which will continue till October 27.\n\nThese candidates qualified for the Group-1 Mains examination out of around 3.02 lakh who appeared for the preliminary examination held in June.\n\nPolice made elaborate arrangements at the exam centres to prevent any protest or untoward incident. Officials were checking the hall tickets of the candidates before allowing them into designated centres.\n\nOn the first day, the candidates appeared for the General English exam. The exam will continue till 5 p.m. Authorities closed the gates an hour before the exam was scheduled to begin. Those coming late were not allowed.\n\nMeanwhile, Chief Minister A. Revanth Reddy has conveyed his best wishes to the candidates writing the Group-I exam. He advised the candidates to write the exams with full concentration without any worries. The Chief Minister wished that the candidates pass the exam and become partners in the reconstruction of Telangana.\n\nThis is the first time after the formation of Telangana that Group-I Mains exams are being held. The last time the exams were held was in 2011.\n\nThe Group-1 prelims have been marred by controversies over paper leaks and legal battles for not following the norms and irregularities in 2022 and 2023. Keeping this in view, the TGSPSC has made fool-proof arrangements. Chief Secretary Santhi Kumari has asked all officials to leave no room for any irregularities.",
        "summary": "Hyderabad, Oct 21 (IANS) The Telangana State Public Service Commission (TGSPSC) Group-I Main examinations began on Monday after the Supreme Court declined to grant a stay on their conduct. The exams began at 46 centres in the afternoon after the apex court rejected the petitions filed by some candidates challenging the Telangana High Court order [&#8230;]",
        "url": "https://bhaskarlive.in/telangana-group-i-exams-begin-after-supreme-court-declines-stay/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410213246854.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 10:28:29",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.304
    },
    {
        "id": 260488060,
        "title": "India, China reach agreement on border patrolling along Line of Actual Control",
        "text": "The centre on Monday announced that both India and China have arrived at an agreement to resume patrolling along the Line of Actual Control (LAC) in eastern Ladakh, paving the way for disengagement and resolution of tensions that started with skirmishes in May 2020. \n\nThis came ahead of Prime Minister Narendra Modi's visit to Russia for the 16th BRICS Summit. \n\n“As a result of the discussions that have taken place over the last several weeks, an agreement has been arrived at on patrolling arrangements along the Line of Actual Control in the India-China border area and this is leading to dis-engagement and eventually a resolution of the issues that had arisen in these areas in 2020,” Foreign Secretary Vikram Misri said.",
        "summary": "India, China reach agreement on border patrolling along Line of Actual Control",
        "url": "https://www.indiatoday.in/india/video/india-china-reach-agreement-on-border-patrolling-along-line-of-actual-control-2620520-2024-10-21",
        "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202410/india--china-reach-agreement-on-border-patrolling-along-line-of-actual-control-212841515-16x9_0.jpg?VersionId=Cpp5HS4oezqQgBPT7jfiA.k3Jy_DV0QU?size=647:363",
        "video": null,
        "publish_date": "2024-10-21 10:28:52",
        "author": "India Today Video Desk",
        "authors": [
            "India Today Video Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.21
    },
    {
        "id": 260498126,
        "title": "India, China agree on patrolling along LAC, leading to disengagement ahead of BRICS meet in Russia",
        "text": "Home NewsIndia, China agree on patrolling along LAC, leading to disengagement ahead of BRICS meet in Russia\n\n India and China have settled on an arrangement to monitor the Line of Actual Control (LAC) in the Himalayas. This arrangement could be a stepping stone towards resolving the skirmishes that started back in May 2020 and moving towards peace.\n\n BREAKING: India, China agree on patrolling along LAC, leading to disengagement ahead of BRICS meet in Russia \n\n New Delhi: In a major development, India and China have agreed on a patrolling arrangement along the Line of Actual Control (LAC) in the border areas of the Himalayas, informed Foreign Secretary Vikram Misri on Monday. This development has come ahead of Prime Minister Narendra Modi’s visit to Russia to attend the crucial BRICS summit. The patrolling arrangement between both countries can lead to disengagement and could be a stepping stone towards resolving the skirmishes that started in May 2020.\n\nWhile addressing the media during a special MEA briefing, Foreign Secretary Vikram Misri stated that diplomatic and military officials from both countries were in talks with each other. “Over the last few weeks, Indian and Chinese diplomatic and military negotiators have been in close contact with each other in a variety of forums and as a result of these discussions, an agreement has been arrived at on patrolling along the Line of Actual Control in the India-China border area, leading to disengagement and resolution,” he stated. \nResponding to a media question on possible meeting between PM Modi and Chinese President Xi Jinping on the sidelines of the BRICS in Russia, Misri stated that there are chances of a bilateral meeting between both the leaders. \n“As far as the question on the bilateral meetings is concerned, this is a multilateral event, though there is always a provision for bilateral meetings on the sidelines. We are currently looking over the overall program of the prime minister. There are a lot of requests for bilateral meetings and we will update on the bilaterals as they evolve,” Misri stated. \nPM Modi, will attend the BRICS summit in Kazan this week. Starting from Tuesday, his short, two-day journey comes as a response to the invitation extended by Russian President Vladimir Putin. In a recent statement on Friday, Denis Alipov, who represents Russia as its ambassador to India, teased the possibility of welcoming new entrants into the BRICS assembly. Such an addition could hugely amplify the group’s capacity as an influential frontier, upholding the interests of the Global South. \nAt an online ‘BRICS 2.0 meet: New Members, New Horizons’, this comment was made looking forward to the soon-to-be-held BRICS convention in Kazan, next week. At the moment, the holding of BRICS’ chair position is in Russia’s hands. This significant alliance brings together the advanced developing economies of the world. Initially, the four original countries were Brazil, Russia, India, and China, hence the name BRIC. South Africa hopped on board in 2010, sparking the change to the currently known name, BRICS. \n(Note: This is a developing story and further details will be added.) \n\n\r\n\r\nSource link",
        "summary": "Home News India, China agree on patrolling along LAC, leading to disengagement ahead of BRICS meet in Russia India and China have settled on an arrangement to monitor the Line of Actual Control (LAC) in the Himalayas. This arrangement could be a stepping stone towards resolving the skirmishes that started back in May 2020 and &#8230;",
        "url": "https://www.thetimesofbengal.com/national/india-china-agree-on-patrolling-along-lac-leading-to-disengagement-ahead-of-brics-meet-in-russia/",
        "image": "https://www.thetimesofbengal.com/wp-content/uploads/2024/10/fm-misri.png",
        "video": null,
        "publish_date": "2024-10-21 10:30:09",
        "author": "Reporter",
        "authors": [
            "Reporter"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.195
    },
    {
        "id": 260488328,
        "title": "Priyanka Gandhi to file nomination for Wayanad bypoll on Wednesday",
        "text": "New Delhi:Congress leader Priyanka Gandhi Vadra will file her nomination for the Wayanad Lok Sabha bypoll on Wednesday, party sources said. Congress president Mallikarjun Kharge, former party chiefs Sonia Gandhi and Rahul Gandhi will be present on the occasion, they said. Ahead of her nomination filing, Priyanka Gandhi met party chief Kharge here on Monday and took his blessings. On Wednesday, Rahul Gandhi and Priyanka Gandhi will also lead a roadshow from Kalpetta New Bus Stand at 11 AM. The nomination will be filed before the district collector at 12 noon on October 23, they said. Priyanka Gandhi is the UDF candidate for the Wayanad parliamentary byeelection. \"The Congress general secretary will officially file her nomination on Wednesday before the Returning Officer in Kalpetta,\" a source said. Congress Chief Ministers, along with prominent national and state leaders, are also likely to be present to show their support, the sources said. With the Election Commission (EC) announcing the bypoll to the Wayanad Lok Sabha seat last week, the stage was set for Priyanka Gandhi's electoral debut from the Kerala constituency that could see her enter Parliament five years after joining active politics. Soon after the EC announced the Wayanad bypoll, the Congress declared that Priyanka Gandhi (52) would be its candidate from the seat in Kerala. With the Congress fielding the AICC general secretary from Wayanad, party workers had put up posters in the constituency which had \"Wayanadinte Priyankari (Wayanad's beloved)\" written on it. Days after the Lok Sabha polls, the Congress had announced in June itself that Rahul Gandhi will retain the Rae Bareli parliamentary constituency in Uttar Pradesh and vacate the Wayanad seat in Kerala, from where his sister Priyanka Gandhi will make her electoral debut. If elected, this will be the first time that Priyanka Gandhi will enter Parliament as an MP. This will also be the first time that the three Gandhi family members -- Sonia, Rahul and Priyanka -- will be in Parliament together. The EC last Tuesday announced bypolls to the Wayanad and Nanded Lok Sabha seats as well as in 48 Assembly constituencies. The bypoll to the Wayanad parliamentary seat and 47 Assembly seats will be held on November 13, along with the first phase of polling for the Jharkhand Assembly. The results will be announced on November 23. Since her entry into active politics in 2019, Priyanka Gandhi has often been projected as a possible challenger to Prime Minister Narendra Modi from Varanasi and also, as a successor to Congress veteran Sonia Gandhi in the family pocket borough of Rae Bareli. However, the Congress has decided to field her from Wayanad, the parliamentary seat that her elder brother Rahul won for two consecutive elections. Priyanka Gandhi was earlier the Congress in-charge of Uttar Pradesh. She emerged as the party's strategist and star campaigner, helping the Congress make impressive gains in some states as well as in the Lok Sabha polls held earlier in the year. After her name was announced for the Wayanad bypoll in June, Priyanka Gandhi had said, \"I am not nervous at all.... I am very happy to be able to represent Wayanad. All I will say is that I will not let them feel his (Rahul Gandhi's) absence. I will work hard and try my best to make everybody happy and be a good representative.\" \"I have a good relationship with Rae Bareli as I worked there for 20 years and that relationship will never break,\" she had said, adding that both she and her brother will work together in both the constituencies. Priyanka Gandhi's poll debut comes at a time when the Congress has been jolted by an electoral defeat in Haryana and it would be interesting to see if she would be able to steer the Wayanad campaign, along with the canvassing for the Jharkhand and Maharashtra polls, to put the grand old party back on track.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/kerala/priyanka-gandhi-to-file-nomination-for-wayanad-bypoll-on-wednesday-1831748",
        "image": "https://www.deccanchronicle.com/h-upload/2024/05/02/1087411-priyankagandhi.webp",
        "video": null,
        "publish_date": "2024-10-21 10:31:55",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.311
    },
    {
        "id": 260489814,
        "title": "“India brings great value to BRICS”: Foreign Secy Vikram Misri ahead of 16th BRICS summit",
        "text": "Foreign Secretary Vikram Misri said that India plays a vital role in BRICS, bringing significant value, particularly in sectors such as economic growth, sustainable development, and global governance reforms.The remarks by Misri came while addressing a media briefing on Prime Minister Narendra Modi’s upcoming Russia visit for the 16th BRICS summit. Addressing the briefing, Misri said, “The PM will be departing for Kazan tomorrow to attend the 16th BRICS Summit at the invitation of Russian President Vladimir Putin. The theme of this edition of BRICS is Strengthening multilateralism for just global development and security.”He added, “As you know, India is a founding member of BRICS and has participated in all of its activities, initiatives and engagements since its inception. India brings great value to BRICS and its contributions have played a vital role in shaping BRICS efforts in areas such as economic growth, sustainable development and global governance reforms.”Misri further asserted that the country views BRICS as a key expression of global multi-polarity. “We place a great deal of importance on our involvement and activities within the BRICS forum as we view it as a key expression of global multi-polarity. BRICS also serves for us as a vital platform to tackle a range of global challenges while also contributing to shaping a fairer, more exclusive and open international order,” Misri said.Elaborating on the schedule of the summit, Misri said, “This is the first summit that will be taking place after the first-ever expansion of BRICS last year in Johannesburg. The summit begins on October 22. The main day of the summit is on October 23 and there are two main sessions, a close plenary in the morning followed by an open plenary in the afternoon devoted to the main theme of the summit.”He added, “The leaders are also expected to adopt the Kazan Declaration which will lay the path forward for BRICS. This document is currently being negotiated in Kazan. The summit will end on October 24. However, the PM will return on October 23. On the sidelines of the summit, PM Modi is expected to have a few bilateral meetings. These are presently being worked out.”Notably, the leaders of BRIC (Brazil, Russia, India, and China) countries met for the first time in St Petersburg, Russia in 2006. After a series of high-level meetings, the first BRIC summit was held in Russia’s Yekaterinburg in 2009.BRIC group was renamed as BRICS (Brazil, Russia, India, China, South Africa) after South Africa was accepted as a full member at the BRIC Foreign Ministers’ meeting in New York in September 2010.On January 1 this year, BRICS admitted four new members: Egypt, Ethiopia, Iran and the United Arab Emirates.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/india-brings-great-value-to-brics-foreign-secy-vikram-misri-ahead-of-16th-brics-summit/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:33:52",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.635
    },
    {
        "id": 260489484,
        "title": "Bengaluru Auto Driver Goes Viral For Displaying 'Learn Kannada' Poster Inside Vehicle, Lists Common Greetings In Local Language To Facilitate Passengers",
        "text": "A person named Vatsalya took to the social media platform after coming this poster fitted inside an auto in the IT city. He called it a \"Very handy\" thing while sharing the picture of the same online. Talking of the poster which has caught attention of X users now, it carried a list of common statements used during a ride.",
        "summary": "",
        "url": "https://www.freepressjournal.in/viral/bengaluru-auto-driver-goes-viral-for-displaying-learn-kannada-poster-inside-vehicle-sharing-common-greetings-in-local-language-to-facilitate-passengers",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/hhr8o5px/Swarna-27.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:35:44",
        "author": "Swarna Srikanth",
        "authors": [
            "Swarna Srikanth"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.112
    },
    {
        "id": 260489502,
        "title": "Omar Adbullah retains Ganderbal assembly seat",
        "text": "Jammu and Kashmir Chief Minister Omar Abdullah retained Ganderbal assembly seat and resigned from Budgam. Speaker Pro-Tem, Mubarak Gul announced it on Monday in Jammu and Kashmir Assembly. OmarAbdullah had contested from two seats and won both in the recently concluded Assembly Elections.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/omar-adbullah-retains-ganderbal-assembly-seat-1831750",
        "image": "https://www.deccanchronicle.com/h-upload/2024/02/07/1074481-omarabdullah.webp",
        "video": null,
        "publish_date": "2024-10-21 10:36:17",
        "author": "DC Correspondent",
        "authors": [
            "DC Correspondent"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.157
    },
    {
        "id": 260492424,
        "title": "Karnataka HC: No Bail For Prajwal Revanna; PIL Against Rahul Gandhi Over His Comments Against The Leader Dismissed",
        "text": "The Karnataka High Court (HC) on Friday rejected the bail and anticipatory bail applications filed by suspended Janata Dal (S) leader Prajwal Revanna, who is accused of rape and sexual assault. The HC also dismissed a public interest litigation (PIL) seeking legal action against Congress leader Rahul Gandhi for his alleged comments against former Hassan MP Prajwal during a Lok Sabha campaign speech in Karnataka earlier this year.\nThe All India Dalit Action Committee had filed the PIL, requesting the court to direct Gandhi to issue an unconditional apology to women for his statements, and disrespecting the Constitution. The petition claimed that Gandhi made the remarks on May 2 during election rallies in Shivamogga and Raichur, just prior to the polls on May 7, 2024.\nThe bench stated that the court must uphold a standard when determining whether a matter qualifies as a public interest issue, noting that not every grievance can be raised in court via a PIL. They acknowledged that Gandhi’s remarks, while potentially controversial, do not meet the criteria for a PIL.\nIn dismissing the case, the court reiterated the importance of careful consideration regarding what constitutes a public interest issue, affirming its discretion in handling such petitions.\nAdditionally, a fine of Rs 25,000 was imposed on the petitioner while dismissing the case.\nThe counsel representing the All India Dalit Action Committee argued that Gandhi’s statements outraged the modesty of women and constituted fabricated accusations against Revanna. They contended that such speeches were damaging in a small town like Hassan, creating mistrust among households.\nThey sought the court to impose a token fine on Gandhi for the supposed misuse of his public position, breach of public trust, and violations of various legal provisions, including the Model Code of Conduct for the 2024 Parliamentary elections and the Representation of the People Act, 1951.\nDuring the hearing, the bench, consisting of Chief Justice N V Anjaria and Justice K V Aravind, indicated that the case did not qualify as a public interest litigation. The court stated, “We have not said anything on the merits; we are not saying anything on the merits of the speech. We have only said this cannot be the subject matter under public interest litigation,” according to Live Law.",
        "summary": "The All India Dalit Action Committee had filed the PIL, requesting the court to direct Rahul Gandhi to issue an unconditional apology to women for his statements, and disrespecting the Constitution",
        "url": "https://www.news18.com/india/karnataka-hc-no-bail-for-prajwal-revanna-pil-against-rahul-gandhi-over-his-comments-against-the-leader-dismissed-9093316.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/04/prajwal-revanna-hassan-2024-04-db6f9a5e55d94ddb4a7e55c3ed8ec728-16x9.png?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 10:38:25",
        "author": "Manjiri Joshi,News18,Rohini Swamy",
        "authors": [
            "Manjiri Joshi",
            "News18",
            "Rohini Swamy"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.507
    },
    {
        "id": 260490120,
        "title": "Samajwadi MP Ram Gopal Yadav sparks row over 'abusive' rant at Chief Justice",
        "text": "Samajwadi Party MP Ram Gopal Yadav on Monday kicked off a massive row as he abused Chief Justice of India DY Chandrachud over his \"prayer to God\" remark made in reference to the Ayodhya dispute. \n\n\"I do not want to make any comments. When you bring ghosts back to life, when you bring the dead back to life, they become ghosts and start following justice. Where are they now? ... Forget it; all such ******* people keep on saying such things. Should I take notice of them?\" Ram Gopal Yadav told reporters.\n\nIn response, Akhilesh Yadav said he was not aware of the objectional remark made by his uncle. \"We all respect the CJI,\" he said.",
        "summary": "Samajwadi MP Ram Gopal Yadav sparks row over 'abusive' rant at Chief Justice",
        "url": "https://www.indiatoday.in/india/video/samajwadi-mp-criticises-cji-dy-chandrachud-over-ram-mandir-remarks-akhilesh-yadav-2620476-2024-10-21",
        "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202410/samajwadimponcjicriticism-s0-original-sixteen-to-nine.jpg?VersionId=VRbmffdGrrJYckJ99VI6pU01TLH0sPe6?size=647:363",
        "video": null,
        "publish_date": "2024-10-21 10:38:52",
        "author": "India Today Video Desk",
        "authors": [
            "India Today Video Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.54
    },
    {
        "id": 260495700,
        "title": "Pakistan allocates Rs 10 million for restoration of historic Hindu Temple in Punjab",
        "text": "A budget of Rs 10 million has been allocated for the restoration of the Baoli Sahib temple in the Punjab province to address the long-standing demands of the Hindu community in Pakistan. This marks the first phase of reconstruction, 64 years after the temple was rendered dysfunctional.The Evacuee Trust Property Board (ETPB), a federal body responsible for overseeing minority worship sites in Pakistan, has commenced work on restoring the Baoli Sahib temple, located in Zafarwal town in Narowal, a city along the western bank of the Ravi River. The temple has been out of service since 1960, according to Dawn News.Currently, there is no functional Hindu temple in the entire Narowal district, forcing the local Hindu population to either conduct religious ceremonies at home or travel to temples in Sialkot and Lahore. Ratan Lal Arya, the former president of the Pak Dharamsthan Committee, explained that the temple became non-functional after the ETPB took control of it. The Hindu community in Narowal, numbering over 1,453 people, has since lacked a proper place to conduct their rituals.Narowal district once had 45 Hindu temples, all of which have fallen into disrepair over time. The restoration work is currently focused on constructing a boundary wall around the four kanals of land, after which the temple will be handed over to the Pak Dharamsthan Committee.Hindus represent the largest minority group in Pakistan. Official estimates suggest that there are around 7.5 million Hindus in the country, though the community claims the number is closer to 9 million. The majority of Pakistan's Hindu population resides in Sindh province, where they share cultural and linguistic ties with their Muslim neighbors.",
        "summary": "",
        "url": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-allocates-rs-10-million-for-restoration-of-historic-hindu-temple-in-punjab/articleshow/114425615.cms",
        "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-114425748/114425748.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:39:06",
        "author": "Toi World Desk",
        "authors": [
            "Toi World Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.074
    },
    {
        "id": 260495706,
        "title": "US Election 2024: Trump has 52% chance of winning, shows poll",
        "text": "Republican presidential candidate Donald Trump on Sunday surpassed Democratic nominee Kamala Harris in the Decision Desk HQ/The Hill election forecast for the first time this cycle. The forecast indicates that Trump has a 52% chance of winning the presidency, while Harris stands at 42%.Since late August, the model had consistently favored Harris, with her chances hovering around 54-56%, while Trump held about 44-46%. However, in early October, the gap began to close, and the candidates are now nearly even.This shift in the forecast aligns with Trump's improved polling averages in key battleground states like Wisconsin and Michigan, which had previously leaned toward Harris. Trump already had a slight lead in Arizona, Georgia, and North Carolina.Of the seven critical swing states in 2024, Pennsylvania is the only one where Harris still leads, according to The Hill report.The US presidential election will take place on Tuesday, November 5, 2024, with early voting already underway in states like Georgia, California, North Carolina, Virginia, and Alabama. The elected candidate will begin their four-year term in the White House starting from the inauguration on January 20, 2025.",
        "summary": "Donald Trump, Republican presidential candidate, leads Democratic nominee Kamala Harris in the Decision Desk HQ/The Hill election forecast with a 52% chance to win the presidency. This shift reflects Trump's stronger polling in key battleground states, now narrowing Harris's earlier lead.",
        "url": "https://timesofindia.indiatimes.com/world/us/us-election-2024-trump-surpasses-harris-for-the-first-time-poll-shows/articleshow/114409445.cms",
        "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-114421779/114421779.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:39:09",
        "author": "Toi World Desk",
        "authors": [
            "Toi World Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.001
    },
    {
        "id": 260489486,
        "title": "Online Applications For 23 Central Government Scholarships Closes On October 31; Apply Here",
        "text": "Scholarships are available across various departments, including those for students with disabilities, OBC, SC, ST students, and specific schemes for higher education. Check eligibility and details below...",
        "summary": "",
        "url": "https://www.freepressjournal.in/education/online-applications-for-23-central-government-scholarships-closes-on-october-31-apply-here",
        "image": "https://media.assettype.com/freepressjournal/2021-10/6658fa1a-4be7-4e66-8d9a-7694df08339e/DU_cutoffs.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:39:35",
        "author": "Megha Chowdhury",
        "authors": [
            "Megha Chowdhury"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.666
    },
    {
        "id": 260490126,
        "title": "India-China agree on ‘patrolling arrangements’ and resolution of the military standoff, says Vikram Misri",
        "text": "In a dramatic development, India and China have reached an agreement on “patrolling arrangements ” and a resolution of the military standoff at the Line of Actual Control (LAC) , the government announced on Monday (October 21, 2024). The patrolling arrangement agreement extends beyond the areas along the LAC where there has already been a disengagement of military personnel over the past few years, and include the so far unresolved areas of Demchok and Depsang, sources told The Hindu, indicating that the India-China standoff since April 2020 is now expected to be resolved.\n\nWhile the MEA did not give further details of the agreement, and whether there would be a reversion to the status quo pre-2020, and whether the “buffer zones” more recently created would continue to exist for patrolling purposes”, Mr. Misri said that the two sides had “reached an agreement on the issues that were being discussed”\n\nThe announcement, by Foreign Secretary Vikram Misri, came amidst a media briefing on Prime Minister Narendra Modi’s visit to Russia for the BRICS summit on Tuesday which he will attend along with Chinese President Xi Jinping.\n\n“Over the last several weeks, Indian and Chinese diplomatic and military negotiators have been in close contact with each other in a variety of forums, and as a result of these discussions, agreement has been arrived at on patrolling arrangements along the line of actual control in the India-China border areas, leading to disengagement and a resolution of the issues that had arisen in these areas in 2020,” Mr. Misri told journalists adding that the two sides would now take the “next steps” on this.\n\nThe timing of the India-China agreement announcement, just a day before the BRICS Summit indicates that a meeting between Mr. Modi and Mr. Xi on the side-lines, that has been speculated about is now expected to take place. Although the two leaders met as many as 18 times prior to the Galwan clashes in June 2020 , where 20 Indian soldiers were killed, they have spoken only twice since then, on the side-lines of the G-20 summit in Indonesia in 2022, and the BRICS summit in South Africa in 2023.\n\n Mr. Misri did not confirm a meeting between Mr. Modi and Mr. Xi , he said that government is discussing the scheduling of a number of bilateral meetings in Kazan, the venue of the BRICS summit.\n\n“[BRICS] is a multilateral event, though, of course, there is always a provision for bilateral meetings on the sidelines. We are currently looking into the overall program of the Prime Minister. There are a number of requests for bilateral meetings, and we will update you on the bilaterals as they evolve, as soon as feasible,” Mr. Misri told journalists when asked, not denying that a meeting with the Chinese leader was among those.\n\nMr. Misri, who was previously India’s Ambassador to China, and was no doubt, a key part of the recent negotiations, did not give further details of the agreement between both sides. He referred to recent meetings that had led to the breakthrough, which include two meetings between External Affairs Minister S. Jaishankar and Chinese FM Wang Yi in June-July, two meetings of the WMCC mechanism of diplomatic and military officials in July-August, followed by a meeting between NSA Ajit Doval and Mr. Wang, who is also the Special Representative on border talks in September. These were followed by intense negotiations of military commanders and MEA officials in the last few weeks. With Mr. Modi and Mr. Xi’s travels to Russia for the BRICS confirmed, a deadline appeared to have emerged for the negotiations to conclude with a result.",
        "summary": "Announcement comes a day before PM Modi and Chinese President Xi Jinping travel to Russia for BRICS summit, now expected to meet",
        "url": "https://www.thehindu.com/news/national/foreign-secretary-vikram-misri-press-conference-in-new-delhi-on-october-21-2024/article68778732.ece",
        "image": "https://th-i.thgim.com/public/news/national/7xtyii/article68778726.ece/alternates/LANDSCAPE_1200/FSMisri.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:40:57",
        "author": "Foreign Secretary Vikram",
        "authors": [
            "Foreign Secretary Vikram"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.038
    },
    {
        "id": 260492866,
        "title": "Akhilesh Yadav Says Bahraich Violence Was BJP's Brainchild: 'In View Of Upcoming Polls...'",
        "text": "Samajwadi Party leader Akhilesh Yadav claimed on Monday that the violence in Bahraich was orchestrated by the ruling Bharatiya Janata Party (BJP).Whatever happened in Bahraich was planned by the BJP in view of the upcoming elections in the state, he told ANI while in Mainpuri.Shops, vehicles, and a hospital were set ablaze by protestors following the death of a man from a gunshot wound during a religious procession.Ram Gopal Mishra, aged 22 and a resident of Rehua Mansoor village, was shot and killed on October 13 during a communal clash.The unrest was triggered by a dispute over loud music being played outside a place of worship in Maharajganj. The incident escalated into communal violence, resulting in arson, vandalism, and a four-day internet suspension in the area.Between October 13 to 16 , at least 11 FIRs were lodged in the district in connection with Mishras death and the subsequent violence.Cases were filed against around 1,000 individuals, including six named suspects. Allahabad HC Puts Stay Order For 15 Days On Bulldozer Action In Violence-Hit BahraichTwo men accused of Mishras murder were shot in the leg by police during a recent encounter as they attempted to flee to Nepal.In the aftermath of the violence, a station house officer (SHO) and a police outpost in-charge were suspended, while Circle Officer Rupendra Gaur, Tehsildar Ravikant Dwivedi, and District Information Officer Ghulam Waris Siddiqui were removed from their posts.Meanwhile, the Uttar Pradesh administration served demolition notices to several people in the area.The Allahabad High Court granted more time for these individuals to submit their responses. The court has scheduled the next hearing for October 23.(With agency inputs)",
        "summary": "Samajwadi Party leader Akhilesh Yadav claimed on Monday that the violence in Bahraich was orchestrated by the ruling Bharatiya Janata Party (BJP). \"Whatever happened in Bahraich was planned by the BJP in view of the upcoming elections in the state,\" he",
        "url": "https://www.oneindia.com/india/akhilesh-yadav-says-bahraich-violence-was-bjps-brainchild-in-view-of-upcoming-polls-3965935.html",
        "image": "https://imagesvs.oneindia.com/img/2024/10/akhilesh-yadav4-1729507171.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:41:03",
        "author": "Amit Vasudev",
        "authors": [
            "Amit Vasudev"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.648
    },
    {
        "id": 260496978,
        "title": "Omar Retains Ganderbal Seat As Pro-tem Speaker Administers Oath To MLAs In Assembly",
        "text": "Srinagar: Chief Minister Omar Abdullah has decided to retain Ganderbal assembly seat and resigned from Budgam one.\n\nThis was announced by Pro-Tem Speaker Mubarak Gul as he administers oath to newly elected members of Legislative Assembly on Monday.\n\nReports said that members including Omar Abdullah were administered oath by Pro-tem Speaker Mubarak Gul.\n\nOmar took oath as member of Ganderbal constituency. He has decided to resign from Budgam constituency.\n\nPertinent to mention that Omar had won from Ganderbal well as Budgam assembly constituencies.(GNS)",
        "summary": "&#160; Srinagar: Chief Minister Omar Abdullah has decided to retain Ganderbal assembly seat and resigned from Budgam one. This was announced by Pro-Tem Speaker Mubarak Gul as he administers oath to newly elected members of Legislative Assembly on Monday. Reports  said that members including Omar Abdullah were administered oath by Pro-tem Speaker Mubarak Gul. Omar [&#8230;]",
        "url": "https://kashmirreader.com/2024/10/21/omar-retains-ganderbal-seat-as-pro-tem-speaker-administers-oath-to-mlas-in-assembly/",
        "image": "https://kashmirreader.com/wp-content/uploads/2019/10/cropped-logoo.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:42:45",
        "author": "Reader correspondent",
        "authors": [
            "Reader correspondent"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.155
    },
    {
        "id": 260492422,
        "title": "2 Jaishankar-Yi Meetings, 52 Diplomatic & Military Talks: How India, China Achieved LAC Disengagement Agreement",
        "text": "Two crucial meetings between Foreign Minister S Jaishankar and China’s Foreign Minister Wang Yi in July, 31 rounds of diplomatic meetings and 21 rounds of military talks over four years paved the way for India and China to achieve an agreement over disengagement at the Line of Actual Control (LAC).\nForeign Secretary Vikram Misri on Monday said both sides have agreed to restart patrolling on the LAC, which is leading to disengagement and a resolution of the issues that had arisen in these areas in 2020. He said the diplomatic and military negotiators from both sides had been in close touch in recent weeks. Government sources called it a “big development”.\nALSO READ | India, China Reach Agreement On Disengagement, Border Patrolling Ahead Of BRICS Meet\nThe statement came just a day ahead of Prime Minister Narendra Modi’s visit for the BRICS Summit to Kazan, Russia, where he is expected to hold a bilateral meeting with Chinese President Xi Jinping.\nThere were seven points of conflict on the LAC since the Galwan clash in 2020, five of which had seen disengagement, but the troops from both sides remained in an eyeball-to-eyeball conflict in Depsang Plains and Demchock. The issue also became a major political flashpoint in India with the Congress attacking the Modi government for alleged presence of Chinese troops on Indian soil.\n\n#IndiaChina Stand-off | India-China reach patrolling agreement on LAC\nIt has to translate on ground, Depsang and Demchok are really important: Lt. Gen Sanjay Kulkarni (R), Defence Expert\nFmr Diplomat @asajjanhar shares his views#LAC #China | @Zakka_Jacob pic.twitter.com/7DFsQA8LY0\n— News18 (@CNNnews18) October 21, 2024\n\nJAISHANKAR’S TWIN MESSAGES IN JULY LAID THE GROUNDWORK\nThe foreign ministers of both countries met twice in July, where the urgency of the disengagement process was underlined, government sources say.\nThe first meeting was on the sidelines of the SCO Council of Heads of State Meeting in Asthana, Kazakhstan, on July 4. “The two ministers agreed that the prolongation of the current situation in the border areas is not in the interest of either side. EAM highlighted the need to redouble efforts to achieve complete disengagement from the remaining areas in Eastern Ladakh,” the Indian side had said, after the meeting.\nThe two ministers met again on July 25 in Vientiane, Lao PDR on the sidelines of the ASEAN-related Foreign Ministers’ meeting to lay the groundwork. “Both the ministers agreed on the need to work with purpose and urgency to achieve complete disengagement at the earliest,” an Indian statement had said about the meeting.\n\nThe meeting also resolved to hold an “early meeting” of the Working Mechanism on Consultation and Coordination on India-China Border Affairs (WMCC) to take the discussions forward. This particular meeting of WMCC happened in Delhi on July 31 and again in China on August 29.\n“In line with the guidance provided by two Foreign Ministers’ meetings in Astana and Vientiane in July 2024 to accelerate their discussion, and building on the WMCC meeting held last month, the two sides had a frank, constructive and forward-looking exchange of views on the situation along the Line of Actual Control (LAC) to narrow down the differences and find early resolution of the outstanding issues. For this, they further agreed for intensified contact through diplomatic and military channels,” the Indian side had said after the August 29 meeting in Beijing.\nThere were total of 31 rounds of talks of the Working Mechanism for Consultation & Coordination on India-China Border Affairs (WMCC) and 21 rounds of India-China Corps Commander Level meetings over the past four years.\nThe opposition could now ask for more details about the said disengagement agreements arrived at between India and China. Meanwhile, the Modi government has attacked the Congress for squandering thousands of square kilometers of land to China under the Nehru rule.",
        "summary": "Foreign Secretary Vikram Misri on Monday said both sides have agreed to restart patrolling on the LAC, which is leading to disengagement and a resolution of the issues that had arisen in these areas in 2020",
        "url": "https://www.news18.com/india/2-jaishankar-yi-meetings-52-diplomatic-military-talks-how-india-china-achieved-lac-disengagement-agreement-9093461.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-2-2024-10-ac1728d0c16fa5b362aba32099131aa3-16x9.jpg?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 10:44:48",
        "author": "Aman Sharma,Manjiri Joshi,News18",
        "authors": [
            "Aman Sharma",
            "Manjiri Joshi",
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.103
    },
    {
        "id": 260490520,
        "title": "Female constable raped in Kanpur, accused arrested",
        "text": "Kanpur: A female police constable on her way home to celebrate Karwa Chauth was allegedly raped here by her neighbour after being offered a lift, officials said on Monday.The accused was an acquaintance of the woman and has been arrested, they said.The incident took place on Saturday when the accused took the cop to an isolated area after giving her a lift on his motorcycle in the Sen-Paschim Para area, they said.“The woman head constable, attached to the Reserve Police Lines in Ayodhya, had come to Kanpur on Saturday night to celebrate the festival of 'Karwa Chauth'. She was on her way to her village when she accepted a lift from her neighbour, Dharmendra Paswan, on his bike,” Additional Commissioner of Police (Law and Order) Harish Chander said.“Instead of dropping her at her destination, Paswan allegedly took the woman to an isolated field and raped her,” Chander added.Ghatampur Assistant Commissioner of Police Ranjeet Kumar said the woman raised an alarm when Paswan attempted to disrobe her, but there was no one around to help.“The victim bit a part of the accused's finger after the assault and somehow managed to flee,” he said.The woman then approached a nearby police outpost and narrated the incident, leading to the prompt registration of an FIR, the officer said.“The police launched a search operation and arrested the accused within hours,” ACP Kumar added.The case was registered at Sen-Paschim Para police station under sections 64 (rape), 76 (criminal force to woman with intent to disrobe), 115(2) (voluntarily causing hurt), 117 (voluntarily causing grievous hurt), and 351(2) (criminal intimidation) of the Bharatiya Nyaya Sanhita.The accused was produced before a court here and sent to judicial custody for 14 days, the police said.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/crime/female-constable-raped-in-kanpur-accused-arrested-1831753",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/14/1852000-crime.webp",
        "video": null,
        "publish_date": "2024-10-21 10:45:07",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.419
    },
    {
        "id": 260490206,
        "title": "India-China Reach Deal on Patrolling Along LAC",
        "text": "The breakthrough in disengagement talks has come just when Indian PM Narendra Modi and Chinese President Xi are set to visit Russia for BRICS Summit (October 22-24). There is no official word yet on bilateral talks between the two leaders on the sidelines of the BRICS Summit.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/india-china-reach-deal-on-patrolling-along-lac",
        "image": "https://media.assettype.com/freepressjournal/2021-01/c270db14-6e21-4c74-b645-478e672b2f88/india_china_meeting.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:47:17",
        "author": "Manas Joshi",
        "authors": [
            "Manas Joshi"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.204
    },
    {
        "id": 260490850,
        "title": "Elevate Your Banking Experience: Introducing The New Kotak811 Mobile Banking App",
        "text": "The new Kotak811 Mobile Banking App is redefining digital banking by making everything accessible in a single, easy-to-use platform. This app brings together all the essential tools you need to manage your finances, from making payments to investing. Whether you're on the go or at home, the Kotak811 app keeps you connected to your money effortlessly.",
        "summary": "",
        "url": "https://www.freepressjournal.in/press-release/elevate-your-banking-experience-introducing-the-new-kotak811-mobile-banking-app",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/te38jm9m/FotoJet-88.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:48:47",
        "author": "Press Release",
        "authors": [
            "Press Release"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": 1.0
    },
    {
        "id": 260490848,
        "title": "VIDEO: Noida Man Attempts Suicide After Losing Job, Rescued By Residents While Hanging From 12th-Floor Balcony",
        "text": "The residents of the building acted promptly and prevented the man from committing suicide. The man was seen hanging from the balcony of the 12th floor before being rescued by the residents of the same society. He allegedly attempted to commit suicide after losing his job.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/video-noida-man-attempts-suicide-after-losing-job-rescued-by-residents-while-hanging-from-12th-floor-balcony",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/i8b1j0tz/Noida-Suicide-Hero.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:49:06",
        "author": "Azhar Khan",
        "authors": [
            "Azhar Khan"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": -0.392
    },
    {
        "id": 260490886,
        "title": "Supreme Court dismisses Arvind Kejriwal's plea in case over remark on PM's degree",
        "text": "The Supreme Court on Monday dismissed Arvind Kejriwal’s plea challenging a Gujarat High Court order that refused to quash summons in a criminal defamation case filed by Gujarat University. The case relates to Kejriwal's remarks about Prime Minister Narendra Modi's educational qualification.A bench comprising Justices Hrishikesh Roy and SVN Bhatti stated that the court was not inclined to interfere with the matter, especially since a similar plea by co-accused AAP leader Sanjay Singh was dismissed on April 8, 2024.Arvind Kejriwal’s counsel argued that the defamation case lacked merit, claiming that the complaint was filed by the Gujarat University registrar, who was not directly mentioned in Kejriwal’s remarks. However, Solicitor General Tushar Mehta countered that Kejriwal was in the “habit of making defamatory and reckless statements and then saying sorry”The court clarified that although Kejriwal's legal team made references to relevant legal provisions, the dismissal of Sanjay Singh's plea earlier influenced the decision to reject Kejriwal’s petition as well.\"We must have a consistent approach,\" the bench noted, further stating that they were not commenting on the merits of the case, only choosing not to entertain the plea.ABOUT THE CASEA defamation case was filed by Gujarat University registrar Piyush Patel against Kejriwal and Singh after the AAP leaders made \"defamatory\" and \"sarcastic\" statements at press conferences and on social media targeting the university over PM Modi's degrees.The AAP leaders had allegedly made the comments after the Gujarat High Court had set aside an order of the Chief Information Commissioner (CIC) that called for providing information about Modi's educational degrees to them under the Right to Information (RTI) Act.After the High Court’s order in the RTI case, Gujarat University filed a defamation case against the two AAP leaders.Arvind Kejriwal and Sanjay Singh had approached the Gujarat High court, seeking quashing of the defamation proceedings in a trial court. The Gujarat High Court had declined the plea, following which the two AAP leaders approached the Supreme Court.The Supreme Court on Monday upheld the Gujarat High Court’s decision and dismissed Kejriwal’s request for relief from the defamation proceedings.Published By: Anuja JhaPublished On: Oct 21, 2024Must Watch",
        "summary": "Supreme Court dismisses Arvind Kejriwal's plea in case over remark on PM's degree",
        "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-dismisses-arvind-kejriwal-plea-gujarat-university-case-over-pm-degree-remark-2620528-2024-10-21",
        "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202410/arvind-kejriwal-212952200-16x9_0.jpg?VersionId=rP7h3kMhyyezbTIMd4roy0Li4L.YOK1s?size=1280:720",
        "video": null,
        "publish_date": "2024-10-21 10:50:19",
        "author": "Srishti Ojha",
        "authors": [
            "Srishti Ojha"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.173
    },
    {
        "id": 260492864,
        "title": "Jharkhand Assembly Election 2024: JMM, Congress, RJD Seal Seat Sharing Deal; Official Announcement Soon",
        "text": "For the upcoming Jharkhand Assembly Elections 2024, INDIA Bloc partners Jharkhand Mukti Morcha (JMM)- Congress- Rashtriya Janata Dal (RJD) have agreed to the latest seat sharing formula, said reports. It has been learned that all allaince partners have agreed for division of 70 out of 81 Jharkhand assembly seats and rest will also be sorted out soon.According to the reports, Congress will contest on 29 seats, a slight decrease from 31 in the last assembly elections. While the Jharkhand Mukti Morcha (JMM) is slated to contest on 41 seats, 2 less than last time.The remaining 11 seats fate is still under deliberation, with expectations leaning towards granting 4 seats to the Left parties and 7 seats to the Rashtriya Janata Dal (RJD), led by Lalu Prasad and his son Tejashwi Yadav.This arrangement would mark the Left parties inaugural inclusion in the Jharkhand alliance, signaling a noteworthy expansion of the coalition.The reports added that Chief Minister of Jharkhand and JMM leader Hemant Soren will make the official announcement of seat sharing tonight, October 21.The 81 Assembly state will go to polling in two phases on November 13 and November 20. While, the counting of votes will be done along with Maharashtra Assembly election results on November 23.On the other side, the BJP already announced its candidates list on Friday for the Jharkhand Assembly election. BJP will contest Jharkhand polls in alliance with AJSU, JDU, and LJP (R). BJP will contest on 68 seats, while NDA partners got 10 (AJSU), 2 (JD(U) ), and 1 (LJP (RV)) seat.",
        "summary": "For the upcoming Jharkhand Assembly Elections 2024, INDIA Bloc partners Jharkhand Mukti Morcha (JMM)- Congress- Rashtriya Janata Dal (RJD) have agreed to the latest seat sharing formula, said reports. It has been learned that all allaince partners have agreed for division",
        "url": "https://www.oneindia.com/india/jharkhand-assembly-election-2024-jmm-congress-rjd-seal-seat-sharing-deal-official-announcement-s-3965953.html",
        "image": "https://imagesvs.oneindia.com/img/2024/10/jharkhand4-1729507803.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:50:32",
        "author": "Gaurav Sharma",
        "authors": [
            "Gaurav Sharma"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.022
    },
    {
        "id": 260491614,
        "title": "Remarks on PM's degree: Kejriwal faces defamation trial in Gujarat as SC upholds summons",
        "text": "New Delhi: Former Delhi chief minister and AAP national convener Arvind Kejriwal is facing criminal proceedings in a defamation case over his alleged remarks over Prime Minister Narendra Modi's educational qualification after the Supreme Court on Monday dismissed his plea to quash summons. A Gujarat Metropolitan court had summoned Kejriwal and AAP's Sanjay Singh in the defamation case over their alleged \"sarcastic\" and \"derogatory\" statements related to PM Modi's educational degrees. Gujarat University Registrar Piyush Patel had filed the defamation case against the politicians over their alleged comments after the Gujarat High Court set aside an order of the chief information commissioner (CIC) for providing information about Modi's degrees under the Right to Information Act. A bench of Justices Hrishikesh Roy and S V N Bhatti noted that a separate bench of the apex court had junked the plea filed by AAP leader Sanjay Singh on April 8 in the same case, who is a co-accused in the case. \"We must have a consistent approach. Having regard to that view, we would not like to entertain the present plea. The same is dismissed,\" said the bench. The top court, however, said all contentions were left open to be decided in the trial and it was expressing no opinion on the merits of the case. Senior advocate Abhishek Singhvi, appearing for Kejriwal, submitted Patel was not an aggrieved party in the matter. \"If at all the statement was defamatory, it is for Modi to file a criminal defamation case and not for the Gujarat University registrar,\" he said. Solicitor General Tushar Mehta, appearing for the University, said a separate bench of the apex court had already dismissed Singh's petition on April 8. Mehta said the degree had been uploaded on the university website and referred to the dismissal of the CIC order by the Gujarat High Court. Arguing that no case of defamation was made out, Singhvi stated that Kejriwal merely asked why the university was not publishing Modi's degree. The bench, however, rejected Kejriwal's plea. The high court had on February 16 dismissed the pleas by Singh and Kejriwal seeking quashing of the summons issued against them in the defamation case. Both had challenged in the high court the summons issued by a trial court in the case filed by the Gujarat University and the subsequent order of the sessions court dismissing their revision pleas against the summons. According to the complainant, the two politicians made \"defamatory\" statements at press conferences and on microblogging platform X, targeting the university over Modi's degrees. Their comments against the Gujarat University were defamatory and hurt the prestige of the institution, which has established its name among the public, he alleged. \"Their statements were sarcastic and intentionally made to hurt the prestige of the university,\" he added. On March 31, 2023, the high court quashed the 2016 order of the CIC asking Gujarat University to provide information on Modi's degrees to Kejriwal, and observed the AAP chief's RTI plea appeared to be \"politically vexatious and motivated\" instead of being based on \"sound public interest considerations\".",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/remarks-on-pms-degree-kejriwal-faces-defamation-trial-in-gujarat-as-sc-upholds-summons-1831755",
        "image": "https://www.deccanchronicle.com/h-upload/2024/05/06/1088301-delhichiefministerarvindkejriwal.webp",
        "video": null,
        "publish_date": "2024-10-21 10:50:45",
        "author": "DC Correspondent",
        "authors": [
            "DC Correspondent"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.257
    },
    {
        "id": 260492872,
        "title": "Patanjali, Falcone Peak Fund, others invest ₹100 crore in KBC Global preferential issue",
        "text": "The preferential issue of KBC Global, a construction and infrastructure company, to raise ₹100 crore has received investment from Patanjali Foods and Herbal Park and Falcone Peak Fund.\n\nThe Board of directors of the company approved the issue of 45.23 crore warrants on a preferential basis to non-promoters at ₹2.20 per warrant aggregating to investment of ₹99.50 crore. \n\nEach warrant will be converted into one equity share of face value of ₹1 each fully paid up. The proceeds of the equity issue will be used to repay debt. \n\nExtra Ordinary General Meeting of the company will be held on November 15 to approve the issue. Out of the total issue, Falcone Peak Fund (CEIC) was allotted 26 crore warrants, Patanjali Parivahan and Patanjali Food and Herbal Park were allotted 4.55 crore warrants and Foresight Holding will get 2.28 crore warrants.\n\nPost issue of the warrants, Falcone Peak Fund will own 8.48 per cent in KBC Global while Patanjali companies and Foresight Holding will hold about 1.48 per cent and 1.04 per cent. \n\nThe warrant will be converted into equity shares in 18 months. The Board also approved the appointment of Muna Makki as Executive Director of the company subject to approval of Members.\n\nAlso read: Indian agri-commodity stocks yo-yo on Brazil drought",
        "summary": "The Board of directors of the company approved the issue of 45.23 crore warrants on a preferential basis to non-promoters at ₹2.20 per warrant aggregating to investment of ₹99.50 crore",
        "url": "https://www.thehindubusinessline.com/companies/patanjali-falcone-peak-fund-others-invest-100-crore-in-kbc-global-preferential-issue/article68778765.ece",
        "image": "https://bl-i.thgim.com/public/incoming/uz6tol/article68778768.ece/alternates/LANDSCAPE_1200/IMG_PO29_planning_2_1_S2DCTEIE.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:53:02",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.064
    },
    {
        "id": 260492870,
        "title": "Centre Mulling On Putting Hoax Callers On 'No-Fly List' As False Bomb Threat Cripples Indian Aviation",
        "text": "Civil Aviation Minister K Rammohan Naidu announced on Monday that the government is planning to amend legislation to address the increasing number of bomb threats targeting airlines.This includes placing individuals responsible for such threats on a no-fly list.Over the past week, almost 100 flights operated by Indian airlines have received bomb threats, the majority of which turned out to be hoaxes.Naidu stated that the government is considering changes to aviation security regulations and the Suppression of Unlawful Acts Against Safety of Civil Aviation Act, 1982, to bolster security measures.The Bureau of Civil Aviation Security (BCAS) is collaborating closely with the Ministry of Home Affairs on the issue.From the Ministry, we have considered some legislative action if necessary. We have concluded that there are two areas we can explore - 1) Amendment to Aircraft Security Rules... one of the ideas we wish to implement through these rule changes is that once we apprehend the perpetrator behind these threats, we aim to place them on the no-fly list... 2) Suppression of Unlawful Acts Against Safety of Civil Aviation Act... Naidu explained.Bomb threats cripples Indian aviationOn Sunday alone, more than 20 flights from IndiGo, Akasa Air, and Vistara were disrupted by bomb threats.This led to a meeting between BCAS officials and airline CEOs, as the threats continue to cause alarm and necessitate extensive security checks.Additionally, Central Industrial Security Force (CISF) Director General RS Bhatti and BCAS Director General Zulfiquar Hasan met with Union Home Secretary Govind Mohan on Monday to discuss the recent surge in hoax calls.During the half-hour meeting at the Home Ministry, both director generals briefed the home secretary on the recent wave of hoax bomb threats, which have caused widespread panic and prompted exhaustive security measures by Indian aviation authorities, intelligence agencies, and other departments.",
        "summary": "Civil Aviation Minister K Rammohan Naidu announced on Monday that the government is planning to amend legislation to address the increasing number of bomb threats targeting airlines. This includes placing individuals responsible for such threats on a no-fly list.",
        "url": "https://www.oneindia.com/india/centre-mulling-on-putting-hoax-callers-on-no-fly-list-as-false-bomb-threat-cripples-indian-aviatio-3965957.html",
        "image": "https://imagesvs.oneindia.com/img/2024/10/rammohan-naidu-1729508051.jpg",
        "video": null,
        "publish_date": "2024-10-21 10:55:57",
        "author": "Amit Vasudev",
        "authors": [
            "Amit Vasudev"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.072
    },
    {
        "id": 260493778,
        "title": "Priyanka Gandhi To File Nomination For Wayanad Bypoll On Wednesday",
        "text": "Congress leader Priyanka Gandhi Vadra will file her nomination for the Wayanad Lok Sabha bypoll on Wednesday, party sources said.\n\nCongress president Mallikarjun Kharge, former party chiefs Sonia Gandhi and Rahul Gandhi will be present on the occasion, they said.\n\nAhead of her nomination filing, Priyanka Gandhi met party chief Kharge here on Monday and took his blessings.\n\nOn Wednesday, Rahul Gandhi and Priyanka Gandhi will also lead a roadshow from Kalpetta New Bus Stand at 11 AM. The nomination will be filed before the district collector at 12 noon on October 23, they said.\n\nPriyanka Gandhi is the UDF candidate for the Wayanad parliamentary by-election.\n\n\"The Congress general secretary will officially file her nomination on Wednesday before the Returning Officer in Kalpetta,\" a source said.\n\nCongress Chief Ministers, along with prominent national and state leaders, are also likely to be present to show their support, the sources said.\n\nWith the Election Commission (EC) announcing the bypoll to the Wayanad Lok Sabha seat last week, the stage was set for Priyanka Gandhi's electoral debut from the Kerala constituency that could see her enter Parliament five years after joining active politics.\n\nSoon after the EC announced the Wayanad bypoll, Congress declared that Priyanka Gandhi (52) would be its candidate for the seat in Kerala.\n\nWith the Congress fielding the AICC general secretary from Wayanad, party workers had put up posters in the constituency which had \"Wayanadinte Priyankari (Wayanad's beloved)\" written on it.\n\nDays after the Lok Sabha polls, the Congress had announced in June itself that Rahul Gandhi will retain the Rae Bareli parliamentary constituency in Uttar Pradesh and vacate the Wayanad seat in Kerala, from where his sister Priyanka Gandhi will make her electoral debut.\n\nIf elected, this will be the first time that Priyanka Gandhi will enter Parliament as an MP. This will also be the first time that the three Gandhi family members -- Sonia, Rahul and Priyanka -- will be in Parliament together.\n\nThe EC last Tuesday announced bypolls to the Wayanad and Nanded Lok Sabha seats as well as in 48 Assembly constituencies.\n\nThe bypoll to the Wayanad parliamentary seat and 47 Assembly seats will be held on November 13, along with the first phase of polling for the Jharkhand Assembly. The results will be announced on November 23.\n\nSince her entry into active politics in 2019, Priyanka Gandhi has often been projected as a possible challenger to Prime Minister Narendra Modi from Varanasi and also, as a successor to Congress veteran Sonia Gandhi in the family pocket borough of Rae Bareli.\n\nHowever, the Congress has decided to field her from Wayanad, the parliamentary seat that her elder brother Rahul won for two consecutive elections. Priyanka Gandhi was earlier the Congress in-charge of Uttar Pradesh.\n\nShe emerged as the party's strategist and star campaigner, helping the Congress make impressive gains in some states as well as in the Lok Sabha polls held earlier in the year.\n\nAfter her name was announced for the Wayanad bypoll in June, Priyanka Gandhi said, \"I am not nervous at all.... I am very happy to be able to represent Wayanad. All I will say is that I will not let them feel his (Rahul Gandhi's) absence. I will work hard and try my best to make everybody happy and be a good representative.\" \"I have a good relationship with Rae Bareli as I worked there for 20 years and that relationship will never break,\" she had said, adding that both she and her brother will work together in both constituencies.\n\nPriyanka Gandhi's poll debut comes at a time when the Congress has been jolted by an electoral defeat in Haryana and it would be interesting to see if she would be able to steer the Wayanad campaign, along with the canvassing for the Jharkhand and Maharashtra polls, to put the grand old party back on track.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
        "summary": "Congress leader Priyanka Gandhi Vadra will file her nomination for the Wayanad Lok Sabha bypoll on Wednesday, party sources said.",
        "url": "https://www.ndtv.com/india-news/priyanka-gandhi-to-file-nomination-for-wayanad-bypoll-on-wednesday-6839007",
        "image": "https://c.ndtvimg.com/2024-10/icma240o_priyanka-gandhi-for-wayanad-pti_625x300_21_October_24.jpeg",
        "video": null,
        "publish_date": "2024-10-21 10:58:10",
        "author": "Poisoning Him",
        "authors": [
            "Poisoning Him"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.342
    },
    {
        "id": 260491612,
        "title": "Sule fires convenient morality barb at Sena over 'removal' of Gauri Lankesh murder case accused",
        "text": "Mumbai: NCP (SP) MP Supriya Sule on Monday claimed the ruling Shiv Sena \"removed\" an accused in the journalist Gauri Lankesh murder case from the party fold temporarily until elections are over.Amid backlash, the Shiv Sena led by Chief Minister Eknath Shinde on Sunday stayed the appointment of the accused, Shrikant Pangarkar, to any post in the party in Jalna district.Pangarkar, who was granted bail by the Karnataka High Court in September, joined the Shiv Sena on Friday in the presence of party leader and former minister Arjun Khotkar, ahead of the Maharashtra assembly polls.A statement from the Shiv Sena on Sunday said that if Pangarkar has been given any party post in Jalna district, the decision has been stayed.Sule stated that the so-called action of Shiv Sena vis-a-vis Pangarkar was limited to the election period.\"An accused in the Gauri Lankesh murder case was inducted into the party (Shiv Sena) and has been removed. But this would not suffice. The veil of morality has been lifted just for the election time. After polls, such goons will be inducted again,\" Sule tweeted on X.Lankesh was shot dead outside her home in Bengaluru on September 5, 2017.A probe by police in Karnataka with assistance from agencies in Maharashtra led to the arrest of several persons.Pangarkar, a Jalna municipal councilor of the undivided Shiv Sena between 2001 and 2006, was arrested in August 2018. The Karnataka High Court granted him bail on September 4 this year.Maharashtra assembly polls will be held on November 20 and votes will be counted on November 23.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/sule-fires-convenient-morality-barb-at-sena-over-removal-of-gauri-lankesh-murder-case-accused-1831757",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854469-untitleddesign-2024-10-21t161856759.webp",
        "video": null,
        "publish_date": "2024-10-21 10:58:22",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.814
    },
    {
        "id": 260497220,
        "title": "J&K LG directs immediate financial aid for Gagangir terror attack victims",
        "text": "Srinagar, Oct 21 (IANS) Jammu and Kashmir Lieutenant Governor Manoj Sinha on Monday directed Chandraker Bharti, Principal Secretary (Home Department, J&K) to immediately provide financial assistance to the families of civilian victims of the Gagangir terrorist attack. \n\nHe has also asked the APCO Infratech company to release the compensation without any delay, as per an official statement.\n\nThe officials of APCO Infratech briefed the Lieutenant Governor on assistance being provided to the kin/family members.\n\nUnder SRE, Rs 6 lakh to be given to the next of kin of each martyred civilian and Rs 15 lakh as an immediate measure to be provided by APCO Infratech. An ex-gratia of Rs 2 lakh will be provided to all the injured.\n\nAdditionally, APCO Infratech will also provide financial assistance to the families of civilians on roll under Corporate Personal Accident Policy and 5 years of their gross CTC as compensation from insurance. All PRW labour and third-party employees are covered under workman compensation policy and accordingly financial assistance to be provided, the statement said.\n\nLieutenant Governor said the Government and APCO Infratech company will ensure every possible financial assistance to the next of kin and other necessary support as required.\n\n“Though it is an irreparable loss and cannot be compensated monetarily, we are taking concrete measures for the families of the martyr civilians so that they live a life of dignity,” the Lieutenant Governor said.\n\nLG Sinha also visited SKIMS Hospital in Srinagar to inquire about the health of civilians, who were injured in the Gagangir terror attack.\n\nTeam of senior doctors briefed the Lt Governor on the health condition of the injured and medical procedures being followed.\n\nIn a post on microblogging site X, the Lt Governor wrote, “Visited the Hospital in Srinagar to inquire about the health of construction workers, who were injured in Gagangir terror attack. I pray for their speedy recovery. Directed the officials to provide all the support to the affected families.\n\n“The brutal and savage attack against construction workers will be avenged. I’ve asked the J&K Police, and security forces to exact a price that will be remembered by the terrorists and their associates for time to come,” he added.",
        "summary": "Srinagar, Oct 21 (IANS) Jammu and Kashmir Lieutenant Governor Manoj Sinha on Monday directed Chandraker Bharti, Principal Secretary (Home Department, J&#38;K) to immediately provide financial assistance to the families of civilian victims of the Gagangir terrorist attack. He has also asked the APCO Infratech company to release the compensation without any delay, as per an [&#8230;]",
        "url": "https://bhaskarlive.in/jk-lg-directs-immediate-financial-aid-for-gagangir-terror-attack-victims/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/20241021065.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 11:01:13",
        "author": "Apco Infratech. An,IANS",
        "authors": [
            "Apco Infratech. An",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.023
    },
    {
        "id": 260495978,
        "title": "Tata Consumer Products’ revenues decline worry investors",
        "text": "Tata Consumer Products, one of the leading FMCG majors in India, witnessed its share prices tumble nearly 10% in yesterday's trading after reporting lackluster financial results for the second quarter of the current fiscal year.\n\nThe company's revenues from operations grew by a modest 13% to Rs. 4,214.5 crores compared to the same period last year. However, operating margins declined by 30 basis points to 14.9% due to rising input costs. Net profits increased by 6% to Rs. 359 crores year-on-year, but fell short of street expectations.\n\nWeak demand, especially in the urban markets, impacted the volume growth for Tata Consumer during the quarter. The tea business, which contributes over half of total revenues, registered muted sales. Rising inflation has also constrained discretionary spending by consumers.\n\nCommenting on the results, analysts at Elara Securities highlighted the competitive pressures in the FMCG sector and slowing demand trends in urban regions as near-term headwinds. Although they remain optimistic about the company's diverse portfolio and broader growth prospects, earnings estimates for the next two fiscal years have been cut to factor in the pressure on revenues and margins.\n\nWhile Tata Consumer looks well-positioned in the long run with its brands and distribution expansion plans, investors seem concerned about the soft demand environment squeezing profits in the immediate quarters. The company will need to efficiently manage costs and urgently revive volume growth in key categories to allay such concerns. For now, uncertainty over the macroeconomic outlook continues to impact sentiment around fast moving consumer goods players.",
        "summary": "Tata Consumer Products, one of the leading FMCG majors in India, witnessed its share prices tumble nearly 10% in yesterday's trading after reporting lackluster financial results for the second quarter of the current fiscal year. The company's revenues from operations grew by a modest 13% to Rs. 4,214.5 crores compared to the same period last [&#8230;]\n\n\nThe post Tata Consumer Products&#8217; revenues decline worry investors appeared first on Northlines.",
        "url": "https://thenorthlines.com/tata-consumer-products-revenues-decline-worry-investors/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/download-2-10.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:03:29",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.222
    },
    {
        "id": 260494578,
        "title": "“All discussions have been done on seat sharing…BJP is making this issue”: Congress leader Atul Londhe Patil",
        "text": "With few weeks left for the Maharashtra assembly polls, Congress leader Atul Londhe Patil said on Monday that all discussions regarding seat sharing among Maha Vikas Aghadi (MVA) have been done and it is standing together with full strength.“All discussions have been done on the seat sharing…BJP is making this issue because they have no issues left. They have not done any work…Tomorrow the list will be released…,” said Patil.Regarding a query about the Congress party causing a delay in issuing tickets, Congress leader Atul Patil told ANI, “I think notification will be issued on October 22. …Some more discussions are going to be held on about 8-10 seats on October 22 in Mumbai. There is no issue.”The Congress leader also attacked the BJP-led government in Maharashtra.“The BJP is seeing that they have done no work. Committed rampant corruption,” Londhe Patil alleged.“The MVA is standing together with full strength. (MVA) Is positive about the (elections),” Londhe Patil added.Congress leader and Leader of the Opposition Vijay Wadettiwar on Monday said that the final decision on all 288 seats for MVA for the Maharashtra assembly election will be made by tomorrow evening.Speaking to reporters in Delhi Congress leader Wadettiwar said, “By tomorrow evening, we will finalise the 17 seats. There are issues on 6-7 seats in Vidarbha and that too will be resolved. We are going to contest as Aghadi…Since 3 parties are sharing 288 seats, it took a little time…The final decision on all 288 seats for Maha Vikas Aghadi will be made by tomorrow evening.”The Bharatiya Janata Party (BJP) on October 20 released its first list of 99 candidates for the Maharashtra assembly elections.Maharashtra has 288 Assembly seats, and the BJP is part of the ruling Mahayuti alliance alongside the Shiv Sena (Eknath Shinde faction) and Ajit Pawar-led NCP.As election day nears, both the Mahayuti alliance and the opposition MVA — comprising the Shiv Sena (UBT), NCP (Sharad Pawar faction), and Congress — have intensified their preparations, including seat-sharing discussions.Maharashtra will vote in a single phase on November 20, with the results to be declared on November 23.In the 2019 assembly elections, the BJP won 105 seats, while Shiv Sena secured 56, and Congress won 44 seats. In 2014, the BJP won 122 seats, Shiv Sena secured 63, and Congress won 42 seats",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/all-discussions-have-been-done-on-seat-sharing-bjp-is-making-this-issue-congress-leader-atul-londhe-patil/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:03:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.298
    },
    {
        "id": 260493780,
        "title": "2025 Jeep Meridian Launched At Rs 24.99 Lakh; 5-Seater Variant Introduced",
        "text": "Jeep India launched the updated Meridian on Monday, starting at Rs 24.99 lakh (ex-showroom). The Meridian is now available in four trims with the fresh introduction of entry-level Longitude and Longitude Plus trims. Originally launched as a 7-seater SUV, the company has also introduced the 5-seater variant of Meridian. \n\nEx-showroom prices:\n\nLongitude: Rs 24.99 lakh\n\nLongitude Plus: Rs 27.50 lakh\n\nLimited(O): Rs 30.49 lakh\n\nOverland: Rs 36.49 lakh\n\nBookings at Jeep dealerships across India with a down payment of Rs 50,000 has begun. Deliveries will start by the end of October. The Jeep Meridian is powered by a 2.0-litre turbocharged diesel engine that generates 170 horsepower and a maximum torque of 350 Nm. \n\nThe cabin is wrapped with vegan leather (vinyl fabric in Longitude) and suede/ vegan leather accents, with visible copper stitching. The 7-seater Meridian has a boot space of 481 litres with five occupants and 170 litres with all seven seats in use. The five-seater variant offers 670 litres of boot space.\n\nThe Jeep Meridian is equipped with a 10.25-inch full-digital cluster and a 10.1-inch touchscreen with built-in navigation and wireless mirroring for Apple CarPlay and Android Auto. The new Jeep Meridian also introduces an upgraded connectivity suite with Uconnect connected services with GSDP 2.0 connectivity protocol for a truly modern driving experience. Some of the key featuresincludeAutomatic SOS Call, Remote Engine Start/Stop with AC Preconditioning, Alexa Home to Vehicle, Smartwatch Extension, Vehicle Health Report with alert, Connected One-Box Navigation Search with live traffic, weather and incident updates, and OTA firmware updates.\n\nALSO READ: Skoda Kylaq (Tata Nexon Rival) Driven: Top 5 Things About It - Watch Video\n\nOther highlights include dual-zone automatic climate control, electric-adjustable front seats, a wireless charger and a panoramic sunroof.\n\nThe Jeep Meridian offers an ADAS suit on its top-of-the-line Overland variant. Equipped with a front radar and camera-based system, the Jeep Meridian now offers adaptive cruise control with stop and go, intelligent speed assist, full speed forward collision warning with collision mitigation braking, lane departure warning and lane keep assist, traffic sign recognition, surround view monitor, smart beam assist, blind spot detection and driver attention alert among others.\n\n“With the additional variants, we're excited to cater to a diverse audience, staying true to our commitment to making Jeep more accessible to enthusiasts in India,” said Kumar Priyesh, Brand Director, Jeep India.",
        "summary": "Bookings at Jeep dealerships across India with a down payment of Rs 50,000 has begun. Deliveries will start by the end of October.",
        "url": "https://www.ndtv.com/auto/2025-jeep-meridian-launched-at-rs-24-99-lakh-adas-specification-features-changes-6839064",
        "image": "https://c.ndtvimg.com/2024-10/vcc4u3no_meridian_625x300_21_October_24.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-21 11:03:45",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.009
    },
    {
        "id": 260495576,
        "title": "Newly elected Haryana MLAs to take oath on Oct 25",
        "text": "The newly elected members of the Haryana assembly will be administered oath in Chandigarh on October 25. \n\nSenior Congress leader and party MLA Raghuvir Singh Kadian (80) will be the pro-tem Speaker in the 15th Haryana Legislative Assembly and will administer the oath. \n\nBut before that Mr. Kadian will be administered oath by Governor Bandaru Dattatreya as acting speaker. \n\n“The Governor will administer oath/affirmation to the Acting Speaker on October 25 in Haryana Raj Bhavan,” according to a government communication to Haryana Vidhan Sabha secretariat. \n\nThe election of speaker and deputy speaker is also likely to be held after the MLAs of the 90-member Assembly take oath. \n\nIn the October 5 Haryana Assembly polls, results of which were declared on October 8, the BJP returned to power for a third consecutive term by winning 48 seats, while the Congress won 37 seats. The INLD won two seats, and three Independents were also elected. \n\nMr. Kadian, who is the senior-most legislator in the House, was also the Speaker of the Haryana Assembly from 2005 to 2009 when the Congress Government led by Bhupinder Singh Hooda was in power.",
        "summary": "Senior Congress leader Raghuvir Singh Kadian to be pro-tem Speaker in Haryana Assembly, oath administered by Governor",
        "url": "https://www.thehindu.com/elections/haryana-assembly/newly-elected-haryana-mlas-to-take-oath-on-oct-25/article68778688.ece",
        "image": "https://th-i.thgim.com/public/incoming/1supcm/article68778779.ece/alternates/LANDSCAPE_1200/18_CDG_HARYANA.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:03:56",
        "author": "Governor Bandaru Dattatreya",
        "authors": [
            "Governor Bandaru Dattatreya"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.501
    },
    {
        "id": 260493044,
        "title": "'Why no judicial probe if Canada had evidence?': Recalled Indian envoy amid row",
        "text": "Amid the India-Canada standoff, recalled Indian envoy Sanjay Verma stated that the government played no role in the killing of Khalistani terrorist Hardeep Singh Nijjar. He also questioned why Canada did not initiate a judicial probe if it had concrete evidence alleging India's involvement in Nijjar's assassination.\n\nVerma alleged, \"Khalistani extremists are constantly encouraged. I believe (without providing evidence) that some of these extremists and terrorists are deeply embedded within the Canadian Security Intelligence Service (CSIS).\"\n\nWhen questioned about accusing Canada without evidence, Verma pointed out, \"This parallels what PM Justin Trudeau did. He accused India in Parliament without substantiating his claims.\"",
        "summary": "'Why no judicial probe if Canada had evidence?': Recalled Indian envoy amid row",
        "url": "https://www.indiatoday.in/india/video/why-no-judicial-probe-if-canada-had-evidence-recalled-indian-envoy-amid-row-2620554-2024-10-21",
        "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202410/why-no-judicial-probe-if-they-had-evidence-sanjay-verma-on-india-canada-row-210010919-16x9_0.jpg?VersionId=3hcrlBoNlmbBZy5S_8YUotkiQ1PahoSZ?size=647:363",
        "video": null,
        "publish_date": "2024-10-21 11:04:48",
        "author": "India Today Video Desk",
        "authors": [
            "India Today Video Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.815
    },
    {
        "id": 260492374,
        "title": "US Defense Secretary Lloyd Austin Arrives In Ukraine Amid Escalating Tensions",
        "text": "Notably, the visit comes after Ukrainian President Volodymyr Zelenskyy expressed concerns about the growing \"malign\" alliance between Russia and North Korea, which could potentially escalate the ongoing war between Ukraine and Russia.",
        "summary": "",
        "url": "https://www.freepressjournal.in/world/us-defense-secretary-lloyd-austin-arrives-in-ukraine-amid-escalating-tensions",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/2xff36kl/Lloyd-Austin-in-Ukraine.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:05:09",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.423
    },
    {
        "id": 260500600,
        "title": "\"Back To 2020 Patrolling\": S Jaishankar To NDTV On India, China Pact",
        "text": "Indian and Chinese soldiers will be able to resume patrolling in the way they had been doing before the border face-off began in May 2020, External Affairs Minister S Jaishankar said today at the NDTV World Summit.\n\nEarlier today, Foreign Secretary Vikram Misri announced India and China have arrived on a patrolling arrangement along the Line of Actual Control (LAC) in the Himalayas, and it can lead to disengagement and resolution of tension.\n\nThe breakthrough came ahead of Prime Minister Narendra Modi's visit to Russia to attend the BRICS summit tomorrow.\n\n\"We reached an agreement on patrolling, and we have gone back to the 2020 position. With that we can say the disengagement with China has been completed. Details will come out in due course,\" Mr Jaishankar told NDTV Editor-in-Chief Sanjay Pugalia.\n\n\"There are areas which for various reasons after 2020, they blocked us, we blocked them. We have now reached an understanding which will allow patrolling as we had been doing till 2020,\" Mr Jaishankar said.\n\nThe External Affairs Minister said the LAC breakthrough is a good development that happened due to \"patient and persevering diplomacy\".\n\nREAD | India To Resume Patrolling In Ladakh After Big Breakthrough With China\n\n\"... At various points of time people almost gave up. We have always maintained on the one hand we obviously had to do counter deployment, and we have been negotiating since September 2020. It has been a very patient process, though more complicated than how it should have been,\" Mr Jaishankar told NDTV.\n\n\"The important thing is if we have reached an understanding, I think what it does is it creates a basis for peace and tranquillity along the border, which were there before 2020. That was a major concern. If there is no peace and tranquillity, how can other areas of bilateral ties improve?\" Mr Jaishankar said.\n\nWhile he agreed people may speculate on the LAC development, the External Affairs Minister said he would use \"caution\" in responding on whether this positive development would spread to trade ties.\n\n\"It (LAC breakthrough) has just happened. I would not go so fast at the moment,\" Mr Jaishankar said, referring to trade.\n\nThe last meeting of the working mechanism for consultation and coordination on India-China border affairs was held on August 29 in Beijing. The two sides then had a frank, constructive and forward-looking exchange of views on the situation along the LAC to narrow down differences and find early resolution of outstanding issues.\n\nIt was agreed that restoration of peace and tranquillity, and respect for the LAC are the essential basis for restoration of normalcy in bilateral relations.\n\nEarlier this month, Indian Army chief General Upendra Dwivedi had said the two sides have resolved the \"low-hanging fruits\" and now need to address difficult situations, adding there was \"positive signalling\" from the diplomatic side and execution on the ground was dependent on military commanders of the two countries.\n\nIndian and Chinese military commanders too had been meeting regularly seeking complete disengagement in the remaining areas along the LAC in eastern Ladakh as an essential basis for restoration of peace and tranquillity in the India-China border areas.\n\nSome areas still remained to be de-escalated after Indian and Chinese troops withdrew from Gogra-Hot Springs in Ladakh in September 2022. The Chinese forces in this area had returned to pre-2020 positions. Even then, Chinese soldiers were still believed to hold large swathes of Indian territory to the north in the Depsang plains.\n\nFierce clashes between soldiers of both sides took place in eastern Ladakh's Galwan in June 2020, in which 20 Indian soldiers were killed in action. Over 40 Chinese soldiers were killed or injured.",
        "summary": "Indian and Chinese soldiers will be able to resume patrolling in the way they had been doing before the border face-off began in May 2020, External Affairs Minister S Jaishankar said today at the NDTV...",
        "url": "https://www.ndtv.com/india-news/we-will-be-able-to-go-back-to-2020-patrolling-s-jaishankar-on-lac-border-row-6839082",
        "image": "https://c.ndtvimg.com/2024-10/d4l91abg_s-jaishankar-ndtv-summit-_625x300_21_October_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-21 11:08:01",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.238
    },
    {
        "id": 260497228,
        "title": "India-China breakthrough: LAC patrol pact enables disengagement ahead of PM Modi’s BRICS engagement",
        "text": "Delhi, Oct 21 (IANS) In a major breakthrough ahead of Prime Minister Narendra Modi’s trip to Russia for the BRICS summit, India and China have established arrangements for patrolling along the Line of Actual Control (LAC) in the Himalayas, which could lead to “disengagement” and resolving the tensions that began in May 2020 with the bloody border clash, Foreign Secretary Vikram Misri announced on Monday.\n\n“These talks have resulted in an agreement on patrolling arrangements along the Line of Actual Control in the India-China border areas leading to disengagement and a resolution of the issues that had risen in these areas in 2020,” he said at a press conference.\n\nPM Modi is leaving for Russia on Tuesday to participate in the BRICS summit, at the invitation of President Vladimir Putin, and this development has come just hours ahead of the trip.\n\nThe agreement is believed to focus on patrolling in the Depsang and Demchok regions, official sources said.\n\nThe Foreign Secretary stated that diplomatic and military negotiators from India and China have engaged in several rounds of discussions over the past few weeks, and these talks have culminated in an agreement on these issues.\n\nIt is anticipated that Prime Minister Modi and Chinese President Xi Jinping could hold a bilateral meeting on the sidelines of the BRICS summit – the first where new members Iran, Egypt, Ethiopia, and the UAE, join existing members Brazil, Russia, India, China, and South Africa. However, there is no official confirmation of such a meeting. The most recent meeting of the working mechanism for consultation and coordination on India-China border affairs took place on August 29 in Beijing. Both sides engaged in a frank and constructive exchange of views regarding the situation along the LAC. The purpose was to bridge differences and expedite the resolution of outstanding issues. It was agreed that restoring peace and tranquillity, as well as respecting the LAC, are essential for normalising bilateral relations. Indian and Chinese military leaders have been meeting regularly to pursue complete disengagement in the remaining areas along the LAC in eastern Ladakh, viewing this as crucial for restoring peace and tranquillity in the border regions.\n\nIndia and China relations became tense following the violent border clashes in 2020 in Eastern Ladakh, resulting in the death of about 20 Indian soldiers and more than 20 fatalities in the Chinese PLA. Despite several rounds of talks at the military and diplomatic levels, a solution had remained elusive so far.",
        "summary": "Delhi, Oct 21 (IANS) In a major breakthrough ahead of Prime Minister Narendra Modi’s trip to Russia for the BRICS summit, India and China have established arrangements for patrolling along the Line of Actual Control (LAC) in the Himalayas, which could lead to &#8220;disengagement&#8221; and resolving the tensions that began in May 2020 with the [&#8230;]",
        "url": "https://bhaskarlive.in/india-china-breakthrough-lac-patrol-pact-enables-disengagement-ahead-of-pm-modis-brics-engagement/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/8fa290df6de482fbee8236029173e620.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 11:11:02",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.096
    },
    {
        "id": 260496778,
        "title": "Telangana govt nod to set up Young India Police School",
        "text": "Hyderabad: The state government has accorded approval for the establishment of Young India Police School at Manchirevula in Rangareddy district on Monday. The school cater to children of serving personnel belonging to Police, Police Martyrs and other uniformed services such as Police, Fire, Excise, SPF and Prisons of the state. DGP Dr. Jithender also stated that the school will aim to provide affordable, high quality education to children of serving personnel. He also proposed that the school shall be state of art of learning institution with focus on holistic development and moral values.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/telangana/telangana-govt-nod-to-set-up-young-india-police-school-1831759",
        "image": "https://www.deccanchronicle.com/h-upload/2024/07/01/1100825-telanganapolice.webp",
        "video": null,
        "publish_date": "2024-10-21 11:11:15",
        "author": "DC Correspondent",
        "authors": [
            "DC Correspondent"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.009
    },
    {
        "id": 260494582,
        "title": "“Samajwadi Party will win big in Karhal bye-elections…”: Dimple Yadav",
        "text": "Samajwadi Party MP Dimple Yadav on Monday exuded confidence in winning the by-polls in Uttar Pradesh.“Samajwadi Party will win big in Karhal by-elections… The party and workers and fully prepared and seeing the Lok Sabha election results, we are all very positive about the bye-election results. Our strategy will remain the same,” she said.The Uttar Pradesh bypolls are slated to be held on nine Assembly seats including Meerapur, Kundarki, Ghaziabad, Khair, Karhal, Phulpur, and Katehari.While polling will take place on November 13, counting of votes is scheduled for November 23, the Election Commission of India (ECI) announced. The poll body has announced bypolls for nine of the 10 vacant assembly seats in Uttar Pradesh, except Milkipur of Ayodhya district.Earlier on October 15, the Election Commission announced bypolls to 48 assembly constituencies including nine seats in Uttar Pradesh and the Wayanad Lok Sabha seat in Kerala. The bypolls are spread over 15 states – Assam, Bihar, Chhattisgarh, Gujarat, Karnataka, Kerala, Madhya Pradesh, Maharashtra, Meghalaya, Punjab, Rajasthan, Sikkim, Uttar Pradesh, Uttarakhand and West Bengal. Meanwhile, SP chief Akhilesh Yadav further accused the state government of carrying out “recovery” and “extortion” in the state, while not working towards enforcement of traffic rules. “In the BJP government of UP, traffic rules are not followed but violated. The BJP government is not interested in enforcing the rules; their entire focus is on recovery and extortion.” He further listed several reasons for the high number of road accidents in the state. “The roads are broken, vehicles are illegal, and there is no restriction on overspeeding,” Yadav noted. He also pointed out that the helmet rule is often ignored and only used for “warming up the fists.”He raised concerns about reckless driving, overloaded vehicles and old vehicles. He also alleged that the fines for drunk driving are only used as a means to “grab money.” (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/samajwadi-party-will-win-big-in-karhal-bye-elections-dimple-yadav/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:13:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.344
    },
    {
        "id": 260497216,
        "title": "Channapatna bypolls: About 80 pc workers demand Suresh’s candidacy, says Shivakumar",
        "text": "Bengaluru, Oct 21 (IANS) Karnataka Deputy Chief Minister D.K. Shivakumar said on Monday that about 80 per cent of the workers are demanding the candidacy of former MP and his younger brother D.K. Suresh from the Channapatna Assembly seat for bypolls. \n\nHe claimed that he clarified to the workers that they must support whoever the high command decides to field.\n\n“We are still recovering from the shock of the Lok Sabha election loss where Suresh lost against C.N. Manjunath by more than two lakh votes. Manjunath had contested Lok Sabha polls on a BJP ticket. Suresh worked hard but we still lost by a huge margin. Had we lost by a smaller margin, we could have improved our performance. We lost the Lok Sabha badly,” said the Deputy Chief Minister. \n\nHe added that if we start to think that JD-S is weak, then “we will be the biggest fools”. \n\n“We have discussed and gathered opinions of the ministers. Instead of a meeting of the election committee, we have discussed with the election in-charges. The decision on the party’s candidates has been made. We will submit the proposal to Delhi, and they will make the final decision.” \n\nCommenting on allegations by Union Minister Kumaraswamy that Congress leaders were in contact with BJP MLC and ticket aspirant for Channapatna, C.P. Yogeshwar, he said, “I have not met or spoken to Yogeshwar. There has been no meeting or discussion between us.”\n\nHe added that Yogeshwar is a sitting member of the Legislative Council and since the MLA position from Channapatna became vacant, Congress has been working to organise the workers. \n\nOn the alleged rift between BJP and JD-S, the Deputy Chief Minister said that he is not aware of any conflicts between them and the media has not reported anything about it.\n\n“Channapatna is naturally a JD-S stronghold. Kumaraswamy was the sitting member. But media reports suggest he is surrendering the segment to the BJP. If he gives up this area, it will lead to the party losing its existence,” the Deputy Chief Minister claimed. \n\nHe added that Suresh has worked hard and the Congress is confident of winning the Channapatna Assembly seat. \n\nOn heavy rains in Bengaluru, the Deputy Chief Minister said that many people have built houses in low-lying areas, and when heavy rain occurs, water inundates those houses. \n\n“We need to find long-term solutions for the areas where water stagnates and problems arise. We are moving towards forming a committee for this,” the Deputy Chief Minister claimed.\n\nHe added that the citizens should also provide information about which areas are facing such problems. \n\n“I have discussed this with the chief engineer and have been in touch with the BBMP control room since last night and received information. I was planning to visit some areas this morning, but the BBMP officials are currently engaged in relief work in some areas, so we should not obstruct their efforts,” he claimed.",
        "summary": "Bengaluru, Oct 21 (IANS) Karnataka Deputy Chief Minister D.K. Shivakumar said on Monday that about 80 per cent of the workers are demanding the candidacy of former MP and his younger brother D.K. Suresh from the Channapatna Assembly seat for bypolls. He claimed that he clarified to the workers that they must support whoever the [&#8230;]",
        "url": "https://bhaskarlive.in/channapatna-bypolls-about-80-pc-workers-demand-sureshs-candidacy-says-shivakumar/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410213246890.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 11:13:33",
        "author": "IANS,Union Minister Kumaraswamy",
        "authors": [
            "IANS",
            "Union Minister Kumaraswamy"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.211
    },
    {
        "id": 260500604,
        "title": "Ignored India Star, Whose Absence vs Aus Termed A 'Shame', Surpasses Lara",
        "text": "Ahead of Indian cricket team's all-important Tour of Australia, that starts next month, the recent loss to New Zealand at home has raised a few doubts about whether the current side needs some changes or not. One star who is most likely to be not picked for the Tour of Australia is Cheteshwar Pujara. The veteran batter, known for his dogged resistance in the face of strong challenge, has a proven record in Australia. The 36-year old has been overlooked from international matches, and the last match he played for India was in June, 2023.\r\n\r\n(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Pujara has now surpassed the great Brian Lara's tally of 65 first-clas tons with a century for Saurashtra against Chhattisgarh in a Ranjji Trophy match. Pujara has 66 tons now. He also went past the 21000-mark in first-class run tally. Regarding his absence, Australia star Pat Cummins said: \"It comes down to who wants to outlast each other, which I quite like that aspect of Test cricket. It's going to be a shame that he is not there, but I'm sure they'll pick someone else who's in a similar kind of style.\"\"It was always great playing (against) Pujara. He was one of those guys who never really felt like he was getting away from you. But then he would (just) bat, bat, bat and bat. I really enjoyed the contest against him. Some days he won, other days I won. It's going to have a bit of a different feel without him. Pujara is a great player.\" He also said that the India vs Australia rivalry is now at par with Ashes. I do think it is. Particularly, after the Indian team won the last couple of series at (our) home. We've had more success against England over the past decade. I think it's right up there,\" he said.\"You know when you play against India, you've got a few Indian fans that are watching. It's a slightly different rivalry to England-Australia rivalry. But again, now having a five-Test match series, it does mirror the Ashes series very closely,\" he said.",
        "summary": "Regarding the India player's absence, Australia star Pat Cummins said: \"It's going to be a shame that he is not there\"",
        "url": "https://sports.ndtv.com/cricket/ignored-india-star-whose-absence-in-border-gavaskar-trophy-called-a-shame-surpasses-brian-laras-historic-feat-6839136",
        "image": "https://c.ndtvimg.com/2022-06/8h6jgqeo_brian-lara-afp_625x300_06_June_22.jpg?im=FitAndFill,algorithm=dnn,width=806,height=605",
        "video": null,
        "publish_date": "2024-10-21 11:13:34",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.136
    },
    {
        "id": 260497224,
        "title": "Patra hits out at Kejriwal over ‘Sheesh mahal’, compares extravagance to royal opulence",
        "text": "New Delhi, Oct 21 (IANS) BJP National Spokesperson Sambit Patra launched a scathing attack on former Delhi Chief Minister Arvind Kejriwal on Monday, criticising the extravagant expenses undertaken on refurbishing his official residence. Patra pointed out that the luxury items installed at the bungalow were of such opulence that even Mughal emperors would not have had such levels of comfort in their time.\n\nDuring a press conference at the BJP national headquarters, Patra cited reference to Kejriwal’s 2013 affidavit, in which the AAP leader had vowed not to take privileges like a red-beacon car, security, or a government bungalow.\n\nPatra sarcastically remarked that Kejriwal not only accepted a bungalow but also spent crores on it, turning it into a “Sheesh Mahal”.\n\nPatra highlighted the luxurious amenities, mentioning smart Toto toilets equipped with remote-controlled features like automatic open-close seats, temperature control, and premium body massage chairs.\n\nHe claimed that the Public Works Department (PWD) recently released an inventory of the items installed at the bungalow, revealing that crores of rupees were spent on such extravagances.\n\n“Arvind Kejriwal is the king today, controlling even the water temperature with a remote control,” Patra said mockingly, adding, “But when the public votes, the remote will be in their hands, and they will ensure Kejriwal faces the heat.”\n\nHe also took a jab at Kejriwal, saying the CM should return the Toto toilet seat, claiming the public wants to see it.\n\nPatra condemned an AAP leader’s recent comments about terrorism in Jammu and Kashmir, stressing that there should be no political disputes on terrorism.\n\nHe gave reference to Home Minister Amit Shah’s condemnation of the attack on innocent people in Ganderbal on Sunday night, reaffirming Kashmir’s status as an integral part of India.\n\nPatra also criticised Samajwadi Party leader Ram Gopal Yadav’s controversial remarks on the Chief Justice of India, accusing leaders of the Opposition INDIA bloc of disrespecting religious sentiments. He cited the importance of humility in Sanatan Dharma, urging those critical of the faith to reflect and gain wisdom.\n\nIn response to a question about the INDIA bloc, Patra dismissed it as fractured, noting that its leaders consistently seek excuses for electoral losses.\n\nPatra also provided updates on a meeting led by BJP National President J.P. Nadda, which focussed on the party’s ongoing membership drive and organisational elections.\n\nHe highlighted the BJP’s internal democratic processes and said that the party’s success is driven by its alignment with the Modi government’s policies aimed at uplifting the poor.\n\nPatra proudly noted that 61 per cent of new BJP members are under 35, emphasising the party’s appeal to the youth.",
        "summary": "New Delhi, Oct 21 (IANS) BJP National Spokesperson Sambit Patra launched a scathing attack on former Delhi Chief Minister Arvind Kejriwal on Monday, criticising the extravagant expenses undertaken on refurbishing his official residence. Patra pointed out that the luxury items installed at the bungalow were of such opulence that even Mughal emperors would not have [&#8230;]",
        "url": "https://bhaskarlive.in/patra-hits-out-at-kejriwal-over-sheesh-mahal-compares-extravagance-to-royal-opulence/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410213246867.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 11:13:46",
        "author": "Bjp National President,IANS",
        "authors": [
            "Bjp National President",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.388
    },
    {
        "id": 260494704,
        "title": "BJP urges Governor to direct Telangana Govt to hand over issue of radicalisation of youths to NIA",
        "text": "Hyderabad: The BJP State unit has urged the Governor Jishnu Dev Varma to direct the State Government to hand over the issue of Mumbai-based speaker Munawar Zama holding a month-long session to radicalise youth on the pretext of personality development sessions, to the National Investigation Agency (NIA).\r\n\r\nA delegation led by BJP MPs M Raghunandhan Rao, Eatala Rajender and Konda Vishweshwar Reddy on Monday submitted a representation to the Governor at Raj Bhavan and requested him to direct the government to hand over the case to NIA. Given the interstate ramifications of the current case it was apt to instruct the DGP to hand over the case to the NIA , which is meant to investigate the anti-national and religious terror issues, they said.\r\n\r\nThe BJP leaders appealed to the Governor to seek the report on illegal activities that had been going on for months in a hotel which harboured anti-nationals and vandals. They also urged the Governor to direct the police to trace all the people who took part in the training session.\r\n\r\nThe delegation also urged the governor to seek a detailed report of the desecration of the Muthyalamma temple and take action against the police personnel responsible for ordering lathi charge. The BJP leaders requested the Governor to direct the police to release all the people arrested during the protest against desecration of the Muthyalamma temple and withdraw cases filed against them.",
        "summary": "On Monday, a delegation of BJP MPs, including M. Raghunandhan Rao, Eatala Rajender, and Konda Vishweshwar Reddy, submitted a request to the Governor at Raj Bhavan, urging him to direct the government to transfer the case to the NIA. They argued that, due to the interstate implications of the case, it would be appropriate for the DGP to hand it over to the NIA, which is tasked with investigating anti-national and religious terror issues.",
        "url": "https://telanganatoday.com/bjp-urges-governor-to-direct-telangana-govt-to-hand-over-issue-of-radicalisation-of-youths-to-nia",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/10/BJP-urges-Governor-to-direct-State-Govt-to-hand-over-issue-of-radicalisation-of-youths-to-NIA.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:15:38",
        "author": "Telangana Today",
        "authors": [
            "Telangana Today"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.23
    },
    {
        "id": 260495984,
        "title": "Prabowo Subianto Forms Indonesia’s Biggest Cabinet Ever with Over 100 Ministers",
        "text": "In a surprising move, Indonesia's new President Prabowo Subianto has unveiled the country's biggest cabinet to date, with a whopping 109 ministers appointed. The cabinet, dubbed the “Red and White Cabinet” after Indonesia's national colors, dwarfs the 34-member team under predecessor Joko Widodo.\n\nSubianto, who was sworn in as Indonesia's eighth president last week, stated the cabinet's large size was necessary to create a “strong government” that could unite the diverse nation and represent its many political voices. Analysts noted it allows him to reward the seven-party coalition that backed his election victory in February. Several ministers from Widodo's cabinet were also retained.\n\nA key reason for the cabinet's enormity appears to be Subianto's stated goal of accelerating Indonesia's economic growth to 8% annually through ambitious spending plans. These include salary hikes for civil servants, free school meals for 83 million children, and defense budget increases. To implement such broad programs, a huge team of ministers will be required.\n\nSome familiar faces staying on include respected Finance Minister Sri Mulyani Indrawati, the first person to hold the post under three separate presidencies. Other returnees are the ministers of trade, energy, state firms and interior. Indrawati's stewardship of the economy through various crises has made her a key stabilizing presence.\n\nInterestingly, Subianto had been a political rival of Widodo for years but did not contest his 2019 reelection defeat, even serving as his defense chief later. This paved the way for the unlikely alliance that saw Widodo tacitly endorse Subianto's recent candidacy. With his new giant cabinet, Indonesia's new leader is clearly ambitious in scale – whether this gamble to leverage broad coalition support pays off remains to be seen.",
        "summary": "In a surprising move, Indonesia's new President Prabowo Subianto has unveiled the country's biggest cabinet to date, with a whopping 109 ministers appointed. The cabinet, dubbed the &#8220;Red and White Cabinet&#8221; after Indonesia's national colors, dwarfs the 34-member team under predecessor Joko Widodo. Subianto, who was sworn in as Indonesia's eighth president last week, stated [&#8230;]\n\n\nThe post Prabowo Subianto Forms Indonesia&#8217;s Biggest Cabinet Ever with Over 100 Ministers appeared first on Northlines.",
        "url": "https://thenorthlines.com/prabowo-subianto-forms-indonesias-biggest-cabinet-ever-with-over-100-ministers/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/image-2024-10-21T164331.021.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:15:54",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.299
    },
    {
        "id": 260494830,
        "title": "Pakistan Seeks Additional $2 Billion From IMF To Combat Climate Change",
        "text": "Earlier, the IMF had raised concerns over Pakistan's ability to repay its external debt, labeling it as \"fragile,\" Geo News reported. According to the IMF, Pakistan's external financing requirements are projected to reach USD 62.6 billion over the next three years under the Extended Fund Facility (EFF) program.",
        "summary": "",
        "url": "https://www.freepressjournal.in/world/pakistan-seeks-additional-2-billion-from-imf-to-combat-climate-change",
        "image": "https://media.assettype.com/freepressjournal/2024-05/235159ba-b877-4f3f-bba3-d8af75914366/FPJ_CUSTOM_PIC__11_.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:16:51",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.092
    },
    {
        "id": 260494580,
        "title": "PM degree row: SC upholds summon issued to Kejriwal",
        "text": "The Supreme Court on Monday dismissed a plea of Arvind Kejriwal challenging the Gujarat High Court order refusing to quash summons sent to him in a criminal defamation case by Gujarat University over his comments in connection with the Prime Minister Narendra Modi’s degree.A bench of Justices Hrishikesh Roy and SVN Bhatti said that a similar plea filed by AAP leader Sanjay Singh had been dismissed by the apex court earlier.“We must have a consistent approach,” the bench said while refusing to entertain Kejriwal’s plea.Senior advocate Abhishek Manu Singhvi, appearing for the former Delhi Chief Minister, told the bench that there was no statement made against the University and hence, it could not have filed any defamation complaint.Seeking disclosure of the degree of persons in public life cannot lead to a defamation action, he added.Gujarat University Registrar Piyush Patel had filed a defamation case against Kejriwal and Sanjay Singh over their alleged comments after the Gujarat High Court set aside an order of the Chief Information Commissioner for providing information about the Prime Minister’s degrees to them under the RTI Act.Earlier this year, the High Court had declined to quash the summons issued to Kejriwal in the defamation case.Challenging the order, Kejriwal approached the apex court seeking quashing of the criminal proceedings.A Gujarat Metropolitan court had summoned Kejriwal and Singh in the defamation case over their “sarcastic and derogatory” statements in connection with Modi’s degree. Later, they filed a revision application in the Sessions court challenging the Metropolitan court’s summons in the case. However, the Sessions court had declined their plea for an interim stay on trial, after which they approached the Gujarat High Court. According to the University, AAP leaders’ comments targeting the Gujarat University were defamatory and hurt the prestige of the university which has established its name among the public.Earlier, the Gujarat High Court had quashed a 2016 order of the Central Information Commission which directed the Gujarat University to provide information on Modi’s degree to Kejriwal",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/pm-degree-row-sc-upholds-summon-issued-to-kejriwal/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:18:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.245
    },
    {
        "id": 260495992,
        "title": "Early Results Show Narrow Support for Moldova’s EU Integration in Historic Referendum",
        "text": "Early results from Sunday’s referendum in Moldova show that citizens are backing the country’s aspirations to integrate with the European Union. With nearly all votes counted, around 50% of Moldovans voted “yes” to the question of whether to amend the constitution to state that the nation’s strategic goal is to join the EU.\n\nThis positive outcome puts Moldova on a path towards eventually applying for EU membership, a significant step considering the country’s complex geopolitical situation. Nestled between Ukraine and Romania, Moldova has faced political influence from neighboring Russia for decades. However, the referendum results indicate that many Moldovans now favor deeper links with the West instead.\n\nThe referendum took place alongside a tightly contested presidential election, where pro-EU incumbent Maia Sandu claimed victory in the first round over her main challenger. Sandu had strongly advocated for the “yes” vote, and her continued presidency will help maintain Moldova’s westward direction. However, the referendum passed with only a narrow margin, highlighting the country’s internal divisions on this challenging foreign policy issue.\n\nAllegations of electoral meddling and voter intimidation marred the democratic process. Fugitive oligarch Ilan Shor was accused of trying to “buy” hundreds of thousands of votes against the referendum through social media propaganda and illicit payments. The close call in favor of integration with the EU suggests Moldova’s path towards the bloc will be long and difficult, requiring ongoing commitment to democratic reforms and weakening of Russian influence.",
        "summary": "Early results from Sunday&#8217;s referendum in Moldova show that citizens are backing the country&#8217;s aspirations to integrate with the European Union. With nearly all votes counted, around 50% of Moldovans voted &#8220;yes&#8221; to the question of whether to amend the constitution to state that the nation&#8217;s strategic goal is to join the EU. This positive [&#8230;]\n\n\nThe post Early Results Show Narrow Support for Moldova&#8217;s EU Integration in Historic Referendum appeared first on Northlines.",
        "url": "https://thenorthlines.com/early-results-show-narrow-support-for-moldovas-eu-integration-in-historic-referendum/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/image-2024-10-21T164648.026.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:18:43",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.35
    },
    {
        "id": 260496784,
        "title": "Kharge calls BJP biggest enemy of farmers",
        "text": "New Delhi: Congress president Mallikarjun Kharge asserted on Monday that the BJP is the “biggest enemy” of farmers in Maharashtra, emphasising that the removal of the double-engine government is essential for the welfare of the agricultural community.In a post on X, Kharge highlighted the alarming rate of farmer suicides in the state, stating, “20,000 farmers have committed suicide due to the BJP's failure.” He criticised the party’s broken promises, including the Rs 20,000 crore water grid initiative, calling the pledge to make Maharashtra drought-free a mere “jumla” (empty rhetoric). Kharge further condemned the BJP’s refusal to provide compensation to farmers while showering insurance companies with Rs 8,000 crore. He expressed concern over the high export duties on onions and soybeans, as well as a significant decline in cotton and sugarcane production, which has exacerbated farmers’ distress. He also pointed to the crisis in Maharashtra’s milk cooperatives, acknowledging the government’s own admissions of the issue. “Maharashtra has decided that farmers will benefit only by removing the BJP’s double-engine government from power! Maharashtra demands Maha Parivartan!” he declared. The ruling Mahayuti alliance in Maharashtra includes Eknath Shinde's Shiv Sena, the BJP, and the Ajit Pawar-led NCP, while the opposition MVA comprises Congress, the Shiv Sena (Uddhav Balasaheb Thackeray), and the Sharad Pawar-led NCP. The Election Commission announced that Maharashtra will hold elections on November 20 to elect its 288-member Assembly, with vote counting set for November 23, just before the current assembly's term concludes.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/kharge-calls-bjp-biggest-enemy-of-farmers-1831760",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854472-kharge.webp",
        "video": null,
        "publish_date": "2024-10-21 11:19:01",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.394
    },
    {
        "id": 260499494,
        "title": "Fethullah Gülen dies at 83: Who was self-exiled spiritual leader accused of Trukish coup attempt in 2016",
        "text": "Islamic spiritual leader Fethullah Gulen, who was once accused by Turkey of orchestrating a failed coup attempt in 2016, passed away at the age of 83, Turkish government said on Monday.\"Dear Friends, Our teacher passed away on October 20, 2024 at 21.20 in the hospital where he had been receiving treatment for a while. His doctors will make a statement about the hospital process in the coming hours,\" Herkul, that publishes his sermons said on X.— Herkul_Nagme (@Herkul_Nagme) Who was Fethullah GülenFethullah Gülen was born in 1941 in a village in Erzurum, Turkey, as the son of an imam. He began studying the Quran at a young age and became a mosque scholar in Edirne in 1959. In the 1960s, he gained prominence in Izmir by establishing student dormitories and preaching in tea houses. This initiative laid the foundation for a vast network that expanded over the decades into education, business, media, and state institutions, granting his followers considerable influence. His impact extended beyond Turkey to the Turkic republics of Central Asia, the Balkans, Africa, and the West through a network of schools.Ally to enemy: Why Erdogan accused him of attempting coupGülen once supported Erdogan during his rise to prime minister in the early 2000s, however, later became persona non grata after a corruption scandal in 2013 engulfing the Turkish premier's inner circle.Accused of terror links, his movement Hizmet was termed as the \"Feto terrorist organisation\" by Erdogan.Tensions escalated in 2016 when Erdogan accused Gülen of orchestrating a failed coup, leading to a widespread crackdown. During this purge, approximately 7,00,000 individuals faced prosecution, and around 3,000 of Gulen's followers received life sentences for alleged involvement in the coup, AP reported. He traveled to the US for medical treatment but chose to stay amid a criminal investigation in Turkey, where Ankara has persistently sought his extradition.",
        "summary": "Fethullah Gulen, the Islamic leader accused by Turkey of masterminding the 2016 coup attempt, has died at 83. Gulen's Hizmet movement was influential globally in education and media before falling out with Erdogan in 2013. Post-coup, Turkey prosecuted numerous followers, while Gulen remained in the U.S., resisting extradition.",
        "url": "https://timesofindia.indiatimes.com/world/middle-east/fethullah-glen-dies-at-83-who-was-self-exiled-spiritual-leader-accused-of-trukish-coup-attempt-in-2016/articleshow/114426158.cms",
        "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-114427044/114427044.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:19:01",
        "author": "Toi World Desk",
        "authors": [
            "Toi World Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.084
    },
    {
        "id": 260496786,
        "title": "How many runs?: Buttler's response to Chahal's proud Insta post viral",
        "text": "Social media engagement between team India star spinner Yuzvendra Chahal and England's white-ball captain Jos Buttler is grabbing netizens attention.Chahal, who is currently playing for Haryana in the ongoing Ranji Trophy, had impressed everyone with his impact-full innings where he missed his fifty by 2 runs.Taking to Instagram, Chahal shared pictures of him batting and walking back after the end of Day's play. To which his IPL team-mate Buttler responded.Commenting on the post, the England star wrote \"Batting? How many runs?\"To which the spinner replied \"48 🏏 🤙\". View this post on Instagram A post shared by Yuzvendra Chahal (@yuzi_chahal23) Soon after that the Rajasthan Royals posted a throwback video on their Instagram, where the two cricketers were having a fun banter. In the video, Chahal can be heard saying \"Joshy Bhai, come open with me.\"In the match, Haryana were sent to bat after Uttar Pradesh won the toss and elected to bowl first in the Ranji Trophy match. After losing quick wickets Haryana stood back up with valuable innings from captain Ankit Kumar (77) and Himanshu Rana (114). At the end, Sumit Kumar(61) and Chahal (48) impressed, adding much needed runs.Walking out to bat, UP fumbled with quick wickets. However, captain Aryan Juyal and Rinku Singh tried to set things in order with a crucial partnership (140). At stumps Uttar Pradesh were 267/6 trailing by 186 runs.Meanwhile, Buttler is set for a comeback after a break during the West Indies tour that is scheduled from October 31.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/sports/how-many-runs-buttlers-response-to-chahals-proud-insta-post-viral-1831761",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854470-untitleddesign-2024-10-21t164052315.webp",
        "video": null,
        "publish_date": "2024-10-21 11:19:18",
        "author": "Dc Web Desk",
        "authors": [
            "Dc Web Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.149
    },
    {
        "id": 260496788,
        "title": "Andhra Pradesh CM promises to clear pending bills worth Rs 763 cr of police dept",
        "text": "Vijayawada: Andhra Pradesh Chief Minister N Chandrababu Naidu on Monday said his government would clear pending bills worth Rs 763 crore of the police department and also promised to hire 6,100 constables.The Chief Minister gave the assurance while speaking on the occasion of Police Commemoration Day at the Indira Gandhi Municipal Stadium in Vijayawada.The previous government (YSRCP) has left bills of the police department worth over Rs 763 crore unpaid. Will take decisions in phases to cooperate with the police department and will clear all those bills, said Naidu during his speech as part of the Police Commemoration Day.Noting that investing in the police department is akin to investing in the state, the CM said he always gave importance to and cooperated with it.According to Naidu, the state government has already cleared pending bills worth Rs 100 crore of the department within 125 days of coming to power.Emphasising on the need for providing latest technologies to the police department, Naidu said policemen cannot fight criminals with old fashioned technological tools.Only when we have an upper hand over criminals in terms of surveillance and technology, can we control them, said Naidu, promising to improve and bring advanced technology.He accused the previous YSRCP government led by YS Jagan Mohan Reddy of using the police department as a tool for political harassment.Slamming Reddy, the TDP supremo said the former could not release Rs 700 crore to the police department but allegedly splurged Rs 700 crore on survey stones, which bore the former CM's images.Assuring importance to police welfare, the CM promised to commit at least Rs 20 crore every year and also build a facility at Amaravati to observe the next Police Commemoration Day from there.I pay my tributes to police who died on duty. I assure you that I will always stand by the police who do justice and respect officials, Naidu added.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/andhra-pradesh-cm-promises-to-clear-pending-bills-worth-rs-763-cr-of-police-dept-1831762",
        "image": "https://www.deccanchronicle.com/h-upload/2024/07/19/1825280-chiefministernarachandrababunaidu.webp",
        "video": null,
        "publish_date": "2024-10-21 11:19:25",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.011
    },
    {
        "id": 260497214,
        "title": "Six killed, eight injured in Israeli airstrike on Lebanon: Sources",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Beirut, Oct 21 (IANS) Six people were killed and eight others injured on Monday in an Israeli drone attack on a house in eastern Lebanon&#8217;s city of Baalbek, according to official Lebanese sources. An Israeli drone raided the house in the Nabi Inaam neighbourhood of central Baalbek, Lebanon&#8217;s official National News Agency said, adding women [&#8230;]",
        "url": "https://bhaskarlive.in/six-killed-eight-injured-in-israeli-airstrike-on-lebanon-sources/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410213246888.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 11:19:54",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260495580,
        "title": "Telangana Govt approves establishment of Young India Police School in Rangareddy for children of uniformed service personnel",
        "text": "The Telangana Government has granted in-principle approval for the establishment of the Young India Police School, a state-of-the-art residential educational institution aimed at providing high-quality education to the children of police personnel and other uniformed services, including those who have lost their lives in the line of duty. \n\nAccording to the government order (GO) issued by the Home Department on Monday (October 21, 2024), the school will cater to the children of serving personnel from the police, fire, excise, Special Protection Force (SPF), and prisons departments of Telangana. Proposed by the Director General of Police, Telangana, the school is set to be established in Manchirevula Village, Rangareddy district.\n\nFacilities at the school\n\nThe school will feature world-class infrastructure, residential facilities, and a sports complex, providing a supportive and nurturing environment for students. The institution’s focus will be on holistic development, combining modern education with strong moral values, in line with the vision laid out by the State’s police leadership.\n\nThe school will aim to provide affordable education, ensuring that the children of police martyrs and other uniformed service members have access to top-tier learning opportunities, helping them grow into capable and responsible citizens.\n\nThe government has requested the Director General of Police to take further necessary steps to advance the project, which is expected to strengthen the State’s commitment to supporting the families of uniformed personnel.\n\nChief Minister A. Revanth Reddy has first made a mention of the school at the passing out parade of sub-inspectors at Telangana Police Academy on September 11, 2024 that a residential school each will be set up in Hyderabad and Warangal. He reiterated the commitment to set up the school, at the Police Commemoration Day held in Hyderabad on Monday morning.",
        "summary": "The school will feature world-class infrastructure, residential facilities, and a sports complex",
        "url": "https://www.thehindu.com/news/national/telangana/telangana-govt-approves-establishment-of-young-india-police-school-in-rangareddy-for-children-of-uniformed-service-personnel/article68778740.ece",
        "image": "https://th-i.thgim.com/public/news/cities/Hyderabad/a6bsfl/article68778888.ece/alternates/LANDSCAPE_1200/young%20india%20police%20school.png",
        "video": null,
        "publish_date": "2024-10-21 11:20:33",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.198
    },
    {
        "id": 260496780,
        "title": "Bengal CM Mamata writes to PM Modi over revised prices of essential medicines",
        "text": "Kolkata: In the backdrop of the National Pharmaceutical Pricing Authority (NPPA) hiking the prices of eight essential drugs, West Bengal Chief Minister Mamata Banerjee on Monday urged Prime Minister Narendra Modi to instruct the relevant ministry to promptly reconsider this decision.In a two-page letter, Banerjee emphasised that \"the welfare of the citizens is of paramount importance,\" stressing the need for all stakeholders to align their policies to reflect this commitment.\"I urge upon your kind office to issue directions to the concerned ministry to immediately reconsider the decision on the price escalation in the overall interest of the health and wellbeing of the common people,\" Banerjee wrote to Modi.\"Perhaps, our aim ought to be preserving a balanced approach that respects both commercial viability and the citizen's right to affordable healthcare. The welfare of the citizens is of paramount importance, and all the stakeholders must align the policies to reflect this commitment. Looking forward to your urgent and kind consideration,\" she added.The NPPA is responsible for ensuring the availability of essential drugs at affordable prices while maintaining access to these medicines. It is a government regulatory agency that oversees the pricing of pharmaceutical drugs in the country.The authority recently approved a 50 per cent hike in the ceiling prices of 11 scheduled formulations of eight drugs, most of which are low-cost and commonly used for treating asthma, glaucoma, thalassemia, tuberculosis, and mental health disorders.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/bengal-cm-mamata-writes-to-pm-modi-over-revised-prices-of-essential-medicines-1831765",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854474-untitleddesign-2024-10-21t164937388.webp",
        "video": null,
        "publish_date": "2024-10-21 11:20:36",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.263
    },
    {
        "id": 260494828,
        "title": "Bhutan: Prime Minister Tshering Tobgay Praises India's Leadership At NDTV Summit, Says Global South Trusts PM Modi; VIDEO",
        "text": "Thanking Prime Minister Narendra Modi for playing a massive role in driving Bhutan's economic growth over the last 10 years, Bhutanese PM Dasho Tshering Tobgay said that the entire world, in particular the Global South, looks at India's leadership when it comes to solving key global issues.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/bhutan-prime-minister-tshering-tobgay-praises-indias-leadership-at-ndtv-summit-says-global-south-trusts-pm-modi-video",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/xqux9yg3/FotoJet-89.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:20:40",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.028
    },
    {
        "id": 260495562,
        "title": "Maharashtra Assembly Elections 2024: BJP's Sanjay Kelkar To Witness Tough Fight In CM Shinde's Political Bastion Thane",
        "text": "Among the key constituencies in Maharashtra, Thane would be in the top list as it is the home city and political bastion for Chief Minister Eknath Shinde. Shinde was the MLA from Thane from 2004 to 2009 and from 2009 to 2014, Sena’s Rajan Vichare was the MLA. Notably. Vichare is now a member of Shiv Sena-Uddhav Thackeray faction",
        "summary": "",
        "url": "https://www.freepressjournal.in/mumbai/maharashtra-assembly-elections-2024-bjps-sanjay-kelkar-to-witness-tough-fight-in-cm-shindes-political-bastion-thane",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/j8hremrd/Sitting-MLA-Manda-Mhatre-BJP-1.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:23:05",
        "author": "Devashri Bhujbal",
        "authors": [
            "Devashri Bhujbal"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 1.0
    },
    {
        "id": 260500634,
        "title": "Court Rejects Petition Against Rahul Gandhi For Remarks On Prajwal Revanna",
        "text": "Karnataka High Court has dismissed the Public Interest Litigation (PIL) against the Leader of the Opposition (LoP) in the Lok Sabha Rahul Gandhi in connection with the alleged derogatory remarks against former MP Prajwal Revanna.\n\nAfter dismissing the case on Monday, the High Court has also fined the petitioner with Rs 25,000.\n\nThe division bench headed by Justice NV Anjaria and Justice KV Arvind passed the order. The All India Dalit Action Committee has filed a petition against Rahul Gandhi.\n\n\"We are not talking about the merit and eligibility of Rahul Gandhi's speech. The subject should not be a matter under the Public Interest Litigation,\" the bench opined while passing the order dismissing the petition.\n\nRahul Gandhi during the Lok Sabha election campaign while delivering the speech made alleged objectionable remarks. Addressing a huge gathering referring to the sensational sex video scam, he stated that \"Prajwal Revanna is a mass rapist\" and further alleged that \"Prajwal Revanna has raped 400 women\".\n\nThe Dalit Action Committee has filed a petition against Rahul Gandhi that he had humiliated and hurt the dignity of women from the Hassan district. The committee had also claimed that the statement was unconstitutional.\n\nIt was alleged that the speeches were made by Rahul Gandhi at Shivamogga and Raichur on May 2 which went to polls on May 7.\n\nChi Na Ramu, who is national president of the All India Dalit Action Committee, alleged that until now no proof of any rape had been found, nor were any complaints made by the women about what Rahul Gandhi had claimed.\n\nChi Na Ramu asked for action to be taken against Rahul Gandhi as per law and demanded that Rahul Gandhi should apologise for making the statement about 400 mass rapes.\n\nThe counsel had argued that Hassan was a small city and people were affected by the \"hate speech\".\n\n\"Every household is doubting the other household now,' the counsel observed.\n\nThe PIL sought legal action against Rahul Gandhi for alleged \"hate speech\" resulting in outraging the modesty of women and showing \"disrespect\" to the Constitution.\n\nThe petition also sought Rahul Gandhi to issue an unconditional apology to the women of Hassan for issuing unconstitutional remarks and also it demanded that token costs on Rahul Gandhi for gross misuse of public post breach of public trust and Constitutional provisions.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
        "summary": "Karnataka High Court has dismissed the Public Interest Litigation (PIL) against the Leader of the Opposition (LoP) in the Lok Sabha Rahul Gandhi in connection with the alleged derogatory remarks...",
        "url": "https://www.ndtv.com/india-news/court-rejects-petition-against-rahul-gandhi-for-remarks-on-prajwal-revanna-6839226",
        "image": "https://c.ndtvimg.com/2024-10/tqgqu07o_rahul-gandhi-prajwal-revanna-_625x300_21_October_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-21 11:23:48",
        "author": "Justice Nv Anjaria",
        "authors": [
            "Justice Nv Anjaria"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.489
    },
    {
        "id": 260500602,
        "title": "\"Who Talked About Yamuna Dip?\" Delhi Lt Governor's Barb At Arvind Kejriwal",
        "text": "Visuals of toxic foam floating in the Yamuna River have emerged as the latest flashpoint in the power tussle between the Aam Aadmi Party (AAP) government and Delhi's Lieutenant Governor VK Saxena.\n\nWith Delhi's air and water pollution levels spiking, Mr Saxena took to X this afternoon. \"The importance of Delhi's lifeline Yamuna increases manifold during the Chhath festival. Yamuna's condition and the pain of Delhi's people are unwatchable,\" he said.\n\n\"Who is responsible for this condition? Who had made claims of cleaning up Yamuna and taking dips? Who got a court pause on work to revive the Yamuna that had started after a National Green Tribunal order?\" added the Lieutenant Governor, a central appointee.\n\nHe was referring to AAP leader and former Delhi Chief Minister Arvind Kejriwal's remark last year in which he said Yamuna would be cleaned before the 2025 Delhi election and he would take a dip into the river. The court pause that Mr Saxena referred to was a Supreme Court order on an NGT direction to appoint the Lieutenant as the head of a high-level panel to tackle the river's pollution. The AAP government had challenged the green tribunal's order.\n\nआदि अनंत से दिल्ली की जीवन रेखा रही यमुना का महत्व महापर्व छठ के समय कहीं अधिक हो जाता है।यमुना का यह हाल, दिल्ली की जनता का दर्ददेखा नहीं जाता।ऐसी दुर्दशा का जिम्मेवार कौन है?किसने यमुना की सफाई के दावे कर इसमे डुबकियाँ लगाने की घोषणा की थी?किसने NGT के आदेश पर पिछले… pic.twitter.com/nvHBpQs0JD— LG Delhi (@LtGovDelhi) October 21, 2024\n\nEarlier, Delhi Chief Minister Atishi said it the BJP's \"dirty politics\" was behind the air and water pollution in Delhi.\n\n\"The pollution levels in Delhi are increasing. The people of Delhi want to know the reason behind this, and I tell them, the real reason is the dirty politics of the BJP. Everyone is aware that stubble burning is a major contributor to rising pollution levels in Delhi during winter. The AAP government in Punjab has significantly reduced stubble burning over the past two years. According to the Centre's statistics, incidents of stubble burning have been halved since the AAP took charge in Punjab. In contrast, if you look at Haryana and Uttar Pradesh, stubble burning has increased,\" she told the media.\n\n\"If the Punjab government can reduce stubble burning, why can't the governments of Uttar Pradesh and Haryana do the same? In Delhi, we have only CNG and electric buses, whereas 100% of the interstate buses coming from UP and Haryana are diesel-powered. Why can't the governments of Haryana and UP introduce electric buses? It's because they want to play dirty politics with the people of Delhi. While Delhi has no brick kilns, there are 3,800 brick kilns in the NCR region, contributing significantly to pollution levels in the capital,\" the Chief Minister added.\n\nOn the water pollution in Yamuna, she said, \"BJP leaders have been visiting Kalindi Kunj for photoshoots, but the real cause of the toxic foam in the Yamuna is industrial waste being dumped into the river by factories in Haryana. The UP government also contributes to the problem by releasing polluted water into the Yamuna.\"\n\nOver the past several winters, Delhiites have gasped for breath as stubble burning in neighbouring states, among other causes, has pushed up air pollution in the capital. With election in the city due in February, air pollution has now emerged as a key talking point.\n\nIn power for 10 years, AAP is pushing hard for a third term. AAP leader Arvind Kejriwal, now out on bail after he was arrested in a corruption case linked to Delhi's now-scrapped liquor policy, stepped down as Chief Minister last month and said he would return to the top office only after the \"people's court\" elects him again. Senior party leader Atishi took over the job after Mr Kejriwal's exit.",
        "summary": "Visuals of toxic foam floating in the Yamuna River have emerged as the latest flashpoint in the power tussle between the Aam Aadmi Party (AAP) government and Delhi's Lieutenant Governor VK Saxena.",
        "url": "https://www.ndtv.com/delhi-news/yamuna-pollution-vk-saxena-arvind-kejriwal-who-talked-about-yamuna-dip-delhi-lt-governors-barb-at-arvind-kejriwal-6839229",
        "image": "https://c.ndtvimg.com/2022-12/rth526i8_vk-saxena-kejriwal_625x300_20_December_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-21 11:24:26",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.405
    },
    {
        "id": 260496790,
        "title": "Karnataka HC rejects PIL seeking apology from Rahul Gandhi over alleged remarks on women",
        "text": "Bengaluru: The Karnataka High Court on Monday rejected a public interest litigation (PIL) petition demanding that Congress leader Rahul Gandhi apologise for allegedly tarnishing the dignity of Indian women.The PIL stemmed from a claim that Gandhi had falsely accused former Janata Dal (Secular) MP Prajwal Revanna, who is facing charges of rape and sexual abuse, of “raping 400 women and filming the act,” describing it as “mass rape” and not a sex scandal.A bench comprising Chief Justice NV Anjaria and Justice K Aravind dismissed the petition, stating that it was a waste of judicial time.The Court also imposed a Rs 25,000 fine on the petitioner, the All India Dalit Action Committee, for filing the plea.The petitioner's counsel argued that Gandhi's remarks, made during a public speech, were highly irresponsible and offensive, particularly to the women of Hassan. He pleaded the Court to issue a notice to Gandhi, compelling him to respond to the allegations.“Gandhi is a serial offender,” the counsel contended, referencing past statements made by Gandhi, including comments regarding individuals with the surname Modi.'The petitioner also cited Gandhi's alleged citizenship issues, which are pending before the Delhi High Court, as further evidence of his misconduct.However, the Karnataka HC found no merit in the petition and dismissed it along with a fine.The petitioner's counsel sought waiver of the fine and argued that he should not be penalized for taking rightful action.The PIL highlighted that Gandhi's allegations, made without evidence, misled the public and disrespected the modesty of Indian women, particularly in light of the provisions under the new Bharatiya Nagrik Suraksha Sanhita.The plea argued that Gandhi's statement amounted to hate speech and promoted gender-based hatred. It also sought a directive from the court requiring Gandhi to issue a public apology and called for the National Commission for Women to take appropriate action against him.Despite the petitioner's appeal, the Court concluded that the matter did not warrant further consideration.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/karnataka/karnataka-hc-rejects-pil-seeking-apology-from-rahul-gandhi-over-alleged-remarks-on-women-1831767",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/23/1844670-rahulgandhi.webp",
        "video": null,
        "publish_date": "2024-10-21 11:25:30",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.079
    },
    {
        "id": 260497218,
        "title": "Assam bypolls: BJP’s ally AGP fields MP’s wife from Bongaigaon seat",
        "text": "Guwahati, Oct 21 (IANS) The Asom Gana Parishad (AGP), an ally of the BJP in Assam, has announced the party candidate’s name for the upcoming bypolls in the state.\n\nThe AGP has named Diptimoy Choudhury, wife of Lok Sabha MP from Barpeta, Phani Bhusan Choudhury, as its candidate to contest the Assembly by-election in the Bongaigaon seat.\n\nThe AGP opened its account during the general elections this year after a long hiatus with its senior leader Phani Bhusan Choudhury being elected from the Barpeta Lok Sabha seat. The party contested in two parliamentary constituencies in the state, however, it lost polls in Dhubri to Congress candidate Rakibul Hussain.\n\nChoudhury was a six-time MLA from the Bongaigaon Assembly segment. When AGP fielded him in the Barpeta Lok Sabha seat to fight parliamentary elections, supporters of Choudhury opposed the party’s decision and urged Choudhury to remain the MLA of Bongaigaon.\n\nAfter the bypolls dates were announced, the name of Diptimoy Choudhury was doing the rounds for the AGP candidate in the Bongaigaon Assembly seat. However, some of the party leaders in the district unit of the AGP revolted against the decision while the district president also resigned from his post.\n\nThese developments caused the AGP leadership to delay the announcement of the name of Choudhury as the party candidate. However, according to sources, Phani Bhusan Choudhury was insistent on his wife getting a ticket for the Assembly bypolls and the top leaders decided to field Diptimoy Choudhury in Bongaigaon.\n\nMeanwhile, the Barpeta Lok Sabha MP said that the people of Bongaigaon wanted his wife to contest the elections. “This is the only reason why she was chosen as a party candidate here,” he said.\n\nChoudhury will take on the Congress party’s nominee Brajenjit Sinha in the Bongaigaon Assembly seat.\n\nBy-elections in five assembly constituencies—Dholai, Samaguri, Behali, Bongaigaon, and Sidli became imminent following the elections of five legislators in the lower house of the parliament in this year’s Lok Sabha polls.\n\nApart from Sinha, the Congress has given party tickets to Dhrubajyoti Purakayastha in Dholai, Sanjib Warle in the Sidli seat, and Tanzil Hussain in the Samaguri Assembly constituency.\n\nThe Dholai Assembly constituency is reserved for the Scheduled Caste (SC) community and the Sidli seat is reserved for the Scheduled Tribe (ST).",
        "summary": "Guwahati, Oct 21 (IANS) The Asom Gana Parishad (AGP), an ally of the BJP in Assam, has announced the party candidate’s name for the upcoming bypolls in the state. The AGP has named Diptimoy Choudhury, wife of Lok Sabha MP from Barpeta, Phani Bhusan Choudhury, as its candidate to contest the Assembly by-election in the [&#8230;]",
        "url": "https://bhaskarlive.in/assam-bypolls-bjps-ally-agp-fields-mps-wife-from-bongaigaon-seat/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410213246898.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 11:26:15",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.685
    },
    {
        "id": 260500608,
        "title": "\"Have 16 Children\": MK Stalin On Delimitation, Tamil Nadu's Lok Sabha Share",
        "text": "\"Have 16 children\" - Tamil Nadu Chief Minister MK Stalin's eyebrow-raising 'solution' Monday to the possibility the southern state will be allotted fewer Lok Sabha seats - and therefore be less important to any political party looking to form the union government - after the delimitation in 2026, i.e., redrawing of parliamentary constituencies, before the 2029 election, based on revised population levels.\n\nThe DMK leader - presiding over the state-funded Hindu marriage ceremony of 31 couples - said the tradition in his state was for family elders to bless married couples with \"16 kinds of wealth\"; the benediction, translated from Tamil, reads \"Acquire 16 kinds of wealth and lead a prosperous life)\".\n\n\"That blessing does not mean you should have 16 children... but now a situation has arisen where people think they may have to, literally, raise 16 children and not a small and prosperous family.\"\n\nAs an aside (and in a comment seen as another jab at the BJP that is in power at the centre), Mr Stalin called on Tamil couples to give their children \"beautiful Tamil names\".\n\nREAD | \"Imposing Hindi Everywhere\": MK Stalin vs Governor In Anthem Row\n\nThe Chief Minister's comment about Tamil names for Tamil children comes amid yet another state-centre flare-up on the language row; last week Mr Stalin lobbed tough questions at Governor RN Ravi, the centre's rep in the state, for trying to \"impose Hindi everywhere\".\n\nThe Delimitation Row\n\nOver the past several months Tamil Nadu, and the other southern states, have expressed concern over a delimitation exercise that will see the number of seats jump from 543 now to 753.\n\nThe biggest increase will be in Uttar Pradesh, India's most populous state; the number of Lok Sabha seats will jump from 80 to 126 - a 57.5 per cent spike. Among the southern states, only Karnataka could see a measurable increase - from 28 seats to 36 - in representation in the Lower House.\n\nTamil Nadu's Lok Sabha share will likely only inch up - from 39 to 41, a five per cent increase, and Andhra Pradesh and Telangana may be given only three extra seats each.\n\nNDTV Explains | What India Will Look Like After 2026 Delimitation\n\nAnd Kerala - the state that has best controlled population growth, a critical factor as the country and world battles climate change, unemployment, and resource scarcity - could lose one of its 20 seats.\n\nThe opposition has been fiercely critical about the marked disparity between possible revised Lok Sabha representation for the northern states - a majority of which voted for the BJP in the 2014, 2019, and 2024 elections - and for those in the south.\n\nAnd Mr Stalin's government has been among the most vocal in this regard.\n\nTamil Nadu's Anti-Delimitation Move\n\nIn February Tamil Nadu's ruling DMK adopted a resolution against the proposed delimitation, arguing that states that have best controlled population levels ought not to be penalised.\n\nREAD | In Tamil Nadu Assembly, A Challenge To Delimitation Exercise\n\nConversely, the DMK said, states that had failed to do so should not be rewarded.\n\nChandrababu Naidu's Remark\n\nMr Stalin's comment - in jest, yes, but with a definite edge - came shortly after his Andhra Pradesh counterpart, Chandrababu Naidu, also 'advised' people to have more children.\n\nMr Naidu's comment, however, was in the context of an aging state population.\n\nHe warned that a disproportionate number of elderly people could affect the state's finances and offered Japan as an example. \"In many villages, only elderly people remain... as the young have migrated to cities or overseas,\" he said, adding his government would pass laws in this regard.\n\nCentre Says...\n\nThe Narendra Modi government will be considerate of the fact southern states have, on average, controlled population better than the north, sources told NDTV in September last year. Fears southern states will be penalised by their Lok Sabha seats being affected, will be allayed, sources said.\n\nNDTV is now available on WhatsApp channels. Click on the link to get all the latest updates from NDTV on your chat.",
        "summary": "\"Have 16 children\" - Tamil Nadu Chief Minister MK Stalin's eyebrow-raising solution Monday to the possibility his state will be allotted fewer Lok Sabha seats - and therefore be less important to any...",
        "url": "https://www.ndtv.com/india-news/mk-stalin-16-children-lok-sabha-delimitation-have-16-children-mk-stalins-on-delimitation-tamil-nadus-lok-sabha-share-6839240",
        "image": "https://c.ndtvimg.com/2024-10/c1ftce68_tamil-nadu-chief-minister-dmk-leader-mk-stalin_625x300_21_October_24.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-21 11:26:21",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.043
    },
    {
        "id": 260497050,
        "title": "Kisan Congress national vice-chairman Lal Varghese Kalpakavadi passes away",
        "text": "Lal Varghese Kalpakavadi, Kisan Congress national vice-chairman and former Kerala State president of Karshaka Congress, passed away on Sunday (October 20, 2024) night. He was 70. \n\nHe breathed his last at a private hospital at Thiruvalla where he had been undergoing treatment for the past few days. His body will be cremated at Valiya Chudukkad crematorium on Tuesday at 4.30 p.m. and his ashes will be interred in the family tomb at Thevalakkara in Kollam.\n\nThe body will be kept at his residence at Thottappally on Tuesday morning for the public to pay homage. \n\nBorn to T.K. Varghese Vaidyan, one of the founding leaders of the Communist party in Kerala, and Saramma Varghese, Mr. Kalpakavadi chose a different political path from his father by joining the Kerala Students Union KSU), the student wing of the Congress, during his student days. \n\nHe became the State treasurer of Karshaka Congress in 1980. Over the years, he held various positions within the organisation, eventually becoming its State president in 2005, a position he held until 2022. Earlier this year (2024), he was appointed vice-chairman of Kisan Congress.\n\nIn 2021, Mr. Kalpakavadi contested Rajya Sabha polls as a United Democratic Front (UDF) candidate but was defeated.",
        "summary": "Born to T.K. Varghese Vaidyan, one of the founding leaders of the Communist party in Kerala, and Saramma Varghese, Kalpakavadi chose a different political path from his father by joining the Kerala Students Union, the student wing of the Congress, during his student days",
        "url": "https://www.thehindu.com/news/national/kerala/kisan-congress-national-vice-chairman-lal-varghese-kalpakavadi-passes-away/article68778806.ece",
        "image": "https://th-i.thgim.com/public/incoming/qe3k74/article68778906.ece/alternates/LANDSCAPE_1200/11073_21_10_2024_16_30_24_1_22TVAL1_LAL.JPG",
        "video": null,
        "publish_date": "2024-10-21 11:26:27",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.151
    },
    {
        "id": 260496180,
        "title": "Rohini Blast: Time & Venue Selected for Minimum Harm, Lack of Device Points to Crude Bomb",
        "text": "The time, date, and venue of Sunday’s blast at a CRPF school in Rohini’s Prashant Vihar area was selected to cause minimum damage, top intelligence sources have told CNN-News18 even as agencies look for clues to understand the motive behind the incident.\n“Post-facto claims have become the norm and we are verifying those. There were no clues available from the spot and analysis is going on,” they said.\nThe sources added: “The place is insignificant in terms of being picked as a target for a bomb blast. This is a busy area in terms of car parking and residential locality but the logistics ensured that no damage occurred. What is most surprising is that no bomb blast material is available and neither was any device found. In this case, it becomes a crude bomb.”\nCrude bomb is used in Bengal and other parts of India, sources said, adding that they had never been used in the national capital.\n“The CCTV footage examination is crucial. There is no clue in CCTVs so far as no one is seen going closer to the spot where the blast took place.”\nOn Monday, Delhi Police said they are probing a possible Khalistani link to the blast. It has written to Telegram, a messaging app, seeking information about a group claiming responsibility for the explosion in a purported social media post on the platform.\nThe purported message, posted on Sunday evening (October 20), said the blast was in retaliation to the alleged targeting of pro-Khalistan separatists by Indian agents. The claim was made by Justice League India using a clip of the blast with a “Khalistan Zindabad” watermark at the bottom, and circulated on social media platforms.\nThe blast, which destroyed a portion of the school wall, window panes of nearby shops, and damaged a few cars parked nearby, was captured in a CCTV camera. Police suspect that the bomb might have been placed late at night as local residents said it went off between 7.35 am and 7.40 am.\nThe sound of the blast was heard several hundred metres away. Videos from the spot showed thick plumes rising from the site. Residents called the explosion “intense” and reported a foul smell in the area.\nPolice have filed a case under sections of Bharatiya Nyaya Sanhita (BNS) on charges of “mischief through explosion” and under the Explosives Act.",
        "summary": "On Monday, Delhi Police said they are probing a possible Khalistani link to the blast and have written to messaging app Telegram, seeking information about a group claiming responsibility for the explosion",
        "url": "https://www.news18.com/india/rohini-blast-time-venue-selected-for-minimum-harm-lack-of-device-points-to-crude-bomb-9093556.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/nsg-delhi-rohini-bomb-blast-pti-2024-10-0985953d7ae38016a6fc6e6af7ce0fc8-16x9.jpg?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:26:42",
        "author": "Apoorva Misra,Manoj Gupta,News18",
        "authors": [
            "Apoorva Misra",
            "Manoj Gupta",
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.687
    },
    {
        "id": 260497052,
        "title": "Omar Abdullah vacates Budgam Assembly seat, retains Ganderbal; J&K MLAs administered oath",
        "text": "The newly elected members of the Jammu and Kashmir Assembly were administered oath on Monday (October 21, 2024) by Pro-tem Speaker Mubarak Gul, with Chief Minister Omar Abdullah taking the pledge in the Kashmiri language.\n\nThe Chief Minister won both the Budgam and Ganderbal Assembly constituencies in the recently held elections. He vacated the Budgam seat and retained the Ganderbal constituency, the pro-tem speaker announced in the House on Monday. The Ganderbal seat is considered an Abdullah family stronghold.\n\nThe 54-year-old leader was an MLA from Ganderbal from 2009 to 2014 during his first tenure as the chief minister of Jammu and Kashmir.\n\nWith this, the strength of the National Conference in the 95-member House has been reduced to 41 but the party still enjoys a comfortable majority with the support of six Congress MLA, five Independents and one MLA each of the AAP and the CPI(M). The BJP with 29 seats is the second-largest party - its best-ever performance in J&K.\n\nOmar takes pledge in Kashmiri\n\nOmar Abdullah, son of Farooq Abdullah and his British wife Mollie Abdullah, had often faced criticism for not being able to speak his native language.\n\nWhile the third generation politician from the Abdullah family is fluent in English, his fluency in vernaculars like Hindi, Urdu and Kashmiri was poor at the start of his political career in the late 1990s.\n\nHowever, during his first tenure as Chief Minister from 2009 to 2014, Mr. Omar Abdullah took lessons to improve his speaking skills in these three languages. And on Monday, he took the oath as MLA in Kashmiri.\n\nDeputy Chief Minister Surinder Kumar Choudhary took oath in English.\n\nThe oath-taking ceremony of the MLAs marks an end to the six-year-long legislative hiatus.\n\nThere are 51 first-time members including BJP MLA from Kishtwar Shagun Parihar, who is the youngest member at 29. The NC veteran and MLA from Chrar-e-Sharief, Abdul Rahim Rather, is the oldest at 80.\n\nMr. Rather and party colleague Ali Mohammad Sagar (MLA Khanyar) have been elected to the Assembly for a record seven terms. While Mr. Sagar has been a member of the Legislative Assembly since 1983, Mr. Rather started his long stint as a legislator in 1977. However, the former finance minister lost the 2014 Assembly elections.",
        "summary": "The strength of the NC in the 95-member House has been reduced to 41 but the party still enjoys majority with the support of 6 Congress MLA, 5 Independents and one MLA each of the AAP and the CPI(M)",
        "url": "https://www.thehindu.com/news/national/jammu-and-kashmir/omar-abdullah-vacates-budgam-assembly-seat-retains-ganderbal-jk-mlas-administered-oath/article68778870.ece",
        "image": "https://th-i.thgim.com/public/incoming/oq4wop/article68778913.ece/alternates/LANDSCAPE_1200/PTI10_19_2024_000135A.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:27:10",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.07
    },
    {
        "id": 260497462,
        "title": "Buddy Loan India Appoints Saurabh Baggaru As COO To Drive Leadership And Growth",
        "text": "Buddy Loan India, a leading and innovative fintech platform reshaping the personal loan sector, proudly announces the appointment of Saurabh Baggaru as its new Chief Operating Officer (COO). With over a decade of experience in driving strategic business alliances, spearheading sales, and achieving significant growth in competitive markets, Saurabhs addition signifies a strategic leap forward for Buddy Loan India as it accelerates its nationwide expansion.Saurabhs distinguished career includes his successful tenure at PayU Finance India Pvt. Ltd, where his visionary leadership was instrumental in achieving growth. Known for navigating complex business landscapes and leading diverse teams, he is ideally positioned to help Buddy Loan India advance its mission of making financial solutions more accessible to all Indians.Saurabhs previous leadership roles at Ola Fleet Technologies Pvt. Ltd. and Housing.com demonstrate his ability to innovate and scale operations. An alumnus of IIT Kanpur, he brings a solid foundation in strategic initiative execution, further solidifying Buddy Loan Indias commitment to excellence.We are thrilled to welcome Saurabh Baggaru to the Buddy Loan family, said Satish and Srikanth, Founders of Buddy Loan. Saurabhs deep understanding of the fintech sector, coupled with his extensive expertise in strategic partnerships and business development, aligns perfectly with our vision of delivering seamless, innovative, and customer-centric financial services. His leadership will be critical as we embark on the next phase of our journey to redefine how Indians access financial support.As COO, Saurabh will focus on enhancing Buddy Loan Indias operational capabilities, driving technological advancements, and improving customer experiences and supporting its growth in the dynamic and rapidly evolving fintech industry.I am excited to join Buddy Loan India at such a transformative time for the fintech sector, stated Saurabh Baggaru. Buddy Loans commitment to innovation and customer empowerment deeply resonates with me, and I look forward to working with this exceptional team to build on our robust foundation, strengthen partnerships, and advance the companys mission of providing accessible and efficient financial services for everyone.About Buddy Loan IndiaFounded in 2019 and headquartered in Bangalore, Buddy Loan India has revolutionized the digital lending landscape. The platform offers swift, collateral-free loans ranging from ₹10,000 to ₹15 lakh, connecting borrowers with RBI-approved banks and NBFCs based on their profiles. With a user-friendly app on Android and iOS, Buddy Loan has processed over 7 million applications worth ₹6,640 crore within 15 months of launch. Ranked among the top 10 fastest-growing digital companies in the personal finance sector by SimilarWebs Digital 100 report, Buddy Loan India continues to set benchmarks in the fintech space, empowering millions of Indians with transparent, reliable, and fast financial solutions.",
        "summary": "Buddy Loan India, a leading and innovative fintech platform reshaping the personal loan sector, proudly announces the appointment of Saurabh Baggaru as its new Chief Operating Officer (COO). With over a decade of experience in driving strategic business alliances, spearheading sales,",
        "url": "https://www.oneindia.com/india/buddy-loan-india-appoints-saurabh-baggaru-as-coo-to-drive-leadership-and-growth-3965981.html",
        "image": "https://imagesvs.oneindia.com/img/2024/10/buddy-loan-1729509219.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:27:19",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.771
    },
    {
        "id": 260496176,
        "title": "‘Reached An Understanding’: Jaishankar On Border Disengagement With China",
        "text": "External Affairs Minister S Jaishankar said disengagement with China has been completed at the Line of Actual Control (LAC) and hoped that both nations would be able to come back to peace as they have reached an understanding. \nSpeaking at a convention organised by broadcaster NDTV on Monday, Jaishankar said India and China are rising powers who are growing at a fast pace in near proximity and it would require diplomacy to handle this ‘double rise’ in the region.",
        "summary": "S Jaishankar said the rise of India and China in the current century will have to be managed with diplomacy as both powers lie close to each other.",
        "url": "https://www.news18.com/world/reached-an-understanding-jaishankar-on-border-disengagement-with-china-9093552.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/s-jaishankar-pti-kim-jong-un-george-soros-dinner-2024-10-c66ada83302a09949c038c46ab3731f5-16x9.jpg?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:27:46",
        "author": "News18,Shankhyaneel Sarkar",
        "authors": [
            "News18",
            "Shankhyaneel Sarkar"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.586
    },
    {
        "id": 260496474,
        "title": "Groww doubles FY24 revenue to ₹3,145 cr, pays ₹1,340 cr in domicile taxes for flip back",
        "text": "Financial services provider Groww has more than doubled its FY24 revenue to ₹3,145 crore at a consolidated level, from ₹1,435 crore in the year-ago period. The Bengaluru-based company maintained its operational profitability of ₹535 crore for FY24 as compared to ₹458 crore in FY23. \n\nThe company paid about ₹1,340 crore as a one-time tax on its domicile movement to India earlier this year. Groww moved its registered office from Delaware in the US to Bengaluru last fiscal year. After paying tax, the company reported a net loss of ₹805 crore.\n\nRecently, the company announced a standalone revenue from the brokerage business to ₹2,899 crore in FY24 based on information filed with rating agency ICRA. \n\nLast year, Groww ventured into consumer lending, payments and asset management through subsidiary businesses and the consolidated figures take these into account.\n\nAs of October 2024, Groww’s active stock investor base stood at 1.2 crore. It has added over 47 lakh new SIP accounts during the July-September quarter. Out of 66 lakh new SIPs recorded in September by AMFI, Groww added 16 lakh new SIPs.\n\n Groww has steadily expanded its offerings by introducing stocks in 2020. “Groww is at the forefront of transitioning domestic savings into liquid financial assets. Its customer-centric approach emphasises on a prudent investing culture as the country’s financial markets navigate an inflexion point in retail participation,” the company said in a statement. \n\nFounded in 2017 by Lalit Keshre, Harsh Jain, Neeraj Singh, and Ishan Bansal, Groww is an online discount broking platform that allows users to invest in stocks, exchange-traded funds and IPOs. It has raised more than $393 million in funding to date by likes of Peak XV Partners, Tiger Global and Propel Venture Partners.",
        "summary": "The Bengaluru-based company maintained its operational profitability of of ₹535 crore for FY24 as compared to ₹458 crore in FY23",
        "url": "https://www.thehindubusinessline.com/companies/groww-doubles-fy24-revenue-to-3145-cr-pays-1340-cr-in-domicile-taxes-for-flip-back/article68778755.ece",
        "image": "https://bl-i.thgim.com/public/incoming/i4xuh6/article68778935.ece/alternates/LANDSCAPE_1200/IMG_groww2_2_1_1DD0M1KE.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:29:02",
        "author": "Lalit Keshre",
        "authors": [
            "Lalit Keshre"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.182
    },
    {
        "id": 260497222,
        "title": "Russia denies clarifying use of North Korean soldiers in Ukraine",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Seoul Oct 21 (IANS) Russia said on Monday it will continue its cooperation with North Korea but declined to comment on allegations that it plans to use North Korean soldiers in military operations against Ukraine. &#8220;There is a lot of contradictory information,&#8221; Kremlin spokesperson Dmitry Peskov told reporters when questioned about the alleged dispatch of [&#8230;]",
        "url": "https://bhaskarlive.in/russia-denies-clarifying-use-of-north-korean-soldiers-in-ukraine/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410213246899.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-21 11:32:02",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260497482,
        "title": "Farooq Abdullah : No talks should be held with Pak till it stops terror attacks",
        "text": "JAMMU, Oct 21: Former chief minister and National Conference president Farooq Abdullah on Monday lashed out at Pakistan for perpetrating terror attacks in Jammu and Kashmir, saying Islamabad will have to stop terror incidents here if it wants to have friendly relations with India.\n\nAbdullah said there can be no talks between New Delhi and Islamabad till the neighbouring country stops killings in Jammu and Kashmir.\n“I do not know what action India should take, that is the domain of the central government. It is a problem for us and we have been going through it for years now. I have been seeing it for 30 years now. I have told them many times to stop it but their thinking is like that only.\n“How can there be talks? You kill our innocent people and then you call for talks. First stop the killings,” Abdullah said while commenting on the terror attack at a construction site in Ganderbal district on Sunday.\nThe former chief minister said the attack was a painful incident as it led to killing of poor people who had come here for earning a livelihood.\n“It is a very painful incident. Poor labourers who come here for a livelihood so that they can feed their families back home. These beasts martyred them. There was one of our doctors with them who serve the people. He also lost his life,” Abdullah said.\nSeven persons– ? one local doctor and six non-local labourers — were killed while five others sustained injuries in the attack.\nAbdullah said if the terrorists think they can establish Pakistani writ in Jammu and Kashmir by indulging in such acts, they are mistaken.\n“What will these beasts get? Do they think that they will establish Pakistan here? We have been seeing it for many years that they (terrorists) are coming from there. We are trying to settle this problem so that we can come out of our difficulties. I want to tell the rulers of Pakistan that if they really want friendship with India, they should stop this. Kashmir will not become (part of) Pakistan,” the NC president said.\nHe said Pakistan should allow people of Kashmir to live in peace and dignity and focus on their own country's development.\n“Please let us live with dignity, allow us to develop. For how long will you put us in miseries? You started in 1947 by sending the tribal raiders and killing the innocents. Were you able to make it to Pakistan here? If you did not succeed in 75 years, how will you succeed now? “For Allah's sake look after your own country and focus on development and leave us at the mercy of our God. We want to remove poverty and unemployment here. It cannot be achieved through terrorism,” he said.\nAbdullah said the impact of the attack will be felt by all people of Jammu and Kashmir.\n“How will we progress if this (bloodshed) continues? The time has come that they should stop it or later the consequences will be hard,” he added.",
        "summary": "JAMMU, Oct 21: Former chief minister and National Conference president Farooq Abdullah on Monday lashed out at Pakistan for perpetrating terror attacks in  Jammu and Kashmir, saying Islamabad will have to stop terror incidents here if it wants to have friendly relations with India. Abdullah said there can be no talks between New Delhi and Islamabad [&#8230;]\n\n\nThe post Farooq Abdullah : No talks should be held with Pak till it stops terror attacks appeared first on Northlines.",
        "url": "https://thenorthlines.com/farooq-abdullah-no-talks-should-be-held-with-pak-till-it-stops-terror-attacks/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/farooq-abdullah-pti070824-2.jpeg",
        "video": null,
        "publish_date": "2024-10-21 11:32:34",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.305
    },
    {
        "id": 260499496,
        "title": "Will Elon Musk run for President? What the Tesla CEO said",
        "text": "Billionaire CEO of Tesla and SpaceX Elon Musk clarified that despite his immense influence and growing role in politics, Musk made it clear that he has no desire to seek the highest office in the United States. Speaking at a recent event, Musk acknowledged that although his grandfather was American, his birthplace disqualifies him from running for president. More importantly, he reiterated his passion for technology and innovation over politics.\"My grandfather was American, but I was born in Africa, so I cannot be president,\" Musk said. He added, \"But I actually don’t want to be president. I want to build rockets and cars. I believe we want to be a spacefaring civilization, and that’s where my focus will remain.\"Musk said that that his primary goal is advancing technology, particularly in space exploration and electric vehicles. “I love creating technologies that people find useful,” Musk said, further distancing himself from any political ambitions. Despite his lack of interest in running for office, Musk has become increasingly involved in political rallies, vocing his support for Republican candidate Donald Trump. Musk has committed to working on government efficiency if Trump is re-elected. Musk said, “I’m hoping that we get President Trump elected, and then I’ll work hard on the department of government efficiency.” This role would involve reducing what he sees as excessive federal spending.— AutismCapital (@AutismCapital) \"I'll work hard on the department of government efficiency. After that, I hope I can not be in politics. That would be my hope. I'm doing this because I think it's critical to the future of the country. And if America falls, nothing else matters,\" the Tesla CEO said.Musk's comments come on the heels of Trump’s announcement that who had earlier announced that he would establish a government efficiency commission, with Musk at the helm, if he wins the election. During a speech at the New York Economic Club, Trump outlined his vision, vowing to perform a thorough audit of federal spending to eliminate \"fraud and improper payments.\" He said, “I will create a government efficiency commission tasked with conducting a complete financial and performance audit of the entire federal government.” In response, Musk expressed enthusiasm for the role on X, saying, “I look forward to serving America if the opportunity arises. No pay, no title, no recognition is needed.”",
        "summary": "Elon Musk clarified he has no interest in running for US president due to his African birthplace and preference for technology over politics. Despite his support for Donald Trump and commitment to work on government efficiency, Musk's focus remains on advancing space exploration and electric vehicles.",
        "url": "https://timesofindia.indiatimes.com/world/us/will-elon-musk-run-for-president-what-the-tesla-ceo-said/articleshow/114423297.cms",
        "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-114423267/114423267.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:35:00",
        "author": "Toi World Desk",
        "authors": [
            "Toi World Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.288
    },
    {
        "id": 260496782,
        "title": "Tensions escalate in Mozambique as Oppn figures killed ahead of protests",
        "text": "Maputo: Police in Mozambique fired tear gas on Monday to disperse a small crowd in Maputo, where shops were closed ahead of a planned protest against alleged electoral fraud. Tensions escalated after attackers killed two Opposition figures—a lawyer and a party official—who were shot while traveling in a car, prompting condemnation from the EU and human rights groups.The new Opposition Podemos party and its presidential candidate, Venâncio Mondlane, have rejected provisional results that indicate a probable win for the ruling Frelimo party, which has been in power for half a century. They called for a nationwide strike in response to the results.Mozambique Elections: Police fire tear gas at Mondlane, journalists – Watch | O País #Mozambique #Moçambique #Mocambique #MozambiqueElections #News https://t.co/BeZrRxo0NA— Club of Mozambique (@clubOmozambique) October 21, 2024 \">Also Read: The Mozambican civil society election observer group More Integrity reported that the shooting occurred in the Bairro da Coop neighborhood of Maputo, resulting in the deaths of Podemos lawyer Elvino Dias and party representative Paulo Guambe. Several dozen people, including journalists, scattered as heavily armed police patrolled the area, according to videos posted on social media. Adriano Nuvunga, director of Mozambique’s Center for Democracy and Human Rights (CDD), described the killings as “a cold-blooded murder,” noting that around 10 to 15 bullets were fired. The EU condemned the violence, demanding an immediate, thorough, and transparent investigation. “In a democracy, there is no place for politically motivated killings,” the EU's diplomatic service stated, adding that its election observers are still assessing the electoral process. As of now, Frelimo leads in all 11 provinces, with Daniel Chapo expected to win the 9 October election, despite external observers raising concerns about the poll's integrity due to reports of vote-buying and intimidation. Full results are due on 24 October, but fears mount that Monday’s protests could turn violent, given the history of police brutality against political dissent. The city of Maputo resembled a ghost town, with shops closed and helicopters hovering above, as the nation awaits official presidential and parliamentary results.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/world/tensions-escalate-in-mozambique-as-oppn-figures-killed-ahead-of-protests-1831769",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854476-mm.webp",
        "video": null,
        "publish_date": "2024-10-21 11:35:24",
        "author": "AFP",
        "authors": [
            "AFP"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.126
    },
    {
        "id": 260497476,
        "title": "India, China reach agreement on border patrolling along LAC: Foreign secretary Misri",
        "text": "NEW DELHI, Oct 21: Indian and Chinese negotiators have reached an agreement on patrolling along the Line of Actual Control (LAC) in eastern Ladakh, Foreign Secretary Vikram Misri said on Monday.\n\nThe foreign secretary said the Indian and Chinese negotiators were in touch over the last few weeks to resolve the remaining issues.\nIt is understood that the agreement pertains to patrolling in Depsang and Demchok areas.\nThe announcement on the breakthrough comes a day ahead of Prime Minister Narendra Modi's travel to the Russian city of Kazan to attend the BRICS Summit.\nThough there is no official announcement, it is expected that Modi and Chinese President Xi Jinping will hold a bilateral meeting on the sidelines of the BRICS Summit.",
        "summary": "NEW DELHI, Oct 21: Indian and Chinese negotiators have reached an agreement on patrolling along the Line of Actual Control (LAC) in eastern Ladakh, Foreign Secretary Vikram Misri said on Monday. The foreign secretary said the Indian and Chinese negotiators were in touch over the last few weeks to resolve the remaining issues. It is [&#8230;]\n\n\nThe post India, China reach agreement on border patrolling along LAC: Foreign secretary Misri appeared first on Northlines.",
        "url": "https://thenorthlines.com/india-china-reach-agreement-on-border-patrolling-along-lac-foreign-secretary-misri/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/image-2024-10-21T170518.353.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:35:35",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.525
    },
    {
        "id": 260497628,
        "title": "'You don't want India to be secular?': Supreme Court on Preamble amendment plea",
        "text": "The Supreme Court on Monday reaffirmed that secularism has long been regarded as an integral part of the Constitution's basic structure. The top court made the statement orally while hearing a Public Interest Litigation (PIL) seeking the removal of the terms 'secular' and 'socialist' from the Preamble to the Constitution.\"You don't want India to be secular?\" Justice Sanjiv Khanna asked, while hearing the plea alongside Justice Sanjay Kumar. The Supreme Court bench said that the term 'socialism' should not necessarily be interpreted in the western context and the term can also mean that there has to be an equal opportunity for all. \"There are a number of judgments of this court which hold that Secularism was always part of the basic structure of the Constitution. If one looks right to equality and word fraternity used in the Constitution as well as the rights under Part III, there is a clear indication that secular has been held as the core feature of the Constitution,\" Live Law quoted Justice Khanna as saying. Khanna also pointed out that, unlike the French model of secularism, India adopted a new model of secularism.The plea, filed by senior BJP leader Dr. Subramanian Swamy and one Balram Singh, challenged the 42nd amendment to the Indian Constitution that was made by late Prime Minister Indira Gandhi-led government during the Emergency.Responding to the top court judge, Advocate Jain said, \"We are not saying that India is not secular, we are challenging the amendment\". Jain further argued that Dr Bhimrao Ramji Ambedkar had opined that the inclusion of the word 'socialism' would curtail personal liberty.In response, Justice Khanna said, \"Socialism can also mean that there should be equality of opportunity and the wealth of country should be distributed equally. Let's not take the Western meaning\".It was also argued by the petitioner that the Preamble of the Constitution, as it stood on November 26, 1949, was a definitive declaration, contending that any subsequent amendment adding words such as 'socialist\" and 'secular' was arbitrary, according to Live Law.To this, Justice Khanna highlighted that the words introduced by the 1976 amendment were clearly indicated by brackets, making it evident that they were additions. Khanna also pointed out that terms such as 'unity' and 'integrity' of the nation were also incorporated through this amendment.The bench then agreed to examine the issue in detail and listed the matter for further hearing on November 18.Published By: Sahil SinhaPublished On: Oct 21, 2024ALSO READ | Supreme Court dismisses Arvind Kejriwal's plea in case over remark on PM's degreeALSO READ | Supreme Court junks plea to replace 'Hindutva' with 'Indian constitutionalism",
        "summary": "'You don't want India to be secular?': Supreme Court on Preamble amendment plea",
        "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-on-secularism-constitution-preamble-amendment-plea-socialist-2620560-2024-10-21",
        "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202410/supreme-court-building-21063130-16x9_1.jpg?VersionId=MJT_phV3SoCMorKMpB5820H16XHcG3Vv?size=1280:720",
        "video": null,
        "publish_date": "2024-10-21 11:36:57",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.12
    },
    {
        "id": 260497480,
        "title": "Gagangir terror attack: LG directs immediate financial help for victims",
        "text": "JAMMU, Oct 21: The Lieutenant Governor, Manoj Sinha today directed Shri Chandraker Bharti, Principal Secretary (Home Department, J&K) to immediately provide financial assistance to the families of civilian victims of Gagangir terrorist attack.\n\nHe has also asked the APCO Infratech company to release the compensation without any delay. The officials of APCO Infratech briefed the Lieutenant Governor on assistance being provided to the kin / family members.\nUnder SRE, Rs.6 Lakh to be given to the next of kin of each martyred civilian and Rs.15 Lakh as an immediate measure to be provided by APCO Infratech. An ex-gratia of Rs.2 Lakh to be provided to all the injured.\nAdditionally, APCO Infratech will also provide financial assistance to the families of civilians on roll under Corporate Personal Accident Policy and 5 years of their gross CTC as compensation from insurance. All PRW labour and third-party employees are covered under workman compensation policy and accordingly financial assistance to be provided. Lieutenant Governor said, the Government and APCO Infratech company will ensure every possible financial assistance to the next of kin and other necessary support as required.\n“Though it is an irreparable loss and cannot be compensated monetarily, we are taking concrete measures for the families of the martyr civilians so that they live a life of dignity,” the Lieutenant Governor said.",
        "summary": "JAMMU, Oct 21: The Lieutenant Governor, Manoj Sinha today directed Shri Chandraker Bharti, Principal Secretary (Home Department, J&#38;K) to immediately provide financial assistance to the families of civilian victims of Gagangir terrorist attack. He has also asked the APCO Infratech company to release the compensation without any delay. The officials of APCO Infratech briefed the [&#8230;]\n\n\nThe post Gagangir terror attack: LG directs immediate financial help for victims appeared first on Northlines.",
        "url": "https://thenorthlines.com/gagangir-terror-attack-lg-directs-immediate-financial-help-for-victims/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/LG-SINHA-10-1024x691-1.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:37:33",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.159
    },
    {
        "id": 260496742,
        "title": "India Inc Accelerates Startups with In-House Incubators",
        "text": "New Delhi, Oct 21 (KNN) In a strategic push to stay agile and foster innovation, large corporations, late-stage tech companies, and government agencies are increasingly setting up in-house incubators and accelerators.\n\nThese initiatives aim to harness the dynamism of the startup ecosystem, ensuring that established firms remain competitive amidst rising competition from nimble new entrants.\n\nIndia’s corporate landscape—often referred to as \"India Inc\"—has embraced this trend, recognising that staying relevant in today’s fast-evolving market demands more than traditional strategies. \n\nBy incubating emerging startups or developing internal ventures, companies are not only driving product innovation but also mitigating the risks of disruption from smaller, more agile competitors.\n\nLate-stage tech giants, such as those in fintech, e-commerce, and IT services, are particularly active in launching these in-house platforms. \n\nThese programs provide entrepreneurs with access to mentorship, funding, technical resources, and market expertise, while companies gain early exposure to cutting-edge technologies, business models, and future talent.\n\nGovernment agencies and venture capital firms are also encouraging this ecosystem by collaborating with corporations, offering grants, or matching funds. \n\nThese partnerships foster an environment where risk-taking is encouraged and breakthrough ideas can thrive within corporate frameworks.\n\n\"In-house accelerators are no longer just a novelty; they are becoming essential for future-proofing business strategies,” said a senior executive from a leading IT firm. “By staying close to startups, companies can pivot faster, absorb innovations early, and avoid being blindsided by market shifts.”\n\nThis move reflects a growing realization: in an era dominated by rapid technological changes, companies must go beyond acquisition strategies and actively foster entrepreneurship within. \n\nThe rise of in-house incubators signals a shift toward continuous innovation, ensuring that India Inc stays resilient and relevant in the global economy.\n\n(KNN Bureau)",
        "summary": "India Inc Accelerates Startups with In-House Incubators\n\n  New Delhi, Oct 21 (KNN) In a strategic push to stay agile and foster innovation, large corporations, late-stage tech companies, and government agencies are increasingly setting up in-house incubators and accelerators.\n\n\n\nThese initiatives aim to harness the dynamism of the startup ecosystem, ensuring that established firms remain competitive amidst rising competition from nimble new entrants.\n\n\n\nIndia&rsquo;s corporate landscape&mdash;often referred to as &quot;India Inc&quot;&mdash;has embraced this trend, recognising that staying relevant in today&rsquo;s fast-evolving market demands more than traditional strategies. \n\n\n\nBy incubating emerging startups or developing internal ventures, companies are not only driving product innovation but also mitigating the risks of disruption from smaller, more agile competitors.\n\n\n\nLate-stage tech giants, such as those in fintech, e-commerce, and IT services, are particularly active in launching these in-house pla",
        "url": "https://knnindia.co.in/news/newsdetails/sectors/start-up/india-inc-accelerates-startups-with-in-house-incubators",
        "image": "https://knnindia.co.in/uploads/newsfiles/Stellar-Apps-21-10-2024.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:37:36",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.183
    },
    {
        "id": 260496746,
        "title": "Andhra Pradesh Aims to Become India's Drone Capital with Investment and Innovation",
        "text": "New Delhi, Oct 21 (KNN) The Andhra Pradesh government is taking significant strides to establish the state as the drone capital of India, as highlighted by Dinesh Kumar, Managing Director of the Andhra Pradesh Drone Corporation.\n\nThe upcoming Amaravati Drone Summit-2024, scheduled for October 22-23, aims to attract investment and foster innovation in the drone manufacturing sector.\n\nIn an exclusive interview with K. Kalyan Krishna Kumar, Dinesh Kumar outlined the summit's objectives, emphasising the importance of creating a platform for discussions on drone technology and its applications across various industries.\n\nThe summit is expected to draw over 1,000 delegates, including officials from the Union Ministry of Civil Aviation, defence representatives, academic scholars, and industry regulators. Chief Minister N. Chandrababu Naidu will inaugurate the event at 10 am on October 22 at CK Conventions in Mangalagiri.\n\nThe two-day event will also feature a free-entry policy for enthusiasts, enabling them to explore cutting-edge solutions from 40 exhibitors showcasing diverse applications of drone technology.\n\nKey discussion topics will include the current state of drone technology, regulatory reforms, and strategies for developing a comprehensive drone ecosystem through innovation hubs and certification agencies.\n\nThe Andhra Pradesh government is actively involved in nurturing this ecosystem, offering manufacturing incentives and regulatory support to attract major players in the drone sector.\n\n\"Our goal is to provide an environment conducive to investment, ensuring that Andhra Pradesh becomes a destination for drone innovation,\" Kumar stated.\n\nCurrently, drones are being utilised in various governmental functions, including hospital mapping, disaster management, and food distribution during emergencies.\n\nThe summit will delve into the future implications of drone technology, particularly its potential role in enhancing governance and everyday life.\n\nOn the evening of October 22, attendees can look forward to a grand cultural celebration at Punnami Ghat in Vijayawada.\n\nThe highlight will be India's largest drone show featuring over 5,000 drones, complemented by a fireworks display, music, dance performances, and laser shows, beginning at 4 pm.\n\nAn exciting aspect of the summit is the drone hackathon, aimed at generating innovative solutions across nine themes, including agriculture and public safety.\n\nOver 520 participants have registered, and the state government plans to partner with the winners to implement their solutions in real-time governance.\n\nAs investment discussions are ongoing, the summit will serve as a crucial platform for potential investors to explore opportunities within the growing drone market, further enhancing Andhra Pradesh's status in the drone industry.\n\n(KNN Bureau)",
        "summary": "Andhra Pradesh Aims to Become India's Drone Capital with Investment and Innovation\n\n  New Delhi, Oct 21 (KNN) The Andhra Pradesh government is taking significant strides to establish the state as the drone capital of India, as highlighted by Dinesh Kumar, Managing Director of the Andhra Pradesh Drone Corporation.\n\n\n\nThe upcoming Amaravati Drone Summit-2024, scheduled for October 22-23, aims to attract investment and foster innovation in the drone manufacturing sector.\n\n\n\nIn an exclusive interview with K. Kalyan Krishna Kumar, Dinesh Kumar outlined the summit&#39;s objectives, emphasising the importance of creating a platform for discussions on drone technology and its applications across various industries.\n\n\n\nThe summit is expected to draw over 1,000 delegates, including officials from the Union Ministry of Civil Aviation, defence representatives, academic scholars, and industry regulators. Chief Minister N. Chandrababu Naidu will inaugurate the event at 10 am on October 22 at CK Conventions in Mangalagiri.\n",
        "url": "https://knnindia.co.in/news/newsdetails/state/andhra-pradesh/andhra-pradesh-aims-to-become-indias-drone-capital-with-investment-and-innovation",
        "image": "https://knnindia.co.in/uploads/newsfiles/DRONE-21-10-2024.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:37:36",
        "author": "Dinesh Kumar",
        "authors": [
            "Dinesh Kumar"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.408
    },
    {
        "id": 260496752,
        "title": "PM Modi Unveils Rs 6,700 Crore Development Projects In Varanasi",
        "text": "Varanasi, Oct 21 (KNN) Prime Minister Narendra Modi unveiled a series of developmental initiatives in Varanasi on Sunday, marking a significant investment in the region's infrastructure and healthcare facilities.\n\nThe projects, collectively valued at approximately Rs 6,700 crore, were announced during an event at the Sports Complex in Sigra, located within the Prime Minister's parliamentary constituency.\n\nThe day's proceedings began with Modi inaugurating the RJ Sankara eye hospital, an establishment operated by the Kanchi Math.\n\nThis medical facility is expected to provide crucial eye care services to residents across 20 districts in eastern Uttar Pradesh, as well as to those living in the neighbouring states of Bihar, Madhya Pradesh, and Chhattisgarh.\n\nOf the total projects announced, 16 development initiatives specific to Varanasi account for over Rs 3,200 crore. These local projects aim to enhance various aspects of urban infrastructure and public services in the city.\n\nA notable highlight of the Prime Minister's announcements was the allocation of approximately Rs 2,870 crore for the expansion and modernisation of the Lal Bahadur Shastri International Airport in Varanasi.\n\nThis comprehensive upgrade includes plans for extending the runway, constructing a new terminal building, and implementing various allied improvements to enhance the airport's capacity and efficiency.\n\n(KNN Bureau)",
        "summary": "PM Modi Unveils Rs 6,700 Crore Development Projects In Varanasi\n\n  Varanasi, Oct 21 (KNN) Prime Minister Narendra Modi unveiled a series of developmental initiatives in Varanasi on Sunday, marking a significant investment in the region&#39;s infrastructure and healthcare facilities.\n\n\n\nThe projects, collectively valued at approximately Rs 6,700 crore, were announced during an event at the Sports Complex in Sigra, located within the Prime Minister&#39;s parliamentary constituency.\n\n\n\nThe day&#39;s proceedings began with Modi inaugurating the RJ Sankara eye hospital, an establishment operated by the Kanchi Math.\n\n\n\nThis medical facility is expected to provide crucial eye care services to residents across 20 districts in eastern Uttar Pradesh, as well as to those living in the neighbouring states of Bihar, Madhya Pradesh, and Chhattisgarh.\n\n\n\nOf the total projects announced, 16 development initiatives specific to Varanasi account for over Rs 3,200 crore. These local projects aim to enhance various aspects of urb",
        "url": "https://knnindia.co.in/news/newsdetails/state/uttar-pradesh/pm-modi-unveils-rs-6700-crore-development-projects-in-varanasi",
        "image": "https://knnindia.co.in/uploads/newsfiles/PM-MODI-INVEST-21-10-2024.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:37:36",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.426
    },
    {
        "id": 260496756,
        "title": "India Pauses FTA Talks To Reassess Trade Strategy",
        "text": "New Delhi, Oct 21 (KNN) In a significant shift in trade policy, India has temporarily halted negotiations on new free trade agreements (FTAs) as it reassesses its approach to international trade pacts.\n\nThis decision comes as part of a broader strategy to ensure more carefully structured agreements that better serve the country's economic interests.\n\nThe Indian government's move is aimed at addressing several key concerns that have emerged fr0m its existing trade partnerships.\n\nThese include preventing unintended concessions, curbing the influx of third-country goods (particularly fr0m China) through partner nations, enhancing market access for domestic industries, resisting stringent sustainability clauses, and striking a more equitable balance in trade terms.\n\nWhile discussions on FTAs at early stages, such as those with Peru and Chile, have been suspended pending high-level approval, negotiations with major partners like the United Kingdom and the European Union, which are at advanced stages, continue uninterrupted.\n\nThis selective approach underscores India's commitment to maintaining progress on strategically important trade relationships while revaluating others.\n\nRecent data analysis by the Global Trade Research Initiative highlights the impetus behind India's cautious stance. Over the past five years, imports fr0m FTA partners increased by 37.9 per cent to USD 187.92 billion, significantly outpacing export growth, which rose by 14.48 per cent to USD 122.72 billion.\n\nThis trade imbalance has been particularly pronounced with ASEAN countries, the UAE, Japan, and nations within the South Asian Free Trade Area (SAFTA).\n\nThe revised strategy draws on lessons fr0m past agreements, such as the challenges encountered with gold, silver, platinum, and date imports under the India-UAE FTA.\n\nBy adopting a more meticulous approach to concessions, India aims to mitigate potential risks and unforeseen consequences in future trade deals.\n\nA key focus of the new policy is to address the issue of third-country products, especially those originating fr0m China, entering India through FTA partner countries at preferential rates.\n\nThis practice, observed notably with Indonesian and Vietnamese imports under the India-ASEAN FTA, has prompted calls for more robust rules of origin to close existing loopholes.\n\nAdditionally, India is taking a firmer stance against non-tariff barriers proposed by developed nations, particularly those related to sustainability, labour standards, and environmental regulations.\n\nThe country is also advocating for a more balanced approach in negotiations with smaller nations to ensure proportionate gains.\n\nTo refine its FTA strategy and develop standard operating procedures for trade negotiations, the Commerce Department organised a strategic planning session in May.\n\nThis event brought together officials and trade experts, including former negotiators, to brainstorm and shape India's future approach to international trade agreements.",
        "summary": "India Pauses FTA Talks To Reassess Trade Strategy\n\n  New Delhi, Oct 21 (KNN) In a significant shift in trade policy, India has temporarily halted negotiations on new free trade agreements (FTAs) as it reassesses its approach to international trade pacts.\n\n\n\nThis decision comes as part of a broader strategy to ensure more carefully structured agreements that better serve the country&#39;s economic interests.\n\n\n\nThe Indian government&#39;s move is aimed at addressing several key concerns that have emerged fr0m its existing trade partnerships.\n\n\n\nThese include preventing unintended concessions, curbing the influx of third-country goods (particularly fr0m China) through partner nations, enhancing market access for domestic industries, resisting stringent sustainability clauses, and striking a more equitable balance in trade terms.\n\n\n\nWhile discussions on FTAs at early stages, such as those with Peru and Chile, have been suspended pending high-level approval, negotiations with major partners like the United Kingdo",
        "url": "https://knnindia.co.in/news/newsdetails/global/india-pauses-fta-talks-to-reassess-trade-strategy",
        "image": "https://knnindia.co.in/uploads/newsfiles/FTA-21-10-2024.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:37:36",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.653
    },
    {
        "id": 260499176,
        "title": "“Talks with Congress going on seat sharing in UP”: SP chief Akhilesh Yadav",
        "text": "Samajwadi Party President Akhilesh Yadav on Monday said that talks are underway between the SP and Congress regarding seat sharing for the upcoming Uttar Pradesh bypolls to be held on November 13.He further emphasised that the Karhal Assembly constituency has always been a stronghold for the Samajwadi Party expressing confidence that the people of Karhal will give “historic results”.“Karhal Assembly constituency has been our stronghold and this time as well, the people of Karhal will give historic results,” he told ANI.SP candidate from the Karhal Assembly seat, Tej Pratap Singh Yadav filed his nomination for the Assembly by-elections. The by-poll was necessitated in the Karhal constituency following Akhilesh Yadav’s resignation after being elected from Kannauj as MP.Samajwadi Party MP Dimple Yadav expressed confidence in winning the Karhal bye-election and said, “Samajwadi party will win big in Karhal by-elections… The party and workers and fully prepared and seeing the Lok Sabha election results, we are all very positive about the by-election results. Our strategy will remain the same.”SP candidate Tej Pratap Yadav said, “BJP is yet to find a candidate. The public has made up their mind. They are with the Samajwadi Party. Samajwadi Party will win this seat by a big margin.”Meanwhile, speaking about the Maharashtra Assembly polls, Akhilesh said that they will claim only those seats where they have a strong organisation.“In Maharashtra, we have decided that we will claim only those seats where we have a strong organisation… We have certain parameters for asking for our share of tickets. Our state president has decided on candidates for 12 seats. We hope we will be given seats and we will contest elections… Talks with Congress are going on seat sharing in UP,” he said.The SP chief further slammed the BJP over the Bahraich incident, saying that, “the incident was planned the BJP given the upcoming elections in the state.”The Uttar Pradesh bypolls are slated to be held on nine Assembly seats including Meerapur, Kundarki, Ghaziabad, Khair, Karhal, Phulpur, and Katehari.While polling will take place on November 13, counting of votes is scheduled for November 23, the Election Commission of India (ECI) announced on Tuesday.The poll body has announced bypolls for nine of the 10 vacant assembly seats in Uttar Pradesh, except Milkipur of Ayodhya district.The Election Commission has kept the polling for the Milkipur seat in Ayodhya in abeyance due to the pending election petition, Samajwadi Party MP Awadhesh Prasad said on Wednesday that the seat has become very important as it is connected to Akhilesh Yadav and Ayodhya.The bypolls are spread over 15 states – Assam, Bihar, Chhattisgarh, Gujarat, Karnataka, Kerala, Madhya Pradesh, Maharashtra, Meghalaya, Punjab, Rajasthan, Sikkim, Uttar Pradesh, Uttarakhand and West Bengal",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/talks-with-congress-going-on-seat-sharing-in-up-sp-chief-akhilesh-yadav/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:39:01",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.246
    },
    {
        "id": 260499424,
        "title": "Who is Shailbala Martin, IAS Officer Who Sparked Row With Temple Loudspeaker Post?",
        "text": "In Madhya Pradesh, a significant debate has emerged regarding the use of loudspeakers in temples, ignited by a recent social media post from IAS officer Shailbala Martin. The 2009-batch officer, currently serving as Additional Secretary in the General Administration Department, raised pertinent questions that garnered widespread attention.\nWho Is Shailbala Martin?\nShailbala Martin, originally from Jhabua, Madhya Pradesh, was born on April 9, 1965. According to the state government website, she began her career in the State Civil Service (SCS) before being promoted to the Indian Administrative Service (IAS) on June 12, 2017. With a BA and an MA in Arts from Holkar Science College in Indore, Martin joined the State Civil Service in 2009.\nThroughout her career, Martin has held various positions, including roles in the Health Department in 2014, Municipal Commissioner of Burhanpur in 2019, and Collector of Niwari district the same year. Since January 25, 2022, she has been serving as Additional Secretary in the General Administration Department.\nThe Loudspeaker Controversy\nThe recent controversy can be traced back to guidelines issued by the state government last year to mitigate noise pollution, which specifically aimed to regulate loudspeakers in religious venues. A journalist on the social media platform X (previously Twitter) questioned the disparity in enforcement, focusing on the use of loudspeakers in mosques and the prevalence of DJs playing music outside these spaces.\nIn response, Martin highlighted the noise pollution caused by loudspeakers in temples, questioning why such disturbances, which can be heard several streets away and continue late into the night, are often overlooked. Her tweet sparked a mix of reactions, with some users supporting her stance while others criticised her for raising the issue.",
        "summary": "In Madhya Pradesh, a significant debate has emerged regarding the use of loudspeakers in temples, ignited by a recent social media post from IAS officer Shailbala Martin.",
        "url": "https://www.news18.com/india/who-is-shailbala-martin-ias-officer-who-posted-about-loud-temple-loudspeakers-9093521.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-1-2024-10-e4e22f1928d93ab52689b337ad0af3d6-16x9.jpg?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:39:50",
        "author": "Diksha Modi,News18,Translation Desk",
        "authors": [
            "Diksha Modi",
            "News18",
            "Translation Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.385
    },
    {
        "id": 260498538,
        "title": "Rajasthan assembly bypolls: State Congress Chief Dotasra rejects alliance with other parties",
        "text": "Rajasthan Congress president Govind Singh Dotasra on Monday (October 21, 2024) ruled out the possibility of an alliance with any regional party for the upcoming bypolls to seven assembly seats.\n\nTalking to reporters after a meeting of the Congress Coordination Committee, Mr. Dotasra said the State unit has made panels of probable candidates for the seven seats and the final announcement will be made by the party's high command in Delhi.\n\nIn the Lok Sabha election held this year, the Congress entered into an alliance with the Rashtriya Loktantrik Party (RLP) for the Nagaur seat and with the CPI(M) for the Sikar seat.\n\nRLP convener Hanuman Beniwal, who had won the Khinvsar assembly seat in Nagaur district in last year's assembly election, emerged victorious from the Nagaur parliamentary constituency this year. As a result, the Khinsvar assembly seat fell vacant.\n\nThere was speculation about a Congress-RLP alliance for the bypoll to the Khinvsar seat but Mr. Dotasra said the Congress' State unit was not looking for a tie-up.\n\nHe said the Congress' Rajasthan in-charge Sukhjinder Singh Randhawa would take the panels for all seven seats to Delhi and candidates would be declared after a discussion with the high command.\n\nDungarpur's Chorasi assembly seat fell vacant after Bharat Adivasi Party (BAP) MLA Rajkumar Roat won the Lok Sabha election from the Banswara-Dungarpur district.\n\nThe Congress did not announce any alliance with the BAP in the general election but asked its candidate to withdraw their nominations from the Banswara-Dungarpur constituency. The move was aimed at supporting the BAP.\n\n\"There are no talks of alliance with any party in the assembly bypolls in Rajasthan. We have prepared panels for all seven seats in the meeting today,\" Mr. Dotasra said.\n\nHe also exuded confidence that the party would win all seven assembly seats.\n\nLeader of Opposition in the Assembly Tikaram Jully, former Chief Minister Ashok Gehlot, former assembly Speaker CP Joshi and other party leaders attended the meeting chaired by Randhawa.\n\nVoting on seven assembly seats -- Jhunjhunu, Dausa, Deoli-Uniara, Khinvsar, Chorasi, Salumbar and Ramgarh -- will be held on November 13 and the results will be declared on November 23.\n\nBypolls on two seats are being held due to the death of the MLAs -- Congress's Zubair Khan from Ramgarh and BJP's Amritlal Meena from Salumbar.\n\nIn the other five constituencies, the MLAs were elected as MPs, necessitating the bypolls.\n\nCongress MLAs Brijendra Ola (Jhunjhunu), Harish Chandra Meena (Deoli-Uniara) and Murari Lal Meena (Dasau) were elected as MPs in the Lok Sabha election. The other two are Beniwal and Roat.\n\nFour of the seven seats where bypolls will be held were with the Congress, while the BJP, BAP and the RLP held one each.\n\nThe BJP has declared candidates for all seats except Chorasi.\n\nThe BAP has already declared its candidate for the Chorasi seat.\n\nCurrently, the 200-seat state assembly has 114 MLAs of the BJP, 65 of the Congress, three of the BAP, two of the BSP, one of the Rashtriya Lok Dal and eight Independents.",
        "summary": "The Rajasthan Congress unit has made panels of probable candidates for the seven seats and the final announcement will be made by the party's high command in Delhi",
        "url": "https://www.thehindu.com/news/national/rajasthan/rajasthan-assembly-bypolls-state-congress-chief-dotasra-rejects-alliance-with-other-parties/article68778834.ece",
        "image": "https://th-i.thgim.com/public/incoming/rpz2si/article68778975.ece/alternates/LANDSCAPE_1200/IMG_Gehlot_at_press_conf_2_1_GOAL645E.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:41:30",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.373
    },
    {
        "id": 260497636,
        "title": "Maharashtra Assembly Elections 2024: 'All Seat-Sharing Talks Within MVA Done... BJP Is Creating Issues,' Says Congress Leader Atul Londhe Patil",
        "text": "Regarding a query about the Congress party causing a delay in issuing tickets, Congress leader Atul Patil told ANI, \"I think notification will be issued on October 22. ...Some more discussions are going to be held on about 8-10 seats on October 22 in Mumbai. There is no issue.\"",
        "summary": "",
        "url": "https://www.freepressjournal.in/mumbai/maharashtra-assembly-elections-2024-all-seat-sharing-talks-within-mva-done-bjp-is-creating-issues-says-congress-leader-atul-londhe-patil",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/cchh2rij/Screenshot-2024-10-21-170030.png",
        "video": null,
        "publish_date": "2024-10-21 11:42:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": -0.78
    },
    {
        "id": 260498792,
        "title": "Woman falls to death while escaping from monkey attack in Nirmal",
        "text": "Nirmal: A 50-year-old woman died on the spot when she fell down in an attempt to escape from being attacked by a troop of monkeys at Vidyanagar in Khanapur town on Monday.\r\n\r\nKhanapur Sub-Inspector A Rahul said Bongoni Laxmi, a beedi-rolling worker, received serious head injuries when she fell, resulting in instantaneous death for her. She was trying to escape from being attacked by monkeys.\r\n\r\nShe was asleep when the troop of monkeys created noise on her tin-roofed house. Ganga Goud, the husband of the woman, lodged a complaint with police. A case was registered.\r\n\r\nMeanwhile, locals said they were facing inconvenience following an unprecedented monkey menace in the town. They said they were fearing to move on the streets due to the monkeys. They requested officials of Khanapur municipality to take steps to address the menace.",
        "summary": "Khanapur Sub-Inspector A. Rahul reported that Bongoni Laxmi, a beedi-rolling worker, sustained severe head injuries from a fall that led to her immediate death. She was attempting to escape an attack by monkeys when the incident occurred.",
        "url": "https://telanganatoday.com/woman-falls-to-death-while-escaping-from-monkey-attack-in-nirmal",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/10/Woman-falls-to-death-while-escaping-from-monkey-attack-in-Nirmal.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:42:50",
        "author": "Telangana Today",
        "authors": [
            "Telangana Today"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.551
    },
    {
        "id": 260500616,
        "title": "\"India Will Become Leader In Semiconductor Production\": Investor Mark Mobius",
        "text": "India has outperformed the US markets and emerging markets are, on average, growing at double the rate of developed economies, ace investor Mark Mobius has said.In a conversation with investor Ramesh Damani at the NDTV World Summit on Monday, Mr Mobius said Prime Minister Narendra Modi's thrust on digital infrastructure and the opening up of the economy has been key to India's growth.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Mr Mobius, who is the founder of Mobius Capital Partners LLP and is known as the 'Indiana Jones of emerging market investing', said, \"I always think of India as the United States of India, because there are different states. It's mind-boggling - you are one nation but you are speaking different languages and even the written languages are different. The first thing he (PM Modi) did was unify the tax system. This is an incredible accomplishment. This is something that probably would have taken a century.\"The investor said India's diversity results in incredible creativity and the future belongs to those who are creative.\"I definitely think India is going to become a leader or the leader in semiconductor production in the future. One reason I say that is the demand - you have got a market here that is one of the biggest in the world. Secondly, it is a relatively open economy, so you are going to be able to take technology from Taiwan, China, the United States, wherever. Thirdly, you have got an incredible software industry already, you are the largest exporter of software in the world,\" Mr Mobius said, adding that many large semiconductor companies already have software bases in India.The investor said semiconductor fabrication will happen in India because the country has the labour force. \"I remember I was meeting an Indian friend of mine a few years ago and I said India will become a big semiconductor manufacturer. He said Indians are not as patient and not so good with small things like the Chinese are and I asked him if he had seen the places where they are polishing these tiny diamonds in India. They will do a very good job here, no questions about it. But it will require a huge amount of capital,\" he added.In terms of return on capital, it's \"India, China and the US\", Mr Mobius said, adding that India still presents plenty of opportunities despite stock prices climbing. As the conversation moved to lighter topics, the investor said he likes the 'Baahubali' movies and also had a picture taken with a statue of the villain from the movies in Hyderabad. &nbsp",
        "summary": "India has outperformed the US markets and emerging markets are, on average, growing at double the rate of developed economies, ace investor Mark Mobius has said.",
        "url": "https://www.ndtv.com/world-news/india-will-become-leader-in-semiconductor-production-investor-mark-mobius-at-ndtv-world-summit-6839409",
        "image": "https://c.ndtvimg.com/2024-10/d6oiigag_mark-mobius-ndtv-summit_625x300_21_October_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-21 11:46:12",
        "author": "Rohit Paul",
        "authors": [
            "Rohit Paul"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.486
    },
    {
        "id": 260498232,
        "title": "J-K terror attack Karwa Chauth and the call that never came",
        "text": "Jammu, Oct 21: Dressed in her finery, she waited for the phone to ring so she could break the Karwa Chauth fast she had kept for his long life. What came instead was the pronouncement of his death – Shashi Abrol had been killed in a terror attack in Kashmir's Ganderbal district.\n\nNews of his death came late on Sunday night, long after the moon had risen, the sight millions of Hindu women look out for to break their daylong fast on the day. Fate could not have dealt Ruchi Abrol a crueller blow.\nShashi Abrol, an architectural designer, was among the seven people killed when terrorists attacked a tunnel construction site on the Srinagar-Leh national highway on Sunday.\nThe attack took place when the team had returned from work to their camp late in the evening. The morning after, his wife held on to their three-year-old daughter, angry, anguished and bewildered at the same time. The couple also has a son studying engineering.\n“I spoke to him in the evening. He didn't mention any threats. I was going to the temple as part of my Karwa Chauth fast, and we had a brief conversation. I tried calling him after I returned but he didn't pick up. After that, his phone was switched off,” a sobbing Ruchi told PTI.\n“I waited for his call but had no idea about the attack,” she added at her home in Jammu's Talab Tillo area, her mother-in-law by her side.\nNo one told them what had happened until late at night. And then too, it came through the media, the family said.\nRuchi was refusing to break her fast, said her sister-in-law Divya.\n“Her life is shattered. The festival of Karwa Chauth has turned into a day of catastrophe for us. Our dear Shashi Ji was killed in a cowardly act by terrorists,” she said.\nAnxiety mounted as the hours passed by.\nRuchi had completed her rituals and was waiting for a video call from her husband, everyone unaware of the magnitude of the tragedy that had befallen them.\n“We tried to comfort Ruchi as we grew worried when his phone switched off late at night. We only learned about his death through the media, which shocked us all,” Divya said.\nShashi was the family's sole breadwinner.\n“What have they gained from this? How will she feed her children now? We curse them,” she said.\nShashi, who had been working for the construction company APCO in Sonamarg for the past six years, had last come home two months ago during his son's college admission.\n“His aim was to see his son as a bright engineer,” Divya said.\nAs news of Shashi's death spread, hundreds of neighbours, relatives and others visited the family home to offer their condolences.\nThe family criticised the government for failing to inform them promptly and urged the authorities to ensure the swift return of Shashi's body for the last rites.\n“This is proof of how much peace and normalcy has been restored. Seven people were massacred. We lost our brother,” Shashi's sister Urvashi said after the incident that came just four days after Omar Abdullah was sworn in as chief minister of Jammu and Kashmir.\nThe family called on the government to provide financial assistance.\nJ L Abrol, Shashi's father, said they had never anticipated any danger in Kashmir. “We demand a job for my daughter in law to feed the family,” he said.\n“There is no breadwinner left in the family. How will his wife, who is a homemaker, feed the children? She should be given a government job. It is the government's duty to take care of them,” a cousin Navin Suri said.\nAccording to Additional Deputy Commissioner, Jammu, Shishir Gupta, the loss cannot be compensated but the process to bring back Shashi's body is being fast tracked.",
        "summary": "Jammu, Oct 21: Dressed in her finery, she waited for the phone to ring so she could break the Karwa Chauth fast she had kept for his long life. What came instead was the pronouncement of his death – Shashi Abrol had been killed in a terror attack in Kashmir's Ganderbal district. News of his [&#8230;]\n\n\nThe post J-K terror attack Karwa Chauth and the call that never came appeared first on Northlines.",
        "url": "https://thenorthlines.com/j-k-terror-attack-karwa-chauth-and-the-call-that-never-came/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/jpg-3.jpeg",
        "video": null,
        "publish_date": "2024-10-21 11:49:06",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.492
    },
    {
        "id": 260500626,
        "title": "\"Russia Has Never...\": S Jaishankar Spells Out Mantra In Delhi-Moscow Ties",
        "text": "Russia has never done anything to impact India's interests negatively, and there is an economic and strategic logic behind New Delhi maintaining strong ties with Moscow, External Affairs Minister Dr S Jaishankar said at the NDTV World Summit today.During an interaction with NDTV Editor-in-Chief Sanjay Pugalia, the veteran diplomat was asked how India-Russia ties would develop in the coming years.\"The Prime Minister is going to Russia tomorrow, so this is a timely question. If you look at our history with Russia after Independence, Russia has never done anything to impact our interests negatively. Among the major countries, there are not many about who we can say this. Today Russia's situation is different, I think Russia's relationship with the West has broken down, so you have a Russia which is turning much more towards Asia. Should Russia not have multiple options in Asia? Should we not take what is good for us in national interests?\"\"And clearly, Russia as a major natural resources power has a complementarity with India at this stage of development where we are big resource consumers. It isn't just Russian oil, it could be fertilisers, metals, coal. There is a whole economic logic to it. There is also a basic strategic logic, if you look at the Eurasian landmass, there are three big countries. You always keep a balance, a relationship,\" the minister said.New Delhi's ties with Moscow have been a key geopolitical talking point over the past few years, especially after the Ukraine War began. With the West siding with Ukraine and imposing sanctions on Russia, India's decision to buy Russian oil had come under scrutiny.India has consistently refused to take sides in the conflict and said it is on the side of peace. This was also reflected in Prime Minister Narendra Modi's recent visits to both Kyiv and Moscow.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Earlier, articulating the Indian position over the decision to procure Russian oil, Dr Jaishankar had said New Delhi has a right to prioritise the interests of its people.\"I understand that there is a conflict situation (in Ukraine). I also understand that Europe has a point of view and Europe will make the choices it will make that is Europe's right. But for Europe to make choices which prioritises its energy needs and then ask India to do something else..,\" he had said.",
        "summary": "Russia has never done anything to impact India's interests negatively, and there is an economic and strategic logic behind New Delhi maintaining strong ties with Moscow, External Affairs Minister Dr S...",
        "url": "https://www.ndtv.com/world-news/russia-has-never-s-jaishankar-spells-out-mantra-in-delhi-moscow-ties-6839431",
        "image": "https://c.ndtvimg.com/2024-10/au1beqqo_jaishankar-ndtv-summit-_625x300_21_October_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-21 11:50:01",
        "author": "Saikat Kumar Bose",
        "authors": [
            "Saikat Kumar Bose"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.166
    },
    {
        "id": 260499174,
        "title": "Congress’ Priyanka Gandhi to file nomination for Wayanad bypolls on October 23",
        "text": "Congress General Secretary and United Democratic Front (UDF) candidate Priyanka Gandhi will be filing her nomination on October 23 for the upcoming Wayanad Lok Sabha bye-elections. She also met with Congress President Mallikarjun Kharge on Monday and took his guidance and blessings ahead of the nomination and election campaign for the Wayanad parliamentary seat in Kerala.https://x.com/priyankagandhi/status/1848322558774419849?t=Py4aOo4dGPTRo8PUznelFw&s=08Congress Parliamentary Party Chairperson Sonia Gandhi, Party President Mallikarjun Kharge and Leader of Opposition (LoP) in Lok Sabha Rahul Gandhi will also accompany her for filing her nomination before the Returning Officer (RO) in Kalpetta, in Wayanad.Priyanka Gandhi and Rahul Gandhi are also going to hold a road show starting at 11 AM, and filing the nomination at noon, according to sources. Congress approved Priyanka’s candidature on October 15, after the bypoll schedule was announced by the Election Commission of India.In the run-up to the bypolls, Congress appointed Saral Patel as Media Coordinator for Wayanad with immediate effect, an All India Congress Committee statement said on October 19. Earlier on Sunday, Bharatiya Janata Party (BJP) candidate for the Wayanad seat, Navya Hariprasad said that her opponent would be facing “tough competition” in the upcoming bypolls. “My opponent is Priyanka Gandhi and all I can say is Congress will be facing tough competition in Wayanad. Rahul Gandhi has given up his seat in Wayanad to retain his seat in Raebareli. When the people of Wayanad faced the landslides, they did not have a representative to raise their issues in the Parliament,” Navya Hariprasad told ANI.The Left Democratic Front (LDF) also announced their candidate, Sathyan Mokeri. Wayanad will go to the polls on November 13 along with voting for bye-elections in 47 assembly seats across 15 states. The first phase of assembly polls in Jharkhand will also be held on November 13.Wayanad’s seat was vacated by Rahul Gandhi after he was also elected to Lok Sabha from Raebareli in Uttar Pradesh in the general elections held earlier this year",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/congress-priyanka-gandhi-to-file-nomination-for-wayanad-bypolls-on-october-23/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:53:59",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.264
    },
    {
        "id": 260500166,
        "title": "RG Kar Issue: Junior doctors meeting start with with Bengal CM Mamata at state secretariat",
        "text": "Protesting junior doctors in West Bengal arrived at the state secretariat on Monday (October 21, 2024) evening to meet Chief Minister Mamata Banerjee in an effort to resolve the ongoing impasse following the rape-murder of an on-duty woman medic at RG Kar Medical College and Hospital.\n\nThe doctors, however, asserted that they would continue their hunger strike demanding justice for the murdered doctor, removal of Health Secretary NS Nigam and enhanced security for healthcare workers, among other issues.\n\n\"We are looking for a positive outcome from the meeting,\" said Debasish Halder, one of the agitating junior doctors, as they departed for Nabanna, the state secretariat, from their protest site at Esplanade, where they had been fasting since October 5.\n\nThe meeting, scheduled for 5 pm, follows threats from the protesting doctors to launch a statewide 'cease work' if their demands are not addressed. So far, six doctors on hunger strike had been hospitalised due to deteriorating health, while eight others remained on indefinite fast.\n\nBanerjee spoke with the protesting doctors over the phone on Saturday, urging them to end their fast, asserting that most of their demands had been met. She requested an additional three to four months to address their remaining concerns.\n\nChief Minister meeting live: Dr Asfakulla Naiya, a protesting doctor of the West Bengal Junior Doctors’ Front and 3rd year postgraduate trainee of ENT at RG Kar Medical College and Hospital, highlights to the Chief Minister that the demands posed by junior doctors include the welfare of patients who seek medical treatment in State-run hospitals\n\nDr Debasish Halder, a senior resident of anaesthesiology at Medical College, Kolkata, says that of the ten-point demands which were demanded to the government earlier, were a centralised referral system and live bed vacancy monitor. He highlights that a State task force was promised for the fulfilment of infrastructural demands. “You had earlier said that 5-7 junior doctors should be part of the State Task Force, but we had suggested more representatives be present from WBJDF on a rotational basis. However, if a SoP is formed for the State Task Force formation and a monthly meeting of the task force ensured, along with directives for the same, we believe our earlier agreements can be realised more constructively,” he says\n\n“We want RDAs and MBBS student unions to be statutory bodies authorised by the government via a statute by West Bengal University of Health Sciences, and elected representatives from these bodies be elected into the aforementioned committees,” one of the protesting doctors suggest\n\nThe junior doctors launched their protests after the recovery of the body of a woman medic from a seminar room at RG Kar Medical Hospital on August 9, an incident that sparked outrage nationwide.\n\n(With inputs from agencies)",
        "summary": "\"We are looking for a positive outcome from the meeting,\" said Debasish Halder, one of the agitating junior doctors, as they departed for Nabanna, the state secretariat",
        "url": "https://www.thehindu.com/news/cities/kolkata/meeting-between-protesting-junior-doctors-and-bengal-cm/article68778976.ece",
        "image": "https://th-i.thgim.com/public/incoming/slsvpi/article68779004.ece/alternates/LANDSCAPE_1200/PTI10_21_2024_000119B.jpg",
        "video": null,
        "publish_date": "2024-10-21 11:54:37",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.183
    },
    {
        "id": 260499064,
        "title": "BJP MPs Urge Governor to Intervene in Temple Attacks, Seek NIA Probe",
        "text": "Hyderabad: BJP MPs Eatala Rajender, K Vishweswar Reddy , Raghunanadhan Rao and other leaders called on Governor Jishnu Dev Verma at Raj Bhavan here on Monday. The MPs appealed to prevent the attacks on temples across the state. They also submitted a representation to the governor on Mutyalamma temple incident in Secunderabad and appealed him to handover the case to NIA.Speaking to the media, Eatala Rajender accused the state government of booking cases on the leaders of Dharmika Sangham and appealed to the Governor to revoke the cases on them.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/telangana/bjp-mps-urge-governor-to-intervene-in-temple-attacks-seek-nia-probe-1831775",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854481-eatala.webp",
        "video": null,
        "publish_date": "2024-10-21 11:55:40",
        "author": "DC Correspondent",
        "authors": [
            "DC Correspondent"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.115
    },
    {
        "id": 260500610,
        "title": "'Shook Hands, Came Back': S Jaishankar On Pakistan Visit For SCO Summit",
        "text": "External Affairs Minister S Jaishankar on Monday denied meeting Pakistan Prime Minister Shehbaz Sharif in a personal capacity at the recently-concluded Shanghai Cooperation Organisation (SCO) Summit in Islanabad.\"I am a good SCO member. We were very supportive and wanted the proceeding to be smooth. Haath milaya aur aa gaye wapis (shook hands and came back),\" he said at the NDTV World Summit 2024.S Jaishankar was referring to a brief interaction with Mr Sharif at an official dinner held for all the summit attendees. The two leaders shook hands and exchanged a courtesy greeting as Mr Sharif welcomed Mr Jaishankar for the official dinner for SCO leaders. Few words were spoken during the interaction that lasted less than twenty seconds.The Union Minister's Pakistan visit for the first by an Indian minister in nearly ten years. The last visit by an Indian foreign minister was by Sushma Swaraj.At his speech at the meeting of the Heads of Government, S Jaishankar flagged concerns over terrorism and extremism. In a veiled message to Pakistan, he said that cooperation in areas like trade is unlikely to flourish if cross-border activities are characterised by terrorism.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Mr Jaishankar also said Indian and Chinese soldiers will be able to resume patrolling in the way they had been doing before the border face-off began in May 2020. His statement came hours after Foreign Secretary Vikram Misri announced India and China have arrived on a patrolling arrangement along the Line of Actual Control (LAC) in the Himalayas, and it can lead to disengagement and resolution of tension.",
        "summary": "External Affairs Minister S Jaishankar denied meeting Pakistan Prime Minister Shehbaz Sharif in a personal capacity at the recently-concluded Shanghai Cooperation Organisation Summit in Islanabad.",
        "url": "https://www.ndtv.com/world-news/shook-hands-came-back-s-jaishankar-on-pakistan-visit-for-sco-summit-6839492",
        "image": "https://c.ndtvimg.com/2024-10/pudbeva_jaishankar-at-ndtv_625x300_21_October_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-21 11:55:43",
        "author": null,
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.116
    },
    {
        "id": 260499818,
        "title": "Worldchefs Congress & Expo 2024 Opens In 'Food Paradise' Singapore; New Addition Is Global Vegan Chefs Challenge",
        "text": "Bringing together culinary passion, innovation, and expertise from several countries, Worldchefs Congress & Expo 2024 is being held at the Marina Bay Sands Expo & Convention Centre. Marking the inauguration on Sunday morning, minister Low Yen Ling welcomed the global event to the “food paradise” that is Singapore.\n\nAs an extension of Worldchefs Congress (October 20-22, 9am to 5pm), the island nation is also hosting the Global Chefs Challenge culinary competition (October 22-25). India is one of the participating countries.\n\nThis year, the biennial event will see the launch of the inaugural Global Vegan Chefs Challenge, an indicator of the increasing reach of and demand for vegan food.\n\nThe World Association of Chefs’ Societies, or Worldchefs in short, is an industry institution founded in 1928 at the Sorbonne in Paris. It is now just four years short of a century.\n\nIn her opening address, minister Low Yen Ling said, “For 96 years, Worldchefs has been a unifying force in the culinary world, bringing together a global network of professionals dedicated to upholding the highest standards of the craft. You foster collaboration and innovation, preserve culinary traditions, and nurture future generations of chefs.”\n\nSingapore is honoured to be a part of this journey. Our city is known as a food paradise and home to excellent culinary skills. You will discover a rich tapestry of flavours here — from our beloved hawker food to renowned fine dining. Our chefs take pride in celebrating our diverse culture and heritage, while embracing innovative approaches to cuisine.Low Yen Ling, Senior Minister of State for the Ministry of Trade and Industry; and Ministry of Culture, Community and Youth, Singapore Government\n\n“These efforts reflect our unwavering commitment to delivering authentic, high-quality gastronomic experiences,” said the minister. “As a global food capital, we continue to scale new culinary heights and are inspired by the incredible talents gathered here.”\n\nOrganisers said in a media release: “Worldchefs Congress & Expo is a hallmark tradition of Worldchefs with an institutional, cultural, and economic interest.” It added that the biennial Worldchefs Congress had been organised in at least 38 cities internationally since the institution was established.\n\nTarget audience of Worldchefs Congress & Expo\n\n● Industry Leadership\n\nThe core of Worldchefs Congress & Expo is formed of the decision-makers and thought leaders from its international membership. Worldchefs officials come together with presidents and management teams from more than 100 professional associations to address the greatest challenges and opportunities facing the chef community and to shape the future of the culinary trade.\n\n● Culinary Professionals & Young Chefs\n\nLeading chefs of all levels and specialties, from Executive Chefs to Young Chefs, attend to gain insight from experts, take part in immersive workshops to spark new ideas for their business or career, and network with the largest culinary body worldwide. \n\n● Hospitality Educators & Culinary Students\n\nRenowned culinary schools and training providers attend to attract and connect with emerging culinary talent, share best-practices, exchange ideas and develop consensus to strengthen global standards of education and learning.\n\n(The article is published under a mutual content partnership arrangement between The Free Press Journal and Connected To India)",
        "summary": "",
        "url": "https://www.freepressjournal.in/business/worldchefs-congress-expo-2024-opens-in-food-paradise-singapore-new-addition-is-global-vegan-chefs-challenge",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/wspxag4y/India-teamcropped-Instagram-southindiachefs.png",
        "video": null,
        "publish_date": "2024-10-21 11:58:14",
        "author": "connectedtoindia.com",
        "authors": [
            "connectedtoindia.com"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": 0.627
    },
    {
        "id": 260500254,
        "title": "What S Jaishankar said on India-China LAC agreement",
        "text": "After two years of frozen relations between India and China, External Affairs Minister S Jaishankar on Monday stated that both countries have reached an understanding and will \"return to pre-2020 patrolling along LAC.\" \n\n\"Frictions happen between large countries, but this is a major breakthrough,\" he added.",
        "summary": "What S Jaishankar said on India-China LAC agreement",
        "url": "https://www.indiatoday.in/india/video/s-jaishankar-on-india-china-line-of-actual-control-patrolling-agreement-2620583-2024-10-21",
        "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202410/external-affairs-minister-s-jaishankar-215101577-16x9_0.jpg?VersionId=5KH5hz0GW.HLlQ1fDwK5io2OoOVZfkDC?size=647:363",
        "video": null,
        "publish_date": "2024-10-21 11:58:59",
        "author": "India Today Video Desk",
        "authors": [
            "India Today Video Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.284
    },
    {
        "id": 260500270,
        "title": "Priyanka Gandhi meets Kharge, to file nomination from Wayanad",
        "text": "Congress leader Priyanka Gandhi Vadra on Monday met party chief Mallikarjun Kharge in Delhi to discuss campaign strategies as she prepares to file nomination for the by-elections in Wayanad Lok Sabha constituency. Vadra, along with Congress leader Rahul Gandhi, will lead a roadshow from Waynad’s Kalpetta New Bus Stand in the morning before filing the nomination on October 23.\n\nAfter the Election Commission of India (ECI) announced the bypoll, Congress declared Gandhi’s candidature for the Waynad seat as part of the United Democratic Front (UDF) in Kerala. Senior Congress leaders will also remain present during Gandhi’s nomination filing before the district collector in the afternoon. \n\nAfter being active in politics for five years, All India Congress Committee (AICC) General Secretary Gandhi will make her electoral debut in the Waynad Lok Sabha constituency, where the bypoll is scheduled to be held on November 13. Along with this, the election commission announced by-elections in 47 assembly seats across 15 states. \n\nIf Priyanka Gandhi wins from Waynad, she will be the third person from the Gandhi family to enter Parliament. Earlier, Rahul Gandhi had retained the Rae Bareli Lok Sabha constituency in Uttar Pradesh and vacated the Wayanad seat, paving the way for his sister to make her electoral debut. \n\nGandhi is contesting against Navya Haridas, a candidate fielded by the Bharatiya Janata Party (BJP) and Left Democratic Front’s (LDF) candidate Sathyan Mokeri. Haridas is a two-time Kozhikode Corporation Councillor. \n\nRahul Gandhi had said both Raebareli and Wayanad would get two MPs and had also expressed confidence in Priyanka Gandhi winning from Wayanad. Priyanka Gandhi was responsible for taking care of the Gandhi family’s stronghold in Amethi and Raebareli before making a run for active politics, where she emerged as an important strategist for her party. \n\nMeanwhile, Congress appointed Saral Patel as the media coordinator for Wayanad ahead of the by-election with immediate effect. (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/priyanka-gandhi-meets-kharge-to-file-nomination-from-wayanad/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-21 12:03:36",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.207
    }
]