[
    {
        "id": 264707000,
        "title": "Flights To Bali Resume Following Volcanic Eruption",
        "text": "Several airlines resumed flights to Bali on Thursday, after cancelling trips to and from the Indonesian resort island due to huge eruptions at a nearby volcano.Eighty-three international routes were cancelled on Wednesday, the general manager of Bali's international airport said in a statement, after Mount Lewotobi Laki-Laki spewed a nine-kilometre (5.6-mile) tower of ash into the sky.The volcano has erupted more than a dozen times over the last two weeks, killing at least nine people and forcing the evacuation of thousands. Qantas and Jetstar were resuming their services to Bali, Australia's Qantas Group said in a statement Thursday, noting \"improved\" conditions.Two delayed Qantas flights from yesterday were among those set to take off, Qantas said.\"We will continue to monitor the changing conditions and volcanic activity,\" it said in the statement. AirAsia planned to resume some flights to and from Bali later today, the company said in a statement to AFP, while Virgin Australia said on its website it would resume flights to and from Denpasar starting today. (function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Singapore's Scoot airline, meanwhile, said it had rescheduled flights from Singapore to Bali and Surabaya as well as their return flights due to Lewotobi Laki-Laki's volcanic activity.As of 3 am Thursday, Bali's airport had recorded another 32 international flight cancellations, general manager Ahmad Syaugi Shahab said. He added that volcanic ash from Mount Lewotobi Laki-Laki had been heading away from the airport since Wednesday evening. \"We hope affected airline passengers can resume their travel on Thursday,\" Ahmad said. Lewotobi erupted again overnight into Thursday morning, and a thick ash column and lava flows could be seen pouring from its crater, according to the volcanology agency. The airport in the tourist hotspot of Labuan Bajo near the volcano reopened on Thursday, according to the airport's Instagram account.Laki-Laki, which means \"man\" in Indonesian, is twinned with a calmer volcano named after the Indonesian word for \"woman\".Bali's economy is heavily reliant on tourism but Indonesia is one of the most disaster-prone nations on Earth, straddling the Pacific Ring of Fire where tectonic plates collide.(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
        "summary": "Several airlines resumed flights to Bali on Thursday, after cancelling trips to and from the Indonesian resort island due to huge eruptions at a nearby volcano.",
        "url": "https://www.ndtv.com/world-news/flights-to-bali-resume-following-volcanic-eruption-7016302",
        "image": "https://c.ndtvimg.com/2024-11/oruq0i7g_bali-airport-afp_625x300_14_November_24.jpeg",
        "video": null,
        "publish_date": "2024-11-14 06:51:14",
        "author": "Agence France-Presse",
        "authors": [
            "Agence France-Presse"
        ],
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": -0.438
    },
    {
        "id": 264711662,
        "title": "Flights to Bali resume following volcanic eruption",
        "text": "Jakarta: Several airlines resumed flights to Bali on Thursday, after cancelling trips to and from the Indonesian resort island due to huge eruptions at a nearby volcano.Eighty-three international routes were cancelled on Wednesday, the general manager of Bali's international airport said in a statement, after Mount Lewotobi Laki-Laki spewed a nine-kilometre (5.6-mile) tower of ash into the sky.The volcano has erupted more than a dozen times over the last two weeks, killing at least nine people and forcing the evacuation of thousands. Qantas and Jetstar were resuming their services to Bali, Australia's Qantas Group said in a statement Thursday, noting \"improved\" conditions.Two delayed Qantas flights from yesterday were among those set to take off, Qantas said. \"We will continue to monitor the changing conditions and volcanic activity,\" it said in the statement.AirAsia planned to resume some flights to and from Bali later today, the company said in a statement to AFP, while Virgin Australia said on its website it would resume flights to and from Denpasar starting today. Singapore's Scoot airline, meanwhile, said it had rescheduled flights from Singapore to Bali and Surabaya as well as their return flights due to Lewotobi Laki-Laki's volcanic activity.As of 3 am Thursday, Bali's airport had recorded another 32 international flight cancellations, general manager Ahmad Syaugi Shahab said. He added that volcanic ash from Mount Lewotobi Laki-Laki had been heading away from the airport since Wednesday evening.\"We hope affected airline passengers can resume their travel on Thursday,\" Ahmad said. Lewotobi erupted again overnight into Thursday morning, and a thick ash column and lava flows could be seen pouring from its crater, according to the volcanology agency.The airport in the tourist hotspot of Labuan Bajo near the volcano reopened on Thursday, according to the airport's Instagram account. Laki-Laki, which means \"man\" in Indonesian, is twinned with a calmer volcano named after the Indonesian word for \"woman\". Bali's economy is heavily reliant on tourism but Indonesia is one of the most disaster-prone nations on Earth, straddling the Pacific Ring of Fire where tectonic plates collide.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/world/flights-to-bali-resume-following-volcanic-eruption-1838152",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/25/1856028-flights.jfif",
        "video": null,
        "publish_date": "2024-11-14 08:16:42",
        "author": "AFP",
        "authors": [
            "AFP"
        ],
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": -0.352
    },
    {
        "id": 263109802,
        "title": "NASA's Parker Solar Probe makes its closest approach to the sun yet.",
        "text": "NASA's Parker Solar Probe will execute its last gravity assist with Venus, skimming just 233 miles (376 km) above the planet's surface, on November 06, 2024. This close encounter will redirect Parker onto its final trajectory, positioning it to travel within a record-breaking 3.86 million miles of the sun's surface on December 24. This approach marks the closest any human-made spacecraft has come to the sun, a landmark in space exploration.\r\n\r\nA Chance Discovery Unveils Venus's Surface\r\n\r\nAs per a recent report by NASA, Parker's earlier Venus flybys yielded unexpected discoveries about the planet. Using the Wide-Field Imager for Parker Solar Probe (WISPR), scientists initially intended to observe changes in the planet's thick cloud cover. However, during the third flyby on 11 July 2020, WISPR detected near-infrared light emanating from Venus's surface, revealing details beyond the clouds. According to Noam Izenberg, a space scientist at Johns Hopkins Applied Physics Laboratory, the intense surface heat—around 869°F (465°C)—allowed WISPR's cameras to capture Venus's hot surface below the thick cloud layers.\r\n\r\nThese new images of Venus align with radar data from NASA's earlier Magellan mission, which mapped Venus's topography between 1990 and 1994. The resemblance in patterns suggests similar landforms, yet WISPR's images showed unexpected brightness in some areas, raising questions about possible surface differences. This latest flyby is expected to provide additional insights, helping scientists determine if WISPR can identify chemical or physical variations on Venus.Shenzhou 18 Astronauts Return to Earth Post Six-Month Space Mission\r\n\r\nApproaching the Sun's Inner Mysteries\r\n\r\nFollowing the November flyby, Parker Solar Probe will head toward the sun to achieve its mission's main objective: to observe the solar atmosphere up close. As Parker closes in on the sun's surface, it will pass through regions filled with solar plasma and potentially within solar eruptions. Adam Szabo, Parker's project scientist at NASA's Goddard Space Flight Center, highlights this as a significant feat of engineering, as the spacecraft must endure immense heat and radiation.\r\n\r\nParker will reach its perihelion, or closest solar pass, on 24 December. The team at NASA will receive a status signal on 27 December, confirming the probe's condition post-mission. Parker's journey will continue, completing two more perihelion passes, but its Dec. 24 orbit will set an unmatched record in proximity to the sun, providing unparalleled data on our star's inner workings.\r\n\r\n\r\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "NASA's Parker Solar Probe will complete its final Venus gravity assist on 6 November, altering its path to make an unprecedented 3.86-million-mile approach to the sun on 24 December. The manoeuvre...",
        "url": "https://www.gadgets360.com/science/news/nasa-s-parker-solar-probe-reaches-closest-approach-to-sun-after-final-venus-flyby-6949316",
        "image": "https://i.gadgets360cdn.com/large/5-nov_artical_3_full_img_1730806924598.jpg",
        "video": null,
        "publish_date": "2024-11-06 15:30:01",
        "author": null,
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": -0.038
    },
    {
        "id": 263148934,
        "title": "NASA's Parker Solar Probe Makes Final Venus Flyby Before Sun Encounter",
        "text": "NASA's Parker Solar Probe will make a close approach to Venus on Wednesday, marking the spacecraft's seventh and final flyby of the planet. This manoeuvre will set the probe on a course for its historic plunge toward the sun, bringing it within 3.8 million miles of our star's surface — closer than any human-made object has ventured. Nour Raouafi, Project Scientist at the Johns Hopkins University Applied Physics Laboratory, described this approach as “almost landing on a star,” likening it to the significance of the 1969 moon landing.\r\n\r\nVenus Flybys as Critical Milestones\r\n\r\nThe Parker Solar Probe, launched in 2018, relies on gravitational assists from Venus to gradually reduce its distance from the sun, using the planet's gravitational pull to adjust its orbit. Yanping Guo, Mission Design and Navigation Manager at the Johns Hopkins Applied Physics Laboratory, emphasised that this final Venus flyby is crucial in positioning the probe for its upcoming close encounter with the sun.\r\n\r\nWhile designed for solar exploration, the probe's instruments have provided valuable data on Venus. During previous flybys, Parker's Wide-Field Imager (WISPR) managed to capture images through Venus's thick atmosphere, revealing surface details like continents and plateaus. The probe also recorded emissions from Venus's nightside, providing insights into its surface composition and temperature, which is around 860 degrees Fahrenheit (460 Celsius).India’s first Astronaut Mission Oostponed to 2026 for Safety Checks\r\n\r\nA Closer Look at Venusian Surface\r\n\r\nThis week's flyby will allow scientists to point WISPR toward Venus once more to capture new surface images, including areas with varied landforms. Noam Izenberg, a planetary geologist at APL, noted that this close approach offers a unique chance to study differences in Venus's surface features, potentially uncovering information about its geology and thermal properties.\r\n\r\nApproaching the Sun's Frontier\r\n\r\nOn December 24, the Parker Solar Probe will skim the sun's outer layer at speeds of up to 430,000 miles per hour (692,010 km/h). Although mission control will lose contact during this close pass, engineers hope to receive a signal on December 27 confirming the probe's success. This achievement could unlock significant insights into the sun's outer atmosphere, its intense heat, and its magnetic dynamics, further advancing our understanding of solar phenomena.\r\n\r\n\r\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "NASA's Parker Solar Probe, launched in 2018, will make its final Venus flyby on Nov. 6. This manoeuvre will bring the spacecraft into a new orbit, allowing it to approach within 3.8 million miles of...",
        "url": "https://www.gadgets360.com/science/news/parker-solar-probes-historic-flyby-of-venus-sets-course-for-closest-sun-encounter-yet-6956705",
        "image": "https://i.gadgets360cdn.com/large/6-nov_artical_1_full_img_1730893923129.jpg",
        "video": null,
        "publish_date": "2024-11-06 18:01:41",
        "author": null,
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": 0.002
    },
    {
        "id": 262366412,
        "title": "Trinidad and Tobago Star Dwight Yorke Hired to Coach National Team",
        "text": "Former Manchester United star Dwight Yorke was appointed coach of Trinidad and Tobago on Friday, aiming to lead his home islands back to the World Cup.Yorke captained the Soca Warriors at the 2006 World Cup in Germany, the only time they qualified. Trinidad and Tobago did not advance from a group including England, Sweden and Paraguay.",
        "summary": "Trinidad and Tobago Star Dwight Yorke Hired to Coach National Team",
        "url": "https://www.republicworld.com/sports/football/trinidad-and-tobago-star-dwight-yorke-hired-to-coach-national-team",
        "image": "https://img.republicworld.com/all_images/trinidad-and-tobago-star-dwight-yorke-hired-to-coach-national-team-1730484270179-9_16.webp",
        "video": null,
        "publish_date": "2024-11-01 18:04:36",
        "author": "Associated Press Television News",
        "authors": [
            "Associated Press Television News"
        ],
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": -0.3
    },
    {
        "id": 262366412,
        "title": "Trinidad and Tobago Star Dwight Yorke Hired to Coach National Team",
        "text": "Former Manchester United star Dwight Yorke was appointed coach of Trinidad and Tobago on Friday, aiming to lead his home islands back to the World Cup.Yorke captained the Soca Warriors at the 2006 World Cup in Germany, the only time they qualified. Trinidad and Tobago did not advance from a group including England, Sweden and Paraguay.",
        "summary": "Trinidad and Tobago Star Dwight Yorke Hired to Coach National Team",
        "url": "https://www.republicworld.com/sports/football/trinidad-and-tobago-star-dwight-yorke-hired-to-coach-national-team",
        "image": "https://img.republicworld.com/all_images/trinidad-and-tobago-star-dwight-yorke-hired-to-coach-national-team-1730484270179-9_16.webp",
        "video": null,
        "publish_date": "2024-11-01 18:04:36",
        "author": "Associated Press Television News",
        "authors": [
            "Associated Press Television News"
        ],
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": -0.3
    },
    {
        "id": 262022062,
        "title": "Lost for 47 years, Nasa reconnects with Voyager 1 spacecraft 15 billion miles away",
        "text": "Sharing a ground breaking development, Nasa recently announced re-connecting with the 47 year old long lost spacecraft Voyager 1, following years of radio silence. The spacecraft recently turned off one of its two radio transmitters and experts are currently working to uncover the cause.According to the space agency, non-essential systems on the spacecraft are switched off if it draws too much power. However, it may take the team several days or even weeks to identify the root cause that triggered the fault protection system.When NASA's Jet Propulsion Laboratory flight team in Southern California sends instructions to the spacecraft through the agency's Deep Space Network, Voyager 1 sends back engineering data. The team then analyzes this information to assess how the spacecraft responded to the commands.The two lone spacecraft, Voyagers 1 and 2, have been wandering in interstellar space for 47 years and are the sole two spacecraft there.The Mirror Us reported that scientists believe the transmitter shut-off was initiated by the spacecraft's fault protection system, which autonomously responds to onboard problems, however, the advanced age of these spacecraft has resulted in a rise in technical issues and new challenges for the mission engineering team. It could take days or weeks for the team to pinpoint the root cause that activated the fault protection system. When the flight team at NASA's Jet Propulsion Laboratory in Southern California sends instructions to the spacecraft via the agency's Deep Space Network, Voyager 1 returns engineering data that the team evaluates to see how the spacecraft responded to the command.It takes approximately 23 hours for the command to travel more than 15 billion miles from Earth to the spacecraft, followed by another 23 hours for the data to return, according to reports from the Manchester Evening News.The flight team had issued a command to activate one of Voyager 1's heaters on October 16. Despite having sufficient power for the heater, the command activated the fault protection system on the spacecraft.The whole issue came to light when the Deep Space Network was unable to detect Voyager 1's signal on October 18. The spacecraft communicates with Earth through an X-band radio transmitter, named after its specific frequency. The flight team concluded that the protection system had reduced the transmitter's rate of sending back data as this mode uses less power from the spacecraft. However, it also changes the X-band signal that the Deep Space Network needs to detect. The signal was recorded later that day by engineers and the Voyager was reported to be stable.However, on October 19, the communication ceased completely.The flight team theorized that Voyager 1's fault protection system had been triggered twice more, turning off the X-band transmitter and switching to a second radio transmitter known as the S-band. Although the S-band uses less power, Voyager 1 hasn't used it to communicate with Earth since 1981.The flight team speculated that Voyager 1’s fault protection system has activated on two additional occasions, leading to the shutdown of the X-band transmitter and a switch to the less commonly used S-band transmitter. While this alternative consumes less power, Voyager 1 has not utilized it for communication with Earth since 1981. Its signal is significantly weaker and operates on a different frequency than the X-band transmitters.Because of the spacecraft's immense distance, the flight team was uncertain if the S-band signal could be detected from Earth; however, engineers at the Deep Space Network successfully managed to locate it.Rather than reactivating the X-band transmitter before determining what triggered the fault protection system, the team sent a command on October 22 to test the functionality of the S-band transmitter. At present, data to assist with further understanding of the situation and work toward restoring Voyager 1 to its normal operations is being gathered.",
        "summary": "NASA has re-established contact with 47-year-old Voyager 1 after years of silence. The spacecraft's fault protection system shut down its radio transmitter, sparking investigations into the cause. Commands and data exchanges between the spacecraft and NASA take nearly two days, with engineers working to restore normal operations.",
        "url": "https://timesofindia.indiatimes.com/science/lost-for-almost-50-years-nasa-reconnects-with-voyager-1-spacecraft-15-billion-miles-away/articleshow/114872925.cms",
        "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-114877619/114877619.jpg",
        "video": null,
        "publish_date": "2024-11-02 06:53:38",
        "author": "TOI SCIENCE DESK",
        "authors": [
            "TOI SCIENCE DESK"
        ],
        "language": "en",
        "category": "science",
        "source_country": "IN",
        "sentiment": -0.429
    },
    {
        "id": 261081084,
        "title": "Newly Discovered Amphipod Species in Japan Features Panda-Like Colouring",
        "text": "Researchers in Japan have officially recognised a new amphipod species, Melita panda, which features black-and-white coloring resembling a panda. Discovered in Japan's coastal waters, the species has now been classified through detailed morphological and genetic research by Hiroshima University's team, as published in ZooKeys. The identification of Melita panda underlines the need for continued taxonomic studies to support biodiversity conservation efforts.\r\n\r\nNew Discovery in Coastal Biodiversity\r\n\r\nOriginally found in Wakayama Prefecture during the 1990s, Melita panda was re-evaluated as part of a broader study on amphipods, a group of small, shrimp-like crustaceans found worldwide. Professor Ko Tomikawa and colleagues from Hiroshima University note that many marine species in Japan remain unclassified, hindering conservation efforts. Their study highlighted that species diversity in Japan's coastal areas requires continued investigation to understand the full spectrum of local biodiversity.\r\n\r\nIdentifying Melita panda: Genetic and Morphological Analysis\r\n\r\nUsing DNA sequencing and morphological analysis, researchers identified Melita panda's distinct black-and-white pattern along with unique physical traits. These include forward-positioned gnathopods (claws) and distinct bristle-like setae, which distinguish it from its closest relatives, Melita nagatai and Melita koreana. These amphipods together form a monophyletic group, meaning they share a common evolutionary ancestor, Melita hoshinoi.Spacex Launches 23 More Starlink Satellites to Boost Broadband Network\r\n\r\nImplications for Conservation and Future Study\r\n\r\nThe recognition of Melita panda emphasises the importance of taxonomy in conservation. Professor Tomikawa noted that the discovery could increase interest in studying coastal species and contribute to more informed conservation planning. He suggests that further taxonomic studies in uncharted marine regions may yield additional species, potentially enhancing our understanding of marine ecosystem dynamics and supporting conservation initiatives across Japan's coastlines.\r\n\r\n\r\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "A newly discovered amphipod species, Melita panda, has been confirmed as a unique species in Japan's coastal waters. This crustacean, named for its black-and-white coloring resembling that of a...",
        "url": "https://www.gadgets360.com/science/news/newly-discovered-amphipod-species-in-japan-features-panda-like-coloring-6871273",
        "image": "https://i.gadgets360cdn.com/large/25-oct_artical_8_full_img_1729851011546.jpg",
        "video": null,
        "publish_date": "2024-10-25 13:11:10",
        "author": null,
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": 0.336
    },
    {
        "id": 256840550,
        "title": "Death toll in Myanmar floods nears 300",
        "text": "Disclaimer The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk. In no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website. Through this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them. Every effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control. For any legal details or query please visit original source link given with news or click on Go to Source. Our translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us. If you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Yangon, Sep 20 (IANS) The death toll from Myanmar&#8217;s floods has risen to 293, with 89 people still missing, the state media reported. The floods have affected dozens of townships in the regions and states across the country, including Nay Pyi Taw Union Territory, Xinhua news agency reported quoting the state-run daily The Mirror. As [&#8230;]",
        "url": "https://bhaskarlive.in/death-toll-in-myanmar-floods-nears-300/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202409203226614.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-09-20 05:27:49",
        "author": "IANS,Typhoon Yagi",
        "authors": [
            "IANS",
            "Typhoon Yagi"
        ],
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 256841594,
        "title": "Death toll in Myanmar floods nears 300",
        "text": "Yangon: The death toll from Myanmar’s floods has risen to 293, with 89 people still missing, the state media reported. The floods have affected dozens of townships in the regions and states across the country, including Nay Pyi Taw Union Territory, Xinhua news agency reported quoting the state-run daily The Mirror. As of Thursday morning, 161,592 flood victims from 47,019 households were taking shelters at 425 relief shelters, the report said. The floods have also submerged 766,586 acres of crops and killed 129,150 animals, it added. The widespread flooding in the Asian country was caused by heavy rains triggered by Typhoon Yagi and a deep depression in the Bay of Bengal. Local authorities, rescue organisations, and residents are working together to clean flood-affected areas, provide healthcare, and distribute food and other essential items for the flood victims.",
        "summary": "Yangon: The death toll from Myanmar&#8217;s floods has risen to 293, with 89 people still missing, the state media reported. The floods have affected dozens of townships in the regions and states across the country, including Nay Pyi Taw Union Territory, Xinhua news agency reported quoting the state-run daily The Mirror. As of Thursday morning, [&#8230;]",
        "url": "https://www.orissapost.com/death-toll-in-myanmar-floods-nears-300/",
        "image": "https://www.orissapost.com/wp-content/uploads/2024/09/image-210764-1726810529.jpg",
        "video": null,
        "publish_date": "2024-09-20 05:44:38",
        "author": "Post News Network",
        "authors": [
            "Post News Network"
        ],
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": -0.377
    },
    {
        "id": 257372966,
        "title": "Yuva Sambhrama off to a colourful start",
        "text": "Mysuru: With a week left for this year’s Dasara, the festive fever has already gripped the youth of Mysuru who gathered in large numbers for the inauguration of ‘Yuva Sambhrama – 2024’ at the Open Air Theatre in Manasagangothri here last evening. The event, which provides students from across the State to showcase their talent, is held every year prior to the commencement of the Dasara festival. The presence of Kannada actors Srimurali and Rukmini Vasanth added more glitter to the inaugural event. While Srimurali was addressing the gathering, youth demanded him to sing for which the actor obliged with the song ‘Hudugir Kannu Loaded Gannu…’ from his movie ‘Rathavara’ which set the tone for the celebrations. Srimurali, who said that ‘Our Nada Habba is Our Pride,’ added that it was only in Mysuru that a grandeur Dasara could be witnessed and no other place in the country. Later, the actor, promoting his upcoming movie ‘Bhageera,’ urged the youth to watch the film in theatres. Earlier, inaugurating the event, District Minister Dr. H.C. Mahadevappa said that among the 470 colleges which had applied to take part in the Yuva Sambhrama, 150 colleges were selected and another 120 colleges out of those not selected would be given an opportunity to showcase their talent by extending the event by a day. Tribute to ‘Appu’ Yesterday’s inaugural event also witnessed the organisers paying tributes to late actor Puneeth Rajkumar, fondly called ‘Appu.’ Dr. Madhusudan and troupe rendered the song ‘Bombe Heluthaithe…’ from the Kannada movie ‘Rajakumara’ joined the audience who also sang along by waving their mobile phones turning on the torch. A delayed inauguration The students and audience present at the Open Air Theatre, who had arrived much earlier to scheduled time of inauguration (5 pm as per the banners at the venue; 6 pm as per the invitation) waited for more than two hours for the guests to arrive. Finally, the event was inaugurated at 8.20 pm which caused a great inconvenience to the students who had to wait for long wearing their costumes. On day-1, Holenarasipur Govt. FGC for Women, Hassan presented a dance programme portraying the folk and desi culture; Hunsur’s Sri Mahaveer College of Education showcased Dasara heritage through dance. It was followed by performances of 18 other colleges. MLC C.N. Manjegowda, Karnataka Exhibition Authority Chairman Ayub Khan, Karnataka State Guarantee Schemes Implementation Authority Vice-Chairperson Dr. Pushpa Amarnath, DC G. Lakshmikanth Reddy, ZP CEO K.M. Gayathri, SP N. Vishnuvardhana & DCP M. Muthuraj were present. ‘Yuva Sambhrama’ programmes will be held from 6 pm onwards till Sept. 30.",
        "summary": "Mysuru: With a week left for this year’s Dasara, the festive fever has already gripped the youth of Mysuru who gathered in large numbers for the inauguration of ‘Yuva Sambhrama &#8211; 2024’ at the Open Air Theatre in Manasagangothri here last evening. The event, which provides students from across the State to showcase their talent,...\n\n\nThe post Yuva Sambhrama off to a colourful start appeared first on Star of Mysore.",
        "url": "https://starofmysore.com/yuva-sambhrama-off-to-a-colourful-start/",
        "image": "https://starofmysore.com/wp-content/uploads/2024/09/news-4-1-yuva-sambrahma-begins.jpg",
        "video": null,
        "publish_date": "2024-09-25 13:10:00",
        "author": "Author",
        "authors": [
            "Author"
        ],
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": -0.071
    },
    {
        "id": 258453658,
        "title": "Scientists Reveal It Wasn't Just One Asteroid That Wiped Out Dinosaurs",
        "text": "The massive asteroid that ended the dinosaurs 66 million years ago was not an isolated event, new research has revealed. The study, published in Nature, detailed scans of an underwater crater off the coast of Guinea. It revealed that another large asteroid struck Earth around the same time, potentially contributing to the cataclysmic conditions that led to the dinosaurs' extinction. Scientists recently mapped the Nadir crater, spanning over 8 km in diameter, and revealed that it was created by an asteroid measuring 400 metres wide. This asteroid struck the planet at nearly 72,000 kmph between 65 million and 67 million years ago. While it was smaller than the asteroid linked to the mass extinction, it was still powerful enough to leave a significant mark on Earth. “The new images paint a picture of the catastrophic event,” said Dr Uisdean Nicholson, a marine geologist at Heriot-Watt University in Edinburgh. He discovered the Nadir crater in 2022, but the impact details were unclear until now. Using advanced 3D seismic imaging, researchers managed to explore the crater's rim and the geological features lying 300 metres beneath the ocean floor. Dr Nicholson called it “exquisite,” saying, “There are around 20 confirmed marine craters worldwide, and none of them has been captured in anything close to this level of detail.” The findings suggest the impact triggered intense tremors that liquefied sediments beneath the sea bed, resulting in faults and landslides that left traces of damage visible for thousands of square miles beyond the crater's edge. Furthermore, the collision unleashed a massive tsunami, estimated to have exceeded 800 metres in height, which would have surged across the Atlantic Ocean. Although the exact timing of this asteroid's impact remains uncertain, its discovery raises intriguing possibilities about a cluster of impacts occurring at the end of the Cretaceous period – 145 million years ago to 66 million years ago. The asteroid responsible for the extinction of the dinosaurs created a much larger crater – 160 km wide – at Chicxulub on the Yucatan Peninsula in Mexico. Dr Nicholson said the “closest humans have come to seeing something like this is the 1908 Tunguska event”, when a 50-metre asteroid entered Earth's atmosphere and exploded in the skies above Siberia. He pointed out that the new 3D seismic data across the Nadir crater provides an unrivalled opportunity to test impact crater hypotheses and develop new models of crater formation in marine environments.",
        "summary": "The massive asteroid that ended the dinosaurs 66 million years ago was not an isolated event, new research has revealed.",
        "url": "https://www.ndtv.com/science/second-asteroid-impact-may-have-contributed-to-dinosaur-extinction-research-6713947",
        "image": "https://c.ndtvimg.com/2024-10/7hfg98pg_asteroid-generic-_625x300_04_October_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
        "video": null,
        "publish_date": "2024-10-04 08:14:40",
        "author": null,
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": -0.186
    },
    {
        "id": 258477436,
        "title": "Dasara: Colourful rangolis adorn palace forecourt",
        "text": "The forecourt of the iconic Mysuru palace looked colourful with various designs showcasing the talent of over 100 women who drew attractive rangolis as part of the Dasara Rangoli competition organised on Friday. A variety of colourful and attractive rangolis were drawn, enlivening the festive mood as women, not just from Mysuru, but also from other districts as well, thronged the venue to showcase their talent and creativity. Many attractive designs of rangolis were drawn on the forecourt of the palace. People also visited the palace to watch the colourful rangolis. The event was inaugurated by MLA T.S. Srivatsa. Speaking on the occasion, the MLA said rangoli symbolised our culture and tradition. More than 100 women participated in the competition to showcase their talents oblivious about the prizes. Their participation is appreciating, he added. The MLA recalled how women in villages draw rangolis, and the preparations they make before the rangolis are drawn in front of their houses. Rangoli is an art and a tradition that has continued since ages, with women in the cities also practicing the tradition, drawing attractive rangolis daily in front of their house. Rangolis in the design of elephant carrying Ambari, Mahisha rangoli, and many other impressive rangolis had been drawn in the competition. Women whose rangoli designs were judged the best will get prizes which will be presented on October 8. Three prizes and three consolation prizes will be presented.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/karnataka/dasara-colourful-rangolis-adorn-palace-forecourt/article68718270.ece",
        "image": "https://th-i.thgim.com/public/incoming/g8p9uq/article68718602.ece/alternates/LANDSCAPE_1200/2303_4_10_2024_19_24_34_1_RANGOLIDASARA.JPG",
        "video": null,
        "publish_date": "2024-10-04 14:24:56",
        "author": "Mla T.s. Srivatsa",
        "authors": [
            "Mla T.s. Srivatsa"
        ],
        "language": "en",
        "category": "science",
        "source_country": "in",
        "sentiment": 0.601
    }
]