[
    {
        "id": 262988482,
        "title": "Honor X9c With Snapdragon 6 Gen 1 SoC, IP65M Rating Launched",
        "text": "Honor X9c was launched in Malaysia on Tuesday. The smartphone is powered by a Snapdragon 6 Gen 1 SoC paired with up to 12GB of RAM. It is backed by a 6,600mAh battery with 66W wired charging support. According to Honor, the phone comes with a 2m drop resistance as well as an IP65M rating for dust and 360-degree water resistance. The Honor X9c carries an OIS-backed 108-megapixel dual rear camera unit. The smartphone succeeds the Honor X9b, which was unveiled in India in February this year.\r\n\r\nHonor X9c Price\r\n\r\nHonor X9c price starts at MYR 1,499 (roughly Rs. 28,700) for the 12GB + 256GB option in Malaysia, while the 12GB + 512GB variant is priced at MYR 1,699 (roughly Rs. 32,500). It is listed on the global website with an 8GB + 256GB configuration as well, but pricing has not been revealed. The phone is offered in three colour options — Jade Cyan, Titanium Black, and Titanium Purple. It is available for pre-orders in Singapore via an online retail store.\r\n\r\nHonor X9c Specifications, Features\r\n\r\nThe Honor X9c sports a 6.78-inch 1.5K (1,224 x 2,700 pixels) AMOLED display with 120Hz refresh rate, 4,000 nits typical brightness, and eye protection features. The phone is powered by a Snapdragon 6 Gen 1 chipset paired with an Adreno A710 GPU, up to 12GB of RAM, and up to 512GB of onboard storage. It ships with Android 14-based MagicOS 8.0.Honor X9b Review\r\n\r\nFor optics, the Honor X9c carries a 108-megapixel primary rear sensor with optical image stabilisation (OIS) alongside a 5-megapixel ultra-wide shooter. There's a 16-megapixel sensor up front for selfies. According to the company, the handset is built to withstand up to a 2m drop. It also has an IP65M rating for dust and 360-degree water resistance. The M-rating, the company says, stands for \"the ability to resist water exposure even while in motion.\"\r\n\r\nThe Honor X9c is backed by a 6,600mAh battery with support for 66W wired fast charging. Connectivity options for the phone include dual 5G, 4G LTE, Wi-Fi, Bluetooth 5.1, OTG, GPS, and a USB Type-C port. The handset measures 162.8 x 75.5 x 7.98mm in size and weighs 189g.",
        "summary": "Honor X9c was launched in Malaysia on Tuesday. The smartphone is powered by a Snapdragon 6 Gen 1 paired with up to 12GB of RAM. It is backed by a 6,600mAh battery with 66W wired charging support. The...",
        "url": "https://www.gadgets360.com/mobiles/news/honor-x9c-price-specifications-features-launch-malaysia-6954584",
        "image": "https://i.gadgets360cdn.com/large/honor_x9c_honor_1730867601616.jpg",
        "video": null,
        "publish_date": "2024-11-06 05:47:32",
        "author": "Siddharth Suvarna,Sucharita Ganguly",
        "authors": [
            "Siddharth Suvarna",
            "Sucharita Ganguly"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.366
    },
    {
        "id": 261797554,
        "title": "OnePlus 13 With Snapdragon 8 Elite, 6,000mAh Battery Launched: See Price",
        "text": "OnePlus 13 was launched in China on Thursday as the company's latest flagship smartphone. It is one of the first handsets to arrive with the new Snapdragon 8 Elite chip from Qualcomm, and it equipped with up to 24GB of RAM and up to 1TB of storage. OnePlus has equipped the new smartphone with a 6.82-inch AMOLED screen with a 120Hz refresh rate. It also features a 50-megapixel triple rear camera setup that is tuned by Hasselblad. The OnePlus 13 runs on ColorOS 15, which is based on Android 15, while the global model will arrive with OxygenOS 15.\r\n\r\nOnePlus 13 Price, Availability\r\n\r\nOnePlus 13 price is set at CNY 4,499 (roughly Rs. 53,100) for the base model with 12GB of RAM and 256GB of storage, while the 12GB+512GB model costs CNY 4,899 (roughly Rs. 57,900). Meanwhile, the price of the 16GB+512GB is set at CNY 5,299 (roughly Rs. 62,600), while the top-of-the-line model with 24GB of RAM and 1TB of storage will be available for CNY 5,999 (roughly Rs. 70,900).\r\n\r\nCustomers in China can pre-order the smartphone via the company's website, and the handset will go on sale on November 1. It will be available in Blue (leather), Obsidian (glass), and White (glass) colourways. OnePlus is also expected to launch the smartphone in global markets, including India.Samsung Galaxy S25 Series Tipped to Debut With This Chipset on All Models\r\n\r\nOnePlus 13 Specifications, Features\r\n\r\nThe dual-SIM (Nano+Nano) OnePlus 13 runs on Android 15-based ColorOS 15 and sports a 6.82-inch Quad-HD+ (1440x3168 pixels) LTPO AMOLED screen produced by BOE with a refresh rate that ranges between 1Hz-120Hz, a peak brightness level of 4,500 nits, and Dolby Vision support. The display also supports 2,160Hz pulse-width modulation when the handset is used in low light scenarios.\r\n\r\n\r\n\r\nOnePlus 13 is available with leather (pictured) or glass finishes\r\nPhoto Credit: OnePlus\r\n\r\n\r\n\r\nOnePlus has equipped the smartphone with a Snapdragon 8 Elite chip and an Adreno 830 GPU, paired with up to 24GB of LPDDR5X RAM. You get up to 1TB of UFS 4.0 inbuilt storage on the OnePlus 13, and it can't be expanded via a storage card.Top 10 Things to Know About Qualcomm's New Snapdragon 8 Elite Chip\r\n\r\nLike its predecessor, the OnePlus 13 is equipped with a triple rear camera setup that is tuned by Hasselblad. It comprises a 50-megapxiel primary camera with OIS and an f/1.6 aperture, a 50-megapixel ultrawide camera with an f/2.2 aperture, and a 50-megapixel periscope telephoto camera (3x optical, 6x in-sensor, 120x digital) with OIS and an f/2.6 aperture. On the front, there's a 32-megapixel camera with an f/2.4 aperture.\r\n\r\nThe handset is equipped with dual stereo speakers and four microphones. Connectivity options on the OnePlus 13 include 5G, 4G LTE, Wi-Fi 7, Bluetooth 5.4, NFC, dual band GPS, and a USB 3.2 Gen 1 Type-C port. It features a proximity sensor, ambient light sensor, colour temperature sensor, e-compass, accelerometer, gyroscope, hall sensor, laser focus sensor, and a spectral sensor.\r\n\r\nThere's an ultrasonic fingerprint scanner under the display of the OnePlus 13, for biometric authentication. It packs a 6,000mAh battery with 100W Flash Charge (wired) and 50W Flash Charge (wireless) support. The handset also supports reverse wired (5W) and reverse wireless (10W) charging.\r\n\r\nThe OnePlus 13 has an infrared (IR) transmitter, which can be used to control appliances. It has IP68 and IP69 certifications for dust and water resistance. The OnePlus 13 measures 162.9x76.5x8.9mm and weighs 210g (leather finish) while the glass finish has a thickness of 8.5mm and weighs 213g.\r\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "OnePlus 13 has been launched in China and the company's new flagship phone is powered by a Snapdragon 8 Elite chip, along with up to 24GB of RAM and up to 1TB of storage. it sports a 6.82-inch AMOLED...",
        "url": "https://www.gadgets360.com/mobiles/news/oneplus-13-price-launch-sale-specifications-features-6914905",
        "image": "https://i.gadgets360cdn.com/large/oneplus_13_main_1730372368366.jpg",
        "video": null,
        "publish_date": "2024-10-31 11:13:57",
        "author": "David Delima",
        "authors": [
            "David Delima"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.203
    },
    {
        "id": 261834044,
        "title": "The importance of Deepawali",
        "text": "Er. Prabhat Kishore\n\nIndia is the land of festivals. Deepawali or Diwali is one of them, which is celebrated on the Amavasya of Kartik Krishna Paksha. The Shanti Mantra from Brihadaranyaka Upnishad “Tamso Ma Jyotirgamya” i.e. “Lead me from darkness to light” reveals its spiritual spirit.\n\nDeepawali is a 5-day long festival, which starts from Dhanteras and ends on Bhaiya Duj. Deepawali is mentioned in Padma Puran and Skand Puran. It is composed of two Sanskrit words “Deep” i.e. light or candle and meaning that which glows, illuminates or knowledge and “Awali” i.e. rows or series. Thus Deepawali means “Rows of Lights” or “Festival of Lights”.\n\nThe first day, Dhanvantari Trayodoshi or Dhanteras is celebrated to commemorate the arrival of Devi Lakshmi from KshirSagar (Ocean) during the Samudra Manthan (churning of the cosmic ocean of milk) by the Devtas and Asuras to receive the Amrit (nector). On this day, Bhagwan Dhanvantari also came out of the ocean with Ayurved for mankind. Bhagwan Kuber, the lord of wealth is also worshipped. Shopping for new items on this day is considered auspicious.\n\nChhoti Diwali, also termed as Narak Chaturdashi or Roop Chaudash, is the second day of the festival. It is celebrated because Bhagwan Krishna and his wife Satyabhama had killed demon king Narkasur of Pragjyotish and released nearly 16000 girls from demon's captivity. It is also believed that Devi Kali had made Narkasur disappear.\n\nOn the third day, the main Diwali is celebrated with great enthusiasm all over the world. Devi Lakshmi and Bhagwan Ganesh are worshiped together to achieve the blessing of wealth & prosperity and the triumph of good over evil and light over darkness. According to mythology, once Goddess Lakshmi was proud of herself that the whole world worships her and yearns to get her. Lord Vishnu understood this feeling of his conscience and with the aim of breaking Lakshmi's pride, he said that Goddess, even though the whole universe yearns to have you, you are not yet complete. Lakshmiji narrated her woes to her friend Parvatiji and asked her to adopt Ganesh, one of her two sons. Lakshmiji adopted Ganesh with the consent of Parvatiji and since then Ganesh was came to be called the adopted son of Devi Lakshmi. Being very pleased Devi Lakshmi gave a boon to Ganesh that I will fulfill the wishes of the devotees only when they will worship you along with me. For this reason, there is a law to worship Ganesh along with Lakshmi in Diwali. Bhagwan Kuber is also worshiped by the devotees on this auspicious day.\n\nThere are several beliefs behind this festival. In Treta Yug, Raja Ramchandra along with Sita, Lakshman & Hanuman returned to Ayodhya from Lanka on this day after victory over Ravan and people celebrated the occasion by lighting Deeyas and decorating Rangolis. On this auspicious day the Nirvan Diwas of Bhagwan Mahavir, 24th Tirthankar of Jain, is observed by the followers of Jainism. The Sikh community celebrates this day to mark the release of Guru Hargovind ji Maharaj from Mugal prison and his arrival at the Holy Swarnmandir, Amritsar.\n\nThe fourth day is the Govardhan Puja or Padwa. Bhagwan Krishna had lifted the Govardhan parvat and held it up to protect the people and cattle from the rain & thunder produced by the angry Indra. When Indra conceded defeat, on the request of Krishna, the people of Brajbhoomi started performing the Govardhan Puja.\n\nBhaiya Duj or Bhai Teeka is the fifth and last day of Diwali. This day is dedicated to sisters. Yamraj (the lord of death) had visited his sister Yamuna on this day and gave her a vardhan (boon) that whoever visits his sister on this day will be liberated from all sins and will achieve Moksha or final emancipation. As per another belief, Krishna had visited his sister Subhadra after defeating Narakasur, who welcomed him with a tilak on his forehead.\n\nThe festival of Deepawali not only has religious or spiritual significance, but it also has scientific importance. The clay Deeyas with oil and cotton wick are eco-friendly and do not leave any harmful residue. During monsoon, the air is moist and full of bacteria & fungus. The heat generated from the Deeya destroys the bacteria, insects, fungus and thus cleans the air. The magnesium present in the Deeya's oil reacts with harmful Sulphur and Carbon Dio-oxide present in the air to form Sulphate and Carbonates and purify the environment.\n\nThe Panch Tatwa (five elements of the universe)-Kshiti (Earth), Jal (Water), Pawak (Fire), Gagan (Sky) & Sameer (Air)- is represented by the Deeya. The Earth element is represented by the clay Deeya, oil & cotton wick, Water is produced during the combustion of oil, Fire by the light generated, Sky by the light around the flame, and Air is the oxygen diffused to the wick.\n\nDeepawali is the season of celebration and there is joy, light and happiness everywhere around us. It illuminates the houses and hearts and spread the message of friendship and togetherness.\n\n(Author is a technocrat \n\nand academician)",
        "summary": "Er. Prabhat Kishore India is  the land of festivals. Deepawali or Diwali is one of them, which is celebrated on the Amavasya of Kartik Krishna Paksha. The Shanti Mantra from Brihadaranyaka  Upnishad “Tamso  Ma Jyotirgamya” i.e. “Lead me from darkness to light” reveals its spiritual spirit. Deepawali is a 5-day long festival, which starts from [&#8230;]\n\n\nThe post The importance of Deepawali appeared first on Northlines.",
        "url": "https://thenorthlines.com/the-importance-of-deepawali-2/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/significance-of-diwali-1.jpg",
        "video": null,
        "publish_date": "2024-10-31 16:40:39",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.209
    },
    {
        "id": 261512810,
        "title": "Broker’s call: Tata Technologies (Reduce)",
        "text": "Target: ₹740\n\nCMP: ₹999.85\n\nTata Technologies’ Q2-FY25 earnings call aptly summarises the concerns highlighted in our ‘Know the cycle’ thematic report on automotive ER&D. Management believes the strategic consideration between electric vehicles (EVs) and hybrids led by polarised policy positioning ahead of the US presidential elections, and regulatory concerns related to Chinese OEMs and associated tariff in the Europe is leading to decision-making delay, tapering of demand, and smaller deal sizes as customers are cautious to committing larger, long-term projects.\n\nThis likely reflects a shift from accelerated adoption to protectionism and pricing pressure which in-turn could moderate capex intensity, a key rationale for our reduce rating. \n\nDespite challenges in the services business, Tata Technologies believes that stable anchor accounts, traction in the aerospace segment supported by recent Airbus accreditations, ramp-up in BMW and Agratas deals and the strength in education are key growth drivers which could help offset near-term challenges while clarity in automotive business could emerge early next year. \n\nUpside risks to our estimates and rating include EV recovery-led growth in the automotive business which, in turn, could help achieve long-term margin aspiration.",
        "summary": "InCred Equities",
        "url": "https://www.thehindubusinessline.com/markets/brokers-call-tata-technologies-reduce/article68810430.ece",
        "image": "https://bl-i.thgim.com/public/news/r7r5u2/article68810468.ece/alternates/LANDSCAPE_1200/Bl30_Tata%20Technologies_new.jpg",
        "video": null,
        "publish_date": "2024-10-29 11:39:48",
        "author": null,
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": -0.106
    },
    {
        "id": 261661846,
        "title": "iQOO 13 With Snapdragon 8 Elite SoC, 120W Fast Charging Launched",
        "text": "iQOO 13 was launched in China on Wednesday. The smartphone comes with Qualcomm's latest Snapdragon 8 Elite SoC paired with up to 16GB of RAM and up to 1TB of onboard storage. The company packs its in-house Q2 gaming chip in the phone as well. It ships with Android 15-based OriginOS 5 skin on top. The handset comes with a 50-megapixel triple rear camera unit and a 32-megapixel selfie shooter. The phone is confirmed to launch in India in soon.\r\n\r\niQOO 13 Price, Availability\r\n\r\niQOO 13 price in China starts at CNY 3,999 (roughly Rs. 47,200) for the 12GB + 256GB option, while the 12GB + 512GB variant is priced at CNY 4,499 (roughly Rs. 53,100). The 16GB RAM versions with 256GB, 512GB, and 1TB storage options are listed at CNY 4,299 (roughly Rs. 50,800), CNY 4,699 (roughly Rs. 55,500), and CNY 5,199 (roughly Rs. 61,400), respectively. \r\n\r\nThe phone is available for purchase via the Vivo China e-store and is offered in four colour options — Isle of Man, Legendary Edition, Nardo Grey, and Track Edition (translated from Chinese).iQOO 13 Will Be Available in India via Amazon; to Feature a Halo Light\r\n\r\niQOO 13 Specifications, Features\r\n\r\nThe iQOO 13 sports a 6.82-inch 2K (1,440 x 3,168 pixels) BOE Q10 8T LTPO 2.0 OLED display with up to 144Hz refresh rate and HDR support. The phone is powered by a Snapdragon 8 Elite SoC paired with up to 16GB LPDDR5x RAM and 1TB UFS 4.0 onboard storage. The phone carries a Q2 gaming chipset and runs on Android 15-based OriginOS 5 out-of-the-box.\r\n\r\nIn the camera department, the iQOO 13 gets a triple rear camera unit, including a 50-megapixel primary sensor with optical image stabilisation (OIS), a 50-megapixel sensor paired with a telephoto lens, and a 50-megapixel ultra-wide shooter with OIS support. The rear camera module has a customisable “Energy Halo” LED around it with support for six dynamic effects and 12 colour combinations. The front camera of the handset holds a 32-megapixel sensor. \r\n\r\niQOO 13 houses a 6,150mAh battery with 120W wired fast charging support. For security, the phone has an in-display ultrasonic fingerprint sensor. The handset comes with IP68 and IP69 ratings for dust and water resistance. Connectivity options include 5G, 4G LTE, Wi-Fi 7, Bluetooth 5.4, NFC, GPS, and a USB Type-C port.\r\n\r\nThe Isle of Man, Legendary Edition, and Nardo Grey variants of the iQOO 13 measure 163.37 x 76.71 x 8.13mm in size and weigh 213g, while the Track Edition measures 7.99mm in thickness and weighs 207g.\r\n\r\nAffiliate links may be automatically generated - see our ethics statement for details.",
        "summary": "iQOO 13 was launched in China on Wednesday. The smartphone comes with Qualcomm's latest Snapdragon 8 Elite SoC paired with up to 16GB of RAM and up to 1TB of onboard storage. The company packs...",
        "url": "https://www.gadgets360.com/mobiles/news/iqoo-13-price-specifications-features-launch-china-6908361",
        "image": "https://i.gadgets360cdn.com/large/iqoo_13_iqoo_1_1730287219043.jpg",
        "video": null,
        "publish_date": "2024-10-30 12:08:24",
        "author": "Siddharth Suvarna,Sucharita Ganguly",
        "authors": [
            "Siddharth Suvarna",
            "Sucharita Ganguly"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.327
    },
    {
        "id": 261660576,
        "title": "Ayushmann Khurrana, Rashmika Mandanna team up for Dinesh Vijan’s horror-comedy ‘Thama’",
        "text": "After the blockbuster success of ‘Stree 2’, producer Dinesh Vijan announced his new horror-comedy film titled ‘Thama’, which will be headlined by Ayushmann Khurrana and Rashmika Mandanna.The film is set to be released in theatres on Diwali 2025 and it will also feature Paresh Rawal and Nawazuddin Siddiqui.Sharing the announcement teaser of the project, production banner Maddock Films took to Instagram and wrote, “Dinesh Vijan’s Horror Comedy Universe needed a love story… unfortunately, it’s a bloody one. Brace yourselves for #Thama – Diwali 2025! “\n\nView this post on Instagram\n\nThe text in the video read, “This universe needed a love story, unfortunately, it’s a bloody one.”‘Munjya’ fame director Aditya Sarpotdar has come on board to helm the film. Dinesh Vijan will produce ‘Thama’ with Amar Kaushik.The film is written by Niren Bhatt, Suresh Mathew and Arun Fulara. Meanwhile, Ayushmann will also be seen sharing screen space with Sara Ali Khan in a yet-to-be titled film. Rashmika, on the other hand, has ‘Sikandar’ with Bollywood superstar Salman Khan in the pipeline.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/ayushmann-khurrana-rashmika-mandanna-team-up-for-dinesh-vijans-horror-comedy-thama/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/ayushmann-khurrana-rashmika-mandanna-team-up-for-dinesh-vijans-horror-comedy-thama.jpg",
        "video": null,
        "publish_date": "2024-10-30 12:33:51",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.259
    },
    {
        "id": 261753922,
        "title": "Honor Magic 7, Magic 7 Pro With Snapdragon 8 Elite SoCs Launched",
        "text": "Honor Magic 7 and Honor Magic 7 Pro were launched in China on Thursday. The smartphones are powered by Qualcomm's newest octa-core Snapdragon 8 Elite chipsets paired with up to 16GB of RAM. They feature triple rear camera units including telephoto shooters and carry 50-megapixel front cameras. The handsets come with IP68 and IP69 ratings for dust and water resistance. Both Honor Magic 7 and Magic 7 Pro support 100W wired and 80W wireless fast charging and run on Android 15-based MagicOS 9.0 skin out-of-the-box. \r\n\r\nHonor Magic 7, Honor Magic 7 Pro Price, Colour Options\r\n\r\nHonor Magic 7 price starts in China at CNY 4,499 (roughly Rs. 53,100) for the 12GB + 256GB option, while the 12GB + 512GB variant is listed at CNY 4,799 (roughly Rs. 56,700). The 16GB + 512GB and 16GB + 1TB configurations are marked at CNY 4,999 (roughly Rs. 59,000) and CNY 5,499 (roughly Rs. 64,900), respectively.\r\n\r\nMeanwhile, the Honor Magic 7 Pro is available at a price of CNY 5,699 (roughly Rs. 67,300) for the 12GB + 256GB option, while the 16GB + 512GB and 16GB + 1TB versions are priced at CNY 6,199 (roughly Rs. 73,200) and CNY 6,699 (roughly Rs. 79,100), respectively.Circle to Search Comes to Honor 200 Series Phones via New Update\r\n\r\n\r\n\r\nHonor Magic 7 Pro is offered in Moon Shadow Gray, Snow White, Sky Blue, and Velvet Black colourways\r\nPhoto Credit: Honor\r\n\r\n\r\n\r\nThe base Honor Magic 7 comes in five colour options — Morning Glow Gold, Moon Shadow Gray, Snow White, Sky Blue, and Velvet Black (translated from Chinese). The Pro variant is offered in Moon Shadow Gray, Snow White, Sky Blue, and Velvet Black (translated) shades. The phones are currently available for pre-order in China via the Honor website and will go on sale starting November 8.Honor Unveils Android 15-Based MagicOS 9.0 With These Features\r\n\r\nHonor Magic 7, Honor Magic 7 Pro Specifications, Features\r\n\r\nThe Honor Magic 7 sports a 6.78-inch full-HD+ (1,264 x 2,800 pixels) LTPO OLED screen with up to 120Hz refresh rate, 1,600 nits of global peak brightness, and TÜV Rheinland certifications for eye protection. Meanwhile, the Honor Magic 7 Pro has a 6.8-inch full-HD+ (1,280 x 2,800 pixels) LTPO OLED display with similar features.\r\n\r\nBoth Honor Magic 7 series phones are powered by octa-core Snapdragon 8 Elite chipsets paired with up to 16GB of RAM and up to 1TB of onboard storage. They ship with Android 15-based MagicOS 9.0 skin on top.\r\n\r\nIn the camera department, the Honor Magic 7 and Magic 7 Pro are equipped with 1/1.3-inch 50-megapixel primary sensors and 50-megapixel secondary ultra-wide shooters. The vanilla model carries a 50-megapixel telephoto camera with 3x optical zoom, while the Pro variant has a 200-megapixel periscope telephoto camera with 3x optical zoom. The front cameras on both handsets have 50-megapixel sensors.\r\n\r\nThe Honor Magic 7 is backed by a 5,650mAh battery, while the Magic 7 Pro packs a 5,850mAh cell. They support 100W wired and 80W wireless fast charging. Both handsets come with IP68 and IP69 ratings for dust and water resistance. For security, they carry in-display ultrasonic fingerprint sensors. Connectivity options for the lineup include dual 5G, dual 4G VoLTE, Wi-Fi 7, Bluetooth 5.4, GPS, AGPS, GLONASS, BeiDou, Galileo, NFC and a USB Type-C port.",
        "summary": "Honor Magic 7 and Honor Magic 7 Pro were launched in China on Thursday. The smartphones are powered by Qualcomm's newest octa-core Snapdragon 8 Elite chipsets paired with up to 16GB of RAM. The phones...",
        "url": "https://www.gadgets360.com/mobiles/news/honor-magic-7-pro-price-specifications-features-series-launch-china-6913053",
        "image": "https://i.gadgets360cdn.com/large/honor_magic_7_honor_1730349979321.jpg",
        "video": null,
        "publish_date": "2024-10-31 05:29:57",
        "author": "Siddharth Suvarna,Sucharita Ganguly",
        "authors": [
            "Siddharth Suvarna",
            "Sucharita Ganguly"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.183
    },
    {
        "id": 261758944,
        "title": "Pixel 11a, Pixel Tablet 3 to Feature Less Capable Tensor G6 Chip: Report",
        "text": "Google Pixel 11a could arrive in 2027 as a midrange phone in the company's Pixel A-series, and the handset will reportedly be equipped with the Tensor G6 chip that is expected to debut in 2026 with the Pixel 11 series. This processor is also expected to power the Pixel Tablet 3, which is also expected to launch in 2027. A new report claims that the Pixel 11a and Pixel Tablet 3 will feature a less capable version of the Tensor G6 chip, in order to keep costs low.\r\n\r\nGoogle Pixel 11a, Pixel Tablet 3 Could Arrive With Less Capable Tensor G6 Chip in 2027\r\n\r\nCiting leaked documents from Google's G-Chips division, Android Authority reports that Google plans to launch four devices as part of the Pixel 11 series — \"Base '26\", \"Premium' 26\", \"Fold '26\" and an \"Entry Phone '27\". These could refer to the Pixel 11, Pixel 11 Pro, Pixel 11 Pro Fold, and Pixel 11a, respectively.\r\n\r\nThe numbers listed above also suggest that the Pixel 11a could be launched in mid 2027, in line with Google's current practice of introducing a new midrange handset six months after its latest Pixel phones are unveiled.Pixel 9a Tipped to Sport 6.3-Inch Screen, 48-Megapixel Camera in New Leak\r\n\r\nThe report states that while all four handsets in the Pixel 11 series will be equipped with a Tensor G6 chip, the Pixel 11a and the Pixel Tablet 3 — referred to as “Tablet Pixel ‘27” — will be equipped with a less powerful version of the chip.\r\n\r\nWhile Google's current Pixel A-series phones feature Tensor chips with different packaging in order to keep costs low, the publication claims that this will not be possible once the company's chips are produced by TSMC next year.\r\n\r\nInstead, Google will reportedly \"fuse off defective parts of the TPU\" that will allow it to use those chips on the Pixel 11a and Pixel Tablet 3. As a result, these devices are unlikely to be as capable of handling AI tasks as the company's more expensive products.Google Could Make a Long-Overdue SoC Switch With Pixel Watch 5 in 2026\r\n\r\nGoogle's Pixel Tablet 3 Might Offer More Connectivity Options\r\n\r\nThe publication also claims that the Tensor G6 chip on the Pixel Tablet 3 will be equipped with a second USB Type-C port controller. The company is expected to enable support for more expansion options for its tablet, allowing power users to use the tablet for additional functionality.\r\n\r\nGoogle's first-generation Pixel Tablet is equipped with a standard USB 2.0 Type-C port, but it also offers USB 2.0 connectivity via the pogo interface used to dock the tablet. According to the report, the Pixel Tablet 3 will include support for a new USB 3.2 port that will also support DisplayPort output, which could also come in handy for advanced users.\r\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "Google Pixel 11a is expected to be launched in 2027 alongside the Pixel Tablet 3 and both of these devices will reportedly feature Google's Tensor G6 chip, but a new report suggests these processors...",
        "url": "https://www.gadgets360.com/mobiles/news/google-pixel-11a-tablet-3-tensor-g6-chip-plans-report-6913423",
        "image": "https://i.gadgets360cdn.com/large/google_pixel_9_pro_xl_main_big_gadgets_360_1725976042164.jpg",
        "video": null,
        "publish_date": "2024-10-31 06:18:22",
        "author": "David Delima",
        "authors": [
            "David Delima"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": -0.069
    },
    {
        "id": 261146630,
        "title": "IIHR licences new technology to industry",
        "text": "Technology to make chocolates from jackfruit seeds, vertical farming model and new varieties of okra and marigold were among the new products/technologies that were licenced by the ICAR-Indian Institute of Horticulture Research, Bengaluru on Thursday. \n\nAlso, an MoU to develop smart packages for crops such as chilli and okra was signed between IIHR and the Pune-based Maharashtra Agribusiness Network (MAGNET) Society.\n\nIIHR had organised the second industry meet on Thursday and the event was aimed to bridge the gap between the industry and the academia, offering a platform to share insights and experiences related to entrepreneurship in various aspects of horticulture. \n\nAlso read: 13 high yielding fruit and vegetable varieties developed by IIHR to be released by PM Modi tomorrow\n\nSenior officials of the ICAR institutes, NABARD, industry representatives, incubates of ICAR-IIHR, scientists, technical staff and students participated in the event, according to a statement. \n\nT K Behera, Director, ICAR-IIHR, Bengaluru, emphasized the importance of technology dissemination and sustainability. Even though there is significant increase in the production of agri-horticulture commodities, there is need to take steps for enhancing productivity. \n\n“There is need to supply nutritive food to the nation through inclusive efforts of both public-private organizations. Over the years IIHR, technologies and licencing to various firms have been increased and there is tremendous scope for further partnerships to reach farmers and other stakeholders of IIHR technologies and services,” he said. \n\nV.B. Patel, ADG, Horticulture Division, ICAR, New Delhi, called for joint research and potential collaborations with private firms and urged for utilization of varieties, breeding lines and other technologies of ICAR-IIHR to benefit farmers. \n\nAlso read: IIHR develops multiple disease-resistant chilli varieties\n\nK.G. Jagadeesha, IAS, CEO & Secretary, Coffee Board, called for one more revolution in the field of Agri-Horticulture, for sustained supply of healthy, residue free and environmentally friendly produce, which is possible through public private partnerships. \n\nVishnuvardhana, Vice Chancellor University of Horticultural Sciences, Bagalkot, opined that public and private organizations should collaborate in the fields of teaching, research, education and entrepreneurship to bring translational research and human resources to ensure food and nutritional security of the country. \n\nU S Gautam, Deputy Director General, ICAR applauded efforts of ICAR-IIHR in conducting the industry meet at its campus, Bengaluru and thereby ensuring the reach of research output to the stakeholders including farmers. \n\nAn exhibition was also arranged at the event displaying the products and technologies developed by ICAR institutes and the industry.",
        "summary": "Also, an MoU to develop smart packages for crops such as chilli and okra was signed between IIHR and the Pune-based Maharashtra Agribusiness Network (MAGNET) Society",
        "url": "https://www.thehindubusinessline.com/economy/agri-business/iihr-licences-new-technology-to-industry/article68795979.ece",
        "image": "https://bl-i.thgim.com/public/incoming/rt4c42/article68795964.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202024-10-24%20at%2016.55.22.jpeg",
        "video": null,
        "publish_date": "2024-10-26 03:59:08",
        "author": null,
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": -0.205
    },
    {
        "id": 261209648,
        "title": "String Metaverse Revolutionizes Web3 with AI-Blockchain Fusion",
        "text": "Hyderabad: String Metaverse, a pioneering Web3 innovator, announces a groundbreaking fusion of artificial intelligence (AI) and blockchain technology, transforming the digital economy. The Singularity of AI and Blockchain This synergy will create a multitrillion-dollar Metaverse economy where autonomous AI agents seamlessly transact with humans on Web3. String Metaverse's \"Agentic Economy\" enables self-learning AI agents to interact with humans and other AIs using cryptocurrency. Key Features 1. Agent-to-human and agent-to-agent commerce 2. Generative AI-powered digital community commerce 3. AI agents writing smart contracts with crypto wallets for autonomous transactions 4. Real-world asset tokenization with transparency 5. Blockchain-enabled user monetization Regulatory Milestones: String Metaverse has secured significant UAE regulatory approvals: 1. AI License: Granted by RAKDAO (Ras Al Khaimah Digital Assets Oasis) 2. Blockchain Node Operator License: Authorized by RAKDAO 3. DEpin License: Awarded by RAKDAOThese licenses solidify String Metaverse's commitment to regulatory compliance, paving the way for AI-Blockchain innovations in the UAE. String Metaverse's Vision \"We believe future AI agents will autonomously transact with humans and other AI agents, revolutionizing commerce,\" said Krishna Mohan, Founder. Corporate Update String Metaverse LTD has merged with BIO Green Papers LTD under IBC CIRP and will commence trading on the Bombay Stock Exchange (BSE) from October 31, 2024, under the scrip code 534535. The company name change to String Metaverse LTD is pending approval from the Registrar of Companies (ROC).",
        "summary": "This synergy will create a multitrillion-dollar Metaverse economy where autonomous AI agents seamlessly transact with humans on Web3",
        "url": "https://www.deccanchronicle.com/technology/in-other-news/string-metaverse-secures-uae-regulatory-approvals-1833368",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/26/1856565-string.webp",
        "video": null,
        "publish_date": "2024-10-26 18:18:29",
        "author": "DC Correspondent",
        "authors": [
            "DC Correspondent"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.678
    },
    {
        "id": 260646584,
        "title": "Elon Musk Hands Out Cash, Makes False Claims On Pennsylvania Tour",
        "text": "For four days billionaire Elon Musk toured Pennsylvania, putting his money and fame into helping Republican Donald Trump's campaign to take back the White House in November.Musk drew praise from conservatives at his rallies while fielding questions about artificial intelligence, government regulation, sentient robots and vaccines.He also made a string of false claims about election fraud, some of them echoing those made by Trump the last four years.The CEO of Tesla and SpaceX and owner of the X social media platform, Musk also handed out two $1 million checks to randomly picked people who signed his online petition backing US constitutional rights to freedom of speech and bear arms.Musk, 53, has more than a passing interest in Trump's success. If reelected, Trump promises to make Musk head of a government efficiency commission, a job Musk vows will help rid the country of regulations he views as bad for the economy and a deterrent to doing business.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");CASHMusk shocked a crowd of roughly 1,500 at a nondenominational church in the Pennsylvania capital of Harrisburg on Saturday when he announced he was giving away $1 million. The first winner was John Dreher, who rushed to the stage in a signature red MAGA cap, pumping his arms in the air.\"I've been following you for 10 years, got your biography 10 years ago and been watching ever since,\" Dreher said to Musk.On Sunday, Musk awarded another $1 million check to Kristine Fishell, who appeared stunned as her name was called and she took the stage in a red Trump T-shirt.\"Thank you so much for ... I mean I truly believe everything you're doing, truly. You don't need to be doing it, I know a lot of us feel the same way.\"Musk said the winners are picked randomly but must have signed his petition and be registered voters in the battleground states that will decide November's election, such as Pennsylvania, Georgia and Arizona.His handouts have stirred legal questions.CONSPIRACIESMusk has also embraced conspiracy theories pushed by Trump, and is spinning some of his own.He revived false theories claiming that voting machines rig elections - an assertion that has been repeatedly debunked since it was pushed by those seeking to overturn Trump's 2020 loss.He mentioned Dominion Voting Systems, which last year sued Fox News for defamation over false claims that the company engaged in a vote-rigging conspiracy. Dominion agreed to a landmark $787 million settlement with the network.\"There's always a sort of question of like, say, the Dominion voting machines. It is weird that the, you know, I think they're used in Philadelphia and in Maricopa County (Arizona), but not in a lot of other places.\"In a statement, Dominion pointed to inaccuracies in Musk's comments, including the fact they don't operate in Philadelphia.Musk also accused Democrats of channeling vast numbers of migrants who enter the US illegally into battleground states.Presenting no evidence, he alleged that Harris would legalize the migrants after the election if she wins, giving Democrats clear majorities in those states.The Harris campaign did not immediately respond to requests for comment. Similar claims have been debunked in the past.'POST THE EVIDENCE'For many at the events, the idea the 2020 election was stolen from Trump was taken as fact despite a lack of evidence.One attendee in Harrisburg asked Musk what he was doing to prevent a recurrence. Musk responded by leaning into the unfounded allegations.\"I mean if the margin of victory is high enough, then I think it can exceed any sort of cheating that may take place. So we're going to aim for just a massive margin,\" Musk said.He encouraged people to use his X platform, formerly known as Twitter, to shine a spotlight on potential election cheating.\"If people think there's a fraud, then they should post the images, post the videos, post the evidence,\" he said.SHARKS AND WHALESMusk has millions of dollars in government contracts and his companies face significant and at times costly government regulations which typically are designed to protect things like consumers, drinking water and wildlife.Musk was asked if in such a job he would take a flamethrower to stacks of regulations and post a video of it. \"I think a bonfire of nonsense regulations would be epic,\" Musk said.Musk recounted how SpaceX was forced to conduct a study to determine whether his rockets would hurt sharks when landing in the water.\"I'm like, it's a big ocean, you know, there's a lot of sharks. It's not impossible, but it's very unlikely,\" Musk said.Reluctantly, they conducted the study only to be told to do a similar review on potential threats to whales, Musk said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
        "summary": "For four days billionaire Elon Musk toured Pennsylvania, putting his money and fame into helping Republican Donald Trump's campaign to take back the White House in November.",
        "url": "https://www.ndtv.com/world-news/elon-musk-hands-out-cash-makes-false-claims-on-pennsylvania-tour-6847477",
        "image": "https://c.ndtvimg.com/2024-10/nihm36r8_elon-musk_625x300_22_October_24.jpeg",
        "video": null,
        "publish_date": "2024-10-22 11:29:33",
        "author": "Reuters",
        "authors": [
            "Reuters"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": -0.046
    },
    {
        "id": 260604008,
        "title": "OnePlus 13 Will Launch With Snapdragon 8 Elite Chipset",
        "text": "Qualcomm unveiled its long-awaited Snapdragon 8 Elite mobile SoC during its Summit 2024 event in Maui on Monday. Shortly after the launch, OnePlus officially announced that its upcoming OnePlus 13 will run on the new mobile platform. The flagship smartphone is set to go official on October 31 in China. The latest Android processor will power the next set of flagships from other OEMs like Xiaomi, Honor and iQOO.\r\n\r\nThrough its official Weibo account and Community forum, OnePlus confirmed that the OnePlus 13 will feature Qualcomm's new Snapdragon 8 Elite SoC. The chipset will be paired with up to 24GB of LPDDR5x RAM and up to 1TB of UFS 4.0 storage. OnePlus will hold an event in China on October 23 at 4:00pm (1:30pm IST) to reveal more details regarding its association with Snapdragon.\r\n\r\nThe Snapdragon 8 Elite chipset is built on TSMC's 3nm process and promises 44 percent improved power efficiency over its predecessor. It features an Oryon CPU with a custom eight-core structure with prime cores clocked at 4.32GHz and performance cores with a peak frequency of 3.53GHz. The new chipset is promised to deliver up to 45 percent improvements in CPU performance and 40 percent GPU performance improvements. It is paired with an Adreno GPU.iQOO 13 Launch Confirmed for October; Specifications Teased\r\n\r\nBesides OnePlus, other OEMs including Xiaomi, Realme and iQOO will utilise the chip for upcoming flagships like Xiaomi 15, iQOO 13, and Realme GT 7 Pro.\r\n\r\nOnePlus 13 Specifications Teased \r\n\r\nMeanwhile, OnePlus is actively teasing the OnePlus 13 on the Web. It will arrive in Black Obsidian Secret Realm, Blues Moment, and White Dew Morning Dawn (translated from Chinese) colour options. It will ship with ColorOS 15 and offer 50W wireless charging support.\r\n\r\nLaunch of OnePlus 13 is already scheduled to take place in China on October 31 at 4:00pm local time (1:30pm IST). The handset is currently up for pre-orders in China through the company's official store.Qualcomm Launches Snapdragon 8 Elite Flagship Chipset for Mobile Device\r\n\r\n\r\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "Qualcomm unveiled its long-awaited Snapdragon 8 Elite mobile SoC during its Summit 2024 event in Maui on Monday. Shortly after the launch, OnePlus officially announced that its upcoming OnePlus 13...",
        "url": "https://www.gadgets360.com/mobiles/news/oneplus-13-snapdragon-8-elite-soc-teasers-colourway-specifications-weibo-6844774",
        "image": "https://i.gadgets360cdn.com/large/oneplus_13_1729574738420.jpg",
        "video": null,
        "publish_date": "2024-10-22 06:28:24",
        "author": "Siddharth Suvarna",
        "authors": [
            "Siddharth Suvarna"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": -0.037
    },
    {
        "id": 260615546,
        "title": "Honor Magic 7 Series to Arrive With Snapdragon 8 Elite Chip, AI Features",
        "text": "Honor Magic 7 series was teased on Monday at Snapdragon Summit 2024, Qualcomm's annual launch event for its next-generation flagship mobile chipset. The smartphone maker has confirmed that the Honor Magic 7 lineup will be equipped with the new Snapdragon 8 Elite processor that was unveiled by the chipmaker. Honor has also revealed some of the artificial intelligence (AI) capabilities of its upcoming smartphone, including an open ecosystem enabled by an on-device AI agent, and improved mobile gaming that uses the NPU for rendering graphics.\r\n\r\nHonor Magic 7 Series Confirmed to Feature Snapdragon 8 Elite Chip\r\n\r\nAt the ongoing Snapdragon Summit 2024, the smartphone maker announced that the Honor Magic 7 series will be powered by the Snapdragon 8 Elite chipset, which is equipped with second-generation custom Oryon CPU cores from Qualcomm, along with a dedicated Hexagon neural processing unit (NPU) and an upgraded AI image signal processor (ISP). The chipset will also power smartphones from Asus, iQOO, OnePlus, Oppo, Realme, Samsung, Vivo, and Xiaomi.\r\n\r\n\r\n\r\nHonor Magic 7 series will offer support for on-device AI functionality\r\nPhoto Credit: Qualcomm\r\n\r\n\r\n\r\nWhile the company didn't reveal any other specifications of the Honor Magic 7 series, its upcoming handsets appear to be designed to utilise the AI-related performance improvements on the new Snapdragon chipset.\r\n\r\nAccording to Honor, the Magic 7 series will offer access to an open ecosystem that uses an on-device AI agent dubbed Autopilot AI that can perform simple or complex tasks, such as placing an order with a restaurant, booking tickets, organising notifications, or automatically unsubscribing a user from various services — the company says that users will be able to trigger these actions using a voice command.\r\n\r\nFor users who play resource intensive games on their smartphones, the Honor Magic 7 series will offer support for real time AI graphics rendering, which is claimed to offer better image quality, while lowering the load on the phone's GPU.\r\n\r\nThe Honor Magic 7 series will be launched in China on October 30, and we will learn more details about the smartphone and the AI features it has to offer on that date. There's no word from the company on plans to launch the Magic 7 lineup in other markets, including India.\r\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "Honor Magic 7 series was teased on Monday during the Snapdragon Summit 2024, and the upcoming flagship phone from the company will feature the newly introduced Snapdragon 8 Elite chip. New artificial...",
        "url": "https://www.gadgets360.com/mobiles/news/honor-magic-7-series-specifications-ai-features-snapdragon-summit-2024-6845914",
        "image": "https://i.gadgets360cdn.com/large/honor_magic_7_qualcomm_youtube_1729584648178.jpg",
        "video": null,
        "publish_date": "2024-10-22 08:17:06",
        "author": "David Delima",
        "authors": [
            "David Delima"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.061
    },
    {
        "id": 260627226,
        "title": "Meta Testing Facial Recognition to Spot 'Celeb-Bait' Ad Scams",
        "text": "Meta announced that it's testing facial recognition technology to detect scam ads and assist users in faster account recovery on Monday. The social media giant is specifically targeting “celeb-bait” ad scams, where scammers use images of celebrities and public figures to lure users into interacting with the ad and clicking malicious links. Additionally, the Menlo Park-based tech giant is also testing using video selfies to let users quickly regain access to their compromised accounts. The company said it aims to proactively remove harmful content from its platforms to create a safer experience for users.\r\n\r\nMeta Testing Facial Recognition Technology\r\n\r\nIn a newsroom post, the social media giant detailed its approach to using facial recognition technology. Meta is currently working on using the technology in two ways — detecting “celeb-bait” ad scams and identity verification for quicker account recovery.\r\n\r\nHighlighting the issue of “celeb-bait” ad scams on Facebook and Instagram, the company said that scammers often use images of public figures to make users interact with ads. Users are asked to click on fraudulent links, and because of the trust factor of the celebrity, some fall for scams.Meta AI on WhatsApp Might Soon Be Able to Remember Your Preferences\r\n\r\nSo far, Meta has used the native ad review system to detect fake ads from legitimate ones. This system is based on machine learning and reviews millions of ads that run on its platforms. The automated system analyses the text, images, and videos featured in the ad. Now, to further bolster the system, the social media giant is testing facial recognition.\r\n\r\nThe company is currently using facial recognition on a limited scale to “compare faces in an ad to the public figure's Facebook and Instagram profile pictures.” In case a match is confirmed and it is determined that the ad is a scam, Meta said it will automatically block it. The technology is also being used to detect and block accounts that impersonate a public figure.\r\n\r\nCurrently, Meta is in early stages of testing and is using a small group of celebrities and public figures to check and improve the speed and efficacy of detection. “In the coming weeks, we'll start showing in-app notifications to a larger group of public figures who've been impacted by celeb-bait letting them know we're enrolling them in this protection,” the company added. Public figures who enrol in this protection will be allowed to opt out via Account Centre.Meta Unveils New Facebook Video Tab and AI-Powered Video Ad Tools\r\n\r\nFacial Recognition in Account Recovery\r\n\r\nMeta is also testing the use of facial recognition to help users regain access to compromised accounts. Many times, Meta's automated systems can flag an account incorrectly and lock it. This could be due to suspicious activity or if a hacker attempted to break into the user's account. Alternatively, proving identity is also necessary if users forget their account passwords. In such cases, users so far were asked to verify their identity by submitting a government identity card.\r\n\r\nNow, the social media giant is testing the use of video selfies to quickly let users regain access to their accounts. Users will have to upload a video selfie, and by running facial recognition technology, the company will compare the data to the profile pictures on the account they are trying to access.\r\n\r\nIn both use cases, Meta claims that it will not store any facial data generated after the comparison is made, regardless if there is a match or not. Additionally, in video selfies, the company stated that the video data will be encrypted and “will never be visible on their profile, to friends or to other people on Facebook or Instagram.”\r\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "Meta announced testing facial recognition technology to detect scam ads and assist users in faster account recovery on Monday. The social media giant is specifically targeting \"celeb-bait\" ad...",
        "url": "https://www.gadgets360.com/apps/news/meta-facial-recognition-celeb-bait-scam-ads-spotting-account-recovery-testing-6845762",
        "image": "https://i.gadgets360cdn.com/large/meta_facial_recognition_account_recovery_1729583383465.jpg",
        "video": null,
        "publish_date": "2024-10-22 09:03:30",
        "author": "Akash Dutta,Siddharth Suvarna",
        "authors": [
            "Akash Dutta",
            "Siddharth Suvarna"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": -0.3
    },
    {
        "id": 256755580,
        "title": "GACM Technologies, Waterwalk Automation ink MoU",
        "text": "GACM Technologies Limited, formerly known as Stampede Capital Limited, has entered into a memorandum of understanding (MoU) with Waterwalk Automation Private Limited. The ₹5 crore deal aims to generate growth-oriented revenue for GACM Technologies. The shares of GACM Technologies Limited were trading at ₹1.24 on the NSE at 11.20 am. The MoU, effective until March 31, 2026, is related to software development between the two companies. The company clarified this is not a related party transaction and there is no shareholding between the parties involved.",
        "summary": "₹5 crore deal aims to generate growth-oriented revenue for GACM Technologies",
        "url": "https://www.thehindubusinessline.com/markets/stock-markets/gacm-technologies-waterwalk-automation-ink-mou/article68658791.ece",
        "image": "https://bl-i.thgim.com/public/incoming/eya22e/article68658843.ece/alternates/LANDSCAPE_1200/IMG_iStock-813842420.jpg_2_1_8PA9R1DQ.jpg",
        "video": null,
        "publish_date": "2024-09-19 06:13:57",
        "author": null,
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": -0.643
    },
    {
        "id": 256828656,
        "title": "SN launches Journal of Transformative Technologies, Sustainable Development",
        "text": "Excelsior Correspondent JAMMU, Sept 19: A Journal of Transformative Technologies and Sustainable Development was launched by Springer Nature (SN) at Chitkara University, here today. This new journal aims to be a premier platform for cutting-edge research at the intersection of technology and sustainability, addressing some of the most pressing challenges facing the world today. The journal was launched by Dr. Madhu Chitkara, Pro Chancellor of Chitkara University, Dr. Fiona McKenzie, Vice President of Springer Journals, Suvira Srivastava and Teena Bedi from SN in presence of Dr. Rajnish Sharma, Vice Chancellor of Chitkara University. Speaking on the occasion, Dr. Fiona McKenzie said, “The journal will focus on high-quality, peer-reviewed research in areas such as renewable energy, climate change mitigation, circular economy, smart cities, and sustainable agriculture. We are thrilled to introduce this journal, which will serve as a vital platform for advancing knowledge and driving progress towards a sustainable future.” Dr. Madhu Chitkara said, “This journal is a reflection of Chitkara University’s dedication to research that not only advances academic knowledge but also drives practical solutions for global challenges. I commend Dr. Rajnish Sharma, our Editor-in-Chief, alongside Dr. Amit Mittal (Section Editor) and Dr. Sagar Juneja (Associate Editor), for their visionary leadership in shaping this initiative.” The Journal of Transformative Technologies and Sustainable Development is now open for submissions, and researchers across Disciplines are encouraged to contribute to this influential new publication, which promises to shape the future of sustainable innovation. Dr. Amit Mittal, Pro Vice Chancellor, Chitkara University, Punjab and Dr. Sagar Juneja were also present on the occasion.",
        "summary": "Excelsior Correspondent JAMMU, Sept 19: A Journal of Transformative Technologies and Sustainable Development was launched by Springer Nature (SN) at Chitkara University, here today. This new journal aims to be a premier platform for cutting-edge research at the intersection of technology and sustainability, addressing some of the most pressing challenges facing the world today. The journal was launched by Dr. Madhu Chitkara, Pro Chancellor of Chitkara University, Dr. Fiona McKenzie, Vice President of Springer Journals, Suvira Srivastava and Teena Bedi [&#8230;]\n\n\nThe post SN launches Journal of Transformative Technologies, Sustainable Development appeared first on Daily Excelsior.",
        "url": "https://www.dailyexcelsior.com/sn-launches-journal-of-transformative-technologies-sustainable-development/",
        "image": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2024/09/page9-1-13.jpg",
        "video": null,
        "publish_date": "2024-09-19 23:48:50",
        "author": "Daily Excelsior",
        "authors": [
            "Daily Excelsior"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.532
    },
    {
        "id": 256839676,
        "title": "Rashmika Mandanna teaches Telugu to Malaysian blogger Ms Kuan",
        "text": "Mumbai: A video has surfaced online in which actress Rashmika Mandanna was seen teaching the Telugu language to Malaysian blogger-model Kristinna Kuan also known as Ms Kuan. Taking to her Instagram Stories section, Kuan shared a video where she was seen sitting with Rashmika while taking Telugu classes from the actress. Ms Kuan mentioned in the video, “My new friend” while Rashmika speaks from back to say the same thing in the Telugu language. However, Kuan captioned the video, “My new friend Rashmika Mandanna (with a heart emoji) I'm learning Tamil guys. In the next story, she shared a candid picture with ‘India’s Srivalli’ as they shared a moment of happiness. She mentioned in the picture, “How our convo started Rashmika Mandanna”. Rashmika Mandanna is currently in Milan, Italy, attending the Onitsuka Tiger Show at Milan Fashion Week S5 2025. Rashmika was seen in a fiery black coat one-piece highlighting the furry collars with a pair of stockings while MsKuan opted black shirt-dress with black and white cool shoes. Rashmika Mandanna is currently on a huge spree, especially after the success of her 2023 revenge drama titled ‘Animal’ helmed by ‘Kabir Singh’ fame director Sandeep Reddy Vanga. In pivotal roles, the film featured Ranbir Kapoor, Rashmika Mandanna, Bobby Deol, Anil Kapoor, Shakti Kapoor, and Triptii Dimri. The actress is all geared up for her most anticipated film of 2024 ‘Pushpa 2: The Rule’ starring Allu Arjun and Fahadh Faasil in the lead roles. The action-thriller helmed by director Sukumar is a sequel to its first successor titled ‘Pushpa: The Rise’ which was released in the year 2021. The film is slated to release on the big screens on December 6, 2024, in Telugu, Tamil, Hindi, Malayalam and Kannada languages. Apart from this, the ‘Dear Comrade’ actress will also feature in Dhanush starrer- ‘Kubera’ helmed by director Sekhar Kammula which also features Akkineni Nagarjuna, Dalip Tahil and Jim Sarbh in pivotal roles. Rashmika is also currently prepping up for another big venture as she has been roped in for Superstar Salman Khan's upcoming big release titled ‘Sikandar' helmed by ‘Ghajini’ fame director AR Murugadoss. The film also features Kajal Aggarwal and Sathyaraj in crucial roles.",
        "summary": "Kuan shared a video on her Instagram Stories showing her sitting with Rashmika Mandanna, taking Telugu lessons from the actress. In the video, Kuan calls Rashmika her \"new friend,\" while Rashmika repeats the same phrase in Telugu from the background.",
        "url": "https://telanganatoday.com/rashmika-mandanna-teaches-telugu-to-malaysian-blogger-ms-kuan",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/09/Rashmika-Mandanna-takes-Malaysian-beauty-Christinna-Kuan-under-her-wing-for-Telugu-lessons.jpg",
        "video": null,
        "publish_date": "2024-09-20 04:20:44",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.544
    },
    {
        "id": 256965152,
        "title": "Rashmika Mandanna meets ‘special’ Donatella Versace",
        "text": "Mumbai: Indian actress Rashmika Mandanna, who was a guest at the Spring-Summer 2025 fashion show, posed with Italian fashion designer Donatella Versace and thanked her for showing what a powerhouse of a woman she is. Rashmika, who was a guest for the luxury label Versace’s fashion show, took to Instagram, where she shared a picture posted by Donatella on her Instagram handle. Donatella had posted a slew of images with personalities such as Hyunjinn, Lusi Zhao, Vittoria Ceretti, Mona Tougaard, Kun, Normani and Rashmika to name a few. For the caption, she wrote: “My house, my rules, my Versace after party! Love you all” Sharing her picture on her Instagram stories, Rashmika, who wore an ivory hued blazer dress, wrote: “donatella_versace what an absolute pleasure it was to have met you.. You are truly special! Thankyou for inspiring us and showing us what a powerhouse of a woman you truly are!” Donatella is the sister of Gianni Versace, founder of the luxury fashion company Versace, with whom she worked closely on the brand. After Gianni died in 1997, Donatella inherited a portion of the Versace brand and became its creative director. Recently, Rashmika shared details about her relatable “extreme personalities” involving working out at odd hours and days when she feels like “like couch potatoing”. She took to her Instagram stories, where she shared a picture of herself in bed and smiling at the camera. She then did a poll, which she captioned: “Do you all also have extreme personalities? For example: when you workout, you workout for 2/3hours a day even at the most odd hours..” “Or when you DON’T feel like working out you don’t workout for daaaaayyyyyysssss and just feel like couch potatoing and eating the most unhealthiest foods on the planets and watch some kdrama.” Rashmika will next be seen in “Pushpa 2: The Rule” starring Allu Arjun and Fahadh Faasil. The action-thriller helmed by director Sukumar is a sequel to its first successor titled ‘Pushpa: The Rise’ which was released in 2021. The film is slated to release on the big screens December 6, 2024, in Telugu, Tamil, Hindi, Malayalam and Kannada languages. IANS",
        "summary": "Mumbai: Indian actress Rashmika Mandanna, who was a guest at the Spring-Summer 2025 fashion show, posed with Italian fashion designer Donatella Versace and thanked her for showing what a powerhouse of a woman she is. Rashmika, who was a guest for the luxury label Versace’s fashion show, took to Instagram, where she shared a picture [&#8230;]",
        "url": "https://www.orissapost.com/rashmika-mandanna-meets-special-donatella-versace/",
        "image": "https://www.orissapost.com/wp-content/uploads/2024/09/Rashmika-Mandanna-Donatella-Versace.png",
        "video": null,
        "publish_date": "2024-09-22 07:06:33",
        "author": "Post News Network",
        "authors": [
            "Post News Network"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.618
    },
    {
        "id": 257017154,
        "title": "The expanding horizons of physiotherapy: Integrating technology with holistic care",
        "text": "The integration of new technologies is revolutionising physical therapy. Wearable sensors are enhancing the precision and effectiveness of physiotherapy Khyatee The critical role of physiotherapy in promoting workforce health, addressing sedentary lifestyle issues, correcting postural imbalances, and enhancing productivity is increasingly being recognised not only by the common man but also by the corporate sector.Needless to say, physiotherapy is a holistic approach that aids individuals in recovering, maintaining, and enhancing their mobility and overall well-being. This evolving field which is continually shaped by technological advancements and shifts in healthcare practices, enhances its effectiveness in patient care in different arenas. Expanding Roles in Mental Health: Physical therapists are increasingly involved in mental health care, particularly in managing depression and anxiety. By leveraging the mind-body connection, physical therapists can offer low-intensity psychological interventions to address symptoms related to mental health conditions. Electroceuticals like Deep Brain Stimulation can help reduce insomnia, anxiety, and depression. We can also help in the well-being of children with autism and Attention Deficit Hyperactivity Deficit. This shift towards integrating physical therapy with mental health care reflects a broader trend toward holistic patient management. Integration of Artificial Intelligence (AI): AI is transforming physical therapy by enabling more personalized and efficient patient care. Advanced algorithms analyse extensive patient data to create tailored rehabilitation programs and forecast pain patterns. AI-powered wearables and immersive technologies like virtual and augmented reality are enhancing therapeutic interventions, allowing for real-time adjustments and improved patient engagement. Adoption of the PRISM Pain Model: The Pain Recovery and Integrative Systems Model (PRISM), developed through collaboration between the APTA and the National Institutes of Health, is set to revolutionize pain management in physical therapy. PRISM addresses the complex nature of pain beyond traditional models, facilitating more effective decision-making and treatment approaches. Boon in Geriatric conditions: Elders are susceptible to various illnesses usually including musculoskeletal, neurological, and cardiopulmonary problems, mental illness, balance problems, and chronic pain. Physiotherapy treatment has been successful in managing each of these ailments. Emphasis on Primary Care Physical Therapy: The trend towards preventive and patient-centred care is spotlighting primary care physical therapy. By focusing on non-pharmacological interventions and early intervention, physical therapists are providing alternatives to manage pain and chronic conditions. This approach not only reduces healthcare costs but also enhances patient outcomes through collaborative, holistic care. For instance, take the case of stroke rehabilation. Physical therapy helps stroke survivors regain motor functions and improve muscle strength, coordination, and balance through targeted exercises and treatments. Similarly, the therapy promotes neuroplasticity, the brain's ability to reorganie and form new neural connections. Therapists use techniques to encourage the brain to adapt and compensate for damaged areas.In functional training, therapy includes functional training to help patients perform everyday tasks, which can significantly enhance their quality of life and self-sufficiency. Growing Popularity of Aquatic Therapy: Aquatic therapy, or hydrotherapy, continues to gain recognition for its benefits, including reduced joint stress and increased flexibility. This low-impact therapeutic option is particularly effective for patients with musculoskeletal issues and is becoming a more common feature in rehabilitation facilities. Innovations in Technology: The integration of new technologies is revolutionizing physical therapy. Motion capture technology and wearable sensors are enhancing the precision of care plans. Virtual reality and interactive video games are improving patient engagement and adherence to therapy. Additionally, rehabilitation robotics, such as exoskeletons and intelligent prosthetics, are offering tailored support that adapts to patients' progress. Telehealth is also on the rise, providing patients with flexible, convenient access to therapy. Increasing Need for Referrals: As physical therapists take on more comprehensive roles, collaboration with physicians becomes increasingly important. Physicians are recognizing the benefits of physical therapy interventions, leading to a higher demand for referrals. These trends highlight the ongoing evolution in physical therapy, emphasizing a shift towards more personalized, technology-driven, and integrated approaches. (The author is a senior physiotherapist and former senior research officer with AIIMS Director. She is also a Co-Founder of Pratyaksh Medical Care; views are personal)",
        "summary": "The integration of new technologies is revolutionising physical therapy. Wearable sensors are enhancing the precision and effectiveness of physiotherapy Khyatee The critical role of physiotherapy in promoting workforce health, addressing sedentary lifestyle issues, correcting postural imbalances, and enhancing productivity is increasingly being recognised not only by the common man but also by the corporate sector.Needless [&#8230;]\n\n\nThe post The expanding horizons of physiotherapy: Integrating technology with holistic care appeared first on Northlines.",
        "url": "https://thenorthlines.com/the-expanding-horizons-of-physiotherapy-integrating-technology-with-holistic-care/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/09/images-2024-09-23T001425.154.jpeg",
        "video": null,
        "publish_date": "2024-09-22 18:46:59",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.437
    },
    {
        "id": 257111160,
        "title": "Vivo X200 Ultra Tipped to Get Snapdragon 8 Gen 4 SoC",
        "text": "Vivo's X200 series is expected to go official on October 14 in China. We have already heard a lot about the Vivo X200 and Vivo X200 Pro models in recent months, and a new leak that came out of China has shed light on the processor and camera details of the purported Vivo X200 Ultra. The Ultra model is tipped to run on the unannounced Snapdragon 8 Gen 4 SoC. It could feature a quad rear camera unit comprising a 200-megapixel periscope lens. Vivo X200 Ultra SoC, Camera Details In a post on the Chinese social media platform Weibo, tipster Digital Chat Station states that Vivo X200 Ultra will run on Snapdragon 8 Gen 4 chipset. The Vivo X200 and Vivo X200 Pro, in contrast, are speculated to ship with MediaTek Dimensity 9400 SoC. The Vivo X200 Ultra is also tipped to feature a quad rear camera unit comprising three 50-megapixel sensors. This would be an upgrade over Vivo X100 Ultra's triple rear camera setup. Like the predecessor, the upcoming handset is tipped to carry a 200-megapixel periscope lens. The main camera is said to offer a 'fixed large aperture'.Vivo X200's Low-Light Camera Capabilities Teased on Social Media In a separate post, the tipster suggests the battery details of Vivo X200, Vivo X200 Pro and Vivo X200 Ultra. The Vivo X200 Pro is said to pack a 6,000mAh battery, while the Vivo X200 could feature a 5,800mAh battery. The Vivo X200 series is believed to go official in China on October 14. Vivo X100 Ultra Price, Specifications Vivo launched the Vivo X100 Ultra in China in May with a price tag of CNY 6,499 (roughly Rs. 74,500) for the 12GB + 256GB RAM storage variant. It features a 6.78-inch 2K (1,440 x 3,200 pixels) E7 LTPO AMOLED display with up to 120Hz refresh rate. It runs on a Snapdragon 8 Gen 3 SoC, alongside up to 16GB of LPDDR5X RAM. It has a 50-megapixel selfie camera. It houses a 5,500mAh battery with 80W wired fast charging support and 30W wireless charging support.Vivo V40e India Launch Scheduled for Next Week; to Get 5,500mAh Battery .embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Affiliate links may be automatically generated - see our ethics statement for details.",
        "summary": "Vivo's X200 series is expected to go official on October 14 in China. We have already heard a lot about the Vivo X200 and Vivo X200 Pro models in recent months and a new leak came out of China shed...",
        "url": "https://www.gadgets360.com/mobiles/news/vivo-x200-ultra-specifications-features-leak-weibo-6632207",
        "image": "https://i.gadgets360cdn.com/large/vivo_x100_ultra_titanium_1715671644669.jpg",
        "video": null,
        "publish_date": "2024-09-23 13:46:59",
        "author": "Manas Mitul",
        "authors": [
            "Manas Mitul"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": -0.073
    },
    {
        "id": 257522644,
        "title": "India revolutionising telecommunications with 6G technology: Communications Minister Scindia",
        "text": "Bengaluru, Sep 26 (IANS) India is on the cusp of revolutionising telecommunications with 6G technology, Union Communications Minister Jyotiraditya M. Scindia said on Thursday. In his remarks at a high-level interaction in Bengaluru, where the Bharat 6G Alliance (B6GA) presented a series of in-depth action plans for 6G technology development. Scindia emphasised the government’s unwavering commitment to fostering the next generation of communication technology in India. “India is on the cusp of revolutionising telecommunications with 6G technology. We are committed to providing the necessary support through policy frameworks, research funding, and spectrum allocation for testing and innovation,” he said. The Minister said that from being a slow technology adopter, “India has transformed into a leader”. The event provided a platform for the Bharat 6G Alliance’s seven working groups to present their progress, innovations, and collaborative efforts aimed at establishing India’s leadership in 6G technologies. These working groups cover a wide array of sectors, including spectrum, device technologies, use cases, standards, green and sustainability, RAN and core networks, AI and sensing, and security. While lauding the efforts of the Bharat 6G Alliance, the Minister reaffirmed the government’s support in facilitating research, establishing testing labs, and creating a conducive environment for startups and enterprises to thrive in the 6G space. Scindia added that the government is “keen to make India a pivotal player in the global 6G landscape by developing world-class technologies, testbeds, and partnerships”. Bharat 6G Vision, launched by Prime Minister Narendra Modi in March 2023, “is a bold initiative to make India a global leader in telecommunications by 2030”, he said. The technology will be a transformative force for social and economic development, particularly in rural and underserved areas. This will ensure that “India’s growth is inclusive”. Further, the Department of Telecommunications (DoT) recently approved 111 research proposals to accelerate 6G research. These proposals will bring together academia and startups in collaborative efforts. –IANS rvt/vd",
        "summary": "Bengaluru, Sep 26 (IANS) India is on the cusp of revolutionising telecommunications with 6G technology, Union Communications Minister Jyotiraditya M. Scindia said on Thursday. In his remarks at a high-level interaction in Bengaluru, where the Bharat 6G Alliance (B6GA) presented a series of in-depth action plans for 6G technology development. Scindia emphasised the government’s unwavering [&#8230;]",
        "url": "https://bhaskarlive.in/india-revolutionising-telecommunications-with-6g-technology-communications-minister-scindia/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202409263231235.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-09-26 14:55:11",
        "author": "IANS,Prime Minister Narendra",
        "authors": [
            "IANS",
            "Prime Minister Narendra"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.321
    },
    {
        "id": 257591024,
        "title": "Xiaomi 14T Pro With Dimensity 9300+ SoC Debuts Alongside Xiaomi 14T",
        "text": "Xiaomi 14T and Xiaomi 14T Pro were announced at Xiaomi's global launch event in Berlin on Thursday (September 26). The Xiaomi 14T series feature 6.67-inch displays with up to 144Hz refresh rate and 4,000nits brightness. They're equipped with MediaTek Dimensity chipsets. The pair flaunts Leica-tuned triple rear cameras matching last year's Xiaomi 13T phones. The Xiaomi 14T and Xiaomi 14T Pro carry 5,000mAh batteries and are IP68-rated for water and dust protection. The Xiaomi 14T Pro, being the premium model, gets 50W wireless charging capabilities and a Dimensity 9300+ SoC. Xiaomi 14T Series Price The Xiaomi 14T Pro is priced at EUR 799.99 (roughly Rs. 75,000) for the 12GB + 256GB model. It costs EUR 899.99 (roughly Rs. 83,000) for the 12GB + 512GB model and EUR 999.99 (roughly Rs. 94,000) for the top-end 12GB + 1TB model. It is available in Titan Black, Titan Gray, and Titan Blue colours. Xiaomi 14T, on the other hand, is priced at EUR 649.99 (roughly Rs. 60,000) for the 12GB + 256GB model. The 12GB + 512GB model costs EUR 699.99 (roughly Rs. 65,000). It is offered in Lemon Green, Titan Black, Titan Gray, and Titan Blue colours. Both models are currently up for sale in Europe. Redmi Note 14 Pro Series Debuts With IP68 Rating, Up to 6,200mAh Battery Xiaomi 14T Pro Specifications The dual SIM (Nano) Xiaomi 14T Pro runs on the company's new HyperOS interface and features a 6.67-inch 1.5K(1,220x2,712 pixels) AMOLED display with up to 144Hz refresh rate, 446ppi pixel density, and 480Hz touch sampling rate. The display supports HDR10+, Dolby Vision, and is said to deliver up to 4,000nits peak brightness. It runs on an octa-core 4nm MediaTek Dimensity 9300+ SoC, paired with up to 16GB of LPDDR5X RAM and up to 1TB of UFS 4.0 onboard storage. It gets a Leica-branded triple rear camera unit with a Vario Summilux lens. The camera setup comprises of a 50-megapixel Light Fusion 900 sensor with optical image stabilisation (OIS) with f/1.6 aperture, a 50-megapixel telephoto camera, and a 50-megapixel ultra wide-angle camera. For selfies and video chats, there is a 32-megapixel camera. Xiaomi 14T Pro Photo Credit: Xiaomi Connectivity options on the Xiaomi 14T Pro include 5G, Wi-Fi 7, USB 3.2 port, Bluetooth 5.4, GPS, Galileo, GLONASS, Beidou, NavIC, and a USB Type-C port. Sensors on board include an accelerometer, ambient light sensor, e-compass, gyroscope, proximity sensor, X-axis linear motor, IR blaster, and flicker sensor. Besides, the phone comes with an in-display fingerprint sensor and supports face unlock. The handset also features stereo speakers with Dolby Atmos support. It has a 3D IceLoop System for thermal management.Xiaomi Captures Second Spot in Global Smartphone Sales: Report The Xiaomi 14T Pro houses a 5,000mAh battery with support for 120W charging and 50W wireless charging. The handset measures 160.4x75.1x8.39mm and weighs 209 grams. Xiaomi 14T Specifications The Xiaomi 14T has the same software, display, and front camera as the Xiaomi 14T Pro. However, the vanilla model is powered by a 4nm MediaTek Dimensity 8300 Ultra SoC, coupled with up to 12GB of LPDDR5 RAM and up to 512GB of UFS 4.0 storage. For optics, the Xiaomi 14T carries a 50-megapixel Sony IMX906 sensor, a 50-megapixel telephoto sensor, and a 12-megapixel ultra wide-angle camera. It also packs a 5,000mAh battery with 67W wired charging support. The vanilla model lacks wireless charging support. It includes an in-display fingerprint sensor. The Xiaomi 14T measures 160.5x75.1x7.80mm and weighs 195 grams. The Xiaomi 14T series ships with Google's Gemini chatbot and other AI features including Circle to Search, AI Notes, AI Recorder, AI Subtitles, AI Film, AI Image Editing, and AI Portrait. Both models in the new series are IP68-rated for dust and water resistance. .embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "Xiaomi 14T and Xiaomi 14T Pro were announced at Xiaomi's global launch event in Berlin on Thursday (September 26). The Xiaomi 14T series feature 6.67-inch displays with up to 144Hz refresh rate and...",
        "url": "https://www.gadgets360.com/mobiles/news/xiaomi-14t-pro-series-price-launch-price-specifications-6660352",
        "image": "https://i.gadgets360cdn.com/large/xiaomi_14t_1727414840068.jpg",
        "video": null,
        "publish_date": "2024-09-27 06:26:50",
        "author": "Siddharth Suvarna",
        "authors": [
            "Siddharth Suvarna"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.24
    },
    {
        "id": 257945684,
        "title": "HMD Moon Knight May Launch Soon With Snapdragon 8s Gen 3 SoC",
        "text": "HMD Moon Knight is reportedly under development. The moniker has surfaced online alongside some expected key features. A tipster has shared the name of the purported smartphone, its model number, and key specifications such as chipset, camera, and display. Meanwhile, other details like the possible build and design element of the rumoured model has also been tipped. HMD, which recently launched its Skyline smartphone in India, has yet to confirm this handset. HMD Moon Knight Features (Expected) An X post from the account HMD_MEME'S (@smashx_60) claimed that HMD is working on a new smartphone, possibly called Moon Knight. It is said to carry the model number TA-1691. According to this leak, the rumoured smartphone could be powered by Qualcomm's Snapdragon 8s Gen 3 chipset. *Moon Knight https://t.co/mXWBioFMnm — HMD_MEME'S (@smashx_60) September 28, 2024 The leak claims that the HMD Moon Knight handset may come with a full-HD+ pOLED screen with a 144Hz refresh rate. The phone may come with a quad rear camera unit. It will likely feature an aluminium frame and support 5G connectivity. The handset may carry a dual speaker unit. HMD Moon Knight could be equipped with POGO pins. This suggests that the design of the phone could be similar to that of HMD Fusion, which was unveiled at IFA 2024 earlier this month. This design is expected to support customisable accessories that may serve additional functionalities. Notably, the HMD Fusion is powered by a Snapdragon 4 Gen 2 SoC and comes with an IP52-rated build for dust and splash resistance. It has a 6.56-inch 90Hz HD+ screen, a 108-megapixel dual rear camera unit, a 50-megapixel selfie shooter, and a 5,000mAh battery with 33W wired fast charging. The phone starts at EUR 249 (roughly Rs. 24,000).",
        "summary": "HMD Moon Knight is reportedly under development. The moniker has surfaced online alongside some expected key features. A tipster has shared the name of the purported smartphone, its model number, and...",
        "url": "https://www.gadgets360.com/mobiles/news/hmd-moon-knight-launch-expected-features-leak-6684814",
        "image": "https://i.gadgets360cdn.com/large/fusion_hmd_1725600135357.jpg",
        "video": null,
        "publish_date": "2024-09-30 13:17:34",
        "author": "Siddharth Suvarna,Sucharita Ganguly",
        "authors": [
            "Siddharth Suvarna",
            "Sucharita Ganguly"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": -0.216
    },
    {
        "id": 258299384,
        "title": "Dev Information Technology share jumps 7% after arm files DRHP for IPO",
        "text": "Dev IT share price: Dev Information Technology (Dev IT) saw its share price surge by 7.23 per cent, hitting an intraday high of Rs 169.60 per share on Thursday, October 3, 2024.The increase in Dev IT share price followed the announcement that its subsidiary, Dev Accelerator Limited (DevX), filed a draft red herring prospectus (DRHP) for an initial public offering (IPO) aimed at expanding its coworking spaces.“We are pleased to announce the filing of the DRHP for our promoted company, DevX. This significant milestone underscores our commitment to the dynamic growth of the flexible work space sector in India. The IPO strategically positions DevX to leverage the increasing demand for flexible office solutions, enabling us to deliver innovative workspace environments tailored to the evolving needs of the clients,” said Pranav Pandya, founder and chairman of Dev Information Technology Limited.DevX IPO overviewThe upcoming DevX IPO includes a fresh issue of up to 2.47 crore equity shares with a face value of Rs 2 each, and the shares will be listed on both the NSE and BSE.DevX IPO funds usage The funds raised through the IPO will be allocated primarily to enhance the company's infrastructure and financial stability. Specifically, Rs 68.95 crore will be designated for \"fit-outs\" in new centres and security deposits, ensuring that facilities are well-equipped for operations. Additionally, Rs 30 crore will be used for the repayment and/or prepayment of certain borrowings, helping to strengthen the company's balance sheet. The remaining proceeds will support various general corporate purposes, including strategic initiatives, marketing enhancements, brand building, lease liabilities, acquiring fixed assets, and overall business development, positioning the company for future growth.This capital infusion will enable DevX to expand its presence in major cities such as Mumbai, Gurugram, Noida, Pune, Chennai, GIFT City, Ahmedabad, Vadodara, Rajkot, Surat, Goa, and Jaipur. As of August 31, 2024, DevX operates 25 centres across more than 10 cities, including Ahmedabad, Vadodara, Hyderabad, Delhi, and Udaipur. The funds from the IPO will strengthen its position as a leading player in the managed office space sector, allowing it to serve a wider range of clients.“This IPO will not only enhance DevX's operational capabilities but also strengthen its financial stability. By securing additional capital, DevX aims to broaden service offerings and elevate customer experiences. The funds raised will be instrumental in accelerating DevX’s expansion plans, enabling DevX to enter new markets, enhance its infrastructure, and invest in technology that drives efficiency,” said Pandya.Dev Information Technology Limited, established in 1997 and listed on both the NSE and BSE, has transformed from a small-scale business automation software provider into a global IT services leader.Headquartered in Ahmedabad, with offices across India and in Canada, the company prioritises continuous innovation, quality, streamlined processes, and technological excellence.Dev IT offers a comprehensive range of services, including Cloud Services, Digital Transformation, Enterprise Applications, Managed IT Services, and Application Development. Among its product offerings are Talligence, an analytics platform, and ByteSigner, a digital signing solution.In FY24, the company achieved a revenue of Rs 165.12 crore, an earnings before interest, tax, depreciation and amortisation (Ebitda) of Rs 15.31 crore, and a profit after tax (PAT) of Rs 9.48 crore..storycontent div {margin:10px 0;}",
        "summary": "Dev IT share price rose after its subsidiary, Dev Accelerator Limited (DevX), filed a draft red herring prospectus (DRHP) for an initial public offering (IPO) aimed at expanding its coworking spaces.",
        "url": "https://www.business-standard.com/markets/news/dev-information-technology-share-jumps-7-after-arm-files-drhp-for-ipo-124100300426_1.html",
        "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-06/24/full/1719206306-2032.jpg",
        "video": null,
        "publish_date": "2024-10-03 07:27:14",
        "author": "Si Reporter",
        "authors": [
            "Si Reporter"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.001
    },
    {
        "id": 258347628,
        "title": "Harvard Students Develop App to Identify Anyone Using Meta Smart Glasses",
        "text": "Ray-Ban Meta smart glasses were used by two Harvard engineering students to build an app that can reveal sensitive information about people without them realising it. The students posted a demo of the video on X (formerly known as Twitter) and showcased the app's capability. Notably, the app is not being made publicly available to users, instead, they made it to highlight the dangers of AI-powered wearable devices that use discreet cameras that can capture photos and images of people. Ray-Ban Meta Smart Glasses Used to Build a Doxxing App The app, dubbed I-Xray, uses artificial intelligence (AI) for facial recognition and then uses processed visual data to doxx individuals. Doxxing, a popular Internet slang which is a portmanteau of “dropping dox (informal of docs or documents)”, is the act of revealing personal information about someone without their consent. It was integrated with the Ray-Ban Meta smart glasses, but the developers said that it would work with any smart glasses with discreet cameras. It uses an AI model similar to PimEyes and FaceCheck for reverse facial recognition. The technology can match the face of an individual to publicly available images of them online and scour the URLs. Another large language model (LLM) is then fed these URLs and an automatic prompt is generated to find out the person's name, occupation, address, and other similar data. The AI model also looks through publicly available government data such as voter registration databases. Additionally, an online tool named FastPeopleSearch was also used for this. Are we ready for a world where our data is exposed at a glance? @CaineArdayfio and I offer an answer to protect yourself here:https://t.co/LhxModhDpk pic.twitter.com/Oo35TxBNtD — AnhPhu Nguyen (@AnhPhuNguyen1) September 30, 2024 In a short video demonstration, Harvard students AnhPhu Nguyen and Caine Ardayfio also showcased the workings of this app. They were able to meet strangers with the camera already turned on, and ask their name, and the AI-powered app could take over from there to find personal data about the individual. In a Google Docs file, the developers said, “This synergy between LLMs and reverse face search allows for fully automatic and comprehensive data extraction that was previously not possible with traditional methods alone.” The students have stated that they do not intend to make the app publicly available and only developed it to highlight the risks of an AI-enabled wearable device that can discreetly record people. However, this does not mean that bad actors cannot make a similar app using a similar methodology. .embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }",
        "summary": "Ray-Ban Meta smart glasses were used by two Harvard engineering students to build an app that can reveal sensitive information about people without them realising it. The students posted a demo of the...",
        "url": "https://www.gadgets360.com/ai/news/harvard-i-xray-meta-smart-glasses-app-reveal-sensitive-information-6708698",
        "image": "https://i.gadgets360cdn.com/large/ray_ban_meta_smart_glasses_g360_1727962856541.jpg",
        "video": null,
        "publish_date": "2024-10-03 13:50:55",
        "author": "Akash Dutta,David Delima",
        "authors": [
            "Akash Dutta",
            "David Delima"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.066
    },
    {
        "id": 260324078,
        "title": "Phytotechnology meet at Calicut varsity from October 22",
        "text": "A three-day international phytotechnology conference will be held on the Calicut University campus from Tuesday (October 22). \n\nA release said on Saturday (October 18) that the theme of the conference was ‘Phytotechnology for sustainable environment and food safety’. Phytotechnology is a branch of science that uses plants to address environmental issues. The conference is being jointly organised by the Botany department at the university and the International Phytotechnology Society. \n\nP. Raveendran, Vice-Chancellor, will open the conference at 10 a.m. on Tuesday. Around 200 delegates, including international scientists, will attend the conference.",
        "summary": "The three-day international conference is being jointly organised by the Botany department at the university and the International Phytotechnology Society",
        "url": "https://www.thehindu.com/news/national/kerala/phytotechnology-meet-at-calicut-varsity-from-october-22/article68772534.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-10-19 16:07:22",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "technology",
        "source_country": "in",
        "sentiment": 0.459
    }
]