[
    {
        "id": 263252088,
        "title": "Why Mahindra XUV700 is perfect for road trips and off-road adventures",
        "text": "This article will help you explore the top 7 reasons that make the XUV700 a brilliant companion for road trips and off-roading adventures. Top 7 Reasons that make the Mahindra XUV700 perfect for Off-Roading Adventures Let us explore the top 7 reasons that make the XUV700 perfect for off-roading adventures. Strong Build Quality The foundation of any good off-roader is a robust build chassis that can withstand the challenges of a rugged trail. The Mahindra XUV700 delivers on this front with its sturdy construction. The monocoque chassis of the Mahindra XUV700 provides the much-needed strength and durability for off-roading adventures. Complementing this rigid frame are high-strength steel panels that resist dents and protect the underbody over rough terrain. Traversing rocky trails or slippery slopes should bring you peace of mind, knowing your XUV700 is ready for the challenge. Powerful Engine Options A reliable and powerful engine is key to conquering steep inclines and rough surfaces during off-roading adventures. The Mahindra XUV700 offers two excellent engine options in this regard: 2.0L Turbo Petrol: The turbo petrol engine option with direct injection delivers 197bhp power and 380Nm torque. This allows the engine to maintain momentum over challenging terrain. 2.2L Diesel: The 2.2-litre diesel engine option delivers 182bhp power and 450Nm torque. This engine variant's abundant torque is a boon for crawling over obstacles at low speeds. Notably, both these engine options come with 6-speed manual or automatic transmission options. Advanced Safety Features The Mahindra XUV700 boasts an impressive array of safety features, positioning it as a leader in its segment. At the forefront is its Advanced Driver Assistance Systems (ADAS), which includes Forward Collision Warning, Adaptive Cruise Control, Lane Keep Assist, and Automatic Emergency Braking. The vehicle's safety is further enhanced by its best-in-class 7 airbags, including a knee airbag and Electronic Stability Program. Driver alertness is prioritised with features like Driver Drowsiness Detection and Personalised Safety Alerts. For enhanced visibility and situational awareness, the XUV700 offers a 360° Surround View and Blind View Monitor. The higher trims include a Tyre Pressure Monitoring System and Electronic Park Brake. High Ground Clearance The Mahindra XUV700 offers a generous ground clearance of 200mm. This clearance allows you to scale most obstacles on off-roading trails without scraping the underbody. It is also sufficient to navigate through urban potholes and most rural roads. A high ground clearance offers enhanced driving comfort and a commanding road view. All-wheel drive (AWD) Capability Power delivery to all four wheels is essential for maintaining the proper grip and forward momentum while traversing harsh off-roading conditions. For this reason, the top-spec AX7 and AX7 L diesel automatic powertrain trims of the Mahindra XUV700 come with an additional option of all-wheel-drive (AWD) system, offering capabilities far beyond what you would expect from a city car like the Maruti Suzuki Swift. Commanding Dimensions The XUV700 measures 4695 mm in length, 1890 mm in width, and 1755 mm in height. Its wheelbase and kerb weight measurements are 2750 mm and 1855 kg, respectively. These readings ensure that the Mahindra XUV700 is well-equipped to help you cruise through the challenges of most off-roading trails in a commanding position. Boot Space Capacity The Mahindra XUV700 won’t disappoint if you want to carry camping gear, bicycles, or other equipment for your outdoor adventures. Though the boot space of 240 litres is far from the best in its class, this space is sufficient to carry the most essential adventure gear. Final Words The Mahindra XUV700 has all the ingredients of a great off-roader. The Mahindra XUV700 can help you easily sail through most off-roading challenges thanks to powerful engine options and a sizable ground clearance. Most importantly, the Advanced Driver Assistance Systems of the XUV700 ensure enhanced safety for you and your loved ones on off-roading adventures. (This article is part of DMCL Consumer Connect Initiative, a paid publication programme. DMCL claims no editorial involvement and assumes no responsibility, liability or claims for any errors or omissions in the content of the article. The DMCL Editorial team is not responsible for this content.)",
        "summary": "This feature-loaded Mahindra XUV700 is purpose-built to handle rugged terrains with ease. It should be on your priority list if you love to go on road trips and off-roading adventures.",
        "url": "https://www.dnaindia.com/india/report-why-the-mahindra-xuv700-is-perfect-for-road-trips-and-off-road-adventures-3116639",
        "image": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2024/11/07/2661032-mahindra-xuv700.jpg",
        "video": null,
        "publish_date": "2024-11-07 06:28:26",
        "author": "Shah Rukh Khan",
        "authors": [
            "Shah Rukh Khan"
        ],
        "language": "en",
        "category": "travel",
        "source_country": "in",
        "sentiment": 0.781
    },
    {
        "id": 257240918,
        "title": "Man murdered and abandoned in ambulance",
        "text": "The man found dead in an ambulance at Kaippamangalam in Thrissur district was murdered, according to the police. The deceased has been identified as Arun, 40, a resident of Mettupalayam in Coimbatore. However, his identity remains to be verified. The incident was reported near the Kaippamangalam fisheries school on Monday around 11.30 p.m. It has since emerged that a four-member gang in a car had summoned the ambulance to take the deceased to a nearby hospital under the pretext that he was injured in an accident. The gang then allegedly fled after having promised the ambulance driver that they would follow the ambulance. The victim was dead by the time the ambulance reached the hospital. Following this, the ambulance driver alerted the Kaippamangalam police. In the ensuing investigation it emerged that the victim was assaulted to death in connection with a money transaction, reportedly to the tune of ₹10 lakh, for a rice puller. One of the accused had reportedly invested the money with Arun who failed to deliver on the promise. According to the police, the victim who was asked to come near the Paliyekkara toll was abducted by the gang and then beaten up at a secret location. He was being taken around in a car when the gang allegedly summoned the ambulance at Kaippamangalam. As per preliminary information, all the accused were residents of Kannur. The Kaippamangalam police have intensified the probe for tracking down the accused.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/kerala/man-murdered-and-abandoned-in-ambulance/article68677867.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-09-24 14:00:30",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "travel",
        "source_country": "in",
        "sentiment": -0.885
    },
    {
        "id": 257519028,
        "title": "Waterfalls turn fatal for tourists in Vizag",
        "text": "Visakhapatnam: Alluri Sitarama Raju district is home to many beautiful waterfalls that attract tourists, especially youngsters from across the state. Unfortunately, many tourists have lost their lives in waterfall-related accidents in the district due to a lack of awareness about the risks. This is because often the youth try to perform adventurous tasks for selfies and short videos. On this problem, ASR district collector A.S. Dinesh Kumar held a meeting with tourism officials. When Deccan Chronicle contacted, Srinivasa Phani, the regional director of the AP Tourism Development Corporation (APTDC), said, “In last week's meeting, we discussed that the APTDC has received Rs 30 crore funds under the Swadeshi Darshan 2.0 scheme from the central government. We have proposed that some of this fund be used to develop infrastructure that prevents accidents at these waterfalls.” The Anantagiri Saria Falls gained recognition as a tourist destination since 2015, attracting many visitors from the North Andhra districts. However, several tragic incidents took place at this spot. According to CPI (M) ASR district secretary D. Venkanna, more than 40 reported fatalities occurred at the falls between 2015 and 2024. Worried about these events, the district authorities enhanced safety measures. Notably, at the first step of Saria Falls, where many accidents had occurred, fencing and warning boards were erected. These measures have prevented accidents in the past two years.Unfortunately, a recent incident at Bahubali Waterfalls, the second step of the falls, resulted in the loss of two lives. The recovery of the bodies was quite a challenge for the officials. Pittalaborra Waterfalls at Ginnelakota village in Pedabayalu mandal has been identified as hazardous due to its history of accidents. A tragic incident occurred three months ago when a young man from the Araku area lost his life after slipping into a waterfall while taking a selfie. His body was recovered two days later.Similarly, Duduma waterfalls, situated at a height of 2,600 feet on the border of Andhra and Odisha, has witnessed multiple fatalities, with six reported deaths in 2024. In response, the Odisha government has implemented preventive measures, resulting in fewer accidents at the site. The Gadigummi Falls in Koyyuru mandal is deemed extremely dangerous, with no documented cases of individuals surviving falls. Local reports suggest that approximately 40 fatalities have occurred at this location. On a different note, the Polluru Waterfall at Mothugudem is renowned for its popularity as a filming location. It has also seen several fatal incidents, with around 35 recorded deaths attributed to quicksand in the boulder area near the waterfall.The Chaparai Waterfall in Dumbriguda is a captivating attraction for tourists, including foreigners. Adjacent to the waterfall, there is a hazardous area known as the Hanuma Stone, which had several accidents due to its beautiful nature, uninformed tourists often meet with accidents here. Local guides have reported approximately 30 fatalities in the past decade. However, two years ago, the authorities took protective measures at the waterfalls area. They have demolished the hazardous Hanuma Stone, installed a fence and taken additional protective measures. As a result, the number of accidents at Chaparai Waterfalls has decreased over the past two years.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/waterfalls-turn-fatal-for-tourists-in-vizag-1826198",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/26/1845600-3.webp",
        "video": null,
        "publish_date": "2024-09-26 15:03:57",
        "author": "ARUNA",
        "authors": [
            "ARUNA"
        ],
        "language": "en",
        "category": "travel",
        "source_country": "in",
        "sentiment": 0.203
    },
    {
        "id": 258458426,
        "title": "Boy drowns in abandoned quarry near Karur",
        "text": "A 14-year-old boy drowned in an abandoned stone quarry at Perumparai near here on Thursday. His name was given as R. Rahul of Alampalayam Colony at Athur. According to sources, he had gone to attend nature’s call along with his friends M. Gopinath, 14, and R. Ilamathan, 15. Rahul accidentally fell in the pool of water in the deep quarry and drowned. On information, the Fire and Rescue Services personnel rushed to the spot and fished out his body. Vangal police have registered a case and are investigating.",
        "summary": "",
        "url": "https://www.thehindu.com/news/cities/Tiruchirapalli/boy-drowns-in-abandoned-quarry-near-karur/article68714517.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-10-04 11:51:08",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "travel",
        "source_country": "in",
        "sentiment": -0.39
    }
]