[
    {
        "id": 264731326,
        "title": "Siddaramiah, Congress reitrate claim that BJP offered Rs 50 crores each to Congress MLAs to destabilise Karnataka govt",
        "text": "The ruling Congress government in Karnataka has upped the ante on Chief Minister Siddaramaiah’s claims that the BJP offered Rs 50 crores each to 50 Congress MLAs to destabilise the Karnataka government during the alleged ‘poaching’ attempts, dubbed as ‘Operation Kamala’.The CM himself reiterated the allegations, “I said what they did previously. I said they tried to destabilise the govt by offering Rs 50 crores, in which they couldn’t succeed.”The Chief Minister had earlier made the accusation on Wednesday in Mysuru during his address after launching development works worth 470 crores in T. Narasipur. Senior Minister HK Patil said that he backed the CM’s claims as they would have come from credible sources.“Our CM must have got credible information and the way the BJP is functioning and their leaders are talking it shows that they are making that kind of effort. You all know how they operated in Maharashtra. Keeping all this in view, the CM has said so. But there is nothing to worry about, our MLAs and party are strong and our govt is stable,” HK Patil said.Another State Minister Ramalinga Reddy said that the BJP had been trying to destabilise the government over six months but had failed.“They (BJP) have been trying for last 6 months, but they have failed. No MLA is ready to go with those people. Since they have failed, they are making allegations against the Congress party and Siddaramaiah. They will never succeed. They will be in opposition for the next 3-5 years…They (BJP) are dreaming of becoming ministers,” he said.State Minister Dr M C Sudhakar said that the BJP had been publically saying that the Congress government would not last and thus are trying everything.“See, poaching MLAs from other parties is not new to BJP. From the day Congress came to power in Karnataka, time and again BJP started saying that this govt was not going to last long. Their great ally HD Kumaraswamy and former PM Deve Gowda is also saying the same. This indicates that they (BJP) are trying all means. They (BJP) would have tried. Without proper information, the CM would not have spoken…”Karnataka Deputy CM DK Shivakumar said that the Chief Minister has got some credible information on this.DK Shivakumar said, “A lot of information is coming from the BJP side also. We will speak with CM and come back to you (media) on this.”Earlier CM Siddaramaiah had lashed out at the BJP, saying that it won’t succeed in its plans.Speaking to reporters, the Karnataka Chief Minister said not a single MLA from the ruling Congress will switch sides.“It is true that BJP is trying to destabilise our government, but they will not succeed in their plans. They tried earlier to topple our government and succeeded, but such ploys won’t work this time. It is clear that they can do anything, and go to any lengths to grab power. But now a single MLA from our party will go to the BJP,” Siddaramaiah said.His remark came amid the trading of barbs between the ruling Congress in Karnataka and the BJP over alleged ‘poaching’ attempts, dubbed as ‘Operation Kamala’, in the southern state",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/siddaramiah-congress-reitrate-claim-that-bjp-offered-rs-50-crores-each-to-congress-mlas-to-destabilise-karnataka-govt/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/siddaramiah-congress-reitrate-claim-that-bjp-offered-rs-50-crores-each-to-congress-mlas-to-destabilise-karnataka-govt.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:58:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.717
    },
    {
        "id": 264731634,
        "title": "Chhattisgarh: Raipur Police Detain Passenger Following 'Bomb Threat' To Flight",
        "text": "One passenger has been detained by the Raipur police in the matter pertaining to the emergency landing of a flight, said a police official on Thursday. A preliminary questioning is underway with the detained passenger, as per the Raipur SSP Santosh Singh.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/chhattisgarh-raipur-police-detain-passenger-following-bomb-threat-to-flight",
        "image": "https://media.assettype.com/freepressjournal/2019-07/24933ad3-1750-4a9c-8126-0b5a88ed26e6/Flight__plane__airplane.jpg",
        "video": null,
        "publish_date": "2024-11-14 10:01:55",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "IN",
        "sentiment": 0.048
    },
    {
        "id": 264731632,
        "title": "Bihar: Police Bust Improvised Firearms Manufacturing Unit During Joint Raid In Munger House, 2 Arrested",
        "text": "Two persons were arrested after Kolkata Police, a team of STF Kolkata Police, Bihar STF, and Tarapur Police busted an improvised firearms manufacturing unit during a joint raid in a house in Munger, Bihar and seized raw materials used for manufacturing firearms on Wednesday night.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/bihar-police-bust-improvised-firearms-manufacturing-unit-during-joint-raid-in-munger-house-2-arrested",
        "image": "https://media.assettype.com/freepressjournal/2021-08/58b05d56-7255-4188-beea-e782fbb4f040/Arrest_1.jpeg",
        "video": null,
        "publish_date": "2024-11-14 09:58:56",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "IN",
        "sentiment": -0.451
    },
    {
        "id": 264732858,
        "title": "Dominica announces its highest national honour the Dominica Award of Honour to PM Narendra Modi",
        "text": "The Commonwealth of Dominica will bestow its highest national award, the Dominica Award of Honour, upon PM Narendra Modi, in recognition of his contributions to Dominica during the COVID-19 pandemic and his dedication to strengthening the partnership between India and Dominica.\n\nSylvanie Burton, President of the Commonwealth of Dominica, will confer the award during the upcoming India-CARICOM Summit, scheduled to take place in Georgetown, Guyana from November 19 to 21, 2024.\n\nIn February 2021, India supplied Dominica with 70,000 doses of the AstraZeneca COVID-19 vaccine-a generous gift which enabled Dominica to extend support to its Caribbean neighbours.\n\nThe award also recognizes India’s support for Dominica in healthcare, education and information technology under Prime Minister Modi’s leadership, as well as his role in promoting climate resilience-building initiatives and sustainable development on a global level.\n\nPrime Minister of Dominica, Roosevelt Skerrit says the award is an expression of Dominica’s gratitude for Prime Minister Modi’s solidarity with Dominica and the wider region.\n\n“Prime Minister Modi has been a true partner to Dominica, particularly during our time of need amid a global health crisis. It is an honour to present him with Dominica’s highest national accolade as a symbol of our gratitude for his support and as a reflection of the strong ties between our countries. We look forward to building on this partnership and advancing our shared vision of progress and resilience,” he said\n\nIn accepting the offer of the award, Prime Minister Modi emphasized the importance of collaboration in tackling global challenges such as climate change and geopolitical conflicts, and affirmed India’s commitment to working alongside Dominica and the Caribbean in addressing these issues.\n\nSylvanie Burton, President of the Commonwealth of Dominica and Prime Minister Roosevelt Skerrit will attend the India-CARICOM Summit, a forum to discuss shared priorities and new avenues for cooperation between India and CARICOM member states.\n\n(This news report is published from a syndicated feed. Except for the headline, the content has not been written or edited by OpIndia staff)",
        "summary": "The Commonwealth of Dominica will bestow its highest national award, the Dominica Award of Honour, upon PM Narendra Modi, in recognition of his contributions to Dominica during the COVID-19 pandemic",
        "url": "https://www.opindia.com/2024/11/dominica-announces-its-highest-national-honour-to-pm-modi/",
        "image": "https://www.opindia.com/wp-content/uploads/2024/11/Modi-Dominica-highest-award.jpg",
        "video": null,
        "publish_date": "2024-11-14 08:09:45",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 1.0
    },
    {
        "id": 264729094,
        "title": "Delhi Police arrest 140 narco offenders, say operation Kavach 6.0 conducted with bettwer coordination",
        "text": "In an effort to clean Delhi’s street off drugs the Delhi Police on Thursday the Delhi Police arrested 140 narco offenders in 139 NDPS cases under the operation Kavach 6.0. Delhi Police DCP Bhisham Singh said the operations were conducted in 874 locations in 15 districts of Delhi and interrogations on the arrested and detained people has started. Speaking to ANI, Singh said “We have been doing Operation Kavach continuously. This is the sixth edition of it. We conducted it four times and got good results. This time too, we have done it once more and this time we did it with better coordination. A Iot of action has been taken against the criminals. We are interrogating everyone who has been arrested and detained.”Further, Singh said that the operation was just a kick start through a big operation and situations would be kept under control. “This operation is just a kick start which has been done through a bigger operation. Following the same leads, we will keep the situation under control,” he added. Earlier today, the Delhi Police arrested 140 narco offenders in 139 NDPS cases and recovered a substantial quantity of drugs. Approximate 870.1 grams of heroin 193.8 kg of ganja, 16.1 grams of cocaine and 404 grams of MDMA have been seized by the Delhi Police, Additional CP Crime Sanjay Bhatia confirmed.Additionally, Rs 34, 420 in cash, one 20 grams gold chain, one motorcycle, one tempo and one scooter have also been seized.Furthermore, 203 cases have been registered under the Delhi Excise Act, and 202 individuals have been arrested.244 cans of beer, 29.942 quarters and 198.75 litres of illicit liquor have also been seized.Besides, 14 people have also been arrested in 14 arms act cases with the recovery of 6 country-made pistols, nine live cartridges and eight knives.1224 individuals have been taken into preventive custody.Operation Kavach was launched in Delhi in May, 2023 to focus on identifying and apprehending individuals involved in the trafficking and distribution of narcotics",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/delhi-police-arrest-140-narco-offenders-say-operation-kavach-6-0-conducted-with-bettwer-coordination/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/delhi-police-arrest-140-narco-offenders-say-operation-kavach-6-0-conducted-with-bettwer-coordination.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:23:31",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.021
    },
    {
        "id": 264729098,
        "title": "“Congress and MVA are going to win”: Mallikarjun Kharge ahead of Maharashtra Assembly polls",
        "text": "Exuding confidence in the Maha Vikas Aghadi’s (MVA) victory in the Maharashtra Assembly polls, Congress President Mallikarjun Kharge on Thursday said that the Congress and MVA are going to win elections in the state. Congress President Kharge said, “The environment in Maharashtra is good. Congress and MVA are going to win. We will give a better government to Maharashtra… When Rahul Gandhi comes, another nearby 2-4 constituencies also get benefited…”Kharge also took a jibe at the BJP and said that regular visits of PM Modi, Amit Shah and prominent leaders of the party show that they are nervous. He further slammed the current Mahayuti government, saying that this government is not formed on the basis of ideology, rather it is formed after ploying the situation. Kharge said, “PM Modi, Union Minister Amit Shah, and Chief Ministers of various states are coming here again and again which shows they are nervous. They want Maha Vikas Aghadi not to come to power, because the government they had made, is made after breaking and ploying the situation, which doesn’t last long. Most importantly, this government is not based on any ideology, so that’s why they want to come to power by any means. But people have also determined that MVA will come to power in these elections in Maharashtra.” Earlier today, targeting the Maha Vikas Aghadi, Maharashtra Chief Minister Eknath Shinde said that in two and a half years, they have looted the state and set it back by ten years. Addressing a press conference, CM Shinde said, “Who are the looters, who are the developers, or who are the murderers of development? In two and a half years, they have looted the state and set it back by ten years. Many projects and works have come to a halt. They have taken money in wood, taken money in khichdi.”He further said that he and his government is working for the welfare of the people and for development.“We want to nurture our beloved sisters. Fake things are being spread that Muslims are scared, Dalits, Adivasis, Muslims, and Christians are afraid, but now people have become wise. We have given money to beloved sisters of all castes,” he said.Campaigning has intensified for the 288 assembly seats in Maharashtra with both the ruling Mahayuti and the opposition Maha Vikas Aghadi (MVA) making efforts to woo the electorate.The Maharashtra polls are scheduled for November 20 and counting will be held on November 23",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/congress-and-mva-are-going-to-win-mallikarjun-kharge-ahead-of-maharashtra-assembly-polls/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/congress-and-mva-are-going-to-win-mallikarjun-kharge-ahead-of-maharashtra-assembly-polls.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:24:01",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.269
    },
    {
        "id": 264729096,
        "title": "Chhattisgarh: Raipur Police detains a passenger following ‘bomb threat’ to flight",
        "text": "One passenger has been detained by the Raipur police in the matter pertaining to the emergency landing of a flight, said a police official on Thursday. A preliminary questioning is underway with the detained passenger, as per the Raipur SSP Santosh Singh. Earlier today, a flight from Nagpur to Kolkata had made an emergency landing at Raipur airport following a bomb threat after which the plane was thoroughly checked at the airport.Further investigation is underway. More details on this matter are awaited",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/chhattisgarh-raipur-police-detains-a-passenger-following-bomb-threat-to-flight/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/chhattisgarh-raipur-police-detains-a-passenger-following-bomb-threat-to-flight.jpeg",
        "video": null,
        "publish_date": "2024-11-14 09:35:57",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.258
    },
    {
        "id": 264729100,
        "title": "Jaya Bachchan’s film with Siddhant Chaturvedi, Wamiqa Gabbi titled ‘Dil Ka Darwaaza Khol Na Darling’, more details inside",
        "text": "Filmmaker Vikas Bal, best known for creating films ‘Queen’ and ‘Super 30’, is currently working on his new project titled ‘Dil Ka Darwaaza Khol Na Darling’. The film stars veteran actress Jaya Bachchan, Siddhant Chaturvedi and Wamiqa Gabbi in the lead roles. The shooting for the project has already kick-started. On Thursday, the makers shared the first official posters of the film. In the image. We can see Jaya Bachchan in rock n roll mood as she seems to be a part of a music band with Wamiqa and Siddhant.https://www.instagram.com/p/DCWBndgJSh2/?igsh=dXcxamw1ZnUzYWVo&img_index=1‘Dil Ka Darwaaza Khol Na Darling’ will hit the theatres in 2025. Sharing the first look on social media, the makers wrote, “Unlocking Love and Laughter, ‘Dil Ka Darwaaza Khol Na Darling’ hitting screens in 2025! Are you ready to turn the key?”The announcement left many moviegoers excited. Reacting to the post, a social media user commented, “this looks fun.”“Let’s goooooooo!!!!!!!!!!!!,” a netizen wrote.Presented by Tips Films Ltd, Baweja Studios Ltd, and Jumping Tomato Studios, Dil Ka Darwaaza Khol Na Darling is a Good Co. production, directed by Vikas Bahl. Produced by Ramesh Taurani, Harman Baweja, Rohandeep Singh, Viraj Sawant, and Ramesh Pulapaka, the film will be released next year. Recently, from Goa, Wamiqa gave a sneak peek into her BTS diaries from the shoot of ‘Dil Ka Darwaaza Khol Na Darling’. Wamiqa took to Instagram Story and shared a picture from the dressing room.” #Day 1 #NewBeginnings #Goa,” she captioned the post.Details regarding the film’s plot have not been disclosed yet. Meanwhile, in the coming months, Wamiqa will also be seen sharing screen space with Varun Dhawan in ‘Baby John’.A few days ago, the makers of Baby John gave audience a glimpse of the film. The clip paints ‘Baby John’ as a mass action drama enriched with emotional undertones. Dhawan plays a police officer and single father, portraying a character who is not afraid to confront adversaries head-on.In a powerful scene, he declares, “Mere jaise bohat aaye hoge, main pehali baar aaya hu” (“Many might have come before me, but I have come here for the first time”), setting the tone for his heroic journey.The teaser also introduces Keerthy Suresh as the female lead and features veteran actor Jackie Shroff in a brief yet impactful role as the antagonist.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/jaya-bachchans-film-with-siddhant-chaturvedi-wamiqa-gabbi-titled-dil-ka-darwaaza-khol-na-darling-more-details-inside/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/jaya-bachchans-film-with-siddhant-chaturvedi-wamiqa-gabbi-titled-dil-ka-darwaaza-khol-na-darling-more-details-inside.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:34:13",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.601
    },
    {
        "id": 264729104,
        "title": "Supreme Court seeks UP govt’s response on Remo D’Souza plea",
        "text": "The Supreme Court on Thursday sought a response from the Uttar Pradesh Government on choreographer-turned-director Remo D’Souza plea seeking quashing of a 2016 cheating case lodged against him.However, the top court declined to grant any interim relief to D’Souza and refused to stay the proceedings against him.A bench of justices Surya Kant and Ujjal Bhuyan issued notice to the UP govt on Remo D’Souza plea and listed the matter next week for further hearing.The top court was hearing Remo D’Souza plea challenging the Allahabad High Court order rejecting his plea seeking to quash the 2016 cheating case against him. An FIR has been lodged against Remo D’Souza under Section 420 (cheating), 406 (criminal breach of trust), and 386 (extortion by putting a person in fear of death or grievous hurt) of the Indian Penal Code (IPC) after a complaint was levelled against him.The complainant has alleged that Remo D’Souza has encouraged him to finance in his movie and assured him to return the double amount invested by him but later he failed to fulfil his promise",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/supreme-court-seeks-up-govts-response-on-remo-dsouza-plea/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/supreme-court-seeks-up-govts-response-on-remo-dsouza-plea.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:48:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.285
    },
    {
        "id": 264729102,
        "title": "Check out trailer of show ‘Waack Girls’",
        "text": "Prime Video is coming up with a new series titled ‘Waack Girls’. The show is created and directed by Padma Shri awardee Sooni Taraporevala and co-written by Sooni, Iyanah Bativala and Ronny Sen. The cast includes Mekhola Bose, Rytasha Rathore, Anasua Chowdhury, Chrisann Pereira, Priyam Saha, Ruby Sah, Achintya Bose alongside acclaimed actors Barun Chanda, Lillete Dubey and the late Nitesh Pandey in pivotal roles.On Thursday, the makers unveiled the show’s trailer. The trailer for Waack Girls whisks “viewers away to the lively streets of Kolkata, where the vibrant rhythm of waacking–a dynamic dance form largely unknown in India–intertwines with themes of friendship, resilience, and defiant self-expression. It showcases a diverse ensemble of young women, all united by their love for dance; offering an intimate glimpse into the lives of these six unapologetic Waack Girls, each with their own unique story.”https://www.instagram.com/p/DCV071rNsPE/Portraying the role of an expert waacker and the team’s choreographer, Mekhola Bose in a press note shared, “Waacking is an amazing medium for self-expression through movement and emotion. For me, it has been an important tool for self-exploration. Collaborating with Sooni was a dream come true; she truly understands the art of storytelling through dance. Waack Girls embodies resilience, passion, and the raw beauty of self-expression, and I’m incredibly proud to bring this story to life with such talented actors. It’s an honor to showcase why waacking deserves a prominent place on the global stage.”Rytasha Rathore, who plays the manager of the dance group ‘Waack Girls’, said, “From the moment I went in for that very first audition at Tess Joseph’s and met Sooni. I knew I must be a part of this show. I had never had the privilege of auditioning with the director in the room; the whole energy of the show was special from the get go. Sooni is a living legend. Working with a team as fantastic as this one is testament that manifestation does work! I’ve spent days journaling about the kind of work I want to do and the kind of people I want to do it with. Waack Girls is an extension of that, a gift from the universe, a true collaboration made with the purest souls.”Waack Girls is set to premiere on Prime Video on November 22.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/check-out-trailer-of-show-waack-girls/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/check-out-trailer-of-show-waack-girls.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:34:28",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "entertainment",
        "source_country": "in",
        "sentiment": 1.0
    },
    {
        "id": 264729110,
        "title": "Tilak Varma dedicates his maiden T20I ton at Centurion to captain Suryakumar Yadav",
        "text": "Star India batter Tilak Verma dedicated his maiden T20I century to skipper Suryakumar Yadav as he promoted him up the order during the third match of the series at the SuperSport Park on Wednesday.Tilak Varma was named the ‘Player of the Match’ after his staggering performance with the bat. The left-hand batter played an unbeaten knock of 107 runs off just 56 deliveries which was laced with eight boundaries and seven maximums in his innings. The southpaw scored runs at a whopping strike rate of 191.07.“It was for Suryakumar, our captain. He has given me the opportunity to bat at No.3. Because I love to bat at that spot, and last 2 matches I batted at No.4. But before this match, he came to my room and said that ‘you’re going to bat at No.3. It’s a good opportunity, so express yourself,” said Tilak in the post-match press conference. Recapping the 3rd T20I of the series, South Africa won the toss and decided to field. Abhishek Sharma (50 runs from 25 balls, 3 fours and 5 sixes) and Tilak Varma (107* runs from 56 balls, 8 fours and 7 sixes) powered India to 219/6 in the first innings. Other batters failed to shine with the bat.Andile Simelane and Keshav Maharaj led the Proteas bowling attack and bagged two wickets each in their respective spell. During the run chase, Heinrich Klaasen (41 runs from 22 balls, 1 four and 4 sixes) and Marco Jansen (54 runs from 17 balls, 4 fours and 5 sixes) kept the Proteas in the game. But with the help of Arshdeep, India prevailed in the end.Arshdeep did the job both with the new ball and in the death overs as he picked up three crucial wickets and gave 37 runs in his four-over spell. Varun Chakaravarthy bagged two wickets in his four-over spell. (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/tilak-varma-dedicates-his-maiden-t20i-ton-at-centurion-to-captain-suryakumar-yadav/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/tilak-varma-dedicates-his-maiden-t20i-ton-at-centurion-to-captain-suryakumar-yadav.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:33:27",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.195
    },
    {
        "id": 264729108,
        "title": "“BJP to form govt, JMM will be booted out”: Home Minister Amit Shah in Jharkhand",
        "text": "As Jharkhand braces for the second phase of polling on November 20, Union Home Minister Amit Shah on Thursday said that it has been decided in the first phase of elections that Bharatiya Janata Party (BJP) would form the government in the state and the Jharkhand Mukti Morcha (JMM) would be turfed out. Taking a dig at Jharkhand Chief Minister Hemant Soren, Union Minister Shah said that Soren’s time was coming to an end now. “The first phase of elections in Jharkhand has made it clear that JMM will be turfed and BJP will form the government in the state. I want to say to Hemant Soren that his time was coming to an end. Has anyone of you ever seen Rs 350 crores? This amount has been seized from the residence of a Congress leader. Another of Soren’s ministers Alam Gir Alam, his personal assistant (PA) had Rs 35 crores at his residence. Whose money is it? Does it belong to Hemant or Kalpana Soren? It belongs to you,” said Amit Shah while addressing a rally in Gandey assembly constituency. The Union Home Minister further accused Congress of opposing the formation of Jharkhand and Soren for joining hands with them for “greed of power”.“A lot of people sacrificed their lives and dedicated their whole lives to the state of Jharkhand. Ultimately, Jharkhand was formed under the government led by Atal Bihari Vajpayee and Congress wanted to stop that. Yet, CM Hemant Soren is standing with that same Congress party as he is greedy for power,” Shah said. Amit Shah promised to set up factories in Jharkhand to resolve the issue of unemployment in the state, blaming the Bangladeshi “infiltrators” for taking away employment opportunities. He said that the BJP government would bring a law against infiltrators. “Jharkhand is the most prosperous state in the country. Jharkhand has so much of minerals that make it the most prosperous state of the country. But the youth here go to different places like Delhi and Mumbai for employment. I will set up enough factories here to generate employment opportunities here…Your employment opportunities have been decreased by the infiltrators from Bangladesh…We will bring a law against infiltrators. They will have to return the land they have taken from tribals,” the Union Minister said.Meanwhile, Uttar Pradesh Chief Minister Yogi Adityanath on Thursday said that the ruling parties in the state including Congress, Rashtriya Janata Party (RJD) and Jharkhand Mukti Morcha (JMM) were looting and misleading people. He alleged that they were promoting leftists to turn Jharkhand into a den of Naxals.\n\nElections on the remaining 38 seats will be conducted on November 20. The counting of the votes will take place on November 23",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/bjp-to-form-govt-jmm-will-be-booted-out-home-minister-amit-shah-in-jharkhand/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/bjp-to-form-govt-jmm-will-be-booted-out-home-minister-amit-shah-in-jharkhand.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:36:28",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.333
    },
    {
        "id": 264729114,
        "title": "‘Baloch Martyrs’ Day’ observed with calls to uphold sacrifices and push for unity and survival",
        "text": "The people of Balochistan on Wednesday, observed ‘Baloch Martyrs’ Day’, with several organisations honouring the sacrifices of the Baloch leaders, underscoring their pivotal role in the region’s history and ongoing struggle.The Baloch Yakjehti Committee and the National Democratic Party highlighted the crucial contributions of these martyrs to the Baloch cause, The Balochistan Post reported.A representative of the Baloch Yakjehti Committee remarked that the sacrifices of the Baloch leaders have played a key role in driving social change and advancement in the region. They emphasised that the rise of national awareness and the ongoing struggle for Baloch rights are direct outcomes of these sacrifices.The spokesperson also recalled the courage of historical leaders such as Mir Mehrab Khan, who chose death over surrendering to British forces, creating a legacy of resistance and sacrifice that continues to inspire future generations, the report added.He further expressed deep solidarity with the families of the ‘martyrs’, recognising the immense pain and loss they have suffered in the name of the national cause. They assured that the committee would remain committed to the principles of resistance, defiance, and sacrifice demonstrated by the Baloch ‘martyrs’, continuing the fight for national rights.In the same vein, the National Democratic Party also paid tribute to the ‘martyrs’ who gave their lives in defence of Baloch land, identity, and rights.The party emphasised that Baloch Martyrs’ Day was created to honour those who sacrificed their lives at various points in history to protect Balochistan. They particularly remembered leaders such as Nawab Mir Mehrab Khan, who resisted British colonialism and chose death rather than surrender.The National Democratic Party stressed that Martyrs’ Day is not only a day of remembrance but also a reaffirmation of the shared commitment and duty to carry forward the ‘martyrs’ mission. It serves as a reminder that the fight for Baloch rights, identity, and culture continues, with the sacrifices of the past fuelling the current struggle for national survival and unity.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/baloch-martyrs-day-observed-with-calls-to-uphold-sacrifices-and-push-for-unity-and-survival/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:35:10",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.287
    },
    {
        "id": 264729112,
        "title": "Giriraj Singh claims extremists creating ‘New Culture’ over Burqa in India, calls Rahul Gandhi, Lalu Yadav as ‘Vote ke Saudagar’",
        "text": "Union Minister Giriraj Singh on Thursday said that there is a “new culture” in the country because of extremists wherein women have started wearing Burqa even in places where they didn’t so earlier. The Union Minister claimed that girls are being forced to wear Burqa in the country, 100 crore Hindus are being threatened, adding that Rahul Gandhi or Lalu Yadav are ‘Vote ke Saudagars,’ who are supporting with them.Speaking to mediapersons, Giriraj Singh also attacked Jamiat Ulama-e-Hind chief Arshad Madani and Ittehad-e-Millat Council (IMC) chief Tauqeer Raza accusing them of creating an environment of terror in the country.“This is the year of women empowerment. There is a protest going on in the Islamic countries of the world over Burqa. In India, because of extremists a new culture has began wherein women have started wearing Burqa even in places where they didn’t wear it earlier,” he said.“Religious leaders like Madni say that they will gather with 5 lakh people against the Waqf bill. They have nothing to do with the law. Tauqeer Raza says he will surround Delhi. Owaisi says he will show everyone within 15 minutes. They have created an environment of terror in the country. Girls are being forced to wear Burqa in India 100 crore Hindus are being threatened and ‘Vote ke Saudagar’ are standing with them, whether it is Rahul Gandhi or Lalu Yadav,” said Singh.Earlier on Monday, the BJP leader had hit out at Congress and its President Mallikarjun Kharge over his statement where he stated that India faces threats from the RSS-BJP, Narendra Modi and Amit Shah.Speaking to ANI on Monday, Singh said if the country faces a threat, it is from the Congress party that wants to have a “civil war” in the country.He also attacked Rahul Gandhi and stated that the Congress leader wants to create “unrest” within the country.“If the country faces a threat, it is from the Congress party that wants to have a civil war in India. Rahul Gandhi wants to create unrest within the country. By creating unrest, they want to not only fuel civil war in India but also want to destroy India through civil war,” Giriraj Singh said.Taking a further dig at the Congress President, the Union Minister said, “Kharge Sahab, your intentions won’t be fulfilled because the youth has awoken and understood your policies.”This came following Kharge’s statement, where he said that the country ‘faces threat’ from the RSS, BJP, Modi, and Amit Shah, in a rally in Maharashtra in the run-up to the upcoming state assembly polls",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/giriraj-singh-claims-extremists-creating-new-culture-over-burqa-in-india-calls-rahul-gandhi-lalu-yadav-as-vote-ke-saudagar/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:36:59",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.329
    },
    {
        "id": 264729116,
        "title": "Fans go “extra mile” as Virat Kohli continues net practice ahead of crucial BGT",
        "text": "Star Indian batter Virat Kohli continued with his net practice in Perth, preparing for the highly anticipated Border-Gavaskar Trophy (BGT) 2024-25 against Australia. According to Fox Cricket’s recent video on X, Kohli’s training session was eagerly watched by fans, who went to great lengths to catch a glimpse of their hero.“First look at Virat Kohli at the Perth nets ahead of the Test series opener,” a Fox News Cricket post stated.“Some fans went the extra mile to catch a glimpse of the King,” it added.\n\nFirst look at Virat Kohli at the Perth nets ahead of the Test series opener 🏏\nSome fans went the extra mile to catch a glimpse of the King 👀#AUSvIND pic.twitter.com/pXDEtDhPeY\n— Fox Cricket (@FoxCricket) November 14, 2024\n\nVirat Kohli, a player who has always been a crowd-puller in Australia, is once again generating significant buzz. His presence in Australia is synonymous with high viewership and extensive media coverage.However, the upcoming series holds immense significance for Kohli. It is viewed as a make-or-break phase in his illustrious career. The former Indian captain is under pressure to regain his form and secure his spot in the Test team amid a potential transition phase, with younger talents waiting for their chance in the playing eleven.Kohli’s current form is a cause for concern. In 19 international matches this year, the 80-time centurion has managed to score only 488 runs at an average of 20.33, with just two half-centuries in 25 innings and a highest score of 76. His struggles in Test cricket have been particularly troubling, given his past dominance in the format.From 2016 to 2019, Kohli was at the peak of his career, amassing 4,208 runs at an astonishing average of 66.79, including 16 centuries and 10 fifties. He also set a record with seven double centuries, the most by a captain in Tests. However, since 2020, his form has dipped dramatically, scoring 1,838 runs in 34 Tests at an average of 31.68, with only two centuries and nine fifties.The recent home Test series against Bangladesh and New Zealand further highlighted his struggles. Kohli scored just 192 runs in 10 innings at an average of 21.33, with only one half-century. This decline in performance saw him slip out of the Top 20 in the ICC Men’s Test batting rankings for the first time in a decade.As Kohli faces criticism and doubts about his place in the team, the series in Australia presents an opportunity for redemption. Historically, Australia has been a stage where Kohli has performed spectacularly, and fans hope he can repeat that success.The Border-Gavaskar Trophy series kicks off on November 22 with the first Test in Perth. The second Test, a day-night affair, is scheduled from December 6 to 10 at Adelaide Oval. The third Test will take place at The Gabba in Brisbane from December 14 to 18.The traditional Boxing Day Test at Melbourne Cricket Ground is set for December 26 to 30, followed by the fifth and final Test at Sydney Cricket Ground from January 3 to 7. This series promises a thrilling contest and a potential turning point in Kohli’s career. (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/fans-go-extra-mile-as-virat-kohli-continues-net-practice-ahead-of-crucial-bgt/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/fans-go-extra-mile-as-virat-kohli-continues-net-practice-ahead-of-crucial-bgt.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:33:49",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.451
    },
    {
        "id": 264312620,
        "title": "Yaariyan Fame Himansh Kohli Ties The Knot With Vini Kohli In Intimate Ceremony; PICS from Wedding Go Viral",
        "text": "Congratulations are in order as Yaariyan actor Himansh Kohli has tied the knot with Vini Kohli! The actor tied the knot in an intimate ceremony at a temple in Delhi. While the actor hasn’t yet shared pictures from his big day on social media, several photos from the ceremony have surfaced on fan pages. Actor Tusshar Kapoor, who is one of Himansh’s closest friends in the industry, has also shared a picture from the couple’s wedding, and congratulated them.\nOn Tuesday evening, Tusshar Kapoor took to his Instagram account to share a picture of the newly married couple from their wedding ceremony. Himansh Kohli’s wife’s name wasn’t revealed until now, however, Tusshar shared her name while congratulating them. “Many congratulations @kohlihimansh & #vinikohli,” he wrote. The picture shows Himansh holding his wife close, as they posed post the wedding ceremony. Himansh is seen in a pink and white sherwani, while the bride donned a golden and red lehenga. The couple is all smiles in the picture. Check it out below!\nTusshar Kapoor’s Instagram story\nAs per reports, Himansh’s wife is from a non-Bollywood background, and it is an arranged-cum-love marriage. Meanwhile, several other pictures from Himansh and Vini Kohli’s wedding have gone viral on Instagram. One of the pictures shows the Yaariyan actor lovingly planting a kiss on his wife’s forehead. Himansh also shared some pictures from moments before the wedding, as he got ready for his big day. “Blessings abound!” he wrote.\n\nView this post on Instagram\n\nA post shared by himanshkohlilove❤️? (@kohlihimanshlove)\n\nView this post on Instagram\n\nA post shared by himanshkohlilove❤️? (@kohlihimanshlove)\n\nView this post on Instagram\n\nA post shared by Hemansh Kohli (@kohlihimansh)\n\nSoon after he posted the pictures, congratulatory messages started pouring in.",
        "summary": "Himansh Kohli got married to Vini Kohli in an intimate temple wedding in Delhi. Tusshar Kapoor has congratulated the couple, sharing a picture from the ceremony!",
        "url": "https://www.news18.com/movies/yaariyan-fame-himansh-kohli-ties-the-knot-with-vini-kohli-in-intimate-ceremony-pics-from-wedding-go-viral-9118170.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/yaariyaan-fame-himansh-kohli-ties-the-knot-with-vini-kohli-in-intimate-ceremony-pics-from-wedding-g-2024-11-3bbc5a9312792b5fceb9e67bdb5deaa3-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 14:00:55",
        "author": "Lubna Khan,News18",
        "authors": [
            "Lubna Khan",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.073
    }
]