[
    {
        "id": 261136292,
        "title": "JK Bank Q2 profit rises 45 pc",
        "text": "Srinagar, Oct 25: Jammu and Kashmir Bank on Friday reported 45 per cent rise in September quarter standalone profit at Rs 551 crore.\n\nIn the year-ago period, the bank had logged a profit of Rs 381.07 crore.\n\nNet profit in April-September FY25 grew 36.6 per cent to Rs 966.41 crore from Rs 707.52 crore in the same period a year ago, a statement said.\n\nBacked by both core and non-core income growth, the bank's operating profit in Q2 rose more than 47 per cent YoY and 32 per cent QoQ to Rs 787 crore.\n\nNet Interest Income (NII) was up 7.7 per cent YoY to Rs 1,435.93 crore in the September quarter. Other income surged 55.6 per cent YoY to Rs 296.08 crore.\n\nNet Interest Margin (NIM) improved to 3.90 per cent from 3.86 per cent recorded in Q1 while the cost to income ratio improved significantly to 54.56 per cent YoY from 64.93 per cent.\n\nCommenting on the bank's Q2 numbers, MD and CEO Baldev Prakash said the results are almost in line with the expectations.\n\n“The bottom-line growth underscores our financial prudence and operational excellence while reflecting our commitment to deliver consistent value for our stakeholders as we stay steady on course to achieve the annual numbers,” he said.\n\n“I believe, with a healthy balance sheet, a diversified portfolio and consistent focus on digital transformation, we are well-positioned to maintain this growth momentum and capitalize on emerging opportunities.”\n\nThe bank's gross NPA ratio decreased by 131 basis points YoY to 3.95 per cent as against 5.26 per cent recorded in September 2023. Net NPA ratio also moderated to 0.85 per cent from 1.04 per cent.\n\nMeanwhile, during the quarter the Return on Assets (RoA) jumped to 1.41 per cent YoY. Provision Coverage Ratio (PCR) also improved 55 basis-points YoY to 90.54 per cent.\n\nPrakash said keeping gross NPA below 4 per cent highlights the success of the robust risk management practices of the bank.\n\n“We have been focusing on proactive asset-quality management and ensuring long-term sustainability in lending. Another highlight of this quarter is RoA, which has surged to 1.41 per cent,” he said.\n\nWith continued improvement in key performance indicators, the bank is reinforcing its position as a leading financial institution focused on profitability and sound asset management, he added.\n\nThe bank's CASA stood at 48.60 per cent, which continues to be one of the highest in the industry.\n\nRegarding business growth, the MD and CEO said during September quarter, “our growth in advances is near 10 per cent, while we have maintained the deposit growth within the range of industry average.”\n\nGoing forward, the bank will intensify efforts to strengthen deposit base and increase loan book to achieve its top-line growth numbers, he said.\n\n“With a CRAR of almost 15 per cent, we remain well-capitalized, ensuring that the bank is positioned to support future growth opportunities while maintaining financial discipline. Pertinently, the CAR is exclusive of half-yearly profit of Rs 966 crore, which would otherwise result in taking the ratio to 16 per cent,” Prakash added.\n\nHe also emphasized on the prioritisation of carrying forward the digital momentum.\n\n“Since our role as a developmental financial institution here is not just to provide credit, we have to take care that businesses are equipped with the tools they need to manage growth sustainably,” he said.\n\nTherefore, by carrying forward the digital momentum, the bank is also revolutionizing the way its customers experience banking, making it more convenient, swift, secure and efficient for them with every passing day, Prakash added.\n\n“Going forward, we have devised a comprehensive road map to help businesses particularly MSMEs get equipped with beneficial, convenient and efficient management solutions, through collaborative banking with our fintech partners, so that these enterprises sustain growth and enjoy prosperity.”",
        "summary": "Srinagar, Oct 25: Jammu and Kashmir Bank on Friday reported 45 per cent rise in September quarter standalone profit at Rs 551 crore. In the year-ago period, the bank had logged a profit of Rs 381.07 crore. Net profit in April-September FY25 grew 36.6 per cent to Rs 966.41 crore from Rs 707.52 crore in [&#8230;]\n\n\nThe post JK Bank Q2 profit rises 45 pc appeared first on Northlines.",
        "url": "https://thenorthlines.com/jk-bank-q2-profit-rises-45-pc/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/gdsgggs-4.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:17:56",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "business",
        "source_country": "in",
        "sentiment": -0.167
    },
    {
        "id": 261136296,
        "title": "Man injured in landmine blast in Poonch",
        "text": "JAMMU, Oct 25: A man was injured in a landmine blast in Poonch district on Friday, officials said.\n\nThe 40-year-old man, identified as Haneef, was gathering wood on his land in the border belt of the Shahpur area when he accidentally stepped on a landmine, they said.\n\nHaneef sustained injuries in the incident, they said, adding that he has been evacuated and sent to a hospital for treatment.",
        "summary": "JAMMU, Oct 25: A man was injured in a landmine blast in Poonch district on Friday, officials said. The 40-year-old man, identified as Haneef, was gathering wood on his land in the border belt of the Shahpur area when he accidentally stepped on a landmine, they said. Haneef sustained injuries in the incident, they said, [&#8230;]\n\n\nThe post Man injured in landmine blast in Poonch appeared first on Northlines.",
        "url": "https://thenorthlines.com/man-injured-in-landmine-blast-in-poonch/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/blast.webp",
        "video": null,
        "publish_date": "2024-10-26 00:14:21",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.014
    },
    {
        "id": 261136300,
        "title": "Rashid protests for restoration of Darbar Move",
        "text": "Srinagar, Oct 25: Awami Ittehad Party (AIP) Chairman and Member Parliament (MP) Abdul Rashid Sheikh, popularly known as Engineer Rashid, along with his supporters took to streets in Srinagar on Friday demanding restoration of the by-annual “Darbar move” in Jammu and Kashmir.\n\nLed by Engineer Rashid, the protestors shouting slogans marched towards the civil secretariat in Srinagar demanding immediate restoration of the bi-annual “Darbar move”, the official seat of the government from Srinagar to Jammu during the winters and from Jammu to Srinagar during the Summer season.\n\nDarbar Move was the name given to the bi-annual shift of the secretariat and all other government offices of Jammu and Kashmir from one capital city (Srinagar) to another (Jammu) bi-annually, which operated from 1872 till 2021. However, the Lieutenant Governor led administration disbanded the practice in June 2021 stating that it costs more than Rs 200 Crore on the state exchequer yearly.\n\nAddressing the protestors, Rashid said today our voice should reach to the Prime Minister Narendra Modi, Home Minister Amit Shah and Jammu and Kashmir Chief Minister that Darbar move is not a question of few crores but a cultural integration between the people of two regions of Jammu and Kashmir.\n\nRashid said the people of Jammu and Kashmir do not know which their capital city is.\n\n“They snatched state, article 370, 35A and our identity from us”, Rashid said adding “don't make Jammu and Kashmir an experimental lab for your dirty politics”.\n\nHe said either declares Srinagar as the permanent capital of Jammu and Kashmir or restore the traditional Darbar move.\n\nRashid threatened that his party would come to the streets if the Darbar move was not restored within one month.",
        "summary": "Srinagar, Oct 25: Awami Ittehad Party (AIP) Chairman and Member Parliament (MP) Abdul Rashid Sheikh, popularly known as Engineer Rashid, along with his supporters took to streets in Srinagar on Friday demanding restoration of the by-annual “Darbar move” in  Jammu and Kashmir. Led by Engineer Rashid, the protestors shouting slogans marched towards the civil secretariat [&#8230;]\n\n\nThe post Rashid protests for restoration of Darbar Move appeared first on Northlines.",
        "url": "https://thenorthlines.com/rashid-protests-for-restoration-of-darbar-move/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/Er-Rashid-1-scaled-1.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:11:33",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.136
    },
    {
        "id": 261136298,
        "title": "Ready to engage with Centre over ‘Kashmir issue’: Mirwaiz Umar",
        "text": "Srinagar, Oct 25: Hurriyat Conference chairman Mirwaiz Umar Farooq on Friday said the separatist amalgam is ready to engage with the BJP-led Centre for the resolution of the “Kashmir issue”.\n\n“When the APHC (All Parties Hurriyat Conference) was formed by the leadership in 1993, the situation was entirely different with militancy at its peak (in Jammu and Kashmir).\n\n“Even at that time, the APHC, in its proclamation, had clearly stated that it advocates for a peaceful resolution of the Kashmir conflict by engagement and even after 30 years, this outlook remains the same,” the mirwaiz said here.\n\nHe was addressing the Friday congregation at the Jamia Masjid in the city's Nowhatta area.\n\nThe mirwaiz said at the BRICS Summit, Prime Minister Narendra Modi himself spoke about dialogue and diplomacy as the means for settling conflicts and not war.\n\n“The Hurriyat talked to (former prime ministers Atal Bihari) Vajpayee and Manmohan Singh, (former Pakistani president Pervez) Musharraf and is always ready to engage with the current dispensation in New Delhi. There has been too much bloodshed in Kashmir to allow it to continue,” the Hurriyat chairman said.\n\nThe mirwaiz called for investigations into recent terror attacks in Ganderbal and Baramulla districts of Jammu and Kashmir.\n\nA local doctor and six non-local labourers were gunned down by terrorists at a tunnel-construction site in the Gagangir area of Ganderbal on Sunday, while the attack in the Gulmarg area in north Kashmir's Baramulla on Thursday left four people, including two soldiers, dead.\n\n“The recent killings in Gagangir are shocking and disturbing. Now, we hear of killings in the high-security area of Gulmarg. These are very serious matters that can escalate and should be investigated,” the Hurriyat Chief said.",
        "summary": "Srinagar, Oct 25: Hurriyat Conference chairman Mirwaiz Umar Farooq on Friday said the separatist amalgam is ready to engage with the BJP-led Centre for the resolution of the “Kashmir issue”. “When the APHC (All Parties Hurriyat Conference) was formed by the leadership in 1993, the situation was entirely different with militancy at its peak (in  [&#8230;]\n\n\nThe post Ready to engage with Centre over ‘Kashmir issue’: Mirwaiz Umar appeared first on Northlines.",
        "url": "https://thenorthlines.com/ready-to-engage-with-centre-over-kashmir-issue-mirwaiz-umar/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/images-2024-10-26T054436.378.jpeg",
        "video": null,
        "publish_date": "2024-10-26 00:16:51",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.06
    },
    {
        "id": 261136304,
        "title": "Miseries of porter killed in Baramulla terror attack",
        "text": "Jammu Tawi, Oct 25: A relative of a civilian porter, who was killed in the Baramulla terror attack on Friday, called on the government to deliver justice to the family.\n\n“He was his father at home, who is a cancer patient, and his mother is elderly. He has a 3-year-old child. Where will that 3-year-old go? The household lacks a source of income. His father spends Rs 10,000 to Rs 12,000 every month on medications and other necessities. I want to urge the government that justice is needed,” a relative of the deceased said.\n\nThe deceased civilian porter identified as Mushtaq Ahmed Choudhary was killed in a terrorist attack on a military vehicle in Baramulla on Thursday.\n\nThe family of the civilian porter, mourned his demise, at their residence in Nowshera, Baramulla, in Jammu and Kashmir on Friday. Visuals showed his relatives and his wife crying inconsolably.",
        "summary": "Jammu Tawi, Oct 25: A relative of a civilian porter, who was killed in the Baramulla terror attack on Friday, called on the government to deliver justice to the family. “He was his father at home, who is a cancer patient, and his mother is elderly. He has a 3-year-old child. Where will that 3-year-old [&#8230;]\n\n\nThe post Miseries of porter killed in Baramulla terror attack appeared first on Northlines.",
        "url": "https://thenorthlines.com/miseries-of-porter-killed-in-baramulla-terror-attack/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/ANI-20241025025809.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:09:49",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.25
    },
    {
        "id": 261136302,
        "title": "Air India Express to start flights to Jammu",
        "text": "NEW DELHI, Oct 25: Air India Express will start non-stop flights to Jammu and Sri Vijaya Puram (Port Blair) from December 1.\n\n“Jammu will be connected with direct flights to Delhi and Srinagar. On the same day (December 1), Air India Express will start direct flights from Sri Vijaya Puram (Port Blair) to Bengaluru and Kolkata,” the airline said in a release on Friday (October 25, 2024).\n\nAir India Express Managing Director Aloke Singh said the airline continues to scale up its presence in the domestic market on the back of a rapidly growing fleet.\n\n“We have recently added stations and capacity in the North-East and South, and now offer a compelling pan-India domestic product…,” he added.\n\nThe Tata Group-owned airline operates over 400 daily flights, connecting 35 domestic and 14 international airports. It has a fleet of 90 aircraft.",
        "summary": "NEW DELHI, Oct 25: Air India Express will start non-stop flights to  Jammu and Sri Vijaya Puram (Port Blair) from December 1. “Jammu will be connected with direct flights to Delhi and Srinagar. On the same day (December 1), Air India Express will start direct flights from Sri Vijaya Puram (Port Blair) to Bengaluru and [&#8230;]\n\n\nThe post Air India Express to start flights to Jammu appeared first on Northlines.",
        "url": "https://thenorthlines.com/air-india-express-to-start-flights-to-jammu/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/IMG_AI_Express_terminate_2_1_PGDEABGO.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:15:08",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.388
    },
    {
        "id": 261136306,
        "title": "LG inspects key infrastructure, Smart City projects of Srinagar",
        "text": "SRINAGAR, OCt 25: Lieutenant Governor Manoj Sinha today conducted the on-site inspection and reviewed the progress of key infrastructure and Smart City projects of Srinagar.\n\nThe Lt Governor visited the project sites of Noor Jehan Bridge, Qamarwari; Wooden Pedestrian Bridge, Amira Kadal and Jhelum Riverfront Development project from Right River Bank Beyond JK Arts Emporium to Amira Kadal and directed the officers and implementing agencies to expedite the works for completion of the projects in a time-bound manner.\n\nHe also visited Srinagar Square, Lal Chowk and interacted with the shopkeepers and traders.\n\nThe Lt Governor was accompanied by Bhupinder Kumar, Secretary, Public Works (R&B); Vijay Kumar Bidhuri, Divisional Commissioner Kashmir; Dr Bilal Mohi-Ud-Din Bhat, Deputy Commissioner, Srinagar; Dr. Owais Ahmed, CEO Srinagar Smart City Limited and other senior officers.",
        "summary": "SRINAGAR, OCt 25: Lieutenant Governor Manoj Sinha today conducted the on-site inspection and reviewed the progress of key infrastructure and Smart City projects of Srinagar. The Lt Governor visited the project sites of Noor Jehan Bridge, Qamarwari; Wooden Pedestrian Bridge, Amira Kadal and Jhelum Riverfront Development project from Right River Bank Beyond JK Arts Emporium [&#8230;]\n\n\nThe post LG inspects key infrastructure, Smart City projects of Srinagar appeared first on Northlines.",
        "url": "https://thenorthlines.com/lg-inspects-key-infrastructure-smart-city-projects-of-srinagar/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/Lt-Governor-Sh-Manoj-Sinha-inspected-progress-of-key-infrastructure-Smart-City-projects-of-Srinagar-2.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:15:52",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.184
    },
    {
        "id": 261136310,
        "title": "Govt failed to establish security, peace in J&K: Rahul",
        "text": "New Delhi, Oct 25: The Congress on Friday slammed the NDA government at the Centre over the terror attack in Jammu and Kashmir's Gulmarg, saying its policies had completely failed to establish security and demanded that it should immediately take accountability as well as ensure the safety of Army personnel and civilians.\n\nTwo soldiers and two Army porters were killed in the attack on Thursday while another porter and a soldier were injured. Terrorists attacked a vehicle of the force six kilometres from the tourist hotspot of Gulmarg in north Kashmir's Baramulla district.\n\nThe terrorists opened fire on the Army vehicle in the Bota Pathri area when it was headed for the Nagin post in Afrawat range.\n\nIn a post in Hindi on X, Leader of Opposition in the Lok Sabha Rahul Gandhi said, “The news of the martyrdom of our brave soldiers in the cowardly attack on an Army vehicle in Gulmarg, Jammu and Kashmir, is extremely saddening. Two porters also lost their lives in the attack. I pay my tribute to the martyrs and express my deepest condolences to the bereaved families.”\n\nThe policies of the National Democratic Alliance (NDA) government at the Centre have completely failed to establish security and peace in Jammu and Kashmir, he said.\n\n“Contrary to their claims, the reality is that the state is living under the shadow of danger due to continuous terrorist activities, attacks on our soldiers and targeted killings of civilians,” Gandhi said.\n\nThe government should immediately take accountability and restore peace in the Valley at the earliest and ensure the safety of the Army and civilians, he said.\n\nCongress leader Priyanka Gandhi Vadra also condoled the loss of lives in the terror attack and said no amount of condemnation was enough for such acts of terror.\n\nIn a post in Hindi on X, Priyanka Gandhi said, “The news of the martyrdom of two soldiers in the terrorist attack in Gulmarg, Jammu and Kashmir, is extremely saddening. Two porters have also lost their lives in the attack.”\n\n“My deepest condolences to the bereaved families. I wish the injured a speedy recovery,” she said.\n\nViolence and terrorism are unacceptable in a civilised society and no amount of condemnation is enough for this, Priyanka Gandhi said.",
        "summary": "New Delhi, Oct 25: The Congress on Friday slammed the NDA government at the Centre over the terror attack in  Jammu and Kashmir's Gulmarg, saying its policies had completely failed to establish security and demanded that it should immediately take accountability as well as ensure the safety of Army personnel and civilians. Two soldiers and [&#8230;]\n\n\nThe post Govt failed to establish security, peace in J&#038;K: Rahul appeared first on Northlines.",
        "url": "https://thenorthlines.com/govt-failed-to-establish-security-peace-in-jk-rahul/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/IMG_Congress_Gen_Sec_Pri_2_1_S4DGARBI.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:19:38",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.547
    },
    {
        "id": 261136308,
        "title": "Search operation launched in border belt of Samba",
        "text": "JAMMU, Oct 25: The BSF and police on Friday launched a search operation to monitor suspicious activities in border areas of Samba district, officials said.\n\nThe search operation comes in the backdrop of spate of terror attacks in the Kashmir valley.\n\nOfficials said the joint search operation by the Border Security Force (BSF) and police is being conducted in the border areas of the Ramgarh sector with security forces scanning several sensitive locations, including some forest belts along the International Border.\n\nThe purpose of this operation is to monitor suspicious activities in border areas and strengthen security, they said.\n\nMeanwhile, the district magistrate of Samba, has ordered a complete ban on the sale or use of all kinds of firecrackers within two km of the International Border in Samba district.\n\nThis order shall come into effect immediately and will remain in force for a period of two months from the date of issuance, unless withdrawn or rescinded earlier, they said.",
        "summary": "JAMMU, Oct 25: The BSF and police on Friday launched a search operation to monitor suspicious activities in border areas of Samba district, officials said. The search operation comes in the backdrop of spate of terror attacks in the Kashmir valley. Officials said the joint search operation by the Border Security Force (BSF) and police [&#8230;]\n\n\nThe post Search operation launched in border belt of Samba appeared first on Northlines.",
        "url": "https://thenorthlines.com/search-operation-launched-in-border-belt-of-samba/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/20241001513L.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:12:33",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.234
    },
    {
        "id": 261136312,
        "title": "Terror attack fails to skip tourists from Gulmarg Hill Resort",
        "text": "GULMARG, Oct 25: Undeterred by the terror attack that claimed the lives of two Army porters and two soldiers merely six kilometres from this famous hill resort, tourists flocked the picturesque town of Gulmarg on Friday, even as a massive operation to hunt down the attackers was underway.\n\nOn Thursday evening, terrorists ambushed an Army vehicle in the Bota Pathri area of north Kashmir's Baramulla district when it was headed for the Nagin post in the Affarwat range. Another porter and a soldier were injured.\n\nA day later, the famous ski resort, however, witnessed an uninterrupted influx of visitors.\n\nA resident of Tripura visiting the Valley for the first time, Ujjwal said he did not feel any threat to his safety as police personnel and the administration are there to protect them.\n\nHe added that the warmth of Kashmir and its people is so special that travellers feel safe here.\n\n“I have come here with my wife and seven-year-old son. We heard about some terror attack yesterday but we did not feel any threat. Even in Tripura, we have had militancy. If something has to happen, it will happen.\n\n“We cannot stop living because of fear. Yesterday, my mother called and asked me to take precautions but I said everything was fine. The police and administration are there to take care of things,” Ujjwal said.\n\nHe added that when he asked their driver if it was safe, the man responded, “I will take care of your safety.”\n\nReferring to the October 20 terror attack on a campsite of workers of an infrastructure project in Ganderbal district that left a local doctor and six workers dead, Ujjwal said it was the day they reached Kashmir on vacation.\n\n“The day we reached here, something similar had happened in some other area but the people here are so nice. They make us feel so comfortable. I think that is what makes this place so special,” he said.\n\nDespite Thursday's attack, local tourism remains steady.\n\nSudesh Kumar, a taxi driver from Jammu, said he has been visiting Kashmir for 23 years and does not feel intimidated by the situation in the Valley.\n\n“I live in Katra and I have been coming here for 23 years now. I first confirmed it with a few people in Gulmarg and they gave a green signal. I arrived here with a Bengali group around 11 am. There is so much security here.\n\n“There is no need to worry. I am happy tourists are visiting Kashmir. Even the people of Kashmir are happy. It is good for all of us,” Kumar said, adding that business is going on and it should not stop.\n\n“If not a terrorist attack, I might die in a road accident. So, why die every day? A terrorist has the trigger, he does not see who is on the opposite side. Be it a Hindu or a Muslim, his job is to spread terror.\n\n“I have an EMI of Rs 60,000, how will I survive if I do not work? There are so many like me who have liabilities. I have faith in God and whatever is his will, I will accept that,” he said.\n\nSecurity forces on Friday morning pressed helicopters aerial surveillance around the scene of the terror attack, while a massive counter-insurgency operation in the area along the Line of Control (LoC) is underway.\n\nThere was also a temporary shutdown of the Gondola cable car project in Gulmarg but it was restored. The shutdown, according to officials, was a precautionary measure to ensure the safety of tourists and staff.\n\nHowever, local shopkeepers have a different tale to tell, fearing that the deadly attack is going to have an impact on their businesses before the situation returns to normal in a few weeks.\n\n“This attack will have an impact on our businesses for a few days. Right now, Gulmarg is trending on every platform on social media, although Bota Pathri is at some distance from here,” a local tea seller said.\n\n“Tourists are roaming freely and enjoying the beautiful scenery but it is not how Gulmarg looks like on a normal day. We are dependent on it. Many of the tourists have already cancelled plans and that is worrisome,” he added. (Agencies)",
        "summary": "GULMARG, Oct 25: Undeterred by the terror attack that claimed the lives of two Army porters and two soldiers merely six kilometres from this famous hill resort, tourists flocked the picturesque town of Gulmarg on Friday, even as a massive operation to hunt down the attackers was underway. On Thursday evening, terrorists ambushed an Army [&#8230;]\n\n\nThe post Terror attack fails to skip tourists from Gulmarg Hill Resort appeared first on Northlines.",
        "url": "https://thenorthlines.com/terror-attack-fails-to-skip-tourists-from-gulmarg-hill-resort/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/InShot_20241025_123343450-scaled-1.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:13:36",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.141
    },
    {
        "id": 261136314,
        "title": "Gulmarg Gondola ropeway reopens after brief closure",
        "text": "SRINAGAR, Oct 25: The Gulmarg Gondola ropeway service in the resort town in Baramulla district was restored after being temporarily shut down as a precautionary measure following the killings of four people, including two soldiers, in a terror attack, officials said on Friday.\n\nTwo soldiers and two Army porters were killed in the attack on Thursday while another porter and a soldier were injured. Terrorists attacked a vehicle of the force six kilometres from Gulmarg, a tourist hotspot.\n\nThe ropeway service has been restored after being shut for a few hours in the morning following Thursday's terror attack, the officials said.\n\nThe shutdown was a precautionary measure to ensure the safety of tourists and staff, they added.\n\nThe gondola, known for attracting tourists year-round with stunning views and unique mountain experiences, resumed operations after security assessments and measures were completed, they further said.\n\nThe Gulmarg Gondola is the second longest and second highest cable car service in the world. A two-stage lift ferries people to and from the Kongdoori mountain, near the Apharwat peak at a height of 13,976 feet.\n\nThe first stage transfers from the Gulmarg resort at 8,694 feet to Kongdoori station in the bowl-shaped Kongdoori Valley. The second stage of the ropeway takes tourists and skiers to a height of 13,058 feet on the Kongdoori Mountain.",
        "summary": "SRINAGAR, Oct 25: The Gulmarg Gondola ropeway service in the resort town in Baramulla district was restored after being temporarily shut down as a precautionary measure following the killings of four people, including two soldiers, in a terror attack, officials said on Friday. Two soldiers and two Army porters were killed in the attack on [&#8230;]\n\n\nThe post Gulmarg Gondola ropeway reopens after brief closure appeared first on Northlines.",
        "url": "https://thenorthlines.com/gulmarg-gondola-ropeway-reopens-after-brief-closure/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/Gulmarg-Gandola.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:10:44",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.316
    },
    {
        "id": 261135020,
        "title": "‘Pakistani terrorists behind Gulmarg terror attack’",
        "text": "A day after a deadly ambush on an Army convoy near the popular tourist spot of Gulmarg in north Kashmir's Baramulla district, which resulted in the death of two soldiers and two civilian porters, the Army on Friday identified the attackers as “Pakistani terrorists” and described the attack as “an attempt to disrupt peace and stability in Kashmir.\n\nAccording to Army officials in Srinagar, after the Army column was attacked in the area, alert troops swiftly and resolutely retaliated the fire, “forcing the terrorists to retreat leaving behind a weapon and rucksack.”\n\nThe Army said attackers escaped into dense foliage, exploiting a nala and fading light.\n\nTwo soldiers, one from Anantnag district and other from Sirsa district, succumbed to injuries sustained during the exchange of fire.\n\n“Actions by these brave soldiers prevented the terrorists from causing any further damage and demonstrated unwavering courage and commitment to safeguard the National Security and counter inimical agenda of Pakistan abetting terrorism in Kashmir,” the Army said.\n\nTwo local porters — Zahoor Ahmad Mir of Boniyar tehsil and Mushtaq Ahmad Choudhary of Uri Tehsil — also made the ultimate sacrifice.\n\n“It is evident that Pakistani terrorists are deliberately and unregretfully targeting Kashmiri locals to evoke fear and terror in the Valley, which is progressing towards peace and stability,” the Army said.\n\nIt said the only “ideology these terrorists espouse is, of “The reign of terror in Valley.”\n\nThe Army said it “remains committed to ensuring the safety and well-being of all our citizens and will resolutely achieve its efforts to combat terrorism and promote harmony in the Kashmir Valley.”\n\n“The sacrifices of these brave Kashmiris and Army soldiers will inspire the future generations to stand against the perpetrators of terror,” the Army said.",
        "summary": "A day after a deadly ambush on an Army convoy near the popular tourist spot of Gulmarg in north Kashmir's Baramulla district, which resulted in the death of two soldiers and two civilian porters, the Army on Friday identified the attackers as “Pakistani terrorists” and described the attack as “an attempt to disrupt peace and [&#8230;]\n\n\nThe post ‘Pakistani terrorists behind Gulmarg terror attack’ appeared first on Northlines.",
        "url": "https://thenorthlines.com/pakistani-terrorists-behind-gulmarg-terror-attack/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/jpg-17.jpeg",
        "video": null,
        "publish_date": "2024-10-26 00:02:58",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.002
    },
    {
        "id": 261135024,
        "title": "SEC orders revision of Panchayat electoral rolls",
        "text": "Mubashir Aalam Wani\n\nSrinagar, Oct 25 : J&K State Election Commission on Friday ordered revision of Panchayat electoral rolls in the Union Territory.\n\nIn a communique, the State Election Commission has written to the district Panchayat Election Officers that it has ordered an annual revision of Panchayat electoral rolls in the UT, with Jan 01, 2025 as qualifying date.\n\n“I am directed to convey that the J&K State Election Commission (Election Authority) has decided to undertake an annual revision of the existing Panchayat Electoral Rolls in terms of the powers vested with the Election Authority under Section 38 of J&K Panchayati Raj Act, 1989 read with Rule 4 of J&K Panchayati Raj Rules, 1996 (SRO 690 dated 25.10.2019),” reads the letter.\n\nIt further states that the electoral roll shall be revised w.r.t 01.01.2025 as qualifying date.\n\nAccording to the schedule unveiled by SEC, the draft electoral roll would be published on November 04, 2024, while the final electoral roll would be unveiled on Jan 06, 2025.\n\nThe fresh revision of electoral rolls has made it unambiguously clear that Panchayat polls wouldn't be held in 2024.\n\nAs per schedule, six special camps shall be organized at all the polling stations locations across Jammu & Kashmir on November 16, 17,23, 24, 30 and December 01.\n\n“All the Panchayat Election Booth Officers (PEBOs) shall remain present in their respective polling station locations with the requisite forms for the guidance of electors and for receiving claims /objections,” the letter states.\n\n“All the Panchayat Election Booth Officers (PEBOs) shall remain present in their respective polling station locations with the requisite forms for the guidance of electors and for receiving claims /objections,” the letter states.",
        "summary": "Mubashir Aalam Wani Srinagar, Oct 25 : J&#38;K State Election Commission on Friday ordered revision of Panchayat electoral rolls in the Union Territory. In a communique, the State Election Commission has written to the district Panchayat Election Officers that it has ordered an annual revision of Panchayat electoral rolls in the UT, with Jan 01, 2025 [&#8230;]\n\n\nThe post SEC orders revision of Panchayat electoral rolls appeared first on Northlines.",
        "url": "https://thenorthlines.com/sec-orders-revision-of-panchayat-electoral-rolls/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/Electoral-Rolls-350x250-1.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:04:05",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.143
    },
    {
        "id": 261135022,
        "title": "Ukraine war: Use or threat of nukes ‘unacceptable’, say India and Germany",
        "text": "PM Modi, Chancellor Scholz call for concerted action against all terrorist groups\n\nIndia and Germany on Friday expressed the “deepest concern” over the prolonged war in Ukraine and its tragic humanitarian consequences, with Prime Minister Narendra Modi and Chancellor Olaf Scholz sharing the view that the “use or threat of use” of nuclear weapons in the context of the conflict is “unacceptable”.\n\nA joint statement issued by the Ministry of External Affairs (MEA) after the two leaders co-chaired the seventh round of the India-Germany Inter-Governmental Consultations in New Delhi said they also “unequivocally condemned” terrorism and violent extremism in all forms and manifestations.\n\n“The leaders expressed their deepest concern over the war raging on in Ukraine, including its terrible and tragic humanitarian consequences. They reiterated the need for a comprehensive, just and lasting peace in line with international law, consistent with the purposes and principles of the UN Charter, including respect for sovereignty and territorial integrity,” it said.\n\nThe leaders also noted the “negative impacts” of the war in Ukraine with regard to global food and energy security, especially for developing and least-developed countries.\n\n“In the context of this war, they shared the view that the use, or threat of use, of nuclear weapons is unacceptable. They underscored the importance of upholding international law, and in line with the UN Charter, reiterated that all states must refrain from the threat of or use of force against the territorial integrity and sovereignty or political independence of any state,” it added.\n\nThe “Joint Statement: 7th India-Germany Inter-Governmental Consultations (IGC)” said Modi and Scholz also “unequivocally condemned the Hamas' terror attacks on October 7, 2023 and expressed concern over the large-scale loss of civilian lives and the humanitarian crisis in Gaza”.\n\nThe leaders underscored that as the world's two largest democracies, India and the European Union (EU) have a common interest in “ensuring security, prosperity and sustainable development in a multi-polar world”.\n\n“They emphasised the importance of deepening the India-EU Strategic Partnership, which would not only benefit both sides but also have a far-reaching positive impact globally,” the statement said.\n\nModi and Scholz also called for concerted action against all terrorist groups, including those proscribed by the United Nations Security Council (UNSC).\n\n“Both sides are committed to promoting a free, open, inclusive, peaceful and prosperous Indo-Pacific built on international law, mutual respect for sovereignty, and peaceful resolution of disputes, and underpinned by effective regional institutions,” the statement said.\n\nModi and Scholz reaffirmed their commitment to “further expand and deepen the Indo-German Strategic Partnership”.",
        "summary": "PM Modi, Chancellor Scholz call for concerted action against all terrorist groups India and Germany on Friday expressed the “deepest concern” over the prolonged war in Ukraine and its tragic humanitarian consequences, with Prime Minister Narendra Modi and Chancellor Olaf Scholz sharing the view that the “use or threat of use” of nuclear weapons in [&#8230;]\n\n\nThe post Ukraine war: Use or threat of nukes ‘unacceptable’, say India and Germany appeared first on Northlines.",
        "url": "https://thenorthlines.com/ukraine-war-use-or-threat-of-nukes-unacceptable-say-india-and-germany/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/images-2024-10-26T052800.460.jpeg",
        "video": null,
        "publish_date": "2024-10-25 23:59:54",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.345
    },
    {
        "id": 261135028,
        "title": "Baramulla attack aimed at disrupting peace, stability in Kashmir: Army",
        "text": "LG Sinha, CM pay homage to fallen soldiers, porters: Omar terms spate of attacks matter of serious concern\n\nSrinagar, Oct 25: The army on Friday said that the attack on its column at Bothapathri, Gulmarg in Baramulla district was a “cowardly” attempt aimed at disrupting peace and stability in Kashmir.\n\nDefence spokesman said that Pakistani terrorists, with a view to disrupt peace and stability in Kashmir, cowardly targeted an Army column in general area Butapathri, Baramulla which was ferrying soldiers and local porters.\n\n“On being fired upon, the alert troops swiftly and resolutely retaliated the fire, forcing the terrorists to retreat leaving behind a weapon and rucksack and escaped into dense foliage, exploiting a nala and fading light. Regrettably, two brave soldiers, one from Anantnag district and other from Sirsa District, succumbed to the injuries sustained during exchange of fire, thereby making the supreme sacrifice,” the statement said, adding that “Army salutes the bravery of Rifleman Kaisar Ahmad Shah and Rifleman Jeevan Singh, who despite being hit responded and forced the terrorists to flee, before laying down their lives in this cowardly terrorist attack.”\n\nThe defence spokesman said that actions by these brave soldiers prevented the terrorists from causing any further damage and demonstrated unwavering courage and commitment to safeguard the National Security and counter inimical agenda of Pakistan abetting terrorism in Kashmir. “Their selfless act is a testament to the Indian Army's resolve to safeguard our Nation and the Citizens,” he said.\n\nThe defence spokesman further said that alongside the brave soldiers, two Kashmiri porters Zahoor Ahmad Mir resident of Boniyar Tehsil and Mushtaq Ahmad Choudhary resident of Uri Tehsil also made the ultimate sacrifice, while serving the Nation. “It is evident that Pakistani terrorists are, deliberately and unregretfully, targeting Kashmiri locals to evoke the fear and terror in Valley, which is progressing towards peace and stability. The only ideology these terrorists espouse is of The Reign of Terror in Valley,” the spokesman said.\n\nHe said that Army pays tributes to these brave soldiers and porters, who laid down their lives while serving the Nation and extend heartfelt condolences to their families. ‘Indian Army remains committed to ensuring the safety and well-being of all our citizens and will resolutely achieve its efforts to combat terrorism and promote harmony in Kashmir Valley. The sacrifices of these brave Kashmiris and Indian Army Soldiers will inspire the future generations to stand against the perpetrators of terror,” the spokesman said.\n\nMeanwhile, Lieutenant Governor Manoj Sinha laid wreath and paid homage to Rfn Jeevan Singh, Rfn Kaisar Ahmad Shah, and Defence Porters Mushtaq Ahmad Chowdary and Zahoor Ahmad Mir, who laid down their lives for the nation.\n\nThe Lieutenant Governor posted on X: “Paid homage to the brave soldiers and Defence Porters who made the supreme sacrifice in the service to the nation in Butapathri Sector on October 24, 2024. India will never forget their selfless service & their supreme sacrifice. We stand in solidarity with the bereaved families”.\n\nChief Minister Omar Abdullah also wrote on X that “Very unfortunate news about the attack on the army vehicles in the Boota Pathri area of North Kashmir which has resulted in some casualties & injuries. This recent spate of attacks in Kashmir is a matter of serious concern. I condemn this attack in the strongest possible terms & send my condolences to the loved ones of the people who lost their lives. I also pray that the injured make a complete & swift recovery.”\n\nPDP chief Mehbooba Mufti also stated on X that “shocked & deeply saddened by the militant attack on an army convoy in Baramulla in which a civilian porter has been killed. Condemn it unequivocally & pray for the swift recovery of the injured soldiers.”",
        "summary": "LG Sinha, CM pay homage to fallen soldiers, porters: Omar terms spate of attacks matter of serious concern Srinagar, Oct 25: The army on Friday said that the attack on its column at Bothapathri, Gulmarg in Baramulla district was a “cowardly” attempt aimed at disrupting peace and stability in Kashmir. Defence spokesman said that Pakistani [&#8230;]\n\n\nThe post Baramulla attack aimed at disrupting peace, stability in Kashmir: Army appeared first on Northlines.",
        "url": "https://thenorthlines.com/baramulla-attack-aimed-at-disrupting-peace-stability-in-kashmir-army/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/images-2024-10-26T053428.910.jpeg",
        "video": null,
        "publish_date": "2024-10-26 00:06:25",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.019
    },
    {
        "id": 261135026,
        "title": "India, China to resume patrol at Depsang, Demchok from Oct 30",
        "text": "To remove temporary blockades, structures at patrolling routes\n\nIndia and China have agreed to resume patrolling by their respective troops at Depsang and Demchok along the Line of Actual Control (LAC) in eastern Ladakh by October 30.\n\nBefore that, both sides will remove all temporary structures set up to block each other's patrolling routes.\n\nOnly Depsang and Demchok were under discussion for the reopening of patrolling that was announced last Monday. “We will go back to patrolling to spots, where we were patrolling before April 2020,” Army sources said on Friday.\n\nThe troops on either side will inform one another before a patrol party is launched. This means patrolling will be coordinated and decided in advance.\n\n“These are a part of measures put in place so that no faceoff occurs at the LAC,” the sources said.\n\nIndian troops will carry hand-held weapons — rifles — as they did on patrol duties earlier.\n\nThe present ‘patrolling arrangement' between India and China, announced on Monday, is only for Depsang and Demchok, the sources added.\n\nThe arrangement does not touch any other contentious spot in eastern Ladakh, where disengagement had already taken place, like Gogra, Hot Springs, Pangong Tso and Galwan.",
        "summary": "To remove temporary blockades, structures at patrolling routes India and China have agreed to resume patrolling by their respective troops at Depsang and Demchok along the Line of Actual Control (LAC) in eastern Ladakh by October 30. Before that, both sides will remove all temporary structures set up to block each other's patrolling routes. Only [&#8230;]\n\n\nThe post India, China to resume patrol at Depsang, Demchok from Oct 30 appeared first on Northlines.",
        "url": "https://thenorthlines.com/india-china-to-resume-patrol-at-depsang-demchok-from-oct-30/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/gettyimages-1396065589.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:01:44",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.526
    }
]