[
    {
        "id": 260499420,
        "title": "Secularism Held To Be Part Of Basic Structure Of Constitution: SC On Preamble Petitions",
        "text": "The Supreme Court on Monday said secularism had always been held to be part and parcel of the basic structure of the Indian Constitution.\nA bench comprising Justices Sanjiv Khanna and Sanjay Kumar passed the remark while hearing a batch of petitions filed by former Rajya Sabha MP Subramanian Swamy, advocate Vishnu Shankar Jain and others, who have challenged the inclusion of words ”socialist” and ”secular” in the Preamble of the Constitution.\n”This court has in a number of judgments held that secularism was always part of the basic structure of the Constitution. If one looks right to equality and the word ’fraternity’ used in the Constitution, there is a clear indication that secularism has been held as the core feature of the Constitution,” the bench said.\nThe words ”socialist’ and ”secular” were inserted into the Preamble of the Constitution under the 42nd Constitutional amendment moved by the Indira Gandhi government in 1976.\nThe amendment changed the description of India in the Preamble from a ”sovereign, democratic republic” to a ”sovereign, socialist, secular, democratic republic”.\nDuring the hearing, Jain submitted that Dr B R Ambedkar had opined that the inclusion of the word ”socialism” would curtail personal liberty. He added that preamble cannot be amended through amendments.\nJustice Khanna said there were different meanings of socialism and one ”should not take the meaning adopted in Western countries”.\n”Socialism can also mean that there should be equality of opportunity and the wealth of the country should be distributed equally,” the bench said.\nAdvocate Ashwini Upadhyay, who too had filed a petition, said he was neither against the words ”socialist, secular and integrity” nor their insertion in the Constitution but against the insertion of these words into the Preamble in 1976 and that too with a retrospective effect from November 26, 1949.\nHe said adding a word did not have any real effect in the country but opened a pandora’s box for the future governments, who can play with it and may remove a word from the Preamble.\nSwamy, on other hand, submitted the Preamble was a declaration made on November 26, 1949, and therefore adding further words to it, through a subsequent amendment, was arbitrary.\nHe said it was wrong to depict that as per the present Preamble, the Indian people agreed on November 26, 1949, to make India a socialist and secular republic. The bench said it would examine the matter and posted it for further hearing on November 18.\nOn February 9, the top court had questioned whether the Preamble of the Constitution could be amended while keeping the date of adoption, November 26, 1949 intact.\n”For the academic purpose, can a Preamble that has the date mentioned, be changed without altering the date of adoption. Otherwise, yes the Preamble can be amended. There is no problem with that,” Justice Datta had remarked.\nJain said that the Preamble of the Constitution of India comes with a specific date, therefore, it cannot be amended without a discussion.\nSwamy said the 42nd Amendment Act was passed during the emergency (1975-77).\nOn September 2, 2022, the top court had tagged Swamy’s plea with other pending matter — filed by one Balram Singh and others — for hearing.\nBoth Swamy and Singh has sought deletion of ”socialist” and ”secular” from the Preamble.\nSwamy in his plea has contended that Preamble cannot be altered, varied, or repealed.\nHe said the Preamble not only indicated the essential features of the Constitution but also the fundamental conditions based on which it was adopted to create a unified integrated community.",
        "summary": "The words ”socialist’ and ”secular” were inserted into the Preamble of the Constitution under the 42nd Constitutional amendment moved by the Indira Gandhi government in 1976.",
        "url": "https://www.news18.com/india/secularism-held-to-be-part-of-basic-structure-of-constitution-sc-on-preamble-petitions-9093577.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-36-2024-10-ead80f35d4fdca63e79d515e52b7f54e-16x9.png?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:47:30",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.071
    },
    {
        "id": 260499422,
        "title": "One Year of RRTS Operations: More Than 40 Lakh Passengers Served; Ghaziabad & Sahibabad Saw Highest Footfall",
        "text": "It was on October 21, 2023, that the first passenger service on the priority section of the Delhi-Meerut Regional Rapid Transit System (Delhi-Meerut RRTS) began. On Monday, India’s first RRTS service completed one year of operations and in the last 365 days, it has served more than 40 lakh passengers. This is the first-of-its-kind train service in India connecting Delhi, Ghaziabad and Meerut.\n“.. Since the launch on October 21, 2023, Namo Bharat trains have significantly transformed commuting across Ghaziabad, Sahibabad, and the surrounding regions, successfully serving over 40 lakh passengers in their first year of operations. Ghaziabad RRTS Station registered the highest footfall over the past year, followed closely by Sahibabad and Modinagar North RRTS Stations,” an official statement from National Capital Region Transport Corporation (NCRTC) reads.\nThe 17-km priority section connected Sahibabad to Duhai Depot with stations at Ghaziabad, Guldhar, and Duhai on the way. \nIn March 2024, the service was extended on additional 17 kilometres up to Modinagar. It connected Murad Nagar, Modinagar South, and Modinagar North.\nIn August, the service entered Meerut with the starting of the Meerut South station. \nEarlier this month, a trial run for the service in Delhi also started to connect New Ashok Nagar and Anand Vihar RRTS station with the already operational Sahibabad station. \nOn Monday, to mark the one-year anniversary, minister of housing and urban affairs and minister of power Manohar Lal Khattar took a ride on the service and visited key stations along the Delhi-Ghaziabad-Meerut RRTS corridor. He boarded the Namo Bharat train from Sahibabad station — the first operational station from Delhi side. \nThe minister also visited the under-construction Anand Vihar RRTS station. With its proximity to two Metro lines, a railway station, and two inter-state bus terminals (ISBTs) in Delhi and Kaushambi, Uttar Pradesh, Anand Vihar is set to become one of the region’s busiest transit hubs. The station’s multimodal connectivity facilitates smooth transitions between various modes of transportation, enhancing convenience and accessibility for daily commuters and creating a comprehensive network of networks.\nCurrently, Namo Bharat services operate on a 42-kilometer stretch covering nine stations — Sahibabad, Ghaziabad, Guldhar, Duhai, Duhai Depot, Muradnagar, Modi Nagar South, Modi Nagar North, and Meerut South. The corridor will soon extend to 54 kilometres with the addition of the Sahibabad to New Ashok Nagar section, which includes key stations of Anand Vihar and New Ashok Nagar.\nHigh-speed connectivity between suburban areas\nRRTS is the first-of-its-kind train service in India. These are not metro trains and are also not regular railway services. While it offers comfort like a metro train, it has the reach of the railways. \nThe service distinguishes itself from other modes of transport by providing high-speed connectivity between suburban areas, significantly reducing commuting times for longer distances. \nThis system is especially effective in addressing the challenges posed by urban expansion into new regions, such as the National Capital Region (NCR). \nBy enabling travellers to cover greater distances in a shorter time frame, RRTS enhances accessibility and convenience, making it an ideal solution for commuters navigating the growing urban landscape.\nOnce the entire 82-kilometer corridor is completed by June 2025, passengers will be able to travel from Delhi to Meerut in under an hour, revolutionising regional connectivity and enhancing the overall commuter experience.",
        "summary": "The Delhi-Meerut Regional Rapid Transit System distinguishes itself from other modes of transport by providing high-speed connectivity between suburban areas, significantly reducing commuting times for longer distances",
        "url": "https://www.news18.com/india/one-year-of-rrts-operations-more-than-40-lakh-passengers-served-ghaziabad-sahibabad-saw-highest-footfall-9093557.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/rrts-2024-10-c2d5b53d0cbb64dc42114425f78e6ea3-16x9.jpg?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:32:58",
        "author": "Apoorva Misra,News18,Nivedita Singh",
        "authors": [
            "Apoorva Misra",
            "News18",
            "Nivedita Singh"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.215
    },
    {
        "id": 260499426,
        "title": "Isha Foundation's Sadhguru Is Canada India Foundation's Global Indian 2024",
        "text": "Canada India Foundation (CIF) has conferred the prestigious CIF Global Indian Award 2024 to Sadhguru, the Indian yogi, mystic and visionary and the Founder of Isha Foundation. The award, which celebrates individuals of Indian origin who have made a profound global impact, recognises Sadhguru’s unparalleled contributions towards creating a Conscious Planet and his leadership in tackling environmental challenges and advancing human consciousness.\nRitesh Malik, Chair of the Canada India Foundation, shared, “We consider ourselves truly fortunate that Sadhguru has not only agreed to be our latest honouree to join a long line of illustrious names, but he also kindly agreed to be present in Toronto to receive the Award. Sadhguru’s most important message has implications for the whole of humanity as well as the future of our planet. In Sadhguru, we have a perfect union of understanding the current challenges and finding solutions to the most pressing issues, guided by the wisdom traditions of the ancient Indian spiritual and knowledge systems as well as straight-forward common sense which unfortunately is not so common anymore. Sadhguru provides practical solutions for the full personal development of the individual as well as long-term solutions to the planet-wide challenges like soil degradation, climate change and food quality.”\n“Canada can benefit greatly from thought leaders like Sadhguru, whose teachings align with Canada’s own focus on individual well-being, sustainability, and inclusivity. His emphasis on yoga, meditation, and mindfulness aligns perfectly with Canada’s public health priorities, especially in the great challenge to the system offered by mental illness,” he added further.\nOn receiving the award, Sadhguru expressed his gratitude towards the CIF, dedicating the associated prize money of CAD 50,000 to Cauvery Calling, a first-of-its-kind initiative, setting the standard for how Bharat’s rivers – the country’s lifelines – can be revitalized. It aims to revitalize Cauvery River and significantly improve the economy of farmers by enabling the planting of 242 crore trees on private farmlands. To date, the project has enabled the plantation of 111 million living trees.\nAbout Canada India Foundation\nCanada India Foundation (CIF) is a non-profit organization dedicated to promoting strong bilateral relations between Canada and India. Through initiatives that build mutual understanding and collaboration, CIF has been instrumental in highlighting the global contributions of Indian-origin leaders.\nAbout Sadhguru\nYogi, Mystic and Visionary, Sadhguru is among the most influential of our times. A New York Times bestselling author, Sadhguru is acclaimed as a speaker and opinion-maker of international renown. He is the only living Indian to have received three Presidential Awards from three different Presidents, among which is India’s highest annual civilian award, the Padma Vibhushan. Three decades ago, Sadhguru founded Isha Foundation, a non-profit human-service organization which is supported by over 17 million volunteers worldwide. As part of the Conscious Planet initiative, he has also launched the world’s largest people’s movement – Save Soil, which has so far reached over 4 billion people.",
        "summary": "Expressing his gratitude towards the CIF, Sadhguru dedicates the associated prize money of CAD 50,000 to Cauvery Calling, a first-of-its-kind initiative, setting the standard for how Bharat’s rivers can be revitalised",
        "url": "https://www.news18.com/india/canada-india-foundation-presents-global-indian-award-2024-to-isha-foundations-sadhguru-9093489.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/04/img-2-2024-04-09t164608.301-2024-04-5d1e0b9f4b8110995ee12d4481610b26-16x9.jpg?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:34:47",
        "author": "Manjiri Joshi,News18",
        "authors": [
            "Manjiri Joshi",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.567
    },
    {
        "id": 260499424,
        "title": "Who is Shailbala Martin, IAS Officer Who Sparked Row With Temple Loudspeaker Post?",
        "text": "In Madhya Pradesh, a significant debate has emerged regarding the use of loudspeakers in temples, ignited by a recent social media post from IAS officer Shailbala Martin. The 2009-batch officer, currently serving as Additional Secretary in the General Administration Department, raised pertinent questions that garnered widespread attention.\nWho Is Shailbala Martin?\nShailbala Martin, originally from Jhabua, Madhya Pradesh, was born on April 9, 1965. According to the state government website, she began her career in the State Civil Service (SCS) before being promoted to the Indian Administrative Service (IAS) on June 12, 2017. With a BA and an MA in Arts from Holkar Science College in Indore, Martin joined the State Civil Service in 2009.\nThroughout her career, Martin has held various positions, including roles in the Health Department in 2014, Municipal Commissioner of Burhanpur in 2019, and Collector of Niwari district the same year. Since January 25, 2022, she has been serving as Additional Secretary in the General Administration Department.\nThe Loudspeaker Controversy\nThe recent controversy can be traced back to guidelines issued by the state government last year to mitigate noise pollution, which specifically aimed to regulate loudspeakers in religious venues. A journalist on the social media platform X (previously Twitter) questioned the disparity in enforcement, focusing on the use of loudspeakers in mosques and the prevalence of DJs playing music outside these spaces.\nIn response, Martin highlighted the noise pollution caused by loudspeakers in temples, questioning why such disturbances, which can be heard several streets away and continue late into the night, are often overlooked. Her tweet sparked a mix of reactions, with some users supporting her stance while others criticised her for raising the issue.",
        "summary": "In Madhya Pradesh, a significant debate has emerged regarding the use of loudspeakers in temples, ignited by a recent social media post from IAS officer Shailbala Martin.",
        "url": "https://www.news18.com/india/who-is-shailbala-martin-ias-officer-who-posted-about-loud-temple-loudspeakers-9093521.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-1-2024-10-e4e22f1928d93ab52689b337ad0af3d6-16x9.jpg?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:39:50",
        "author": "Diksha Modi,News18,Translation Desk",
        "authors": [
            "Diksha Modi",
            "News18",
            "Translation Desk"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.385
    },
    {
        "id": 260499428,
        "title": "Hit the Disc at UP’s Largest Floating Restaurant in Gorakhpur, Entry at Rs 1,500",
        "text": "The floating restaurant of Gorakhpur in Uttar Pradesh is now ready with new facilities to attract customers. The ‘Trident Club’ has now turned this fine dining place afloat the Ramgarh Taal into the perfect party spot in the city.\nAccording to Alok Aggarwal, the Managing Director of the restaurant, the entry fee in this ‘Trident Club’ has been kept very economical. Aggarwal said that a person can enjoy their time at the disco along with food and drinks for just Rs 1,500. Speaking about couple entry, he said that the offer is even cheaper. Couples can enjoy themselves at the disco for just Rs 2,000. Though this package does not include unlimited service, it would be enough for the night, he said.\nThe restaurant has recently changed its entry policy. Earlier, a coupon of Rs 300 had to be taken for entry at the floating restaurant making it unattractive owing to the high rate. The entry fee has now been reduced to just Rs 30 so that more people can visit the place and order the dishes of their choice.\nThis floating restaurant, built at a cost of Rs 10 crore, is reportedly the largest in Uttar Pradesh. It has the capacity to serve 150 people at a time. Despite the 5-star facilities in this restaurant, inaugurated by Chief Minister Yogi Adityanath on September 19, the food prices have been kept very economical. One can order a special thali at the restaurant at just Rs 250. However, only vegetarian food is served here.\nOne can have unique experiences at every floor of this three-storey floating restaurant. There is a food court at the first floor where one can enjoy their favourite dishes at an economical rate. On the second floor one can enjoy at the disco and the bar. One can also enjoy the view of the lake from the open deck at the third floor.",
        "summary": "According to Managing Director Alok Aggarwal a person can enjoy their time at the disco, including food and drinks, for just Rs 1,500. For couples, the offer is even more affordable, with entry priced at just Rs 2,000.",
        "url": "https://www.news18.com/india/hit-the-disc-at-ups-largest-floating-restaurant-in-gorakhpur-entry-at-rs-1500-9093554.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/floating-disco-2024-10-f6569219222f7a13b0bd96227f3ad2d5-16x9.png?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:57:19",
        "author": "News18,Satyaki Baidya",
        "authors": [
            "News18",
            "Satyaki Baidya"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.551
    },
    {
        "id": 260496174,
        "title": "UP Woman Prays For Husband’s Long Life On Karva Chauth, Then Kills Him By Poisoning",
        "text": "In a shocking incident, a woman allegedly killed her husband by poisoning, moments after completing the fast of Karva Chauth for the latter’s long life in Uttar Pradesh’s Kaushambi district on Sunday.\nAccording to the police officials, the accused woman, Savita, had poisoned her husband, Shailesh (32), after she suspected that the latter was having a love affair with another woman, NDTV reported.\nThe incident took place in district’s Lal Bahadur Shastri Nagar area when the woman had an argument with Shailesh while breaking the fast during evening time. Shailesh’s brother, Akhilesh said that his sister-in-law poisoned her brother’s food. Shailesh was rushed to a hospital, where he also recorded a video declaration stating that Savita had poisoned his food. He died during treatment.\nThe accused woman, who was absconding, has been arrested by the police.\n“The crime was reported from Ismailpur village. The woman allegedly poisoned her husband after they had a fight. The man died during treatment. A case has been registered, the woman has been arrested and the body has been sent for a post-mortem,” NDTV quoted Kaushambi Superintendent of Police Brijesh Kumar Shrivastava as saying.",
        "summary": "According to the police officials, the accused woman, Savita, had poisoned her husband, Shailesh (32), after she suspected that the latter was having a love affair with another woman.",
        "url": "https://www.news18.com/india/up-woman-prays-for-husbands-long-life-on-karva-chauth-then-kills-him-by-poisoning-9093542.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-19-2024-10-9f2e6a6ff79f3e3dacfc6865d05ea3cd-16x9.png?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:23:38",
        "author": "News18,Shobhit Gupta",
        "authors": [
            "News18",
            "Shobhit Gupta"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.512
    },
    {
        "id": 260496178,
        "title": "'Mysterious' Disease Outbreak in Udaipur Tribal Village Leaves 17 Dead in a Month",
        "text": "A total of 17 people have died in the last month in a tribal village in Rajasthan leading to widespread concern about the outbreak of an epidemic.\nWhile it is not certain whether the string of deaths in the Ghata Gram Panchayat in Rajasthan’s Udaipur district is due to some seasonal disease or some other cause, several villagers have attributed these deaths, mostly among children, to be due to some ‘mysterious disease’.\nAmong the 17 deaths, the latest being a child who died a day ago, 16 died after receiving treatment from unqualified practitioners. According to Sarpanch Nikaram Garasiya, the district administration has been informed about this grave epidemic.\nThe villagers said that immediate treatment for this specific fatal disease is not readily available. This has led to fear, especially among the sick, in the village.\nWhen the district administration came to know about the serious nature of the disease, the medical department has set up medical camps in four villages of Ghata gram panchayat. Deputy Chief Medical and Health Officer (CMHO) Deepak Jain said that the medical department team from Kotra has also reached the location. \nJain said that patients are being treated through door-to-door visits adding that it is possible that these deaths may have occurred due to seasonal diseases. Jain said that the medical department is investigating the entire matter and more than 400 patients have been treated so far.\nThe victims are being treated in the presence of Deputy CMHO Deepak Jain and Kotra Block Chief Medical and Health Officer (BCMO) Shankarlal Chauhan. Meanwhile, all the unqualified practitioners in the area have disappeared. Many medical clinics have also shut down.\nThe locals are in fear and have pleaded for a swift resolution to the disease outbreak. The epidemic has also emerged as a challenge for the local administration with the health department making every possible effort to control the seasonal diseases. \nIt should be noted that in Rajasthan, seasonal diseases are most prevalent in Jaipur and Udaipur districts.",
        "summary": "Uncertainty surrounds the cause of deaths in Rajasthan's Ghata Gram Panchayat, but villagers attribute the fatalities, mostly among children, to a 'mysterious disease'",
        "url": "https://www.news18.com/india/mysterious-disease-outbreak-in-udaipur-tribal-village-leaves-17-dead-in-a-month-9093526.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/disease-outbreak-2024-10-b7e39dd3e4341ef127c9f5ca8a66e519-16x9.png?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:16:08",
        "author": "News18,Satyaki Baidya",
        "authors": [
            "News18",
            "Satyaki Baidya"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.322
    },
    {
        "id": 260496176,
        "title": "‘Reached An Understanding’: Jaishankar On Border Disengagement With China",
        "text": "External Affairs Minister S Jaishankar said disengagement with China has been completed at the Line of Actual Control (LAC) and hoped that both nations would be able to come back to peace as they have reached an understanding. \nSpeaking at a convention organised by broadcaster NDTV on Monday, Jaishankar said India and China are rising powers who are growing at a fast pace in near proximity and it would require diplomacy to handle this ‘double rise’ in the region.",
        "summary": "S Jaishankar said the rise of India and China in the current century will have to be managed with diplomacy as both powers lie close to each other.",
        "url": "https://www.news18.com/world/reached-an-understanding-jaishankar-on-border-disengagement-with-china-9093552.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/s-jaishankar-pti-kim-jong-un-george-soros-dinner-2024-10-c66ada83302a09949c038c46ab3731f5-16x9.jpg?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:27:46",
        "author": "News18,Shankhyaneel Sarkar",
        "authors": [
            "News18",
            "Shankhyaneel Sarkar"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.586
    },
    {
        "id": 260496180,
        "title": "Rohini Blast: Time & Venue Selected for Minimum Harm, Lack of Device Points to Crude Bomb",
        "text": "The time, date, and venue of Sunday’s blast at a CRPF school in Rohini’s Prashant Vihar area was selected to cause minimum damage, top intelligence sources have told CNN-News18 even as agencies look for clues to understand the motive behind the incident.\n“Post-facto claims have become the norm and we are verifying those. There were no clues available from the spot and analysis is going on,” they said.\nThe sources added: “The place is insignificant in terms of being picked as a target for a bomb blast. This is a busy area in terms of car parking and residential locality but the logistics ensured that no damage occurred. What is most surprising is that no bomb blast material is available and neither was any device found. In this case, it becomes a crude bomb.”\nCrude bomb is used in Bengal and other parts of India, sources said, adding that they had never been used in the national capital.\n“The CCTV footage examination is crucial. There is no clue in CCTVs so far as no one is seen going closer to the spot where the blast took place.”\nOn Monday, Delhi Police said they are probing a possible Khalistani link to the blast. It has written to Telegram, a messaging app, seeking information about a group claiming responsibility for the explosion in a purported social media post on the platform.\nThe purported message, posted on Sunday evening (October 20), said the blast was in retaliation to the alleged targeting of pro-Khalistan separatists by Indian agents. The claim was made by Justice League India using a clip of the blast with a “Khalistan Zindabad” watermark at the bottom, and circulated on social media platforms.\nThe blast, which destroyed a portion of the school wall, window panes of nearby shops, and damaged a few cars parked nearby, was captured in a CCTV camera. Police suspect that the bomb might have been placed late at night as local residents said it went off between 7.35 am and 7.40 am.\nThe sound of the blast was heard several hundred metres away. Videos from the spot showed thick plumes rising from the site. Residents called the explosion “intense” and reported a foul smell in the area.\nPolice have filed a case under sections of Bharatiya Nyaya Sanhita (BNS) on charges of “mischief through explosion” and under the Explosives Act.",
        "summary": "On Monday, Delhi Police said they are probing a possible Khalistani link to the blast and have written to messaging app Telegram, seeking information about a group claiming responsibility for the explosion",
        "url": "https://www.news18.com/india/rohini-blast-time-venue-selected-for-minimum-harm-lack-of-device-points-to-crude-bomb-9093556.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/nsg-delhi-rohini-bomb-blast-pti-2024-10-0985953d7ae38016a6fc6e6af7ce0fc8-16x9.jpg?impolicy=website&width=1200&height=675",
        "video": null,
        "publish_date": "2024-10-21 11:26:42",
        "author": "Apoorva Misra,Manoj Gupta,News18",
        "authors": [
            "Apoorva Misra",
            "Manoj Gupta",
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.687
    }
]