[
    {
        "id": 264075232,
        "title": "Gurugram: Gangster wife held for demanding Rs 2 cores ransom from hotel owner",
        "text": "Gurugram, Nov 11 (IANS) Notorious gangster Kaushal Chaudhary’s wife was arrested after she demanded a ransom of Rs 2 crore from a hotel owner in Rajasthan posing as a gang member of Kaushal Chaudhary and Amit Dagar gang, police said.\n\nThe woman was identified as 35-year-old Manisha Chaudhary a resident of Naharpur Rupa village of Gurugram. She was arrested from Devilal Colony in Gurugram on Monday.\n\nThe Haryana Police have also announced a bounty of Rs 20,000 on her arrest.\n\nGangster Kaushal Chaudhary and Amit Dagar are already lodged in the jail, police said.\n\nAccording to the police, on September 15, 2024, a person filed a complaint at the Bilaspur police station here in Gurugram that he works at a Hotel Highway King in Rajasthan’s Neemrana area.\n\n“On September 10 an unknown caller called him on his hotel number and introduced himself as a member of Kaushal Chaudhary and Amit Dagar gang and demanded a ransom of Rs 02 crore and threatened to fire at the hotel if the ransom was not paid and also threatened to kill if a complaint was made to the police,” the complainant told the police.\n\nBased on his complaint, a case was registered under the relevant sections at the Bilaspur Police Station in Gurugram.\n\nDuring interrogation, a police team led by Sub-Inspector Lalit Kumar, Incharge Crime Branch Manesar, Gurugram and while taking action, the police team apprehended Manisha.\n\nDuring questioning, the woman revealed that she carried out the incident of firing for ransom at Hotel Highway King Neemrana, Rajasthan. The accused also revealed providing illegal weapons to four accused caught in the police encounter in the Manesar area and one caught from the area of ​​Sector-29, Gurugram.\n\n“From the observation of the criminal record of the woman, it was found that three cases are registered against her in Gurugram in relation to extortion, murder and fraud. The accused has also been in Bhondsi Jail, Gurugram and Hoshiarpur (Punjab) Jail before this incident,” Varun Dahiya, ACP (crime) said.\n\nThe police team has recovered two mobile phones from the possession of the accused.\n\n“The police teams are collecting evidence and information related to the crime. The accused was produced in the local court on Monday and took her on six days of police remand. During this period, the accused will be thoroughly interrogated regarding the crimes committed in various states,” he added.",
        "summary": "Gurugram, Nov 11 (IANS) Notorious gangster Kaushal Chaudhary&#8217;s wife was arrested after she demanded a ransom of Rs 2 crore from a hotel owner in Rajasthan posing as a gang member of Kaushal Chaudhary and Amit Dagar gang, police said. The woman was identified as 35-year-old Manisha Chaudhary a resident of Naharpur Rupa village of [&#8230;]",
        "url": "https://bhaskarlive.in/gurugram-gangster-wife-held-for-demanding-rs-2-cores-ransom-from-hotel-owner/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411113258549.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 12:34:28",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.434
    },
    {
        "id": 264075236,
        "title": "Congress leader attacked in pre-poll violence in Assam",
        "text": "Guwahati, Nov 11 (IANS) Pre-poll violence continued in Assam’s Samaguri Assembly constituency on the last day of campaigning for the upcoming by-election with the latest being a Congress leader who claimed to come under attack by miscreants.\n\nThe person identified as Amjad Ali, a local Congress leader alleged that he was targeted by a group of miscreants in the wee hours of Monday.\n\nHe told reporters here, “Around 4 a.m. in the morning today, some miscreants launched an attack on my house and the vehicle parked outside my residence got heavily damaged in the incident.”\n\nAli claimed that the miscreants belong to the BJP and he had a hitch with a group of ruling party workers during the poll campaign.\n\n“I have registered a police complaint for an investigation in the incident,” he added.\n\nSamaguri Assembly constituency has witnessed sporadic pre-poll violence with supporters of BJP and Congress clashing with each other on several occasions.\n\nOn late Saturday night, suspected armed criminals opened fire on a BJP march that included Barhampur MLA Jitu Goswami, injuring at least three people.\n\nAttackers targeted BJP politicians taking part in the march, including MLA Goswami, in the Moriputhi neighborhood of Samaguri.\n\nAccording to witnesses, the attackers first pelted stones at the participants before striking them with sticks. Three people were hurt when unidentified persons opened fire on the group. The attack also caused some damage to Goswami’s car.\n\nReacting to the incident, Chief Minister Himanta Biswa Sarma lashed out at Congress party alleging that the opposition party which does photo-op with the Constitution is actually resorting to violence and attacking the BJP workers.\n\nTaking to X, Sarma wrote, “I strongly condemn the attack on Hon’ble MLA Shri Jitu Goswami in Samaguri by @INCAssam supporters. This is the same Congress that proudly holds up the Constitution for the cameras, yet resorts to violence under cover of darkness to intimidate our karyakartas.”\n\n“The real question is, why has Congress stooped to such low in this by-election? It’s not just fear of defeat but the desperation to hold on to their core vote bank that drives them to such extremes. Justice will be served, and we will not allow anyone to sabotage or undermine our democratic process,” he added.",
        "summary": "Guwahati, Nov 11 (IANS) Pre-poll violence continued in Assam’s Samaguri Assembly constituency on the last day of campaigning for the upcoming by-election with the latest being a Congress leader who claimed to come under attack by miscreants. The person identified as Amjad Ali, a local Congress leader alleged that he was targeted by a group [&#8230;]",
        "url": "https://bhaskarlive.in/congress-leader-attacked-in-pre-poll-violence-in-assam/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411113258525.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 12:58:01",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.173
    },
    {
        "id": 264075234,
        "title": "Malaysia’s palm oil stocks fall 6.32 per cent in October",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Kuala Lumpur, Nov 11 (IANS) Malaysia, the world&#8217;s second-largest palm oil producer, saw its palm oil stocks fall 6.32 per cent from the previous month to 1.88 million tonnes at the end of October, official data showed Monday. According to the country&#8217;s industry regulator Malaysian Palm Oil Board, the country&#8217;s crude palm oil production slipped [&#8230;]",
        "url": "https://bhaskarlive.in/malaysias-palm-oil-stocks-fall-6-32-per-cent-in-october/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202312163095480.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 13:28:49",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 264075238,
        "title": "DUSU polls: Delhi HC says counting of votes on or before Nov 26",
        "text": "New Delhi, Nov 11 (IANS) In a relief to candidates of the Delhi University Students’ Union (DUSU) and college elections, the Delhi High Court on Monday said that poll results may be declared on or before November 26 if the university administration is satisfied that defaced public properties have been entirely cleaned. \n\nA bench of Chief Justice Manmohan and Justice Tushar Rao Gedela took on record the status report filed by the varsity stating that defacement had been addressed in North as well as South campuses.\n\nFurther, it took note of the affidavits filed by student leaders in compliance with earlier orders regarding removal of posters, banners, hoardings, graffiti and restoration of defaced walls.\n\nIn the course of hearing, the petitioner, advocate Ashish Manchanda, pointed out that several vandalised public properties outside the campus were yet to be restored by the erring candidates.\n\nTaking note of the submission, the Delhi High Court ordered the student leaders to clear the highlighted sites and said that the Delhi University may commence the process of counting of votes on or before November 26, if the varsity is satisfied that defaced walls have been cleaned.\n\nIn an earlier hearing, the Delhi HC strongly reprimanded DUSU and college elections candidates, and directed them to clean the defaced public properties not only inside the university campus but in the whole city.\n\nIt had summoned candidates Bhaanu Pratap Singh, Ronak Khatri, Yash Panwar, Rishabh Chaudhary, Lokesh Chaudhary, Yash Nandal, Rahul Singh Dedha, Aman Kapasia, Deepika Jha, Aman Kapasia, Shivam Maurya, Himanshu Nagar, Aaryan Maan, Rishi Raj Singh, Rahul Jhansla and Priyanshu Chaudhary and ordered them to be impleaded as respondent parties in the matter.\n\nThe Delhi HC, in an order passed on September 25, had directed that the counting of votes will not take place till it was satisfied that the posters, graffiti, hoarding, and spray paint are removed, the vandalised public properties are restored and the losses suffered due to defacement are made good by the erring candidates.\n\nAfter perusal of the video and photographs placed on record, the Delhi High Court said that it was of the “prima facie view that there has been extensive use of money and muscle power in DUSU and college elections contrary to Lyngdoh Committee Guidelines”.\n\nFurther, it said: “This Court is of the opinion that elections, which are supposed to be a festival of democracy, have been converted into a festival of money laundering and defacement of public property. In some respects, it reflects the failure of the education system.”\n\nThe applicant, advocate Manchanda, stated that due to DUSU polls, public properties across all quarters of the national capital have been defaced, in blatant violation of not only the applicable civil and penal provisions, but in direct contravention of the orders of the Delhi HC.\n\nThe application said that the aspiring candidates under the patronage of political parties have left no place unscathed, be it the buses, bus stops, Metro stations, public properties, private properties, etc and even police stations have been defaced by posters, banners, spray paints, and massive hoardings.",
        "summary": "New Delhi, Nov 11 (IANS) In a relief to candidates of the Delhi University Students&#8217; Union (DUSU) and college elections, the Delhi High Court on Monday said that poll results may be declared on or before November 26 if the university administration is satisfied that defaced public properties have been entirely cleaned. A bench of [&#8230;]",
        "url": "https://bhaskarlive.in/dusu-polls-delhi-hc-says-counting-of-votes-on-or-before-nov-26/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202407263193478.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 12:42:53",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.5
    },
    {
        "id": 264075242,
        "title": "MP: Time limit for female students at Barkatullah University sparks controversy",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Bhopal, Nov 11 (IANS) Akhil Bharatiya Vidyarti Parishad (ABVP), the student wing of the Bharatiya Janata Party (BJP), on Monday, staged a protest at Barkatullah University in Bhopal after a group of female students living in the campus hostels alleged that they were &#8220;forced&#8221; to write an &#8220;apology&#8221; for returning late. Students have alleged that [&#8230;]",
        "url": "https://bhaskarlive.in/mp-time-limit-for-female-students-at-barkatullah-university-sparks-controversy/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411113258542.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 13:10:45",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 264075240,
        "title": "Jharkhand polls: Campaigning for 43 seats ends, 1.37 cr voters to decide fate of 683 candidates",
        "text": "Ranchi, Nov 11 (IANS) Campaigning for 43 seats in the first phase of Jharkhand Assembly elections ended on Monday evening. Voting will be held on these seats on November 13, for which the process of sending polling parties started on Monday.\n\nOf the seats in the first phase, six are reserved for SC and 20 for the ST. The number of general seats is 17. On these seats, voters will decide the fate of a total of 683 candidates on EVMs, including former CM Champai Soren and six cabinet ministers of the current Hemant Soren government of Jharkhand — Dr Rameshwar Oraon, Ramdas Soren, Banna Gupta, Mithilesh Thakur, Deepak Birua and Baidyanath Ram.\n\nThe heavyweight candidates of the first phase include former Minister JD(U)’s Saryu Rai, former Assembly Speaker and former Minister BJP’s C.P. Singh, Neera Yadav, Neelkanth Singh Munda, Ramchandra Chandravanshi, former Minister Congress’ K.N. Tripathi, former Chief Minister Raghubar Das’ daughter-in-law Purnima Das, former CM Champai Soren’s son Babulal Soren, cabinet Minister Satyanand Bhokta’s daughter-in-law Rashmi Prakash.\n\nOn the seats of this phase, 87 candidates are from national parties, 32 are from recognised political parties of Jharkhand, 42 are from recognised parties of other states and 188 candidates are from unrecognised registered parties.\n\nApart from this, there are 334 Independent candidates also in the fray. The fate of 73 women candidates and of a third-gender candidate is also to be decided in the first phase. Third-gender candidate Nagma Rani is contesting as an Independent from Hatia.\n\nThe seats of the first phase include Koderma, Barkatha, Barhi, Barkagaon, Hazaribagh, Simaria, Chatra, Baharagora, Ghatshila, Potka, Jugsalai, Jamshedpur East, Jamshedpur West, Ichagarh, Saraikela, Chaibasa, Majhgaon, Jaganathpur, Manoharpur, Chakradharpur, Kharsawan, Tamar, Torpa, Khunti, Ranchi, Hatia, Kanke, Mandar, Sisai, Gumla, Bishunpur, Simdega, Kolebira, Lohardaga, Manika, Latehar, Panki, Daltonganj, Bishrampur, Chhatarpur, Hussainabad, Garhwa and Bhawanathpur.\n\nA total of 15,344 booths have been set up for voting where a total of 1,37,10,717 voters will decide the fate of 683 candidates contesting the elections. The total voters in the first phase include 68,73,455 men, 68,36,959 women and 303 third gender.\n\nChief Electoral Officer K. Ravi Kumar has said that as soon as the election campaign ends, all the people associated with political parties (who are not voters of that area) who have gone there for election work will have to leave from there. If such people are caught after the campaign period ends, action will be taken against them as per the rules.\n\nsnc/skp/dan",
        "summary": "Ranchi, Nov 11 (IANS) Campaigning for 43 seats in the first phase of Jharkhand Assembly elections ended on Monday evening. Voting will be held on these seats on November 13, for which the process of sending polling parties started on Monday. Of the seats in the first phase, six are reserved for SC and 20 [&#8230;]",
        "url": "https://bhaskarlive.in/jharkhand-polls-campaigning-for-43-seats-ends-1-37-cr-voters-to-decide-fate-of-683-candidates/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411113258485.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 12:37:35",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.32
    },
    {
        "id": 264075246,
        "title": "50 rockets cross into Israel from Lebanon, injuring three",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Jerusalem, Nov 11 (IANS) A barrage of some 50 rockets was fired from Lebanon into northern Israel on Monday at noon, injuring three people, as Israel&#8217;s military prepared to launch new strikes on dozens of villages in southern Lebanon. The rockets, fired within about 30 minutes, triggered air raid warning sirens across the Upper Galilee [&#8230;]",
        "url": "https://bhaskarlive.in/50-rockets-cross-into-israel-from-lebanon-injuring-three/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/9fea6e3542b769177b204c1df00adbb6.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 13:26:41",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 264075244,
        "title": "Challenge excise dealers, not PM Modi: Pralhad Joshi to Siddaramaiah",
        "text": "Hubballi, Nov 11 (IANS) Union Minister Pralhad Joshi on Monday attacked Karnataka Chief Minister Siddaramaiah, saying that he is under the illusion that criticising Prime Minister Narendra Modi will make him famous. \n\nSpeaking to the media on Monday in Hubballi, Joshi responded to Siddaramaiah’s statement that, “Prime Minister Narendra Modi is falsely accusing the state government of a Rs 700 crore excise corruption scam,” saying that “Siddaramaiah, you, who have drowned in corruption and should challenge the excise dealers, not PM Modi,” Joshi said. \n\n“Siddaramaiah keeps criticising Prime Minister Narendra Modi, perhaps thinking that it will make him famous. But it’s his own misconception,” Joshi remarked.\n\nJoshi countered Siddaramaiah by saying that it wasn’t Prime Minister Narendra Modi or the BJP who accused the state excise ministry and government of Rs 700 crore in corruption; rather, it was the excise dealers themselves. He urged Siddaramaiah to understand this first.\n\n“The excise dealers are part of his own government. These very dealers have accused Excise Minister R.B. Thimmapur of corruption, and Prime Minister Narendra Modi simply referenced this issue. What’s wrong with that?” Joshi questioned.\n\n“In his 25 years in politics, Prime Minister Narendra Modi has never faced defeat. He has been Chief Minister of Gujarat three times and has been elected as the Prime Minister twice. He’s a seasoned politician who has never lost in his career. And yet, you dare speak about him,” he said. \n\n“The people of Mysore rejected you in the 2018 Assembly elections from the Varuna segment, even though you were the Chief Minister from 2013 to 2018. But the people have never turned away from Prime Minister Narendra Modi,” Joshi retorted to Siddaramaiah.\n\nHe added that as more and more corruption scams within the state government are coming to light, the Siddaramaiah is becoming desperate. \n\n“In the MUDA scam, a tehsildar’s report even shows that stamp duty payments were made on behalf of the Siddaramaiah, which has come out in the open, leaving him cornered,” he added.\n\nReacting to Prime Minister Narendra Modi’s attack during the campaigning in Maharashtra state that the Congress government in Karnataka has ‘collected’ Rs 700 for assembly elections, Siddaramaiah had stated in Haveri that “I am surprised to see the Prime Minister of this country lie so much.”\n\nWhile campaigning in Maharashtra, the Prime Minister claimed that the Karnataka Congress was involved in a scam in the excise department, mobilising Rs 700 crores to send to Maharashtra, and Jharkhand, and to spend on the bypolls.\n\n“Today, I challenge PM Modi: if he can prove these allegations, I will retire from politics. But if he cannot, then he should retire. When a Prime Minister makes such allegations, they should at least be close to the truth, but these claims are far from it. In independent India, we have never seen a Prime Minister who lies like this,” he said.",
        "summary": "Hubballi, Nov 11 (IANS) Union Minister Pralhad Joshi on Monday attacked Karnataka Chief Minister Siddaramaiah, saying that he is under the illusion that criticising Prime Minister Narendra Modi will make him famous. Speaking to the media on Monday in Hubballi, Joshi responded to Siddaramaiah’s statement that, &#8220;Prime Minister Narendra Modi is falsely accusing the state [&#8230;]",
        "url": "https://bhaskarlive.in/challenge-excise-dealers-not-pm-modi-pralhad-joshi-to-siddaramaiah/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411113258510.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 12:48:01",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.321
    },
    {
        "id": 264075248,
        "title": "U-turn: Delhi CM Atishi wants L-G to draft policy to rehire bus marshals",
        "text": "New Delhi, Nov 11 (IANS) In a U-turn, Delhi Chief Minister Atishi on Monday put the ball back in Lieutenant Governor V.K. Saxena’s court over formulation of a policy for long-term engagement of 10,000 Civil Defence Volunteers (CDVs) as bus marshals.\n\nIntensifying the political tussle between the elected government and the Raj Niwas that reports to the Central government, CM Atishi urged the L-G to draft the policy which she claimed was beyond her domain.\n\nShe also urged Saxena to immediately reinstate 10,000 bus marshals on “as-is-where-is basis” so that women safety in buses is not compromised over the next four-five months that might be needed to draft a policy for their permanent engagement.\n\nAs chances of long-term engagement of bus marshals continue to diminish with each passing day of the AAP government’s tenure, the latest move by the AAP government appears an attempt to shield itself from any blame for delay over the matter in an election year.\n\nCM Atishi’s decision to ask the L-G to draft the proposal comes within a week of an advice given by Raj Niwas to her on similar lines for directing officials to formulate a policy for long-term engagement of CDVs and bus marshals.\n\nFor now, the L-G is considering a proposal from the AAP government to engage the 10,000 out-of-job CDVs as green warriors for four months.\n\nPointing to rise in harassment of women in buses in the absence of bus marshals, CM Atishi said at a press conference that after a long discussion with officials she had come to the conclusion that the issue of re-engagement of bus marshals was related to service department and public order, both of which were reserved subjects that come under the domain of L-G Saxena.\n\n“We have requested the L-G to formulate a policy on the matter so that bus marshals can be deployed in two shifts in public transport buses,” said CM Atishi at a joint press conference with Health Minister Saurabh Bhardwaj.\n\nReiterating the AAP government’s commitment to women’s safety, CM Atishi said travelling in public transport buses was a harrasing experience for women and to check this bus marshals were deployed in 2015 by then Chief Minister Arvind Kejriwal.\n\n“But, the BJP through its officials raised objections to the scheme. In April 2023, the salary of bus marshals was stopped and from October 2023 Civil Defence Volunteers working as bus marshals were removed,” she said.\n\nFor the past one year, bus marshals, supported by AAP ministers and leaders, were agitating on roads for re-engagement and finally the Central government had to bow before their demands, she said.\n\n“As you know, the AAP government has decided to re-engage the CDVs for anti-pollution duties. But, the bigger question that needs to be addressed is that of women safety in public transport buses over the next four months,” she said.\n\nBhardwaj said the L-G and Leader of Opposition Vijender Gupta of BJP were playing tricks and delaying the re-appointment of bus marshals.\n\n“My request to the L-G is not to delay the matter and use his powers to immediately reinstate the bus marshals,” he said.",
        "summary": "New Delhi, Nov 11 (IANS) In a U-turn, Delhi Chief Minister Atishi on Monday put the ball back in Lieutenant Governor V.K. Saxena’s court over formulation of a policy for long-term engagement of 10,000 Civil Defence Volunteers (CDVs) as bus marshals. Intensifying the political tussle between the elected government and the Raj Niwas that reports [&#8230;]",
        "url": "https://bhaskarlive.in/u-turn-delhi-cm-atishi-wants-l-g-to-draft-policy-to-rehire-bus-marshals/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411113258541.JPG?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 13:13:35",
        "author": "IANS,Raj Niwas",
        "authors": [
            "IANS",
            "Raj Niwas"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.207
    },
    {
        "id": 264075250,
        "title": "Why check only my bags, what about PM Modi & MahaYuti leaders: Uddhav Thackeray",
        "text": "Yavatmal, Nov 11 (IANS) Shiv Sena (UBT) President Uddhav Thackeray gave an earful to election department officials in Yavatmal who rummaged through his chartered helicopter and personal baggage on Monday.\n\nThackeray, along with other party leaders landed at the helipad in Wani, where they were accosted by a team of election officials, who stepped forward to check the chopper and their private baggage kept inside, as they came for a schedule of election rallies.\n\nApparently riled by this, the SS (UBT) supremo called the official and asked him to identify himself and also questioned them about the sudden scrutiny of their belongings.\n\nThen, in a banter-style, Thackeray asked him how many leaders’ bags he had examined so far, as the official tried to mumble his evasive replies – all of which were caught on camera by an official videographer who claimed to be from Madhya Pradesh.\n\nThe former Chief Minister then queried the official whether he had checked the bags of PM Modi, Union Home Minister Amit Shah, Chief Minister Eknath Shinde, or Deputy Chief Minister Devendra Fadnavis and the pink-jacketed Deputy Chief Minister Ajit Pawar.\n\nWhen the flustered official replied to everything in the negative, Thackeray asked him to ensure that he (the official) scans the bags of PM Modi and Amit Shah, and others and to send him the videos doing that, to which the former nodded.\n\nAfter the brief altercation, Thackeray allowed the officials to check his bags placed inside the private helicopter, the entire operation was recorded, and then the officials left the venue.\n\nThe video of the incident soon became viral and evoked sharp reactions from several party bigwigs like Deputy Leader Sushma Andhare, Spokesperson Kishore Tiwari and more.\n\nAndhare said that after the Director General of Police was changed recently, there was optimism that the elections would be fair and transparent, but the hopes are being belied with the latest incident.\n\nTiwari said that though nobody has any objection to the frisking of bags of VIPs as per the Election Commission of India directives or the code of conduct, “why should it be done selectively only for the Opposition parties’ leaders while the ruling side leaders virtually pass through a ‘green channel’ unchecked”.\n\nLater, at his public rally in the Wani Assembly constituency, the SS (UBT) chief raked up the incident in his speech, and also advised his political colleagues to ensure that they first confirm the identity of the officials, the authorisation letter and even the pockets of those who are sent to carry out such checks.\n\n“My question is: whether the election officials go through the bags of PM Modi, HM Shah, Shinde, Fadnavis and Pawar or not? If they don’t, then my men will do the needful,” cautioned Thackeray.\n\nThe ECI has mandated the checking of the aircraft of most VVIPs in the polling season ostensibly to prevent ferrying any unauthorised or objectionable allurements to sway the voters.\n\n(Quaid Najmi can be contacted at: qnajmi@gmail.com)",
        "summary": "Yavatmal, Nov 11 (IANS) Shiv Sena (UBT) President Uddhav Thackeray gave an earful to election department officials in Yavatmal who rummaged through his chartered helicopter and personal baggage on Monday. Thackeray, along with other party leaders landed at the helipad in Wani, where they were accosted by a team of election officials, who stepped forward [&#8230;]",
        "url": "https://bhaskarlive.in/why-check-only-my-bags-what-about-pm-modi-mahayuti-leaders-uddhav-thackeray/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411113258531.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-11 13:04:47",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.355
    },
    {
        "id": 263751004,
        "title": "Avoid challenging constitutional institutions: VP Dhankhar",
        "text": "New Delhi, Nov 9 (IANS) Challenging constitutional institutions is a recipe for chaos and impeding our growth, said Vice-President Jagdeep Dhankhar on Saturday, adding that demonising institutions is fast becoming a pastime even with those who constitutionally matter in the political arena.\n\nAddressing the 4th Convocation of the National Institute of Technology (NIT) Delhi, the Vice President, in a veiled message to the Congress, criticised the recent efforts to cast aspersions on the Election Commission of India after the Grand Old Party faced adverse outcomes in the recent elections.\n\nTouching upon issues like economic nationalism, Dhankhar also highlighted the importance of research in making the country developed and spoke on the crucial role of alumni in strengthening the educational ecosystem.\n\n“Research and innovation is key to the attainment of the goal of a developed nation. Our standing in the field of research and innovation will define our prowess to the global community and give cutting edge to our soft diplomacy,” he said.\n\nSharing an emotional personal experience, the Vice President said: “I was selected for IIT Kharagpur. Couldn’t join, I didn’t have money. A major setback. A hard reality. You don’t have that situation now. When I focused on the alumni fund, it was on this emotive platform.”\n\nHighlighting the crucial role of alumni in strengthening the educational ecosystem and urging active participation and contributions to alumni associations, the Vice President said: “Alumni of an institution are in several ways its lifeline. They are ambassadors of the institution. It is an acknowledged method globally and nationally that the best way to pay back to your institution is to be an active member of the alumni association.”\n\n“I strongly urge you to have an alumni fund… making annual contributions is all important. Some of the best institutions globally have been on an upward trajectory because these institutions are fueled by alumni energy. You have to conserve and converge your alumni energy for better prospects of all those who step into this institution to get an education,” he said.\n\nCalling for unflinching commitment to nationalism in its fullness, he said national interest has to have precedence or partisan or otherwise interests.\n\n“Economic nationalism has to be a dominant concern for business. Howsoever justifiable, howsoever big in volume or fiscal quantum, there is no excuse for compromising economic nationalism. This denudes our commitment to the principle of keeping the nation first,” he said.\n\nHe appealed to chambers of commerce and industry and associations of trade to come forward to fuel research and spur innovation through liberal financial contributions.\n\n“However, in the name of commitment to research, let us not have something that is just surface scratching. It must be real and authentic,” he said.",
        "summary": "New Delhi, Nov 9 (IANS) Challenging constitutional institutions is a recipe for chaos and impeding our growth, said Vice-President Jagdeep Dhankhar on Saturday, adding that demonising institutions is fast becoming a pastime even with those who constitutionally matter in the political arena. Addressing the 4th Convocation of the National Institute of Technology (NIT) Delhi, the [&#8230;]",
        "url": "https://bhaskarlive.in/avoid-challenging-constitutional-institutions-vp-dhankhar/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411093257489.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-09 13:38:32",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.358
    },
    {
        "id": 263751008,
        "title": "Stalin in Virudhunagar district as part of statewide tour to monitor govt schemes",
        "text": "Chennai, Nov 9 (IANS) Tamil Nadu Chief Minister M.K. Stalin visited Virudhunagar district as part of his statewide tour to monitor government projects. \n\nDuring his visit, he stopped by a fireworks factory in the district, where he met with the workers and staff to inquire about their well-being.\n\nStalin inspected the firecracker production areas and the warehouse and reviewed the required certifications for the factory’s operation.\n\nThe Chief Minister directed the factory owner to provide insurance facilities for all the workers. He was informed that the factory was well-equipped, adhered to all safety protocols, and had not experienced any accidents.\n\nIt may be noted that Virudhunagar district, particularly Sivakasi, is the largest firecracker-producing region in India. During the 2024 Deepavali festival, Sivakasi reported a sales turnover of Rs 6,000 crore, solidifying its reputation as the ‘firecracker capital of India’.\n\nUpon arrival at Madurai airport from Chennai, the Chief Minister was accorded a warm welcome. Crowds gathered along the roads to greet him as he travelled to Virudhunagar.\n\nThis visit is part of a larger tour that Stalin began in Coimbatore on November 5.\n\nIn a letter to party members, he shared his plans to conduct ground-level inspections across the state to evaluate the progress of various government schemes.\n\nHe emphasised his commitment to visiting every district to inform the public about the achievements and successes of these welfare initiatives. Although he has not specified a timeline for the tour, Stalin’s visits will be spread out over time.\n\nSince taking office in May 2021, his government has introduced various programmes aimed at uplifting marginalised communities.\n\nKey initiatives include the Kalaignar Magalir Urimai Thittam scheme, which provides Rs 1,000 monthly to 1,15,16,292 women; free bus travel for women; the Makkalai Thedi Matuthuvam (Health at Doorstep) scheme; and the Chief Minister’s Free Breakfast Scheme for schoolchildren.\n\nAnother notable scheme, Pudhumai Pen, offers Rs 1,000 per month to girl students from government and government-aided schools pursuing college education. Around 3.28 lakh girl students have benefitted from this initiative.\n\nFollowing the success of the abovementioned scheme, it was extended to boys in government and government-aided schools through the Tamizh Pudhalvan scheme, which now aids approximately 3.18 lakh boys.\n\nThe government’s Naan Mudhalvan (I am the First) scheme has trained 28 lakh students to improve employability and facilitate skill development.\n\nThrough these schemes, the government has distributed over Rs 6,569 crore across Tamil Nadu. The initiatives have drawn attention from other states, with ministers and officials visiting Tamil Nadu to learn about the welfare programmes inspired by the Dravidian model.\n\nThe Chief Minister’s office announced that Stalin would meet with government officials, MPs, MLAs, and local representatives to review the implementation of these initiatives.\n\nOn Sunday, he will meet with sanitary workers and traders of Virudhunagar to hear their grievances. Stalin will also inaugurate the new District Collector’s Office and the Integrated Commercial Tax Office in Virudhunagar on November 10.",
        "summary": "Chennai, Nov 9 (IANS) Tamil Nadu Chief Minister M.K. Stalin visited Virudhunagar district as part of his statewide tour to monitor government projects. During his visit, he stopped by a fireworks factory in the district, where he met with the workers and staff to inquire about their well-being. Stalin inspected the firecracker production areas and [&#8230;]",
        "url": "https://bhaskarlive.in/stalin-in-virudhunagar-district-as-part-of-statewide-tour-to-monitor-govt-schemes/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411093257510.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-11-09 14:17:18",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.227
    },
    {
        "id": 263751006,
        "title": "Bihar: Railway employee crushed to death after getting trapped between engine & bogie",
        "text": "Patna, Nov 9 (IANS) In a tragic accident at Barauni Railway Station in Bihar’s Begusarai, a railway employee was crushed to death after getting trapped between an engine and a bogie on Saturday.\n\nOn platform five, railway worker Amar Rawat, who was responsible for uncoupling the engine from the bogie of the 5204 Barauni-Lucknow Express, lost his life after an engine unexpectedly moved backwards without a signal, trapping him between the engine and the bogie.\n\nIt took rescue personnel nearly two hours to retrieve his body, leaving an atmosphere of shock and grief at the station. The driver fled the scene immediately afterwards, intensifying frustration and anger among other railway employees.\n\nRawat was due to get married on December 11.\n\nShivprasad Yadav, the Divisional President of Sonpur, said, “Four workers are typically required for the safe handling of engine-bogie couplings, yet only one or two staff members are often tasked with the job due to understaffing. Lack of personnel and adherence to safety protocols may have led to this preventable tragedy.”\n\nThe victim’s brother, Shekhar Kumar, also voiced the family’s distress and frustration, alleging that despite knowing the safety requirements, the railway management continued to operate with minimal staff, leading to a high-risk environment for workers.\n\nRawat, who had obtained his job on compassionate grounds after his father’s passing, was employed as a porter responsible for handling couplings between engines and bogies.\n\nFollowing the accident, railway officials, including Sonpur Divisional Railway Manager (DRM) Vivek Bhushan Sood, visited the site and assured assistance to the victim’s family.\n\n“I assured immediate assistance to Rawat’s family and promised disciplinary measures to prevent similar incidents in the future,” Sood said.\n\n“We have constituted a special team that would conduct a thorough investigation to understand how protocols have failed and what actions must be taken. A high-level meeting has been called to discuss safety improvements and prevent future incidents,” Sood said.",
        "summary": "Patna, Nov 9 (IANS) In a tragic accident at Barauni Railway Station in Bihar’s Begusarai, a railway employee was crushed to death after getting trapped between an engine and a bogie on Saturday. On platform five, railway worker Amar Rawat, who was responsible for uncoupling the engine from the bogie of the 5204 Barauni-Lucknow Express, [&#8230;]",
        "url": "https://bhaskarlive.in/bihar-railway-employee-crushed-to-death-after-getting-trapped-between-engine-bogie/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411093257508.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-09 14:07:43",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.24
    },
    {
        "id": 263751010,
        "title": "J&K: Tearful adieu for slain VDC members in Kishtwar",
        "text": "Jammu, Nov 9 (IANS) Two Village Defence Committee (VDC) members kidnapped and later killed by terrorists were given tearful adieu on Saturday by locals in J&K’s Kishtwar district as scores of people joined their funerals. \n\nScores of people attended both the burial and the cremation and shouted anti-Pakistan and anti-terrorist slogans. \n\n“Everybody attending the funeral was shocked and had moist eyes,” a local said. \n\nNazir was buried at a local graveyard while Kuldeep was cremated in the peripheral area of Ohli village. \n\nMeanwhile, people have demanded a government job for the next of kin of the slain civilians and adequate security for the village. \n\nBodies of two VDC members, Nazir Ahmad (42) and Kuldeep Kumar (40) were found in the forests of Kuntwara in Kishtwar after they were kidnapped by the terrorists. The two had gone to the forest to graze cattle when the terrorists struck. \n\nAfter a hectic search, the security forces recovered the bodies and these were brought to their ancestral Ohli village on Friday. \n\nOfficials said the post-mortem reports of the two slain VDC members revealed that both had been shot from behind in the head.\n\n“Both bodies were found blindfolded with hands tied behind their back. The terrorists used a pistol to commit the gruesome murder of these unarmed civilians”, officials confirmed. \n\nKuldeep Kumar had lost his father, Amar Chand last week. Villagers said the objective of the terrorists is to create terror and also drive a wedge between different communities living in the area. \n\nKashmir Tigers, a lesser-known offshoot of the Pakistan-based Jaish-e-Muhammad (JeM) terror outfit has owned responsibility for both these killings. \n\nJ&K DGP, Nalin Prabhat and GOC of the army’s Nagrota-headquartered White Knight Corps visited the area on Friday and took stock of the situation in the aftermath of the terror attack. \n\nLocal MLA, Shagun Parihar and former J&K BJP president, Ravinder Raina also went to express condolences to the bereaved families. \n\nVDCs of civilians were created in the far-flung remote areas of the Jammu division to protect themselves and their families. \n\nJ&K Police has given automatic weapons to the VDC members after terrorists carried out ambush attacks against the army, security forces, police and civilians in Doda, Kishtwar, Rajouri, Poonch, Kathua, Reasi and Udhampur districts of Jammu division.",
        "summary": "Jammu, Nov 9 (IANS) Two Village Defence Committee (VDC) members kidnapped and later killed by terrorists were given tearful adieu on Saturday by locals in J&#38;K’s Kishtwar district as scores of people joined their funerals. Scores of people attended both the burial and the cremation and shouted anti-Pakistan and anti-terrorist slogans. “Everybody attending the funeral [&#8230;]",
        "url": "https://bhaskarlive.in/jk-tearful-adieu-for-slain-vdc-members-in-kishtwar/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411093257497.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-09 13:54:49",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.261
    },
    {
        "id": 263562756,
        "title": "Kannangattu Kadavu bridge construction: compensation disbursal begins",
        "text": "Compensation disbursal to landowners displaced by the construction of Kannangattu Kadavu bridge began on Friday with Kovoor Kunjumon, MLA, handing over the documents to beneficiaries at a meeting held at the chamber of the District Collector. \n\nThe money was given to those who lost land, buildings, business establishments, and jobs as part of the land acquisition for the construction of the bridge and connecting roads. The bridge across the Kallada river connecting Munroe Thuruthu and West Kallada will be built using the Kerala Infrastructure Investment Fund Board (KIIFB) fund. \n\nFor the project, 54.55 ars (01 acre 34.739 cents) of land was acquired, including 42.68 ars from Munroe Thuruthu village and 11.87 ars from West Kallada village. A total of 84 awards worth ₹4,41,68,598 were distributed. \n\nMr. Kunjumon said that once the bridge connecting Kollam and Kunnathur taluks becomes a reality, the transport facility to Munroe Thuruth will improve. He added that the steps for the construction of the Konnelkadav bridge is also progressing. District Collector N. Devidas presided over the function. District panchayat president P.K. Gopan, Munroe Thuruthu panchayat president Mini Suryakumar, West Kallada panchayat president B. Unnikrishnan, and other officials were present.",
        "summary": "Steps for the construction of Konnelkadav bridge is also progressing, says MLA",
        "url": "https://www.thehindu.com/news/national/kerala/kannangattu-kadavu-bridge-construction-compensation-disbursal-begins/article68845516.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 14:02:32",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.227
    },
    {
        "id": 263562758,
        "title": "Land survey for expansion of Konaseema national highway to begin from November 11",
        "text": "The Departments of Roads and Buildings, Revenue, and Rural Water Supply will carry out a fresh land survey from November 11 to acquire land for the expansion of National Highway 216E, proposed by the National Highways Authority of India (NHAI) between Ravulapalem and Amalapuram in Dr. B.R. Ambedkar Konaseema district. \n\nThe estimated distance proposed for the expansion of the national highway is nearly 30 km, in an area nestled between the canals of the Godavari river and coconut groves.\n\nAt a review meeting held here on Thursday (November 7), with the officials of the NHAI and other departments, Joint Collector T. Nishanthi directed them to complete the land survey within two weeks, identifying government land, private land and the government facilities such as electricity poles, and drinking water pipelines existing in the proposed stretch and the availability of government land along the irrigation canals.\n\nThe expansion of the road has been proposed in four mandals — Ambajipeta, Kothapeta, Ainavalli and Ravulapalem. The Department of Survey authorities have been told to provide the survey data to identify the government land along the banks of the irrigation canals during the land survey.\n\nRoads and Buildings Superintending Engineer B. Ramu, RWS Superintending Engineer C.H.N.V. Krishna Reddy, Water Resources Divisional Engineer B. Srinivasa Rao, National Highways EE E. Srinivasulu, RDOs K. Madhavi, P. Srikar and other officials were present.",
        "summary": "NH 216E is proposed to be expanded between Ravulapalem and Amalapuram in Dr. B.R. Ambedkar Konaseema district",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/land-survey-for-expansion-of-konaseema-national-highway-to-begin-from-november-11/article68845427.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 14:02:29",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.2
    }
]