[
    {
        "id": 260223268,
        "title": "Telangana Governor appoints Vice Chancellors of nine state universities",
        "text": "Hyderabad, Oct 18 (IANS) Telangana Governor Jishnu Dev Varma on Friday appointed Vice Chancellors for nine State universities. \n\nThe Governor, who is the Chancellor of the State universities, appointed Prof Kumar Moglaram as the Vice Chancellor of the prestigious Osmania University, Hyderabad.\n\nProf G.N. Srinivas has been appointed as the Vice Chancellor of Palamuru University, Mahabubnagar, Prof Pratap Reddy the Vice Chancellor of Kakatiya University, Warangal, Prof Umesh Kumar as the Vice Chancellor of Satavahana University, Karimnagar, Prof Nityananda Rao as Vice Chancellor of Telugu University, Hyderabad and Prof Altaf Hussain as Vice Chancellor of the Mahatma Gandhi University, Nalgonda.\n\nThe other Vice Chancellors appointed are Prof Yadagiri Rao of Telangana University, Nizamabad), Prof Aldas Janaiah of Prof. Jayashankar Telangana State Agricultural University, Hyderabad, and Prof Raji Reddy of the Sri Konda Laxman Telangana Horticultural University.\n\nOn May 21, the state government appointed senior Indian Administrative Service (IAS) officers as in-charge Vice Chancellors of the state universities. The officials holding key posts in the government were appointed as in-charges as existing Vice-Chancellors demitted their office.\n\nThe government had invited applications for the posts of regular Vice-Chancellors. A total of 1,382 applications were received from 312 teachers. Most of them applied for multiple universities. Search Committees were also constituted to expedite the process of appointing regular vice-chancellors. The committees, comprising a representative from the university concerned, the University Grants Commission, and the state government went through the applications and recommended three names for each VC post.\n\nThe Committees submitted the lists to the Governor, who then appointed Vice Chancellors. Chief Minister A. Revanth Reddy had announced after assuming office in December last year that he would not keep the posts of Vice Chancellors pending for years like the previous government.",
        "summary": "Hyderabad, Oct 18 (IANS) Telangana Governor Jishnu Dev Varma on Friday appointed Vice Chancellors for nine State universities. The Governor, who is the Chancellor of the State universities, appointed Prof Kumar Moglaram as the Vice Chancellor of the prestigious Osmania University, Hyderabad. Prof G.N. Srinivas has been appointed as the Vice Chancellor of Palamuru University, [&#8230;]",
        "url": "https://bhaskarlive.in/telangana-governor-appoints-vice-chancellors-of-nine-state-universities/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202401303112429.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 15:41:22",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.253
    },
    {
        "id": 260630194,
        "title": "Afghanistan: Three killed, three injured in blast",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Ghazni, Oct 22 (IANS) Three children have been confirmed dead and three others were injured as a device went off in Afghanistan&#8217;s Ghazni province, the provincial police office said in a statement. The accident occurred on Monday in the province&#8217;s Qara Bagh district when the children worked on a potato farm. The device exploded, killing [&#8230;]",
        "url": "https://bhaskarlive.in/afghanistan-three-killed-three-injured-in-blast/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247390.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:24:51",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260223272,
        "title": "Sharad Pawar met Dawood in Dubai, govt must clarify: Prakash Ambedkar",
        "text": "Mumbai, Oct 18 (IANS) The Vanchit Bahujan Aghadi (President) Prakash Ambedkar has alleged that the Nationalist Congress Party (SP) President Sharad Pawar met the absconding mafia don Dawood Ibrahim Kaskar in Dubai and was gifted a gold chain.\n\nMaking a sensational claim, Ambedkar told media persons that the purported meeting took place when Pawar was the Chief Minister of Maharashtra (1988-1991) and had travelled abroad, first to California (USA), and then to London (UK).\n\nHe further claimed that Pawar had gone on an official tour that time, first went to London, then California and returned to London where he stayed for two days after which he travelled to Dubai (UAE).\n\n“In Dubai, he met Dawood at the airport and he (Pawar) was welcomed and even gifted a gold necklace by the don there. Then he took a flight back to London that evening and then returned to India after two days,” alleged Ambedkar, the grandson of the Chief Architect of the Indian Constitution B. R. Ambedkar.\n\nRejecting the claims, NCP (SP) National Spokesperson Clyde Crasto said that it is clear that Ambedkar is attempting to create a ‘fake narrative’ ahead of the Maharashtra Assembly elections.\n\n“It’s clear… He is speaking on behalf of the Bharatiya Janata Party… He is just trying to float a narrative with the state assembly polls coming up soon,” said Crasto dismissively.\n\nOn the purported trip around 35 years ago, Ambedkar questioned that as Pawar was the Chief Minister then did he get the permission of the Central government before travelling abroad.\n\n“Did the Centre allow him to travel and attend the meetings in California then? If yes, then was he also permitted to go and meet Dawood in Dubai? Were those meetings official or unofficial and reported to the central government or not,” demanded Ambedkar.\n\nWhen pointed out, the VBA chief said that he was raising it as it’s (Assembly) election time and he wanted to caution the people to choose the party which they vote for carefully, in view of the current political situation in the world, and attacks like the killing of MahaYuti ally Nationalist Congress Party leader Baba Ziauddin Siddique on October 12.\n\nHe called upon the NCP (SP), and the Central government to come clean on this and provide an explanation on all this, why the meetings were held since the country had faced a series of bomb blasts and terror strikes in the 1990s, and a similar situation unfolding now for which we must be on alert. \n\n“I am not making any allegations, but merely putting forth certain facts, and demand that the NCP (SP) and the (current) government should give an explanation. Moreover, the current international situation is disturbing and India’s relations are getting damaged with the USA, Canada, and in the Middle East,” contended Ambedkar.",
        "summary": "Mumbai, Oct 18 (IANS) The Vanchit Bahujan Aghadi (President) Prakash Ambedkar has alleged that the Nationalist Congress Party (SP) President Sharad Pawar met the absconding mafia don Dawood Ibrahim Kaskar in Dubai and was gifted a gold chain. Making a sensational claim, Ambedkar told media persons that the purported meeting took place when Pawar was [&#8230;]",
        "url": "https://bhaskarlive.in/sharad-pawar-met-dawood-in-dubai-govt-must-clarify-prakash-ambedkar/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410183245454.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 16:08:51",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.3
    },
    {
        "id": 260630196,
        "title": "Mongolia reports outbreak of contagious caprine pleuropneumonia",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Ulan Bator, Oct 22 (IANS) An outbreak of contagious caprine pleuropneumonia (CCPP), a severe disease affecting goats caused by the bacterium Mycoplasma capricolum subsp. capripneumoniae, has been reported in the southeastern Dornogovi province of Mongolia, according to the country&#8217;s General Authority for Veterinary Services on Tuesday. CCPP has not been reported in Mongolia since the [&#8230;]",
        "url": "https://bhaskarlive.in/mongolia-reports-outbreak-of-contagious-caprine-pleuropneumonia/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247405.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:26:21",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260629296,
        "title": "India is multiplying renewable energy investment: Harjeet Singh",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "New Delhi, Oct 22 (IANS) Harjeet Singh, Global Engagement Director of the Fossil Fuel Non-Proliferation Treaty Initiative said on Tuesday acknowledged scaled up investments in the renewable energy sector and said that it was contributing to the country&#8217;s efforts in combating climate change. Speaking to IANS on the sidelines of the NDTV World Summit, Singh [&#8230;]",
        "url": "https://bhaskarlive.in/india-is-multiplying-renewable-energy-investment-harjeet-singh/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247327.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 09:59:35",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260629300,
        "title": "Doctors give docus to Bengal CM on how govt ignored complaints against Sandip Ghosh",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Kolkata, Oct 22 (IANS) The representatives of West Bengal Junior Doctors’ Front (WBJDF) during their meeting with Chief Minister Mamata Banerjee handed over several crucial documents on how the state government had previously ignored complaints on the financial irregularities in R.G. Kar Medical College and Hospital during the tenure of Sandip Ghosh as the principal. [&#8230;]",
        "url": "https://bhaskarlive.in/doctors-give-docus-to-bengal-cm-on-how-govt-ignored-complaints-against-sandip-ghosh/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247414.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:14:34",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260629298,
        "title": "President Droupadi Murmu presents National Water Awards",
        "text": "New Delhi, Oct 22 (IANS) President Droupadi Murmu on Tuesday conferred the fifth National Water Awards in the national capital. The awards were presented to 38 winners in nine categories, including Best State, Best District, Best Village Panchayat, Best Urban Local Body, Best Water User Association and Best Civil Society. \n\nSpeaking on the occasion, President Murmu said that the government has provided tap water connections to over 78 per cent of rural households across the country under the Jal Jeevan Mission.\n\nShe highlighted the significant improvement in the lives of people, particularly in rural areas, after the launch of the Jal Jeevan Mission and said that when the flagship programme was launched in 2019, only 17 per cent of rural households had access to safe drinking water.\n\nThe National Water Awards are aimed at creating awareness among the people about the importance of water and to motivate them to adopt the best water usage practices.\n\nPresident Murmu also underlined the role of state governments in water conservation and expressed concern over the depletion of the groundwater situation of the country.\n\nShe said that water is a basic necessity and a fundamental human right for every individual.\n\n“A clean and prosperous society cannot be built without ensuring access to clean water. The unavailability of water and poor sanitation have a greater impact on the health, food security and livelihood of the underprivileged,” she said.\n\nThe President further noted that water conservation has been part of our tradition and underlined the need to retain the wisdom of ancestors.\n\n“Our ancestors used to build ponds near villages. They used to build reservoirs in or near temples so that the stored water could be used in case of water shortage. Unfortunately, we are forgetting the wisdom of our ancestors. Some people have encroached upon reservoirs for personal gain. This not only affects the availability of water during drought but also creates flood-like situations when there is excessive rainfall,” she said.\n\nThe President said that the conservation and enhancement of water resources is the collective responsibility of all and added that without everyone’s active participation, it is not possible to build a water-secure India.\n\nPresident Murmu further said that the National Water Awards is a commendable step towards promoting relevant approaches and actions towards water resources.\n\nShe expressed confidence that the “Best Practices” of the awardees would reach the masses through this event.",
        "summary": "New Delhi, Oct 22 (IANS) President Droupadi Murmu on Tuesday conferred the fifth National Water Awards in the national capital. The awards were presented to 38 winners in nine categories, including Best State, Best District, Best Village Panchayat, Best Urban Local Body, Best Water User Association and Best Civil Society. Speaking on the occasion, President [&#8230;]",
        "url": "https://bhaskarlive.in/president-droupadi-murmu-presents-national-water-awards/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247413.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:14:05",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.127
    },
    {
        "id": 260629302,
        "title": "Will win all seven seats in Rajasthan: BJP state chief on bypolls",
        "text": "Jaipur, Oct 22 (IANS) BJP state chief Madan Rathore said on Tuesday that the BJP will win all seven seats in Rajasthan which are going for bypolls on November 13.\n\n“We will win all seats. There will be no rebels on any seat. We will convince all rebels,” he said. \n\nSo far, the BJP has announced six candidates for the bypolls while the party is yet to announce its seventh candidate for the Chorasi seat. \n\nHowever, soon after the announcement of candidates, some of the leaders started protesting over seat allocation. The party high command has now assigned the task to convenience the rebel leader to Chief Minister Bhajan Lal Sharma.\n\nVeteran leader Narendra Meena, who was denied a ticket from the Salumber seat, was brought to Jaipur and held talks with the Chief Minister, after which he agreed to work for the party. \n\nNarendra Meena has also agreed not to contest as an independent. \n\nIn Ramgarh, Jai Ahuja who contested on the party ticket in the Assembly elections had called for a Mahapanchayat on Sunday. \n\nOn Monday, the administration sent him a notice questioning the timing of calling the gathering during the code of conduct. \n\nVijay Bainsla has also protested for being denied the ticket from Deoli Uniara while Bablu Chowdhary was also anguished as he was also denied a ticket from Jhunjhunu as the ticket was given to Rajendra Bhambhu.\n\nSources said that the Chief Minister and BJP state chief are in constant touch with all the leaders who have shown resentment following the ticket distribution. \n\n“I am persuading all the rebels on every seat,” claimed the Rajasthan BJP chief.",
        "summary": "Jaipur, Oct 22 (IANS) BJP state chief Madan Rathore said on Tuesday that the BJP will win all seven seats in Rajasthan which are going for bypolls on November 13. “We will win all seats. There will be no rebels on any seat. We will convince all rebels,” he said. So far, the BJP has [&#8230;]",
        "url": "https://bhaskarlive.in/will-win-all-seven-seats-in-rajasthan-bjp-state-chief-on-bypolls/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247422.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:23:32",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.262
    },
    {
        "id": 260629306,
        "title": "Cyclone threat: Well-marked low pressure area intensifies into depression in Bay of Bengal",
        "text": "Bhubaneswar, Oct 22 (IANS) The well-marked low pressure area developed in Bay of Bengal has intensified into a depression, IMD informed on Tuesday.\n\n“Yesterday’s well-marked low pressure area over east-central Bay of Bengal moved west-northwestwards, concentrated into a depression and lay centred at 0530 hrs IST on October 22, over the same region near latitude 15.4° N and longitude 91.2°E, about 730 km southeast of Paradip (Odisha), 770 km south-southeast of Sagar Island (West Bengal) and 740 km south-southeast of Khepupara (Bangladesh),” said the IMD.\n\nThe IMD further noted that the system is very likely to move west-northwestwards and intensify into a cyclonic storm by October 23 over the east-central Bay of Bengal.\n\n“Thereafter, continuing to move northwestwards, it is very likely to intensify into a severe cyclonic storm over northwest Bay of Bengal by the morning of October 24 and cross north Odisha and West Bengal coasts between Puri and Sagar Island during the night of October 24 and the next morning as a severe cyclonic storm with a wind speed of 100-110 kmph gusting 120 kmph,” it added.\n\nNotably, Chief Minister Mohan Charan Majhi had earlier asserted that the state government is fully prepared to deal with the impending severe cyclonic storm.\n\nCM Majhi, while emphasising the government’s resolve to ensure ‘zero casualty’ in the cyclone, has appealed to the people not to panic.\n\nThe Chief Minister has also reviewed the preparedness to face the cyclone in a high-level meeting at the Lok Seva Bhavan here on Monday. All the District Collectors have been instructed to identify the affected areas and ensure evacuation of all the people from vulnerable places to safer places.\n\nThe state government has also cancelled the leaves of all its employees from October 23 to 25. The schools in 14 affected districts will also remain closed during the above period.\n\nThe tourists have also been asked to leave Puri before the cyclonic storm hits the Odisha coast. The state government has advised the devotees from the state and outside to avoid visiting the holy city on October 24 and 25.",
        "summary": "Bhubaneswar, Oct 22 (IANS) The well-marked low pressure area developed in Bay of Bengal has intensified into a depression, IMD informed on Tuesday. &#8220;Yesterday’s well-marked low pressure area over east-central Bay of Bengal moved west-northwestwards, concentrated into a depression and lay centred at 0530 hrs IST on October 22, over the same region near latitude [&#8230;]",
        "url": "https://bhaskarlive.in/cyclone-threat-well-marked-low-pressure-area-intensifies-into-depression-in-bay-of-bengal/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410203246358.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:19:38",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "environment",
        "source_country": "in",
        "sentiment": -0.153
    },
    {
        "id": 260629304,
        "title": "Caste census report must be discussed before making it public: K’taka Home Minister",
        "text": "Bengaluru, Oct 22 (IANS) Karnataka Home Minister G. Parameshwara said on Tuesday that the caste census report must be discussed thoroughly before making it public.\n\n“The public has the right to know what is in the caste census report. If there is no discussion over the report, people may develop doubts about it. The caste census report will be presented to the Cabinet for discussion,” the Karnataka Home Minister said.\n\nHe said that a sum of Rs 160 crores has been spent on the caste census. “And if the report is not made public, a huge amount will be wasted. People have a right to know what is in the report,” he said. \n\nHe added that implementing the caste census is a different matter, but the information from the report must be made public first. \n\nResponding to questions about the reservation for Panchamasali Lingayats in 2A Category, internal reservations, and the caste census report, he said: “The state government and Chief Minister Siddaramaiah are fully capable of handling all these issues. We will have discussions and make decisions on how to address the concerns of various communities.”\n\nHe added that there is a directive that reservations should not exceed 50 per cent. \n\n“In some states, they have exceeded this limit. Tamil Nadu has legally implemented 69 per cent reservation by adding it to Schedule 9 of the Constitution. In our state too, various communities are asking for increased reservation, which will require exceeding the 50 per cent limit,” he said.\n\nHe said that Siddaramaiah has announced that the caste census report prepared during his first tenure will be tabled in the Cabinet.",
        "summary": "Bengaluru, Oct 22 (IANS) Karnataka Home Minister G. Parameshwara said on Tuesday that the caste census report must be discussed thoroughly before making it public. “The public has the right to know what is in the caste census report. If there is no discussion over the report, people may develop doubts about it. The caste [&#8230;]",
        "url": "https://bhaskarlive.in/caste-census-report-must-be-discussed-before-making-it-public-ktaka-home-minister/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247401.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:08:51",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.027
    },
    {
        "id": 260629310,
        "title": "MP man salutes Tricolour 21 times, chants ‘Bharat Mata ki jai’ on court order",
        "text": "Bhopal, Oct 22 (IANS) Complying with Madhya Pradesh High Court’s direction as a condition for bail, Faizal Khan alias Faizan saluted the national flag and chanted ‘Bharat Mata ki Jai’ 21 times at a police station on Tuesday. \n\nKhan, who is accused of raising anti-national slogans, was granted bail on condition that until the trial in the case is underway, he will visit the police station twice a month and salute the national flag and chant ‘Bharat Mata KI Jai’.\n\nOn Tuesday morning, he arrived at the Misrod police station in Bhopal and saluted the national flag amid high security.\n\nTalking to the media, Khan said he had made a mistake. “I had made a mistake and I have realised it. I am an Indian and would respect the national flag and chant Bharat Mata Ki Jai,” he said.\n\nKhan said he had raised anti-national slogans for a video, but at that time he didn’t realise the mistake may take him to jail. “Now, I would request all my friends not to raise anti-national slogans or disrespect the national flag. I would not make this mistake again ever in my life,” he added.\n\nMisrod police station in-charge said a video of Khan saluting the national flag and chanting ‘Bharat Mata ki Jai’ has been recorded, which will be produced before the high court. Notably, the court has also directed the Bhopal Police Commissioner to ensure compliance with this condition for bail.\n\nOn October 15, the court of Justice Dinesh Kumal Paliwal while hearing Faizan’s bail application had said, “Till the trial of the case is underway, the accused (Faizal Khan) will have to visit Misrod Police Station in Bhopal on every 1st and 4th Tuesday of the month and salute the national flag at the police station building.”\n\nFaizal Khan, a resident of Raisen district, was arrested by Madhya Pradesh Police in May for allegedly raising anti-national slogans — ‘Pakistan Zindabad, Hindustan Murdabad’ in Bhopal.\n\nKhan moved the high court seeking bail claiming that he had been falsely implicated in the case. However, during the hearing, his counsel accepted that his client was seen shouting the anti-national slogan. Therefore, the advocate requested he should be released on bail by imposing some stringent conditions.\n\nAfter hearing the argument, Justice Paliwal noted that undoubtedly, the applicant has a criminal background of 13 criminal cases and in the video, he is seen shouting the slogan as aforementioned. “I am of the view that applicant may be released on bail by imposing some conditions which may enthuse in him the sense of responsibility and a pride for the country in which he is born and living,” Justice Paliwal had said.",
        "summary": "Bhopal, Oct 22 (IANS) Complying with Madhya Pradesh High Court&#8217;s direction as a condition for bail, Faizal Khan alias Faizan saluted the national flag and chanted ‘Bharat Mata ki Jai’ 21 times at a police station on Tuesday. Khan, who is accused of raising anti-national slogans, was granted bail on condition that until the trial [&#8230;]",
        "url": "https://bhaskarlive.in/mp-man-salutes-tricolour-21-times-chants-bharat-mata-ki-jai-on-court-order/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247408.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:13:31",
        "author": "IANS,Madhya Pradesh Police",
        "authors": [
            "IANS",
            "Madhya Pradesh Police"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.198
    },
    {
        "id": 260629308,
        "title": "Adani Energy Solutions reports 172 pc jump in net profit in Q2 FY25",
        "text": "Ahmedabad, Oct 22 (IANS) Adani Energy Solutions Limited (AESL) on Tuesday reported an impressive 172 per cent surge in net profit at Rs 773 crore in the July-September quarter (Q2) this fiscal.\n\nAdjusted profit after tax (PAT) was Rs 459 crore, excluding deferred tax reversal (MAT entitlement) of Rs 314 crore — up 61.6 per cent YoY while EBITDA was Rs 1,891 crore, up 31 per cent YoY.\n\nKandarp Patel, CEO, Adani Energy Solutions, said the company remains focused on timely project commissioning as well as achieving operating efficiencies.\n\n“The power demand trends in both utilities and new transmission project wins are very encouraging and we are making progress with the installation of smart meters in all our contracts,” said Patel.\n\nIn the month of August, the Adani Group company raised Rs 8,373 crore via the qualified institutional placement (QIP) route, the largest in the country’s power sector. The QIP received bids of approximately six times of the base deal size from a diverse group of investors.\n\nAdani Energy Solutions reported an increase in its project pipeline from Rs 17,000 crore in the first quarter of the current fiscal to Rs 27,300 crore in the second quarter (Q2). The transmission network was at 23,269 circuit kilometres (ckm) in the July-September period, compared to 19,862 ckm in the same period of the previous year.\n\nAdani Energy Solutions saw robust growth of 69 per cent in total income, driven by the contribution from the recently commissioned Kharghar-Vikhroli, Warora-Kurnool, Khavda-Bhuj lines, acquired Mahan-Sipat line, higher energy sales in Mumbai and Mundra utilities and contribution from smart metering.\n\nThe company also secured three new transmission projects — NES in Jamnagar Gujarat, NES in Navinal (Mundra), and Khavda Phase IVA, thereby adding 2,059 ckm to under construction network.\n\n“The leverage position is healthy, with net debt to EBITDA metric at 3.1 times in H1 FY25,” said the company. The capex as of H1 FY25 was Rs 4,400 crore, as against Rs 2,622 crore in H1 FY24.\n\n“Our credible steps of successfully divesting the Dahanu thermal plant in line with our commitment and achieving an all-time high share of 39 per cent renewable power penetration in Mumbai strengthens our position as true energy transition leader in India,” Patel said.",
        "summary": "Ahmedabad, Oct 22 (IANS) Adani Energy Solutions Limited (AESL) on Tuesday reported an impressive 172 per cent surge in net profit at Rs 773 crore in the July-September quarter (Q2) this fiscal. Adjusted profit after tax (PAT) was Rs 459 crore, excluding deferred tax reversal (MAT entitlement) of Rs 314 crore &#8212; up 61.6 per [&#8230;]",
        "url": "https://bhaskarlive.in/adani-energy-solutions-reports-172-pc-jump-in-net-profit-in-q2-fy25/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247417.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:19:23",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.023
    },
    {
        "id": 260629312,
        "title": "50 National Highway projects in Manipur get Centre’s nod",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "New Delhi, Oct 22 (IANS) In a major infrastructure push in the northeast, the Ministry of Road Transport and Highways has approved 50 National Highway (NH) projects of 1,026 km length in Manipur. The announcement came a day after Union Minister Nitin Gadkari highlighted the need to enhance connectivity in the northeast while reviewing the [&#8230;]",
        "url": "https://bhaskarlive.in/50-national-highway-projects-in-manipur-get-centres-nod/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247428.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:22:48",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260629314,
        "title": "Luminous CEO stresses need for collective effort to increase women’s role in economy",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "New Delhi, Oct 22 (IANS) Preeti Bajaj, CEO and MD of Luminous Power Technologies, emphasised the need for the collective role of the government, industry, and citizens in increasing women&#8217;s participation in the economy to 50 per cent, a crucial step for India to achieve its goal of becoming the third-largest economy in the world. [&#8230;]",
        "url": "https://bhaskarlive.in/luminous-ceo-stresses-need-for-collective-effort-to-increase-womens-role-in-economy/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410223247406.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-22 10:22:21",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260633732,
        "title": "Amidst ‘Jigra’ controversy, director Vasan Bala deactivates X account",
        "text": "Mumbai: Acclaimed filmmaker Vasan Bala, whose recent release ‘Jigra’ starring Alia Bhatt turned into a box-office debacle, has deactivated his X, formerly Twitter, account.\r\n\r\nThis comes in the light of the dirty standoff between the producer of ‘Jigra’, Karan Johar and actress-director Divya Khossla, and of course the underwhelming performance of ‘Jigra’ at the box-office. However, the filmmaker is quite active on his Instagram.\r\n\r\nEarlier, a war of words ensued between Divya and KJo as the former accused KJo’s prodigy Alia Bhatt of buying the tickets to ‘Jigra’.\r\n\r\nWhile Karan took to the Stories section of his Instagram, and wrote, “Silence is the best speech you will ever give to fools”. Divya replied by sharing a quote on her Instagram Stories, “Truth will always offend Fools opposed to it”.\r\n\r\nWhen she felt that she hadn’t made her point, and her voice wasn’t heard enough, she uploaded another Story. She wrote, “When you are shamelessly accustomed to stealing what rightfully belongs to others, you will always seek shelter in silence. You will have no voice no spine”.\r\n\r\nDivya seemed in no mood to buy the collections as she felt that the collections of the film are inflated at the behest of the production house which is considered one of the premier film studios in Hindi cinema. Interestingly, Divya’s ‘Savi’ is said to follow the same basic premise of a jail break story as that of Alia’s ‘Jigra’ (the difference being in ‘Savi’, the titular character played by Divya carries out prison break of her husband, and in ‘Jigra’, Alia takes her brother out of the prison).\r\n\r\nWhile ‘Savi’ managed to make only Rs. 7.83 crore in two weeks of its theatrical run before it was ousted from cinemas for a more lucrative and financially rewarding ‘Chandu Champion’, Alia’s ‘Jigra’ earned Rs. 4.5 crore on its opening day.\r\n\r\nFollowing the box-office debacle of 'Jigra' KJo also sold 50% of stakes of his Dharma Productions to Adar Poonawalla.",
        "summary": "This comes in the light of the dirty standoff between the producer of ‘Jigra’, Karan Johar and actress-director Divya Khossla, and of course the underwhelming performance of ‘Jigra’ at the box-office.",
        "url": "https://telanganatoday.com/amidst-jigra-controversy-director-vasan-bala-deactivates-x-account",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/10/jig.jpg",
        "video": null,
        "publish_date": "2024-10-22 11:01:11",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.23
    },
    {
        "id": 260223256,
        "title": "Baba Siddique murder: 5 more nabbed from Raigad, sent to police custody for a week",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Mumbai, Oct 18 (IANS) The Mumbai Police Crime Branch has arrested five more persons in connection with the killing of ruling Nationalist Congress Party (NCP) leader and businessman Baba Ziauddin Siddique in Bandra on October 12, officials said on Friday. With this, the total number of suspects arrested has gone up to nine. The arrests [&#8230;]",
        "url": "https://bhaskarlive.in/baba-siddique-murder-5-more-nabbed-from-raigad-sent-to-police-custody-for-a-week/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410133242269.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 15:47:59",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    }
]