[
    {
        "id": 263751004,
        "title": "Avoid challenging constitutional institutions: VP Dhankhar",
        "text": "New Delhi, Nov 9 (IANS) Challenging constitutional institutions is a recipe for chaos and impeding our growth, said Vice-President Jagdeep Dhankhar on Saturday, adding that demonising institutions is fast becoming a pastime even with those who constitutionally matter in the political arena.\n\nAddressing the 4th Convocation of the National Institute of Technology (NIT) Delhi, the Vice President, in a veiled message to the Congress, criticised the recent efforts to cast aspersions on the Election Commission of India after the Grand Old Party faced adverse outcomes in the recent elections.\n\nTouching upon issues like economic nationalism, Dhankhar also highlighted the importance of research in making the country developed and spoke on the crucial role of alumni in strengthening the educational ecosystem.\n\n“Research and innovation is key to the attainment of the goal of a developed nation. Our standing in the field of research and innovation will define our prowess to the global community and give cutting edge to our soft diplomacy,” he said.\n\nSharing an emotional personal experience, the Vice President said: “I was selected for IIT Kharagpur. Couldn’t join, I didn’t have money. A major setback. A hard reality. You don’t have that situation now. When I focused on the alumni fund, it was on this emotive platform.”\n\nHighlighting the crucial role of alumni in strengthening the educational ecosystem and urging active participation and contributions to alumni associations, the Vice President said: “Alumni of an institution are in several ways its lifeline. They are ambassadors of the institution. It is an acknowledged method globally and nationally that the best way to pay back to your institution is to be an active member of the alumni association.”\n\n“I strongly urge you to have an alumni fund… making annual contributions is all important. Some of the best institutions globally have been on an upward trajectory because these institutions are fueled by alumni energy. You have to conserve and converge your alumni energy for better prospects of all those who step into this institution to get an education,” he said.\n\nCalling for unflinching commitment to nationalism in its fullness, he said national interest has to have precedence or partisan or otherwise interests.\n\n“Economic nationalism has to be a dominant concern for business. Howsoever justifiable, howsoever big in volume or fiscal quantum, there is no excuse for compromising economic nationalism. This denudes our commitment to the principle of keeping the nation first,” he said.\n\nHe appealed to chambers of commerce and industry and associations of trade to come forward to fuel research and spur innovation through liberal financial contributions.\n\n“However, in the name of commitment to research, let us not have something that is just surface scratching. It must be real and authentic,” he said.",
        "summary": "New Delhi, Nov 9 (IANS) Challenging constitutional institutions is a recipe for chaos and impeding our growth, said Vice-President Jagdeep Dhankhar on Saturday, adding that demonising institutions is fast becoming a pastime even with those who constitutionally matter in the political arena. Addressing the 4th Convocation of the National Institute of Technology (NIT) Delhi, the [&#8230;]",
        "url": "https://bhaskarlive.in/avoid-challenging-constitutional-institutions-vp-dhankhar/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411093257489.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-09 13:38:32",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.358
    },
    {
        "id": 263751008,
        "title": "Stalin in Virudhunagar district as part of statewide tour to monitor govt schemes",
        "text": "Chennai, Nov 9 (IANS) Tamil Nadu Chief Minister M.K. Stalin visited Virudhunagar district as part of his statewide tour to monitor government projects. \n\nDuring his visit, he stopped by a fireworks factory in the district, where he met with the workers and staff to inquire about their well-being.\n\nStalin inspected the firecracker production areas and the warehouse and reviewed the required certifications for the factory’s operation.\n\nThe Chief Minister directed the factory owner to provide insurance facilities for all the workers. He was informed that the factory was well-equipped, adhered to all safety protocols, and had not experienced any accidents.\n\nIt may be noted that Virudhunagar district, particularly Sivakasi, is the largest firecracker-producing region in India. During the 2024 Deepavali festival, Sivakasi reported a sales turnover of Rs 6,000 crore, solidifying its reputation as the ‘firecracker capital of India’.\n\nUpon arrival at Madurai airport from Chennai, the Chief Minister was accorded a warm welcome. Crowds gathered along the roads to greet him as he travelled to Virudhunagar.\n\nThis visit is part of a larger tour that Stalin began in Coimbatore on November 5.\n\nIn a letter to party members, he shared his plans to conduct ground-level inspections across the state to evaluate the progress of various government schemes.\n\nHe emphasised his commitment to visiting every district to inform the public about the achievements and successes of these welfare initiatives. Although he has not specified a timeline for the tour, Stalin’s visits will be spread out over time.\n\nSince taking office in May 2021, his government has introduced various programmes aimed at uplifting marginalised communities.\n\nKey initiatives include the Kalaignar Magalir Urimai Thittam scheme, which provides Rs 1,000 monthly to 1,15,16,292 women; free bus travel for women; the Makkalai Thedi Matuthuvam (Health at Doorstep) scheme; and the Chief Minister’s Free Breakfast Scheme for schoolchildren.\n\nAnother notable scheme, Pudhumai Pen, offers Rs 1,000 per month to girl students from government and government-aided schools pursuing college education. Around 3.28 lakh girl students have benefitted from this initiative.\n\nFollowing the success of the abovementioned scheme, it was extended to boys in government and government-aided schools through the Tamizh Pudhalvan scheme, which now aids approximately 3.18 lakh boys.\n\nThe government’s Naan Mudhalvan (I am the First) scheme has trained 28 lakh students to improve employability and facilitate skill development.\n\nThrough these schemes, the government has distributed over Rs 6,569 crore across Tamil Nadu. The initiatives have drawn attention from other states, with ministers and officials visiting Tamil Nadu to learn about the welfare programmes inspired by the Dravidian model.\n\nThe Chief Minister’s office announced that Stalin would meet with government officials, MPs, MLAs, and local representatives to review the implementation of these initiatives.\n\nOn Sunday, he will meet with sanitary workers and traders of Virudhunagar to hear their grievances. Stalin will also inaugurate the new District Collector’s Office and the Integrated Commercial Tax Office in Virudhunagar on November 10.",
        "summary": "Chennai, Nov 9 (IANS) Tamil Nadu Chief Minister M.K. Stalin visited Virudhunagar district as part of his statewide tour to monitor government projects. During his visit, he stopped by a fireworks factory in the district, where he met with the workers and staff to inquire about their well-being. Stalin inspected the firecracker production areas and [&#8230;]",
        "url": "https://bhaskarlive.in/stalin-in-virudhunagar-district-as-part-of-statewide-tour-to-monitor-govt-schemes/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411093257510.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-11-09 14:17:18",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.227
    },
    {
        "id": 263751006,
        "title": "Bihar: Railway employee crushed to death after getting trapped between engine & bogie",
        "text": "Patna, Nov 9 (IANS) In a tragic accident at Barauni Railway Station in Bihar’s Begusarai, a railway employee was crushed to death after getting trapped between an engine and a bogie on Saturday.\n\nOn platform five, railway worker Amar Rawat, who was responsible for uncoupling the engine from the bogie of the 5204 Barauni-Lucknow Express, lost his life after an engine unexpectedly moved backwards without a signal, trapping him between the engine and the bogie.\n\nIt took rescue personnel nearly two hours to retrieve his body, leaving an atmosphere of shock and grief at the station. The driver fled the scene immediately afterwards, intensifying frustration and anger among other railway employees.\n\nRawat was due to get married on December 11.\n\nShivprasad Yadav, the Divisional President of Sonpur, said, “Four workers are typically required for the safe handling of engine-bogie couplings, yet only one or two staff members are often tasked with the job due to understaffing. Lack of personnel and adherence to safety protocols may have led to this preventable tragedy.”\n\nThe victim’s brother, Shekhar Kumar, also voiced the family’s distress and frustration, alleging that despite knowing the safety requirements, the railway management continued to operate with minimal staff, leading to a high-risk environment for workers.\n\nRawat, who had obtained his job on compassionate grounds after his father’s passing, was employed as a porter responsible for handling couplings between engines and bogies.\n\nFollowing the accident, railway officials, including Sonpur Divisional Railway Manager (DRM) Vivek Bhushan Sood, visited the site and assured assistance to the victim’s family.\n\n“I assured immediate assistance to Rawat’s family and promised disciplinary measures to prevent similar incidents in the future,” Sood said.\n\n“We have constituted a special team that would conduct a thorough investigation to understand how protocols have failed and what actions must be taken. A high-level meeting has been called to discuss safety improvements and prevent future incidents,” Sood said.",
        "summary": "Patna, Nov 9 (IANS) In a tragic accident at Barauni Railway Station in Bihar’s Begusarai, a railway employee was crushed to death after getting trapped between an engine and a bogie on Saturday. On platform five, railway worker Amar Rawat, who was responsible for uncoupling the engine from the bogie of the 5204 Barauni-Lucknow Express, [&#8230;]",
        "url": "https://bhaskarlive.in/bihar-railway-employee-crushed-to-death-after-getting-trapped-between-engine-bogie/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411093257508.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-09 14:07:43",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.24
    },
    {
        "id": 263751010,
        "title": "J&K: Tearful adieu for slain VDC members in Kishtwar",
        "text": "Jammu, Nov 9 (IANS) Two Village Defence Committee (VDC) members kidnapped and later killed by terrorists were given tearful adieu on Saturday by locals in J&K’s Kishtwar district as scores of people joined their funerals. \n\nScores of people attended both the burial and the cremation and shouted anti-Pakistan and anti-terrorist slogans. \n\n“Everybody attending the funeral was shocked and had moist eyes,” a local said. \n\nNazir was buried at a local graveyard while Kuldeep was cremated in the peripheral area of Ohli village. \n\nMeanwhile, people have demanded a government job for the next of kin of the slain civilians and adequate security for the village. \n\nBodies of two VDC members, Nazir Ahmad (42) and Kuldeep Kumar (40) were found in the forests of Kuntwara in Kishtwar after they were kidnapped by the terrorists. The two had gone to the forest to graze cattle when the terrorists struck. \n\nAfter a hectic search, the security forces recovered the bodies and these were brought to their ancestral Ohli village on Friday. \n\nOfficials said the post-mortem reports of the two slain VDC members revealed that both had been shot from behind in the head.\n\n“Both bodies were found blindfolded with hands tied behind their back. The terrorists used a pistol to commit the gruesome murder of these unarmed civilians”, officials confirmed. \n\nKuldeep Kumar had lost his father, Amar Chand last week. Villagers said the objective of the terrorists is to create terror and also drive a wedge between different communities living in the area. \n\nKashmir Tigers, a lesser-known offshoot of the Pakistan-based Jaish-e-Muhammad (JeM) terror outfit has owned responsibility for both these killings. \n\nJ&K DGP, Nalin Prabhat and GOC of the army’s Nagrota-headquartered White Knight Corps visited the area on Friday and took stock of the situation in the aftermath of the terror attack. \n\nLocal MLA, Shagun Parihar and former J&K BJP president, Ravinder Raina also went to express condolences to the bereaved families. \n\nVDCs of civilians were created in the far-flung remote areas of the Jammu division to protect themselves and their families. \n\nJ&K Police has given automatic weapons to the VDC members after terrorists carried out ambush attacks against the army, security forces, police and civilians in Doda, Kishtwar, Rajouri, Poonch, Kathua, Reasi and Udhampur districts of Jammu division.",
        "summary": "Jammu, Nov 9 (IANS) Two Village Defence Committee (VDC) members kidnapped and later killed by terrorists were given tearful adieu on Saturday by locals in J&#38;K’s Kishtwar district as scores of people joined their funerals. Scores of people attended both the burial and the cremation and shouted anti-Pakistan and anti-terrorist slogans. “Everybody attending the funeral [&#8230;]",
        "url": "https://bhaskarlive.in/jk-tearful-adieu-for-slain-vdc-members-in-kishtwar/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411093257497.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-09 13:54:49",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.261
    },
    {
        "id": 263562756,
        "title": "Kannangattu Kadavu bridge construction: compensation disbursal begins",
        "text": "Compensation disbursal to landowners displaced by the construction of Kannangattu Kadavu bridge began on Friday with Kovoor Kunjumon, MLA, handing over the documents to beneficiaries at a meeting held at the chamber of the District Collector. \n\nThe money was given to those who lost land, buildings, business establishments, and jobs as part of the land acquisition for the construction of the bridge and connecting roads. The bridge across the Kallada river connecting Munroe Thuruthu and West Kallada will be built using the Kerala Infrastructure Investment Fund Board (KIIFB) fund. \n\nFor the project, 54.55 ars (01 acre 34.739 cents) of land was acquired, including 42.68 ars from Munroe Thuruthu village and 11.87 ars from West Kallada village. A total of 84 awards worth ₹4,41,68,598 were distributed. \n\nMr. Kunjumon said that once the bridge connecting Kollam and Kunnathur taluks becomes a reality, the transport facility to Munroe Thuruth will improve. He added that the steps for the construction of the Konnelkadav bridge is also progressing. District Collector N. Devidas presided over the function. District panchayat president P.K. Gopan, Munroe Thuruthu panchayat president Mini Suryakumar, West Kallada panchayat president B. Unnikrishnan, and other officials were present.",
        "summary": "Steps for the construction of Konnelkadav bridge is also progressing, says MLA",
        "url": "https://www.thehindu.com/news/national/kerala/kannangattu-kadavu-bridge-construction-compensation-disbursal-begins/article68845516.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 14:02:32",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.227
    },
    {
        "id": 263562758,
        "title": "Land survey for expansion of Konaseema national highway to begin from November 11",
        "text": "The Departments of Roads and Buildings, Revenue, and Rural Water Supply will carry out a fresh land survey from November 11 to acquire land for the expansion of National Highway 216E, proposed by the National Highways Authority of India (NHAI) between Ravulapalem and Amalapuram in Dr. B.R. Ambedkar Konaseema district. \n\nThe estimated distance proposed for the expansion of the national highway is nearly 30 km, in an area nestled between the canals of the Godavari river and coconut groves.\n\nAt a review meeting held here on Thursday (November 7), with the officials of the NHAI and other departments, Joint Collector T. Nishanthi directed them to complete the land survey within two weeks, identifying government land, private land and the government facilities such as electricity poles, and drinking water pipelines existing in the proposed stretch and the availability of government land along the irrigation canals.\n\nThe expansion of the road has been proposed in four mandals — Ambajipeta, Kothapeta, Ainavalli and Ravulapalem. The Department of Survey authorities have been told to provide the survey data to identify the government land along the banks of the irrigation canals during the land survey.\n\nRoads and Buildings Superintending Engineer B. Ramu, RWS Superintending Engineer C.H.N.V. Krishna Reddy, Water Resources Divisional Engineer B. Srinivasa Rao, National Highways EE E. Srinivasulu, RDOs K. Madhavi, P. Srikar and other officials were present.",
        "summary": "NH 216E is proposed to be expanded between Ravulapalem and Amalapuram in Dr. B.R. Ambedkar Konaseema district",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/land-survey-for-expansion-of-konaseema-national-highway-to-begin-from-november-11/article68845427.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 14:02:29",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.2
    },
    {
        "id": 263563828,
        "title": "Kannada language through Bhakti Sangeetha touches core of your heart: Nirmala Sitharaman",
        "text": "Union Finance Minister Nirmala Sitharaman on Friday said she strongly believed that Kannada language, through Bhakti Sangeetha, directly touches the core of your heart. In Dasa Sangeetha, each of the verses sung by the Dasas reaches us without language barriers. The verses are a humble plea of these Dasas, who lived on Bhiksha, followed a Guru and attained Diksha with that Guru’s guidance, she said.\n\nMs. Sitharaman was speaking after inaugurating the three-day Mysuru Sangeetha Suganda, a music festival celebrating the Dasa tradition of Carnatic music, at the KSOU Convocation Hall here.\n\nThe music festival is jointly organised by the Central Ministry of Tourism and State Ministry of Culture and the Tourism Department. The event aims to celebrate Mysuru’s rich Carnatic music traditions, and also promote lesser-known tourist destinations, cuisine, handicrafts and textiles of Karnataka. Many renowned musicians are attending the festival and also performing.\n\nIn her inaugural address, Ms. Sitharaman, who was instrumental in organising the music festival for promoting Carnatic music, said language does not come as a barrier in Dasa Sangeetha as it reaches everybody.\n\nThe Finance Minister, who spoke on the greatness of Mysuru’s Carnatic music traditions and the Dasa Sangeetha, said the festival organised jointly by the Tourism and Culture Ministries should become a calendar event organised annually to promote Kannada language and the Dasa Sangeetha. The Karnataka government must come forward to support the event every year.\n\nWhile complimenting the Tourism Ministry for choosing Mysuru for the music festival, Ms. Sitharaman said the Dasas during the Bhakti movement kept the entire population together and helped people to remain positive. Because of their roles, Karnataka contributed immensely despite the difficult era. Mysuru is a blessed place.\n\nExplaining the vision of the Modi government, she said ‘Vikas Bhi, Virasat Bhi’, which highlights the country’s development and at the same time emphasises on safeguarding our heritage and culture. India has diverse languages and cultures. The Prime Minister’s message is, that besides the country’s economic progress, we also need to preserve our cultural heritage. We need language, culture, music and so on, she explained.\n\nShe also spoke on the programme “Ek Bharat Shreshtha Bharat”. India is blessed by diverse languages. Every language is superior or “Shrestha”. All the beautiful languages make Bharat where different languages are spoken. There is a need to strengthen these languages, the finance minister opined.\n\nDuring her talk, Ms. Sitharaman also spoke on the contributions of the Mysuru kings for the promotion of Carnatic music, and mentioned about the songs composed by Sri Jayachamarajendra Wadiyar.\n\nShe said the music festival needs to be supported and all Kannadigas, even through the digital modes, have to come together to promote Carnatic music as many stalwarts of Carnatic music hailed from Mysuru, which was a nerve centre for culture, and who set golden standards for music. It was Purandara Dasaru, known as “Pitamaha” of Carnatic music, who codified Carnatic music.\n\nBesides Mysuru, the performances of Dasa Sankeerthana as part of the music festival are also being held simultaneously at the National Gallery of Modern Art, Bengaluru; Sri Aprameya Swamy Temple; Rudrapatna in Hassan district and Araga.\n\nMinister of State for Petroleum and Natural Gas and Tourism Suresh Gopi, Minister in charge of Mysuru district H.C. Mahadevappa, and Mysuru MP Yaduveer Krishnadatta Chamaraja Wadiyar also spoke. Additional Secretary to the Tourism Ministry Suman Billa welcomed. MLA T.S. Srivatsa was present.\n\nThe Finance Minister later had an informal chat with the musicians and experts after the event.",
        "summary": "Union Finance Minister inaugurates three-day Mysuru Sangeetha Suganda Music Festival that celebrates the Dasa tradition of Carnatic music",
        "url": "https://www.thehindu.com/news/national/karnataka/kannada-language-through-bhakti-sangeetha-touches-core-of-your-heart-nirmala-sitharaman/article68845298.ece",
        "image": "https://th-i.thgim.com/public/incoming/sjzla0/article68845885.ece/alternates/LANDSCAPE_1200/2303_8_11_2024_18_24_58_1_FMMUSICFEST.JPG",
        "video": null,
        "publish_date": "2024-11-08 14:06:15",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.465
    },
    {
        "id": 263563826,
        "title": "When the FM recited ‘Ragi Tandira’",
        "text": "Union Finance Minister Nirmala Sitharaman on Friday narrated the lyrics of one of the songs of Purandara Dasa – Ragi Tandira – to emphasise her view on the amazing words penned in the Sankeerthana.\n\nDuring her inaugural speech at the Mysuru Sangeetha Suganda Music Festival here, she even requested the musicians who were present in the audience to sing the song during one of the days of the festival. “I must try to recite the Sankeerthana as the music festival aims to celebrate the Dasa tradition of Carnatic music,” she said.\n\nMs. Sitharaman managed to recount the Kannada lyrics while explaining the meaning of the words which, she said, bring out the quality of Ragi (finger millet) and also the quality of a person who is giving the ‘Bhiksha’. Every word is musical, the Minister said, while speaking on the beauty of words.\n\nHer effort and admiration for the song drew applause from the audience.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/karnataka/when-the-fm-recited-ragi-tandira/article68845399.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 14:08:48",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.935
    },
    {
        "id": 263561418,
        "title": "Small-scale handloom park to come up at Sengunthapuram",
        "text": "Minister for Textiles and Handlooms R. Gandhi on Friday said that the State government will set up a small-scale handloom park at Sengunthapuram in Ariyalur district. \n\nInspecting the proposed site for setting up the park, along with Minister for Transport S.S. Sivasankar, Mr. Gandhi said it had been decided to allot 13,205 sq. ft. of land owned by the Tamil Nadu Cotton Corporation to set up the park at Sengunthapuram. It was an ideal place to establish the park, which was aimed at assisting the handloom weavers. There was a building at the proposed site. It would be refurbished to house handlooms. The officials were asked to complete the work within two or three months. \n\nThe Minister said it was part of the announcement made by Chief Minister M.K. Stalin in the State Assembly. He had announced that 10 small-scale handloom parks would be set up in the State in 2023-24 to boost the handloom sector. In the first phase, 50 handlooms would be erected at the Sengunthapuram Park. Fifty more looms would be added subsequently. \n\nHandloom Department secretary V. Amuthavalli, Collector P. Rathinasamy, Jayankondam MLA K.S.K. Kannan and senior officials were present.",
        "summary": "Ministers R. Gandhi and S.S. Sivashankar inspect the 13,205 sq. ft. site belonging to the Tamil Nadu Cotton Corporation at Sengunthapuram",
        "url": "https://www.thehindu.com/news/cities/Tiruchirapalli/small-scale-handloom-park-to-come-up-at-sengunthapuram/article68845569.ece",
        "image": "https://th-i.thgim.com/public/news/cities/Tiruchirapalli/z2ru82/article68845549.ece/alternates/LANDSCAPE_1200/Pro%20Ariyalur%20Photo%20-%2008.11.2024%2001.jpg",
        "video": null,
        "publish_date": "2024-11-08 13:39:38",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.044
    },
    {
        "id": 263561416,
        "title": "Drones to emerge as game changer in fisheries sector, says Union Minister",
        "text": "Drones will emerge as a gamechanger in the fisheries sector, addressing several critical challenges with precision and efficiency, Union Minister of State for Fisheries George Kurian said here on Friday.\n\nHe was inaugurating an awareness workshop and demonstration of drone applications in the fisheries sector at the ICAR-Central Marine Fisheries Research Institute. \n\n“Drones play a pivotal role in managing aquaculture farms, monitoring fish markets, and assessing damage to fisheries infrastructure, particularly during natural disasters, when rescue operations are essential. On their part, underwater drones help closely monitor fish behaviour in natural habitats, to detect signs of distress like erratic swimming patterns and also provide real-time data that strengthen sustainable fisheries management,” he said.\n\nThe event saw live demonstration of drone applications in fisheries, including transportation of fish from the farm, dispensing aquafeeds and rescue operation.\n\nThe Minister said the Centre would develop 100 climate-resilient coastal fishermen villages across the country, to help fisher communities who encounter climate-change challenges, by allocating ₹2 crore per village under the Pradhan Mantri Matsya Sampada Yojana. This would help ready common facilities like fish-drying yards, processing centres, fish markets, and emergency rescue facilities, whilst promoting climate-resilient practices like seaweed cultivation, artificial reefs, and green fuel initiatives. \n\nThe Union Department of Fisheries would install transponders in about one lakh marine fishing vessels this year at an estimate of ₹364 crore. \n\nThis would provide a two-way communication system enabling real-time tracking of fishing vessels and help fishermen to send short messages using their Android mobile phone while fishing up to 200 nautical miles from the coast.\n\nThe system would also provide weather alerts to the fishermen, including cyclone warning. The Indian Space Research Organisation developed this technology indigenously using GSAT 6 satellite. Information related to potential fishing zones too would be made available to the fishermen on their mobile in regional languages, Mr Kurian said.\n\nNeetu Kumari Prasad, Joint Secretary in Union Department of Fisheries; B.K. Behra, Chief Executive of National Fisheries Development Board; Grinson George, Director of CMFRI; and George Ninan, Director of CIFT, spoke on the occasion",
        "summary": "George Kurian says Centre will develop 100 climate-resilient coastal villages to protect fishers’ livelihood",
        "url": "https://www.thehindu.com/news/national/kerala/drones-to-emerge-as-game-changer-in-fisheries-sector-says-union-minister/article68845140.ece",
        "image": "https://th-i.thgim.com/public/news/national/kerala/fq0wll/article68845225.ece/alternates/LANDSCAPE_1200/IMG-20241106-WA0199.jpg",
        "video": null,
        "publish_date": "2024-11-08 13:32:42",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.202
    },
    {
        "id": 263561420,
        "title": "Puthiya Tamilagam submits memorandum to Governor Ravi demanding to nullify internal reservation for Arunthathiyars",
        "text": "Puthiya Tamilagam party founder K. Krishnasamy on Friday submitted a memorandum to Tamil Nadu Governor R.N. Ravi, highlighting the “adverse impact” of 3% internal reservation for Arunthathiyars within the Scheduled Caste quota of 18%.\r\n\nThe party, in a press release, said “The recent Supreme Court judgement on the sub-classification of Scheduled Castes underscores that, although various subgroups exist, it is unjust to allocate all opportunities to a single community. The 3% internal reservation granted to Arunthathiyars in Tamil Nadu represents grave injustice and a violation of social equity…We urge the Governor to advise the Central and State governments to promptly nullify this injustice.”\r\n\nAmong other issues that the party brought to the attention of the Governor include extending benefits of the Forest Rights Act to tea plantation workers in Tamil Nadu, implementing total prohibition in the State, deploying Central agencies in southern Tamil Nadu to curtail recurrent caste-based violence and murders against members of Devendrakula Vellalars, attracting foreign investments to southern districts, and prioritising employment opportunities for native population.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/tamil-nadu/puthiya-tamilagam-submits-memorandum-to-governor-ravi-demanding-to-nullify-internal-reservation-for-arunthathiyars/article68845174.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 13:31:59",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.241
    },
    {
        "id": 263561426,
        "title": "BJP is trying to convert Vijayapura into a Hindutva laboratory, says Minister M.B. Patil",
        "text": "“The BJP is trying to convert Vijayapura district into a Hindutva laboratory and divide people on the basis of religion. But its plans will not succeed as it is a land of communal harmony,” Minister M.B. Patil said in Vijayapura on Friday.\n\n“The BJP is using the waqf issue to create rifts between communities and spread hatred. It will not succeed, as the people can see through the conspiracy,” he told reporters.\n\n“The BJP is trying to portray Congress as an anti-Hindu party by saying that we are supporting Waqf Board in reclaiming its land. This is not true because the Waqf Board is a statutory body that regularly issues notices to remove encroachments from its land. During its tenure, the BJP has taken several pro-Waqf Board steps, including issuing notices and mutation of Record of Rights, Tenancy and Crops (RTCs),” he said.\n\nReleasing a list of documents to support his claim, he said that the Congress will also release a booklet containing the BJP’s pro-Waqf Board activities.\n\nThe BJP, which has been in power at the Centre since 2014 and also in the and State intermittently, is very concerned about the protection of waqf properties. Its leaders and Ministers have made several statement and took steps towards that end. When the BJP was in power in the State, it allowed the Waqf Board to take back property of farmers, religious places and people from all religions, he said. “It is now conducting a false campaign propaganda against us in the State and national level,” he added.\n\nHe claimed that the BJP government mutated in favour of the Waqf Board land belonging to many farmers in 2023, citing examples.\n\nThe then Revenue Minister issued circulars in 2010, regarding updating of waqf documents. The Chief Secretary issued a circular in 2010 to remove all encroachments from waqf land by private individuals, government bodies and corporations. The Regional Commissioner of Kalaburagi issued orders in 2011 on protecting waqf property and regularization of records, the Minister pointed out, to show that clearing encroachments is an ongoing process.\n\nThe Principal Secretary, Minority Welfare, issued orders in 2011, on compulsory depositing of compensation against acquisition of waqf land to the board’s account. In 2020, the Deputy Secretary (Land Grant, Land Reforms and Revenue Department) issued orders for flagging wakf property in the Bhoomi portal. In 2021, the BJP government set up district-level task forces to protect waqf property.\n\nIn 2021, the BJP government issued orders for flagging and locking of waqf property in gramthana land in the Panchatantra and e-Swattu software.\n\nIn 2014, the BJP’s election manifesto proposed, in consultation with religious leaders, to empower the Waqf Board and clear encroachments.\n\nIn 2019, MP Shobha Karandlaje asked a question in Parliament seeking information about steps taken to preserve waqf property like geo-tagging and digitization, lease terms, financial assistance to State Waqf Boards, video conferencing facilities, Mr. Patil said, citing these instances.\n\nIn Karnataka, Chief Minister Siddaramaiah has ordered withdrawal of all notices when the BJP started making false allegations about waqf assets, he said.\n\n“Even after all this, the BJP is spreading false information among farmers, religious leaders and public for political gains and publicity. Were they not following anti-Hindu policies, when they were in power? Why are they posing now that the BJP is the only party in favor of the Hindus?” he asked.\n\nHe said that the BJP has politicised religious institutions. The BJP has dragged into the anti-waqf agitation innocent swamis of various maths who have no clear idea of the double-speak of the party, he added.\n\n“But then, we will take steps to convince them of the BJP’s hypocrisy. Sri Adrushya Kadasiddeshwar Swami of Kaneri Math, who addressed the rally in Vijayapura, will turn against the BJP. That is because we are true Hindus, but the BJP has fake Hindu leaders who are carrying out a false propaganda for political gains,” Mr. Patil claimed.",
        "summary": "The Congress is planning to release a booklet containing the BJP’s pro-Waqf Board activities",
        "url": "https://www.thehindu.com/news/national/karnataka/bjp-is-trying-to-convert-vijayapura-into-a-hindutva-laboratory-says-minister-mb-patil/article68845580.ece",
        "image": "https://th-i.thgim.com/public/incoming/jnhnda/article68845789.ece/alternates/LANDSCAPE_1200/9727_8_11_2024_18_41_7_1_09BGMMBPBIJAPURWAQF1.JPEG",
        "video": null,
        "publish_date": "2024-11-08 13:42:13",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.369
    },
    {
        "id": 263561422,
        "title": "Improve tech. skills to handle cybercrimes, false social media posts, police told",
        "text": "Vizianagaram Superintendent of Police Vakul Jindal on Friday advised the police officials of all ranks to enhance their technological skills to handle cyber crimes and unethical social media posts.\n\nSpeaking to the media here, he said that the department had been conducting special training programmes for all station house officers and other personnel in view of increasing incidence of cyber crimes. \n\nMr. Jindal urged people not to respond to calls from unknown persons seeking One Time Passwords, PAN numbers, and bank account details.\n\nHe said the department would take stern action on people who would use social media platforms to target public representatives, officials and individuals with false allegations and derogatory remarks.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/improve-tech-skills-to-handle-cybercrimes-false-social-media-posts-police-told/article68845423.ece",
        "image": "https://th-i.thgim.com/public/incoming/qkct5p/article68845846.ece/alternates/LANDSCAPE_1200/10215_8_11_2024_19_14_17_1_WHATSAPPIMAGE2024_11_08AT61900PM.JPEG",
        "video": null,
        "publish_date": "2024-11-08 13:50:12",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.364
    },
    {
        "id": 263561428,
        "title": "Fishermen seek healthcare and cold storage facilities",
        "text": "The Tamil Nadu Fishermen’s Welfare Board (TNFWB) based in Mallipattinam, Thanjavur district, has urged the government to provide emergency healthcare access and establish cold storage facilities to improve the lot of the coastal communities in the State this week.\r\n\nBoard’s general secretary A. Thajuddin submitted a memorandum containing 11 demands to Deputy Chief Minister Udhayanidhi Stalin in Thanjavur on Thursday, detailing the requirements of fishermen in the State.\n\nAccess to hospitals and medical assistance was among the issues raised by the board. “Fishermen who get injured while at sea due to natural calamities, accidents, or health problems are left waiting for medical attention. The authorities should organise ambulance and helicopter rescue services at the ports in order to save lives,” the memorandum said. \n\nThe document pointed out that despite the heavy footfall and vehicular traffic at the Mallipattinam fish market, the nearest hospital was in Tiruchi or Thanjavur. “A full-fledged hospital closer to the market would be able to attend to accidents and injuries,” it said.\n\nAmong the other demands were to early installation of curved groynes to protect the Mallipattinam port from sea erosion and climate change. \n\nThe body sought official help to settle disputes between fishermen in Tamil Nadu and Sri Lanka. “We urge the authorities to resolve the issue of fishermen straying into foreign waters through high-level bilateral talks and secure the release of those who have been arrested along with their vessels from Sri Lankan custody,” the statement said.\n\nFishermen of Thanjavur district could be permitted to stay at sea with their power boats for at least three days, like those of Nagapattinam district, in order to increase the size of their catch, and profits, said the body. Cold storage facilities would help preserve the stock of fish caught daily.",
        "summary": "",
        "url": "https://www.thehindu.com/news/cities/Tiruchirapalli/fishermen-seek-healthcare-and-cold-storage-facilities/article68845482.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 13:33:17",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "health",
        "source_country": "in",
        "sentiment": -0.109
    },
    {
        "id": 263561432,
        "title": "Guidelines issued for fertilizer distribution in Karaikal for samba, thaladi paddy cultivation",
        "text": "With samba and thaladi paddy cultivation under way on 4,148 hectares in Karaikal district, the Agriculture Department has issued guidelines to ensure fair and sufficient distribution of fertilizers. \n\nKaraikal’s Additional Director of Agriculture R. Ganesan, in a statement, outlined the measures and cautioned vendors that strict action would be taken for non-compliance with these rules. \n\nMr. Ganesan confirmed that fertilizers, including urea, DAP, complex, and potash, are adequately stocked at authorised private and cooperative outlets for local farmers. To maintain transparent and efficient distribution, the department had directed fertilizer vendors to display their sales licences prominently, list stock levels and prices clearly, and sell fertilizers exclusively at government-mandated rates. Sales are restricted to farmers within Karaikal district to prevent unauthorised distribution to neighbouring areas. \n\nThe guidelines stipulate that vendors must avoid combining fertilizer sales with unrelated products and are prohibited from selling unapproved items. All sales are to be documented via POS systems, with receipts provided to farmers. Vendors are required to submit inventory and sales reports bi-monthly, on the 15th and 30th. \n\nMr. Ganesan reiterated that any violations of these regulations would lead to action under the Fertiliser Control Order of 1985, reinforcing the department’s commitment to ensuring a fair and efficient fertilizer supply chain.",
        "summary": "",
        "url": "https://www.thehindu.com/news/cities/Tiruchirapalli/guidelines-issued-for-fertilizer-distribution-in-karaikal-for-samba-thaladi-paddy-cultivation/article68845775.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 13:55:49",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.02
    },
    {
        "id": 263561436,
        "title": "JNTU-GV to hone communication skills of rural students",
        "text": "JNTU-GV Vice-Chancellor D. Rajyalakshmi on Friday said special training programmes would be conducted for students to improve their communication and technical skills. \n\nSpeaking at the Freshers’ Day function at St. Theressa Institute of Engineering and Technology at Garividi in the district, she said that every college affiliated to the university should make students focus on certificate courses apart from regular academic studies to meet the expectations of the industries. She also stressed the need for teaching faculty to improve their skills and knowledge. \n\nAvanthi group chairperson Muttamsetti Srinivasa Rao said that the management was giving priority to campus selections. \n\nThe college principal Jashuva Jayaprasad, M. Mahesh, director A. Chandrasekhar, vice-principal B. Venkata Ramana and others were present.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/jntu-gv-to-hone-communication-skills-of-rural-students/article68845342.ece",
        "image": "https://th-i.thgim.com/public/incoming/ynivqn/article68845746.ece/alternates/LANDSCAPE_1200/10215_8_11_2024_17_51_42_1_WHATSAPPIMAGE2024_11_08AT54318PM.JPEG",
        "video": null,
        "publish_date": "2024-11-08 13:36:54",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.102
    }
]