[
    {
        "id": 263309282,
        "title": "Mount Lewotobi in Indonesia erupts, top flight alert issued",
        "text": "Jakarta, Nov 7 (IANS) Mount Lewotobi in Indonesia’s East Nusa Tenggara province erupted again on Thursday, spewing a column of ash up to 5,000 metres high and prompting the highest aviation alert, the Volcanology and Geological Disaster Mitigation Centre reported.\n\nThe eruption occurred at 10:48 a.m. local time, with ash dispersing to the west, southwest, and north of the crater.\n\nLocated in East Flores regency, Mount Lewotobi is on the highest alert level, with a designated danger zone extending 7 km from the crater, Xinhua news agency reported.\n\nA Volcano Observatory Notice for Aviation has been issued at the red level, the highest warning, prohibiting flights below 6,000 metres above and around the crater. Aircraft should also be prepared for ash clouds, which can disrupt flights.\n\nMount Lewotobi erupted late Sunday night, resulting in 10 fatalities, injuries to 63 people, and the displacement of over 4,000 residents. Hot clouds and volcanic materials destroyed hundreds of homes and buildings, triggering fires in the area.\n\nStanding at 1,584 metres, Mount Lewotobi is one of Indonesia’s 127 active volcanoes. The country, located along the Pacific Ring of Fire, experiences frequent volcanic activity.\n\nEarlier on Thursday, Mount Marapi in Indonesia’s West Sumatra province erupted in the morning, sending a column of ash up to 800 metres into the air, according to the Volcanology and Geological Disaster Mitigation Centre.\n\nThe eruption occurred at 8.54 a.m. Jakarta time, with ash dispersing to the east and northeast of the crater, Xinhua news agency reported.\n\nResidents have been warned to avoid activities within a 4.5-kilometre radius of the crater. Those living along rivers that originate on the volcano’s slopes are advised to stay alert for possible lava flows during heavy rains.",
        "summary": "Jakarta, Nov 7 (IANS) Mount Lewotobi in Indonesia&#8217;s East Nusa Tenggara province erupted again on Thursday, spewing a column of ash up to 5,000 metres high and prompting the highest aviation alert, the Volcanology and Geological Disaster Mitigation Centre reported. The eruption occurred at 10:48 a.m. local time, with ash dispersing to the west, southwest, [&#8230;]",
        "url": "https://bhaskarlive.in/mount-lewotobi-in-indonesia-erupts-top-flight-alert-issued/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073256227.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 12:08:50",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.447
    },
    {
        "id": 263309288,
        "title": "Pakistan: Three-year-old approaches court as Lahore remains world’s most polluted city",
        "text": "Lahore, Nov 7 (IANS) A three-year-old girl has filed a petition against the local government in Pakistan’s Punjab as the province, especially its capital Lahore, continues to reel under the severe impact of smog, keeping the air quality in an extremely hazardous zone.\n\nOn Thursday morning, the Air Quality Index (AQI) of Lahore stayed on top of the global rankings with levels crossing much above the 800-mark, making the air seriously dangerous for the residents.\n\nAs per the Swiss air quality monitor IQAir, Lahore has been on top of the cities with the world’s highest AQI. The levels have even exceeded the 1000-mark on many occasions.\n\nThe extended and prolonged bad weather has made it impossible for citizens to venture out of their homes. The hospitals too are getting filled up with people suffering from respiratory issues. The bad air quality has left thousands of citizens of the province vulnerable to respiratory diseases with the provincial government and doctors advising all to wear masks whenever they venture out of their homes.\n\nThe provincial government has imposed a smog emergency across the province and has shut down all educational institutions up to the higher secondary level in Lahore and other districts till November 17.\n\nMeanwhile, a three-year-old girl has reached out to the Lahore High Court (LHC) on Thursday, filing a case against the provincial government over its failure to control the air pollution.\n\nThe petitioner, Amal Sekhera, through her lawyer maintained in the petition that young children and the elderly are severely affected by air pollution and sought justice for herself, friends and the future generations.\n\n“Under Article 99-A of the Constitution, the government is obligated to provide citizens with a clean and healthy environment,” the petition stated.\n\nThe petition criticised the Punjab government for failing to protect the fundamental rights guaranteed by the Constitution of Pakistan.\n\nPunjab government’s senior provincial minister Maryam Aurangzeb has said that the intensity of the smog is expected to continue for at least 10 more days, due to which the educational institutions have been shut down and people have been advised to wear masks.\n\nMany other cities like Multan and Gujranwala are also severely impacted with the ongoing weather conditions.",
        "summary": "Lahore, Nov 7 (IANS) A three-year-old girl has filed a petition against the local government in Pakistan&#8217;s Punjab as the province, especially its capital Lahore, continues to reel under the severe impact of smog, keeping the air quality in an extremely hazardous zone. On Thursday morning, the Air Quality Index (AQI) of Lahore stayed on [&#8230;]",
        "url": "https://bhaskarlive.in/pakistan-three-year-old-approaches-court-as-lahore-remains-worlds-most-polluted-city/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073256226.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 12:07:26",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.279
    },
    {
        "id": 263309286,
        "title": "Those who turned party into private limited company talking about East India: Smriti Irani tears into Rahul Gandhi",
        "text": "New Delhi, Nov 7 (IANS) Former Union Minister Smriti Irani on Thursday tore into the Leader of Opposition (LoP) in Lok Sabha Rahul Gandhi over his opinion article reflecting on the ‘prowess’ of East India Company and accused him as well as the Congress party of insulting nation’s brave freedom fighters and martyrs.\n\nAddressing a press conference, Smriti Irani said that it was unfortunate that they (Rahul Gandhi and Congress) don’t understand the valour of freedom fighters and their supreme sacrifices.\n\n“They either aren’t aware of the bravery of Birsa Munda, heroic acts of Shivaji Maharaja, the sacrifices of Rani Laxmibai, the intrepidness of Mangal Pandey or tend to deliberately ignore their contributions to the country’s freedom struggle,” the former minister said in a presser.\n\nSmriti Irani also expressed strong reservations over the article’s reference to the Britishers ‘supremacy’, in the first line, which apparently read – ‘India was silenced by East India Company’.\n\n“Had India been silent, Britishers would be ruling the country today” she retorted.\n\nFurther taking a stinging jibe, Irani said, “It’s ludicrous that the family which turned a leading political party into a private limited company is talking about East India Company.”\n\nEarlier in the day, the scions of Indian royal families also took exception to Rahul Gandhi’s article, where he wrote that India’s silence under the East India Company was not due to its business control but rather its oppressive control.\n\nThey lambasted Congress MP Rahul Gandhi for describing the country’s former kings as “pliant maharajas” subjugated by the East India Company.\n\nRajasthan Deputy Chief Minister Diya Kumari, the granddaughter of Man Singh II, the last Maharaja of Jaipur, voiced her disapproval on X, saying, “I strongly condemn Mr Rahul Gandhi’s attempt to malign the erstwhile royal families of India in an editorial today. The dream of an integrated India was only possible because of the utmost sacrifice of the erstwhile royal families of India.”\n\nVikramaditya Singh, former Congress leader and grandson of Maharaja Sir Hari Singh, the last ruler of Kashmir, criticised Gandhi’s “superficial understanding of history.”\n\n“The irony is that Mr Rahul Gandhi, coming from such immense privilege himself, would repeatedly attempt to malign the Maharajas’ colossal contributions to the Republic of India is appalling,” Singh wrote.\n\nChaitanya Raj Singh, representing the former royal family of Jaisalmer, called the LoP’s claims “baseless and unacceptable,” remarking, “Perhaps Rahul Gandhi has forgotten who actually did the work of uniting India; he should look into the pages of history.”\n\nIn an article in a leading daily, Rahul Gandhi wrote that the Easy India Company suppressed India by allying with, bribing and threatening more pliant maharajas and nawabs.",
        "summary": "New Delhi, Nov 7 (IANS) Former Union Minister Smriti Irani on Thursday tore into the Leader of Opposition (LoP) in Lok Sabha Rahul Gandhi over his opinion article reflecting on the ‘prowess’ of East India Company and accused him as well as the Congress party of insulting nation’s brave freedom fighters and martyrs. Addressing a [&#8230;]",
        "url": "https://bhaskarlive.in/those-who-turned-party-into-private-limited-company-talking-about-east-india-smriti-irani-tears-into-rahul-gandhi/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073256200.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 12:19:28",
        "author": "East India Company,IANS",
        "authors": [
            "East India Company",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.252
    },
    {
        "id": 263307816,
        "title": "Rahul Gandhi is ‘Messiah’ of anti-nationals: BJP over Yasin Malik’s wife letter to LoP",
        "text": "Jammu, Nov 7 (IANS) After Mushaal Hussein Mullick, the wife of jailed Jammu Kashmir Liberation Front (JKLF) chief, Yasin Malik, wrote to Leader of the Opposition (LoP) in Lok Sabha Rahul Gandhi urging him to initiate a debate in Parliament for her husband, BJP leader Kavinder Gupta on Thursday said that he (Rahul Gandhi) is the ‘Messiah’ of anti-nationals. \n\nMullick, a former assistant to the Prime Minister of Pakistan on human rights and women empowerment, believes that Yasin Malik’s role in the ongoing peace process in J&K is critical and that his plight must be addressed urgently. Malik, who has been at the forefront of Kashmir’s separatist movement, is currently involved in challenging the NIA’s appeal for capital punishment in a terror funding case.\n\nTalking to IANS, Kavinder Gupta said, “Sometimes Rahul Gandhi works for Pannu, sometimes for foreign agencies and I want to say that he always stands with anti-national elements. Recently, there was an attack on a Hindu temple in Canada, but Rahul Gandhi doesn’t speak on that. I don’t know why every anti-national element contacts him only. Congress will have to speak about this,” he added.\n\nHe further reacted over the ruckus which erupted in the Jammu and Kashmir (J&K) Assembly on Thursday as BJP members protested against a resolution seeking the restoration of special status for the former state.\n\n“The J&K Assembly has been turned into a battleground of hooliganism, with the Speaker playing a key role in this. He is working as an agent of the National Conference. This is all a conspiracy by the National Conference. What happened there today, and the use of marshals that led to injuries to some leaders, is condemnable. They all were knowing it earlier that this kind of situation would happen. But, I want to remind them now that earlier also Sheikh Abdullah and Nehru made mistake and Abdullah had to spend 18 years in jail,” he concluded.",
        "summary": "Jammu, Nov 7 (IANS) After Mushaal Hussein Mullick, the wife of jailed Jammu Kashmir Liberation Front (JKLF) chief, Yasin Malik, wrote to Leader of the Opposition (LoP) in Lok Sabha Rahul Gandhi urging him to initiate a debate in Parliament for her husband, BJP leader Kavinder Gupta on Thursday said that he (Rahul Gandhi) is [&#8230;]",
        "url": "https://bhaskarlive.in/rahul-gandhi-is-messiah-of-anti-nationals-bjp-over-yasin-maliks-wife-letter-to-lop/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073256117.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 11:35:32",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.141
    },
    {
        "id": 263307818,
        "title": "K’taka BJP urges EC to take action on use of money in bypolls",
        "text": "Bengaluru, Nov 7 (IANS) Karnataka BJP has urged the state Election Commission (EC) to initiate action on the “looted money being used” by the state government in three Assembly segments going to by-elections.\n\n“It has come to our attention that Congress leaders, who are in charge of the state by-elections, are attempting to use the maximum amount of looted money in these three constituencies. Karnataka Chief Election Commissioner must take this issue seriously,” Union Minister D.V. Sadananda Gowda told media persons. \n\nHe stressed the need for strict monitoring of the three Congress election coordinators. “We are ready to provide the Election Commission with all the necessary information. If there is no vigilance, they will misuse the influence of money to ruin the minds of the general public and transform this election into a money-driven one,” Gowda claimed.\n\nHe added that the BJP is not afraid and the workers and the NDA will continue their “honest” work. However, if the EC fails to control the underground activities of these coordinators, it could have a serious impact on the general public.\n\n“There is a bit of worry about those handling the election responsibilities for the Congress party. For instance, in Sandur, former minister B. Nagendra, who has just come out of jail in the Valmiki Tribal Welfare scam, is in charge. Minister for Waqf Zameer Ahmad Khan, who has been accused of changing farmer-owned lands to Wakf accounts to acquire them, is the coordinator in the change of Shiggaon assembly seat. In Channapatna, Shivakumar is managing the election,” he stated.\n\nHe said that the Congress is making an all-out effort in this by-election to ensure the victory. “Three Congress leaders, who have been experts in looting the Karnataka treasury, are handling the by-elections. They are determined to win the election with their monetary power,” he said. \n\nHe alleged that if people fall prey to the influence of money, Congress’s governance, which lacks any development, will continue. “The state will face a continuation of scam-ridden government. Land grabbing of farmers will continue and the people won’t get any relief due to the miserable inability of the Congress government to compensate for rain damages,” he claimed. \n\nHe also claimed that the NDA would win all three seats in the state.",
        "summary": "Bengaluru, Nov 7 (IANS) Karnataka BJP has urged the state Election Commission (EC) to initiate action on the “looted money being used” by the state government in three Assembly segments going to by-elections. &#8220;It has come to our attention that Congress leaders, who are in charge of the state by-elections, are attempting to use the [&#8230;]",
        "url": "https://bhaskarlive.in/ktaka-bjp-urges-ec-to-take-action-on-use-of-money-in-bypolls/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073256199.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 11:43:52",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.437
    },
    {
        "id": 263307820,
        "title": "Chhath festivities turn sour for two families in Bihar",
        "text": "Patna, Nov 7 (IANS) Chhath festival celebrations turned into tragedy after children from two families in Bihar’s Bhojpur and Patna drowned on Thursday.\n\nIn Bhojpur district’s Andhari village, extended families of one Santosh Soni have come to his home to celebrate the Chhath festival.\n\nThe tragedy struck when five children of the family were swept away in the Son River while bathing.\n\nAs 10-year-old Golu Kumar was drowning, his cousins came forward to rescue him. Priya Kumari attempted to rescue Golu and other children also tried to help.\n\nThe villagers managed to rescue two of the drowning children Gudiya and Tanu, Vivek Kumar, SHO of Chauri police station said.\n\nDuring the rescue operation, the bodies of Chhaya Kumari and Priya Kumari were fished out.\n\nA search for Golu was underway, with local authorities and officials actively involved in the efforts.\n\nThe tragedy has deeply affected the community, casting a shadow over the festive celebrations. Many local leaders and villagers gathered at the river to support the grieving families and assist in the search.\n\nIn another incident, three teenage girls drowned while bathing in the Punpun River in Patna’s Masaurhi block.\n\nThe girls were part of a family gathering for the festival. The trio went to the river to bathe with Pratima Kumari, who was observing the Chhath fast.\n\nShalu, daughter of Randhir Singh from Batsapur in Aurangabad, had come to visit her maternal uncle, Bablu Singh, in Lakhanpar for the festivities.\n\nHowever, Shalu, along with her cousin Medha and Pratima’s daughter Mishu Kumari started drowning.\n\nThe locals rescued Mishu and Medha but Shalu was missing.\n\nA State Disaster Response Force team has been deployed to search for her, with local authorities, including the Sub-Divisional Officer and Block Development Officer, on-site to assist with the rescue efforts.\n\nPunpun Police Station Head Baby Kumari said information was received regarding the incident, two of three girls have been saved while the search for another was underway.",
        "summary": "Patna, Nov 7 (IANS) Chhath festival celebrations turned into tragedy after children from two families in Bihar&#8217;s Bhojpur and Patna drowned on Thursday. In Bhojpur district&#8217;s Andhari village, extended families of one Santosh Soni have come to his home to celebrate the Chhath festival. The tragedy struck when five children of the family were swept [&#8230;]",
        "url": "https://bhaskarlive.in/chhath-festivities-turn-sour-for-two-families-in-bihar/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073256210.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 11:54:58",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.128
    },
    {
        "id": 262231014,
        "title": "Indonesia: 10 killed as volcano Lewotobi erupts",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Jakarta, Nov 4 (IANS) Ten people have been confirmed to have been killed after Mount Lewotobi erupted late Sunday in Indonesia&#8217;s East Nusa Tenggara province, according to national disaster management agency BNPB spokesperson Abdul Muhari on Monday. &#8220;It is confirmed that 10 people have died. Nine bodies have been recovered, while one remains trapped under [&#8230;]",
        "url": "https://bhaskarlive.in/indonesia-10-killed-as-volcano-lewotobi-erupts/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254424.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:24:41",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 262231012,
        "title": "Bangladesh’s remittance reaches nearly $9 billion in July-October",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Dhaka, Nov 4 (IANS) Remittances from millions of Bangladeshis living and working overseas totalled nearly $9 billion in the July-October period, central bank data showed. According to the data, released on Sunday, the inflow of remittances from Bangladeshis increased by more than 30 per cent year on year to 8.94 billion dollars in July-October of [&#8230;]",
        "url": "https://bhaskarlive.in/bangladeshs-remittance-reaches-nearly-9-billion-in-july-october/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254409.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:15:47",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 262231016,
        "title": "Chhath Puja: Celebrations to begin with ‘Nahay Khay’ on first day of festival",
        "text": "New Delhi, Nov 4 (IANS) The auspicious four-day festival of Chhath Puja is set to begin from Tuesday. The festival, spanning over next four days will see a series of meticulously planned rituals and offerings.\n\nThe festival begins with Nahay Khay (bathing and feasting), where participants take a ritualistic bath and consume a simple meal. The subsequent day, devotees observe Kharna, which involves fasting throughout the day, breaking it only after sunset as an offering to the deities. The person observing the fast takes the meal of roti (chappati) and kheer (rice pudding) before the family members and friends gather to eat the same meal on a banana leaf together.\n\nOn the third day, the main ritual having immense devotion ascribed to it, takes place. Chhath devotees gather at the water bodies including rivers, ponds and something, before sunrise. Standing waist-deep in water, they offer ‘arghya’ (offering of water) to the rising Sun, chanting prayers.\n\nDevotees, clad in traditional attire, gather at riverbanks and sacred water bodies, engaging in elaborate rituals that include singing devotional songs and performing dances, creating a vibrant atmosphere of community and spirituality. The sight of colourful decorations, offerings laid on woven baskets, and the collective spirit of devotion paints a striking picture of unity and faith.\n\nIn essence, Chhath is not just a festival; it is a celebration of life, health, and the enduring connection between humanity and nature. As Bihar residents around the world partake in these rituals, the festival continues to thrive as a symbol of cultural identity and spiritual richness, bridging the past with the present in a beautiful tapestry of tradition.\n\nThe festival is dedicated to the worship of Lord Surya and his sister Chhathi Maiya, the sixth form of Devi Prakriti and is popularly observed in the states of Uttar Pradesh, Jharkhand, Bihar, Madhya Pradesh, and West Bengal.\n\nDuring the festival, the devotees observe fasting to express gratitude to the Sun god for sustaining life on Earth. This year, the festival is being celebrated from November 5 (Tuesday) to November 8 (Friday).\n\nThis year, Chhath Puja will take place from November 6th to November 9th.",
        "summary": "New Delhi, Nov 4 (IANS) The auspicious four-day festival of Chhath Puja is set to begin from Tuesday. The festival, spanning over next four days will see a series of meticulously planned rituals and offerings. The festival begins with Nahay Khay (bathing and feasting), where participants take a ritualistic bath and consume a simple meal. [&#8230;]",
        "url": "https://bhaskarlive.in/chhath-puja-celebrations-to-begin-with-nahay-khay-on-first-day-of-festival/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254347.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:09:29",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.683
    },
    {
        "id": 262231020,
        "title": "Giriraj Singh is an attention seeker: Misa Bharti",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Patna, Nov 4 (IANS) Patliputra Lok Sabha MP Misa Bharti criticised Union Textile Minister Giriraj Singh on Monday and accused him of seeking attention rather than addressing issues of the people in the state. Bharti challenged Singh&#8217;s contributions to his home state, particularly questioning the development of textile-related infrastructure in regions like Bhagalpur and Motihari, [&#8230;]",
        "url": "https://bhaskarlive.in/giriraj-singh-is-an-attention-seeker-misa-bharti/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254418.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:17:53",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 262231018,
        "title": "Maha: Ajit Ranade resigns as Gokhale Institute VC",
        "text": "Pune, Nov 4 (IANS) In a surprise move, the Pune-based Gokhale Institute of Political Science and Economics Vice Chancellor and leading economist Ajit Ranade has resigned from his post citing ‘personal reasons’. \n\nHe has submitted his resignation through a letter dated October 29 to the Institute Chancellor Sanjeev Sanyal, who became Chancellor on October 7.\n\n“Thank you to the Board of Management of Servants of India Society, faculty and staff, students and all other stakeholders for giving me the opportunity to lead the Gokhale Institute, one of the best institutes in the country, for two and a half years,” said Ranade in his resignation. He wished the Institute to achieve excellence.\n\n“My resignation does not in any way indicate any lapse or disqualification for my appointment as Vice-Chancellor of the Institute in 2021,” he clarified.\n\nThe Institute has confirmed Ranade’s resignation.\n\nThe Institute was hogging the headlines after Ranade was terminated as the VC in September this year following the recommendations of the fact-finding committee appointed by former Chancellor Bibek Debroy.\n\nThe committee was formed to probe charges against Ranade after a show cause notice was served to him on June 27 by former Chancellor Rajiv Kumar.\n\nThis was done after a complaint to the UGC by a former faculty member in December 2023 that Ranade’s appointment was not in line with the University Grant Commission’s guidelines.\n\nAccording to the UGC guidelines, a vice-chancellor must have at least 10 years of continuous teaching experience as a professor in a recognised university or academic or educational institution. The UGC had sought a report from Kumar.\n\nThe former Chancellor Bibek Debroy relieved Ranade from his post. After that Ranade had approached the Bombay High Court which stayed his termination.\n\nSanyal had withdrawn Debroy’s termination order citing procedural fairness and the institute’s reputation as reasons for rescinding the dismissal.\n\nSanyal in his order laid emphasis on the importance of upholding due process while giving due respect to the legal proceedings.",
        "summary": "Pune, Nov 4 (IANS) In a surprise move, the Pune-based Gokhale Institute of Political Science and Economics Vice Chancellor and leading economist Ajit Ranade has resigned from his post citing ‘personal reasons’. He has submitted his resignation through a letter dated October 29 to the Institute Chancellor Sanjeev Sanyal, who became Chancellor on October 7. [&#8230;]",
        "url": "https://bhaskarlive.in/maha-ajit-ranade-resigns-as-gokhale-institute-vc/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254385.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 10:55:22",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.103
    },
    {
        "id": 262231022,
        "title": "Assam: ‘Vote for secular candidate in by-poll’, Badruddin Ajmal appeals to voters",
        "text": "Guwahati, Nov 4 (IANS) Badruddin Ajmal, the chief of All India United Democratic Front (AIUDF) urged voters on Monday to vote for a secular candidate in the upcoming by-elections in the state.\n\nAIUDF has refrained from fielding candidates for the by-polls in the five constituencies in the state.\n\nAjmal told reporters here, “We are not contesting the by-elections and our party will concentrate on the panchayat polls which are due for a long time in Assam. In this situation, I appeal to voters of five Assembly constituencies where by-polls will take place to cast their vote in favour of a secular candidate.”\n\nThe AIUDF leader also mentioned that he did not field any candidate in Samaguri Assembly seat to help ‘nephew’ Tanzil Hussain.\n\nNotably, Tanzil Hussain is son of Congress MP and former minister Rakibul Hussain.\n\nAjmal was defeated by Rakibul Hussain by more than 10 lakh votes in AIUDF bastion Dhubri—a seat he represented in the lower house of the parliament for 15 years.\n\nThe AIUDF leadership earlier announced that they would field a candidate in Samaguri Assembly seat; however, later, they changed their decision and the party announced that they decided to stay out of the by-elections.\n\nAjmal said, “If we field candidates in any of the five seats which are going into by-polls, the BJP will get an advantage. We do not want to give the ruling party an edge in this election. AIUDF’s motive is to put a brake on BJP’s winning spree and that is why we have decided not to contest polls.”\n\nHussain was an MLA in the Samaguri Assembly constituency for a long time and the Congress party fielded him in the Dhubri Lok Sabha seat to take on Ajmal.\n\nFollowing his election to Lok Sabha, his Assembly seat in Samaguri fell vacant and the by-poll became imminent there.\n\nAjmal said, “I might have differences with Rakibul Hussain in Dhubri but I have no animosity with his son. I wish him good luck and I desire that he must be chosen as an MLA from Samaguri in the by-polls. He has come to my house for blessings.”\n\nOn the other hand, BJP has been eyeing to oust Congress from Samaguri this time. The ruling party has thrown its top leaders into the campaign for the by-elections.",
        "summary": "Guwahati, Nov 4 (IANS) Badruddin Ajmal, the chief of All India United Democratic Front (AIUDF) urged voters on Monday to vote for a secular candidate in the upcoming by-elections in the state. AIUDF has refrained from fielding candidates for the by-polls in the five constituencies in the state. Ajmal told reporters here, “We are not [&#8230;]",
        "url": "https://bhaskarlive.in/assam-vote-for-secular-candidate-in-by-poll-badruddin-ajmal-appeals-to-voters/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202405233165820.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:16:51",
        "author": "IANS,Rakibul Hussain",
        "authors": [
            "IANS",
            "Rakibul Hussain"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.333
    },
    {
        "id": 262231026,
        "title": "Jharkhand rally: PM Modi blasts JMM, Cong and allies, labels them as ‘anti-Adivasi’",
        "text": "Ranchi, Nov 4 (IANS) Prime Minister Narendra Modi, during a mega rally in Jharkhand’s Chaibasa, slammed the Congress, Jharkhand Mukti Morcha (JMM), and Rashtriya Janata Dal (RJD), labelling them as “anti-Adivasi.” \n\nAccusing the parties of disrespecting country’s Adivasi community, PM Modi highlighted their disregard for India’s first female Adivasi President.\n\nAddressing a huge gathering in Jharkhand’s Chaibasa area, PM Modi stated, “History stands as a proof of how the British were uprooted from Kolhan. Today, Kolhan is determined to uproot the corrupt JMM government.”\n\nHe prophesied that BJP will be next to form government in the state..\n\n“This is my second rally here, and from the enthusiasm I see, I can confidently say that BJP will form the government with record-breaking seats.”\n\nPM Modi underscored the BJP’s commitment to Jharkhand, invoking a popular slogan that has gained traction among the masses: “Roti, beti aur maati ki pukaar, Jharkhand me BJP-NDA sarkar,” affirming that if the NDA assumes power, it will focus on addressing local demands symbolised by “Roti, Beti, Maati” (livelihood, daughters, and land).\n\nHe praised the BJP’s historical role in advancing Adivasi rights, stating, “When the BJP first formed a government at the Centre, it was under Atal Bihari Vajpayee’s leadership that Adivasis were granted their own states, Jharkhand and Chhattisgarh. For the past decade, we have tirelessly advocated for Adivasi demands nationally and globally.”\n\nThe Prime Minister contrasted BJP’s pro-Adivasi approach with the Congress, RJD, and JMM, accusing them of being “anti-Adivasi” forces.\n\n“No one has been a bigger enemy to the Adivasi community than Congress and RJD,” he asserted, urging young people to remember the Gua Goli Kand incident of the 1980s, where Adivasis were reportedly oppressed and even shot at under the Congress government in Bihar for demanding statehood for Jharkhand.\n\nContinuing his critique, PM Modi claimed that RJD leaders once vowed that Jharkhand would only be formed “over their dead bodies.”\n\n“Now the JMM is aligned with the RJD, which resisted Jharkhand’s formation from the start. No party has been a bigger enemy of Jharkhand than the Congress and RJD,” he noted.\n\nThe Prime Minister also highlighted that the Congress, with “Adivasi blood on its hands,” is now supporting JMM, illustrating what he described as the “betrayal” of Adivasi aspirations by these alliances.\n\nThe Prime Minister pointed out that, unlike the Congress, the BJP has appointed Adivasi leaders to top positions, including President Droupadi Murmu, Chhattisgarh’s Vishnu Deo Sai and Union Minister Savitri Thakur.\n\nHe noted that the BJP-led NDA was responsible for giving India its first female Adivasi President.\n\n“Even when we chose an Adivasi woman as the President of India, these Congress leaders opposed it,” he said, underlining BJP’s commitment to empowering the Adivasi community.\n\nPM Modi also accused the Congress, JMM, and RJD of repeatedly “insulting” the Adivasi community, citing the dismissal of Champai Soren from the Chief Minister post as a direct affront to Adivasis.\n\n“Today, the voice of Adivasis is represented by our President, but Congress, JMM, and their allies cannot tolerate an Adivasi President. They didn’t shy away from hurling insults at her,” he stated, concluding with a strong appeal to Jharkhand’s electorate.",
        "summary": "Ranchi, Nov 4 (IANS) Prime Minister Narendra Modi, during a mega rally in Jharkhand&#8217;s Chaibasa, slammed the Congress, Jharkhand Mukti Morcha (JMM), and Rashtriya Janata Dal (RJD), labelling them as &#8220;anti-Adivasi.&#8221; Accusing the parties of disrespecting country’s Adivasi community, PM Modi highlighted their disregard for India&#8217;s first female Adivasi President. Addressing a huge gathering in [&#8230;]",
        "url": "https://bhaskarlive.in/jharkhand-rally-pm-modi-blasts-jmm-cong-and-allies-labels-them-as-anti-adivasi/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254395.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:29:12",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.265
    },
    {
        "id": 262231024,
        "title": "K’taka has become safer for religious fanatics: BJP",
        "text": "Bengaluru, Nov 4 (IANS) Karnataka BJP staged a state-wide protest condemning the state government’s move to issue notices to farmers across the state claiming the ownership of their land to the Waqf board and demanded the resignation of Chief Minister Siddaramaiah.\n\nTaking part in the protest organised in front of the K.R. Puram Tehshildar’s office in K.R. Puram locality of Bengaluru on Monday, the Leader of the Opposition (LoP) in assembly, R. Ashoka stated that the issue of notices to farmers by the Waqf board is an unforgivable act.\n\n“The Congress government in 1975 is the main culprit behind the present situation. Siddaramaiah, if you want to defraud farmers by allowing notices to be issued to them and change their land records, who will believe you now,” said Ashoka.\n\nHe added that in Karnataka, terrorists and communal Muslims can have botherless sleep as they can’t be touched under the Congress rule.\n\n“Karnataka has become safer than Pakistan for religious fanatics under the Congress government,” Ashoka alleged.\n\nHe added that Siddaramaiah claimed how he could give back his family’s sites initially and demanded Rs 64 crore compensation in connection with the Mysuru Urban Development Authority (MUDA) scam, adding that later, he returned the allotted sites.\n\n“How can people believe in you? Our struggle won’t stop. You are issuing false statements and lying on withdrawing notices. We will continue our agitation,” he said.\n\nThe protesters also raised slogans demanding Siddaramaiah’s resignation and exhibited posters saying ‘Siddaramaiah is turning Karnataka into a Pakistan’, and ‘Karnataka Congress government is carrying out land jihad’ while also demanding the resignation of Minister for Waqf and Housing Zameer Ahmad Khan.\n\nThe BJP is holding a protest on Monday in Karnataka demanding the withdrawal of the 1974 Waqf property gazette notification and calling for an investigation by central agencies into the alleged misuse of authority by the government.\n\nThe party is seeking an investigation by the ED and CBI into the alleged creation of false records in the Karnataka Waqf Board for monetary gain.\n\nBJP has said that the records created over the last 50 years were now being used for minority appeasement and vote-bank politics and has also demanded that all records created under this act be investigated by the CBI and ED.",
        "summary": "Bengaluru, Nov 4 (IANS) Karnataka BJP staged a state-wide protest condemning the state government’s move to issue notices to farmers across the state claiming the ownership of their land to the Waqf board and demanded the resignation of Chief Minister Siddaramaiah. Taking part in the protest organised in front of the K.R. Puram Tehshildar’s office [&#8230;]",
        "url": "https://bhaskarlive.in/ktaka-has-become-safer-for-religious-fanatics-bjp/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254403.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:12:27",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.394
    },
    {
        "id": 262231030,
        "title": "Stopping horse trading becomes impossible if Centre supports it: Kamal Nath",
        "text": "Bhopal, Nov 4 (IANS) Former Madhya Pradesh Chief Minister Kamal Nath on Monday accused the BJP of indulging in ‘horse trading’ and ‘toppling’ of elected governments in the states, saying that stopping horse trading becomes impossible if the Centre supports it. \n\n“We have seen examples of toppling the state governments like Madhya Pradesh, Karnataka, Uttarakhand, Maharashtra. In all these states, the BJP has satisfied its hunger by toppling the non-BJP governments,” he said. \n\n“Laws have been made to stop horse trading, but when the Central government itself supports it then the law becomes incapable of stopping it,” the former Chief Minister added.\n\nHe pointed out that horse trading not only kills a democratic government but also kills the basic decision of the people for change. \n\nKamal Nath is all set to start the campaign for by-elections in Budhni and Vijaypur Assembly seats in Madhya Pradesh where he is scheduled to address two public rallies in Budhni on Tuesday. \n\nHe will also address public rallies in Vijaypur on Wednesday. Former Madhya Pradesh Chief Minister Digvijaya Singh will also campaign for the party’s candidates Budhni and Vijaypur bypolls from Wednesday. \n\nIn Budhni, the bypolls was mandated after former Chief Minister Shivraj Singh Chouhan resigned from the state Assembly after being elected for Lok Sabha. \n\nChouhan, who represented Budhni for five consecutive terms between 2006 and 2023, is now Union Agriculture Minister. \n\nThe BJP has fielded Ramakant Bhargava against Congress’ Rajkumar Patel, who had won this seat for the Congress last time in 1998. \n\nBypolls in Vijaypur was necessitated after ex-Congress MLA Ramniwas Rawat resigned from the party and the state Assembly and shifted to BJP during the Lok Sabha polls earlier this year. \n\nRawat, who at present is the state forest minister, will be contesting from Vijaypur in BJP’s symbol. \n\nBypolls in two Assembly seats – Vijaypur and Budhni are scheduled for November 13, and the results will be announced on November 23.",
        "summary": "Bhopal, Nov 4 (IANS) Former Madhya Pradesh Chief Minister Kamal Nath on Monday accused the BJP of indulging in ‘horse trading’ and ‘toppling’ of elected governments in the states, saying that stopping horse trading becomes impossible if the Centre supports it. &#8220;We have seen examples of toppling the state governments like Madhya Pradesh, Karnataka, Uttarakhand, [&#8230;]",
        "url": "https://bhaskarlive.in/stopping-horse-trading-becomes-impossible-if-centre-supports-it-kamal-nath/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254399.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:05:11",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.103
    },
    {
        "id": 262231028,
        "title": "Stop registrations & land transactions of Waqf Board: K’taka LoP to Amit Shah",
        "text": "Bengaluru, Nov 4 (IANS) Karnataka Leader of the Opposition (LoP) R. Ashoka wrote to Union Home Minister Amit Shah and Chairman of the Joint Parliamentary Committee on the Waqf (Amendment) Bill, 2024 Jagadambika Pal on Monday and demanded to stop all registrations of the Waqf Board.\n\n“In the wake of the recent atrocities by Karnataka Waqf Board, I have written to Union Home Minister Amit Shah and Chairman of the Joint Parliamentary Committee on Waqf (Amendment) Bill, 2024, Jagadambika Pal, urging them to instruct the Chief Secretary of Karnataka to immediately stop all registrations and land transactions involving Waqf Board in Karnataka,” he said.\n\nAshoka stated in the letter that the development has come to light following farmers claiming that in Vijayapura district they have served notice to acquire 15,000 acres of land.\n\n“Reportedly, the Waqf Board is attempting to register approximately 10,000 acres in each district across the state in a clandestine manner. This rush to register lands under the Waqf Board is resulting in thousands of poor families and farmers losing ancestral lands,” he said.\n\nHe added that the Waqf Board has claimed ownership of temple lands, monasteries, and other Hindu religious institutions, with even Hindu cremation grounds reportedly being listed as Waqf property.\n\n“The claims by the Waqf board include 1.28 acres belonging to the historic Virakta Math in Sindagi, the Someshwara Temple in Vijayapura, and the Birdevara Gudi in Kalaburagi. This has led to fears among farmers that they might lose their lands,” he said.\n\nHe urged that merely withdrawing notices is insufficient and demanded that farmers’ names be restored in property records and that the 1974 gazette notification be repealed.\n\n“This has caused public unrest, leading to violence and riots in places like Haveri. In light of these events, Ashoka has urged the JPC to engage with Karnataka’s Chief Secretary and immediately halt the registration of Waqf-related lands,” he said.\n\nHe pointed out that the Central government has established the JPC to draft the Waqf Amendment Bill with a focus on ensuring efficient and transparent management of Waqf properties.\n\n“However, the state government and Waqf Board in Karnataka are attempting to alter revenue records and acquire ownership of farmers’ lands,” Ashoka stated.\n\n“I am writing this to bring to your attention the recent developments in Karnataka where hasty attempts are made to register lands claimed by the Waqf board perhaps in anticipation of the amendment that Joint Parliamentary Committee could bring to the Waqf Act,” he stated.\n\nAshoka noted that as part of this pre-emptive attempt, the state government and Waqf board have reportedly begun altering land revenue records, transferring ownership of farmers’ lands to the Waqf board.\n\n“This hurried whitewashing and registering of unjust claims of land to Waqf boards will deprive thousands of farmers and poor people of Karnataka of their just and ancestral property rights,” he said.",
        "summary": "Bengaluru, Nov 4 (IANS) Karnataka Leader of the Opposition (LoP) R. Ashoka wrote to Union Home Minister Amit Shah and Chairman of the Joint Parliamentary Committee on the Waqf (Amendment) Bill, 2024 Jagadambika Pal on Monday and demanded to stop all registrations of the Waqf Board. “In the wake of the recent atrocities by Karnataka [&#8230;]",
        "url": "https://bhaskarlive.in/stop-registrations-land-transactions-of-waqf-board-ktaka-lop-to-amit-shah/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254422.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:24:23",
        "author": "IANS,Karnataka Waqf Board",
        "authors": [
            "IANS",
            "Karnataka Waqf Board"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.303
    }
]