[
    {
        "id": 262231014,
        "title": "Indonesia: 10 killed as volcano Lewotobi erupts",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Jakarta, Nov 4 (IANS) Ten people have been confirmed to have been killed after Mount Lewotobi erupted late Sunday in Indonesia&#8217;s East Nusa Tenggara province, according to national disaster management agency BNPB spokesperson Abdul Muhari on Monday. &#8220;It is confirmed that 10 people have died. Nine bodies have been recovered, while one remains trapped under [&#8230;]",
        "url": "https://bhaskarlive.in/indonesia-10-killed-as-volcano-lewotobi-erupts/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254424.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:24:41",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 262231012,
        "title": "Bangladesh’s remittance reaches nearly $9 billion in July-October",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Dhaka, Nov 4 (IANS) Remittances from millions of Bangladeshis living and working overseas totalled nearly $9 billion in the July-October period, central bank data showed. According to the data, released on Sunday, the inflow of remittances from Bangladeshis increased by more than 30 per cent year on year to 8.94 billion dollars in July-October of [&#8230;]",
        "url": "https://bhaskarlive.in/bangladeshs-remittance-reaches-nearly-9-billion-in-july-october/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254409.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:15:47",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 262231016,
        "title": "Chhath Puja: Celebrations to begin with ‘Nahay Khay’ on first day of festival",
        "text": "New Delhi, Nov 4 (IANS) The auspicious four-day festival of Chhath Puja is set to begin from Tuesday. The festival, spanning over next four days will see a series of meticulously planned rituals and offerings.\n\nThe festival begins with Nahay Khay (bathing and feasting), where participants take a ritualistic bath and consume a simple meal. The subsequent day, devotees observe Kharna, which involves fasting throughout the day, breaking it only after sunset as an offering to the deities. The person observing the fast takes the meal of roti (chappati) and kheer (rice pudding) before the family members and friends gather to eat the same meal on a banana leaf together.\n\nOn the third day, the main ritual having immense devotion ascribed to it, takes place. Chhath devotees gather at the water bodies including rivers, ponds and something, before sunrise. Standing waist-deep in water, they offer ‘arghya’ (offering of water) to the rising Sun, chanting prayers.\n\nDevotees, clad in traditional attire, gather at riverbanks and sacred water bodies, engaging in elaborate rituals that include singing devotional songs and performing dances, creating a vibrant atmosphere of community and spirituality. The sight of colourful decorations, offerings laid on woven baskets, and the collective spirit of devotion paints a striking picture of unity and faith.\n\nIn essence, Chhath is not just a festival; it is a celebration of life, health, and the enduring connection between humanity and nature. As Bihar residents around the world partake in these rituals, the festival continues to thrive as a symbol of cultural identity and spiritual richness, bridging the past with the present in a beautiful tapestry of tradition.\n\nThe festival is dedicated to the worship of Lord Surya and his sister Chhathi Maiya, the sixth form of Devi Prakriti and is popularly observed in the states of Uttar Pradesh, Jharkhand, Bihar, Madhya Pradesh, and West Bengal.\n\nDuring the festival, the devotees observe fasting to express gratitude to the Sun god for sustaining life on Earth. This year, the festival is being celebrated from November 5 (Tuesday) to November 8 (Friday).\n\nThis year, Chhath Puja will take place from November 6th to November 9th.",
        "summary": "New Delhi, Nov 4 (IANS) The auspicious four-day festival of Chhath Puja is set to begin from Tuesday. The festival, spanning over next four days will see a series of meticulously planned rituals and offerings. The festival begins with Nahay Khay (bathing and feasting), where participants take a ritualistic bath and consume a simple meal. [&#8230;]",
        "url": "https://bhaskarlive.in/chhath-puja-celebrations-to-begin-with-nahay-khay-on-first-day-of-festival/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254347.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:09:29",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.683
    },
    {
        "id": 262231020,
        "title": "Giriraj Singh is an attention seeker: Misa Bharti",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Patna, Nov 4 (IANS) Patliputra Lok Sabha MP Misa Bharti criticised Union Textile Minister Giriraj Singh on Monday and accused him of seeking attention rather than addressing issues of the people in the state. Bharti challenged Singh&#8217;s contributions to his home state, particularly questioning the development of textile-related infrastructure in regions like Bhagalpur and Motihari, [&#8230;]",
        "url": "https://bhaskarlive.in/giriraj-singh-is-an-attention-seeker-misa-bharti/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254418.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:17:53",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 262231018,
        "title": "Maha: Ajit Ranade resigns as Gokhale Institute VC",
        "text": "Pune, Nov 4 (IANS) In a surprise move, the Pune-based Gokhale Institute of Political Science and Economics Vice Chancellor and leading economist Ajit Ranade has resigned from his post citing ‘personal reasons’. \n\nHe has submitted his resignation through a letter dated October 29 to the Institute Chancellor Sanjeev Sanyal, who became Chancellor on October 7.\n\n“Thank you to the Board of Management of Servants of India Society, faculty and staff, students and all other stakeholders for giving me the opportunity to lead the Gokhale Institute, one of the best institutes in the country, for two and a half years,” said Ranade in his resignation. He wished the Institute to achieve excellence.\n\n“My resignation does not in any way indicate any lapse or disqualification for my appointment as Vice-Chancellor of the Institute in 2021,” he clarified.\n\nThe Institute has confirmed Ranade’s resignation.\n\nThe Institute was hogging the headlines after Ranade was terminated as the VC in September this year following the recommendations of the fact-finding committee appointed by former Chancellor Bibek Debroy.\n\nThe committee was formed to probe charges against Ranade after a show cause notice was served to him on June 27 by former Chancellor Rajiv Kumar.\n\nThis was done after a complaint to the UGC by a former faculty member in December 2023 that Ranade’s appointment was not in line with the University Grant Commission’s guidelines.\n\nAccording to the UGC guidelines, a vice-chancellor must have at least 10 years of continuous teaching experience as a professor in a recognised university or academic or educational institution. The UGC had sought a report from Kumar.\n\nThe former Chancellor Bibek Debroy relieved Ranade from his post. After that Ranade had approached the Bombay High Court which stayed his termination.\n\nSanyal had withdrawn Debroy’s termination order citing procedural fairness and the institute’s reputation as reasons for rescinding the dismissal.\n\nSanyal in his order laid emphasis on the importance of upholding due process while giving due respect to the legal proceedings.",
        "summary": "Pune, Nov 4 (IANS) In a surprise move, the Pune-based Gokhale Institute of Political Science and Economics Vice Chancellor and leading economist Ajit Ranade has resigned from his post citing ‘personal reasons’. He has submitted his resignation through a letter dated October 29 to the Institute Chancellor Sanjeev Sanyal, who became Chancellor on October 7. [&#8230;]",
        "url": "https://bhaskarlive.in/maha-ajit-ranade-resigns-as-gokhale-institute-vc/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254385.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 10:55:22",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.103
    },
    {
        "id": 262231022,
        "title": "Assam: ‘Vote for secular candidate in by-poll’, Badruddin Ajmal appeals to voters",
        "text": "Guwahati, Nov 4 (IANS) Badruddin Ajmal, the chief of All India United Democratic Front (AIUDF) urged voters on Monday to vote for a secular candidate in the upcoming by-elections in the state.\n\nAIUDF has refrained from fielding candidates for the by-polls in the five constituencies in the state.\n\nAjmal told reporters here, “We are not contesting the by-elections and our party will concentrate on the panchayat polls which are due for a long time in Assam. In this situation, I appeal to voters of five Assembly constituencies where by-polls will take place to cast their vote in favour of a secular candidate.”\n\nThe AIUDF leader also mentioned that he did not field any candidate in Samaguri Assembly seat to help ‘nephew’ Tanzil Hussain.\n\nNotably, Tanzil Hussain is son of Congress MP and former minister Rakibul Hussain.\n\nAjmal was defeated by Rakibul Hussain by more than 10 lakh votes in AIUDF bastion Dhubri—a seat he represented in the lower house of the parliament for 15 years.\n\nThe AIUDF leadership earlier announced that they would field a candidate in Samaguri Assembly seat; however, later, they changed their decision and the party announced that they decided to stay out of the by-elections.\n\nAjmal said, “If we field candidates in any of the five seats which are going into by-polls, the BJP will get an advantage. We do not want to give the ruling party an edge in this election. AIUDF’s motive is to put a brake on BJP’s winning spree and that is why we have decided not to contest polls.”\n\nHussain was an MLA in the Samaguri Assembly constituency for a long time and the Congress party fielded him in the Dhubri Lok Sabha seat to take on Ajmal.\n\nFollowing his election to Lok Sabha, his Assembly seat in Samaguri fell vacant and the by-poll became imminent there.\n\nAjmal said, “I might have differences with Rakibul Hussain in Dhubri but I have no animosity with his son. I wish him good luck and I desire that he must be chosen as an MLA from Samaguri in the by-polls. He has come to my house for blessings.”\n\nOn the other hand, BJP has been eyeing to oust Congress from Samaguri this time. The ruling party has thrown its top leaders into the campaign for the by-elections.",
        "summary": "Guwahati, Nov 4 (IANS) Badruddin Ajmal, the chief of All India United Democratic Front (AIUDF) urged voters on Monday to vote for a secular candidate in the upcoming by-elections in the state. AIUDF has refrained from fielding candidates for the by-polls in the five constituencies in the state. Ajmal told reporters here, “We are not [&#8230;]",
        "url": "https://bhaskarlive.in/assam-vote-for-secular-candidate-in-by-poll-badruddin-ajmal-appeals-to-voters/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202405233165820.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:16:51",
        "author": "IANS,Rakibul Hussain",
        "authors": [
            "IANS",
            "Rakibul Hussain"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.333
    },
    {
        "id": 262231026,
        "title": "Jharkhand rally: PM Modi blasts JMM, Cong and allies, labels them as ‘anti-Adivasi’",
        "text": "Ranchi, Nov 4 (IANS) Prime Minister Narendra Modi, during a mega rally in Jharkhand’s Chaibasa, slammed the Congress, Jharkhand Mukti Morcha (JMM), and Rashtriya Janata Dal (RJD), labelling them as “anti-Adivasi.” \n\nAccusing the parties of disrespecting country’s Adivasi community, PM Modi highlighted their disregard for India’s first female Adivasi President.\n\nAddressing a huge gathering in Jharkhand’s Chaibasa area, PM Modi stated, “History stands as a proof of how the British were uprooted from Kolhan. Today, Kolhan is determined to uproot the corrupt JMM government.”\n\nHe prophesied that BJP will be next to form government in the state..\n\n“This is my second rally here, and from the enthusiasm I see, I can confidently say that BJP will form the government with record-breaking seats.”\n\nPM Modi underscored the BJP’s commitment to Jharkhand, invoking a popular slogan that has gained traction among the masses: “Roti, beti aur maati ki pukaar, Jharkhand me BJP-NDA sarkar,” affirming that if the NDA assumes power, it will focus on addressing local demands symbolised by “Roti, Beti, Maati” (livelihood, daughters, and land).\n\nHe praised the BJP’s historical role in advancing Adivasi rights, stating, “When the BJP first formed a government at the Centre, it was under Atal Bihari Vajpayee’s leadership that Adivasis were granted their own states, Jharkhand and Chhattisgarh. For the past decade, we have tirelessly advocated for Adivasi demands nationally and globally.”\n\nThe Prime Minister contrasted BJP’s pro-Adivasi approach with the Congress, RJD, and JMM, accusing them of being “anti-Adivasi” forces.\n\n“No one has been a bigger enemy to the Adivasi community than Congress and RJD,” he asserted, urging young people to remember the Gua Goli Kand incident of the 1980s, where Adivasis were reportedly oppressed and even shot at under the Congress government in Bihar for demanding statehood for Jharkhand.\n\nContinuing his critique, PM Modi claimed that RJD leaders once vowed that Jharkhand would only be formed “over their dead bodies.”\n\n“Now the JMM is aligned with the RJD, which resisted Jharkhand’s formation from the start. No party has been a bigger enemy of Jharkhand than the Congress and RJD,” he noted.\n\nThe Prime Minister also highlighted that the Congress, with “Adivasi blood on its hands,” is now supporting JMM, illustrating what he described as the “betrayal” of Adivasi aspirations by these alliances.\n\nThe Prime Minister pointed out that, unlike the Congress, the BJP has appointed Adivasi leaders to top positions, including President Droupadi Murmu, Chhattisgarh’s Vishnu Deo Sai and Union Minister Savitri Thakur.\n\nHe noted that the BJP-led NDA was responsible for giving India its first female Adivasi President.\n\n“Even when we chose an Adivasi woman as the President of India, these Congress leaders opposed it,” he said, underlining BJP’s commitment to empowering the Adivasi community.\n\nPM Modi also accused the Congress, JMM, and RJD of repeatedly “insulting” the Adivasi community, citing the dismissal of Champai Soren from the Chief Minister post as a direct affront to Adivasis.\n\n“Today, the voice of Adivasis is represented by our President, but Congress, JMM, and their allies cannot tolerate an Adivasi President. They didn’t shy away from hurling insults at her,” he stated, concluding with a strong appeal to Jharkhand’s electorate.",
        "summary": "Ranchi, Nov 4 (IANS) Prime Minister Narendra Modi, during a mega rally in Jharkhand&#8217;s Chaibasa, slammed the Congress, Jharkhand Mukti Morcha (JMM), and Rashtriya Janata Dal (RJD), labelling them as &#8220;anti-Adivasi.&#8221; Accusing the parties of disrespecting country’s Adivasi community, PM Modi highlighted their disregard for India&#8217;s first female Adivasi President. Addressing a huge gathering in [&#8230;]",
        "url": "https://bhaskarlive.in/jharkhand-rally-pm-modi-blasts-jmm-cong-and-allies-labels-them-as-anti-adivasi/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254395.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:29:12",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.265
    },
    {
        "id": 262231024,
        "title": "K’taka has become safer for religious fanatics: BJP",
        "text": "Bengaluru, Nov 4 (IANS) Karnataka BJP staged a state-wide protest condemning the state government’s move to issue notices to farmers across the state claiming the ownership of their land to the Waqf board and demanded the resignation of Chief Minister Siddaramaiah.\n\nTaking part in the protest organised in front of the K.R. Puram Tehshildar’s office in K.R. Puram locality of Bengaluru on Monday, the Leader of the Opposition (LoP) in assembly, R. Ashoka stated that the issue of notices to farmers by the Waqf board is an unforgivable act.\n\n“The Congress government in 1975 is the main culprit behind the present situation. Siddaramaiah, if you want to defraud farmers by allowing notices to be issued to them and change their land records, who will believe you now,” said Ashoka.\n\nHe added that in Karnataka, terrorists and communal Muslims can have botherless sleep as they can’t be touched under the Congress rule.\n\n“Karnataka has become safer than Pakistan for religious fanatics under the Congress government,” Ashoka alleged.\n\nHe added that Siddaramaiah claimed how he could give back his family’s sites initially and demanded Rs 64 crore compensation in connection with the Mysuru Urban Development Authority (MUDA) scam, adding that later, he returned the allotted sites.\n\n“How can people believe in you? Our struggle won’t stop. You are issuing false statements and lying on withdrawing notices. We will continue our agitation,” he said.\n\nThe protesters also raised slogans demanding Siddaramaiah’s resignation and exhibited posters saying ‘Siddaramaiah is turning Karnataka into a Pakistan’, and ‘Karnataka Congress government is carrying out land jihad’ while also demanding the resignation of Minister for Waqf and Housing Zameer Ahmad Khan.\n\nThe BJP is holding a protest on Monday in Karnataka demanding the withdrawal of the 1974 Waqf property gazette notification and calling for an investigation by central agencies into the alleged misuse of authority by the government.\n\nThe party is seeking an investigation by the ED and CBI into the alleged creation of false records in the Karnataka Waqf Board for monetary gain.\n\nBJP has said that the records created over the last 50 years were now being used for minority appeasement and vote-bank politics and has also demanded that all records created under this act be investigated by the CBI and ED.",
        "summary": "Bengaluru, Nov 4 (IANS) Karnataka BJP staged a state-wide protest condemning the state government’s move to issue notices to farmers across the state claiming the ownership of their land to the Waqf board and demanded the resignation of Chief Minister Siddaramaiah. Taking part in the protest organised in front of the K.R. Puram Tehshildar’s office [&#8230;]",
        "url": "https://bhaskarlive.in/ktaka-has-become-safer-for-religious-fanatics-bjp/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254403.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:12:27",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.394
    },
    {
        "id": 262231030,
        "title": "Stopping horse trading becomes impossible if Centre supports it: Kamal Nath",
        "text": "Bhopal, Nov 4 (IANS) Former Madhya Pradesh Chief Minister Kamal Nath on Monday accused the BJP of indulging in ‘horse trading’ and ‘toppling’ of elected governments in the states, saying that stopping horse trading becomes impossible if the Centre supports it. \n\n“We have seen examples of toppling the state governments like Madhya Pradesh, Karnataka, Uttarakhand, Maharashtra. In all these states, the BJP has satisfied its hunger by toppling the non-BJP governments,” he said. \n\n“Laws have been made to stop horse trading, but when the Central government itself supports it then the law becomes incapable of stopping it,” the former Chief Minister added.\n\nHe pointed out that horse trading not only kills a democratic government but also kills the basic decision of the people for change. \n\nKamal Nath is all set to start the campaign for by-elections in Budhni and Vijaypur Assembly seats in Madhya Pradesh where he is scheduled to address two public rallies in Budhni on Tuesday. \n\nHe will also address public rallies in Vijaypur on Wednesday. Former Madhya Pradesh Chief Minister Digvijaya Singh will also campaign for the party’s candidates Budhni and Vijaypur bypolls from Wednesday. \n\nIn Budhni, the bypolls was mandated after former Chief Minister Shivraj Singh Chouhan resigned from the state Assembly after being elected for Lok Sabha. \n\nChouhan, who represented Budhni for five consecutive terms between 2006 and 2023, is now Union Agriculture Minister. \n\nThe BJP has fielded Ramakant Bhargava against Congress’ Rajkumar Patel, who had won this seat for the Congress last time in 1998. \n\nBypolls in Vijaypur was necessitated after ex-Congress MLA Ramniwas Rawat resigned from the party and the state Assembly and shifted to BJP during the Lok Sabha polls earlier this year. \n\nRawat, who at present is the state forest minister, will be contesting from Vijaypur in BJP’s symbol. \n\nBypolls in two Assembly seats – Vijaypur and Budhni are scheduled for November 13, and the results will be announced on November 23.",
        "summary": "Bhopal, Nov 4 (IANS) Former Madhya Pradesh Chief Minister Kamal Nath on Monday accused the BJP of indulging in ‘horse trading’ and ‘toppling’ of elected governments in the states, saying that stopping horse trading becomes impossible if the Centre supports it. &#8220;We have seen examples of toppling the state governments like Madhya Pradesh, Karnataka, Uttarakhand, [&#8230;]",
        "url": "https://bhaskarlive.in/stopping-horse-trading-becomes-impossible-if-centre-supports-it-kamal-nath/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254399.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:05:11",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.103
    },
    {
        "id": 262231028,
        "title": "Stop registrations & land transactions of Waqf Board: K’taka LoP to Amit Shah",
        "text": "Bengaluru, Nov 4 (IANS) Karnataka Leader of the Opposition (LoP) R. Ashoka wrote to Union Home Minister Amit Shah and Chairman of the Joint Parliamentary Committee on the Waqf (Amendment) Bill, 2024 Jagadambika Pal on Monday and demanded to stop all registrations of the Waqf Board.\n\n“In the wake of the recent atrocities by Karnataka Waqf Board, I have written to Union Home Minister Amit Shah and Chairman of the Joint Parliamentary Committee on Waqf (Amendment) Bill, 2024, Jagadambika Pal, urging them to instruct the Chief Secretary of Karnataka to immediately stop all registrations and land transactions involving Waqf Board in Karnataka,” he said.\n\nAshoka stated in the letter that the development has come to light following farmers claiming that in Vijayapura district they have served notice to acquire 15,000 acres of land.\n\n“Reportedly, the Waqf Board is attempting to register approximately 10,000 acres in each district across the state in a clandestine manner. This rush to register lands under the Waqf Board is resulting in thousands of poor families and farmers losing ancestral lands,” he said.\n\nHe added that the Waqf Board has claimed ownership of temple lands, monasteries, and other Hindu religious institutions, with even Hindu cremation grounds reportedly being listed as Waqf property.\n\n“The claims by the Waqf board include 1.28 acres belonging to the historic Virakta Math in Sindagi, the Someshwara Temple in Vijayapura, and the Birdevara Gudi in Kalaburagi. This has led to fears among farmers that they might lose their lands,” he said.\n\nHe urged that merely withdrawing notices is insufficient and demanded that farmers’ names be restored in property records and that the 1974 gazette notification be repealed.\n\n“This has caused public unrest, leading to violence and riots in places like Haveri. In light of these events, Ashoka has urged the JPC to engage with Karnataka’s Chief Secretary and immediately halt the registration of Waqf-related lands,” he said.\n\nHe pointed out that the Central government has established the JPC to draft the Waqf Amendment Bill with a focus on ensuring efficient and transparent management of Waqf properties.\n\n“However, the state government and Waqf Board in Karnataka are attempting to alter revenue records and acquire ownership of farmers’ lands,” Ashoka stated.\n\n“I am writing this to bring to your attention the recent developments in Karnataka where hasty attempts are made to register lands claimed by the Waqf board perhaps in anticipation of the amendment that Joint Parliamentary Committee could bring to the Waqf Act,” he stated.\n\nAshoka noted that as part of this pre-emptive attempt, the state government and Waqf board have reportedly begun altering land revenue records, transferring ownership of farmers’ lands to the Waqf board.\n\n“This hurried whitewashing and registering of unjust claims of land to Waqf boards will deprive thousands of farmers and poor people of Karnataka of their just and ancestral property rights,” he said.",
        "summary": "Bengaluru, Nov 4 (IANS) Karnataka Leader of the Opposition (LoP) R. Ashoka wrote to Union Home Minister Amit Shah and Chairman of the Joint Parliamentary Committee on the Waqf (Amendment) Bill, 2024 Jagadambika Pal on Monday and demanded to stop all registrations of the Waqf Board. “In the wake of the recent atrocities by Karnataka [&#8230;]",
        "url": "https://bhaskarlive.in/stop-registrations-land-transactions-of-waqf-board-ktaka-lop-to-amit-shah/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411043254422.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-04 11:24:23",
        "author": "IANS,Karnataka Waqf Board",
        "authors": [
            "IANS",
            "Karnataka Waqf Board"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.303
    },
    {
        "id": 261917610,
        "title": "Ektaa Kapoor revives ‘Kyunki Saas Bhi Kabhi Bahu Thi’ for ‘The Sabarmati Report’",
        "text": "Mumbai: Ektaa Kapoor is set to bring back the legendary song “Ram Ram” from her popular TV series “Kyunki Saas Bhi Kabhi Bahu Thi” in her forthcoming film “The Sabarmati Report.”\r\n\r\nThe song has been reimagined and given a new title, “Raja Ram\" This revamped track beautifully merges the cherished memories of the original with a contemporary cinematic flair.\r\n\r\nThe makers shared the teaser for the song on their social media handles, writing, “This Diwali, Truth will prevail!” The film's teaser was recently released and it hinted at the revelation of long-hidden truths surrounding the incident. In the teaser, Vikrant impresses as a bold journalist dedicated to uncovering the truth, while Raashii Khanna delivers a powerful performance as his fellow reporter.\r\n\r\nThe teaser also offers a glimpse of Ridhi’s role as a seasoned anchor. “The Sabarmati Report” is directed by Dheeraj Sarna and produced by Shobha Kapoor, Ektaa R Kapoor, Amul V Mohan, and Anshul Mohan. The film recounts the tragic events of February 27, 2002, when a devastating fire broke out on the Sabarmati Express, resulting in the deaths of 59 pilgrims and karsevaks returning from Ayodhya. It marks Massey’s first on-screen collaboration with both Raashii Khanna and Ridhi Dogra.The film is set to release in theatres on November 15.\r\n\r\nApart from this, Vikrant also has an upcoming film Aankhon Ki Gustaakhiyaan in the pipeline. He was last featured in Aditya Nimbalkar’s crime thriller Sector 36, where he starred alongside Deepak Dobriyal and Akash Khurana.\r\n\r\nThe film was inspired by the notorious Noida serial murders of 2006. Talking about, ‘Kyunki Saas Bhi Kabhi Bahu Thi’, the Star Plus’s daily soap opera was one of the most popular and loved shows. It aired from 3 July 2000 to 6 November 2008. The show starred Smriti Irani in the lead role.",
        "summary": "The song has been reimagined and given a new title, “Raja Ram\" This revamped track beautifully merges the cherished memories of the original with a contemporary cinematic flair.",
        "url": "https://telanganatoday.com/ektaa-kapoor-revives-kyunki-saas-bhi-kabhi-bahu-thi-for-the-sabarmati-report",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/ektaa.jpg",
        "video": null,
        "publish_date": "2024-11-01 10:28:37",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "entertainment",
        "source_country": "in",
        "sentiment": 0.706
    },
    {
        "id": 261917614,
        "title": "ISRO launches India’s first analog space mission to study extraterrestrial challenges",
        "text": "New Delhi: The Indian Space Research Organization (ISRO) on Friday announced the launch of its first analog space mission, to study the challenges of extraterrestrial conditions that will help in future space missions.\r\n\r\nThe mission, which includes a compact, inflatable habitat named Hab-1 will simulate life in an interplanetary habitat. It is being held in Leh, in Ladakh.\r\n\r\nEven as India plans to launch several space missions, the new mission will help understand the challenges that future astronauts may encounter on missions beyond Earth.\r\n\r\n“India’s first analog space mission kicks off in Leh!” ISRO said in a post on X.\r\n\r\n“This mission will simulate life in an interplanetary habitat to tackle the challenges of a base station beyond Earth,” the space agency added.\r\n\r\nHab-1 is equipped with essentials like a hydroponics farm, kitchen, and sanitation facilities. It provides a self-sustaining environment, offering valuable data as India is planning long-duration space missions to the Moon, Mars, and beyond.\r\n\r\nThe mission is a collaborative effort by the Human Spaceflight Centre, ISRO, AAKA Space Studio, University of Ladakh, IIT Bombay, and is supported by the Ladakh Autonomous Hill Development Council.\r\n\r\nLadakh was chosen as the place for the mission due to its unique geological characteristics that closely resemble Martian and lunar landscapes.\r\n\r\nIts cold, arid conditions and high altitude will provide an ideal environment for testing technologies and strategies necessary for long-duration space missions.\r\n\r\nDuring the mission, the scientists will test new technologies, robotic equipment, vehicles, habitats, and communications. They will also seek to understand power generation, mobility, infrastructure, and storage during the analog mission.\r\n\r\nHab-1 will also study the effects of isolation and confinement on human health and performance.\r\n\r\nThe findings may help ISRO understand the strengths, limitations, and validity of planned human-robotic exploration operations.\r\n\r\n“This analog mission is a significant step towards understanding the complexities of living on other planets,” said Rajnagar Divisional Forest Officer Sudarshan Gopinath.\r\n\r\n\"The insights gained will be crucial for the success of future space missions,\" he added.\r\n\r\nThe country's Space Vision 2047 includes setting up an Indian Space Station - - Bharatiya Antariksha Station (BAS) -- by 2035 and landing an Indian on the Moon by 2040.",
        "summary": "The mission, featuring a compact inflatable habitat called Hab-1, will simulate life in an interplanetary environment and is taking place in Leh, Ladakh. As India prepares for upcoming space missions, this initiative aims to explore the challenges future astronauts may face on missions beyond Earth.",
        "url": "https://telanganatoday.com/isro-launches-indias-first-analog-space-mission-to-study-extraterrestrial-challenges",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/ISRO-launches-Indias-first-analog-space-mission.jpg",
        "video": null,
        "publish_date": "2024-11-01 10:30:54",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.718
    },
    {
        "id": 261916120,
        "title": "Thailand’s manufacturing sector stagnates in October",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Bangkok, Nov 1 (IANS) Thailand&#8217;s manufacturing sector slowed to stagnation in October as new orders fell slightly despite a continued rise in output and employment, a survey showed on Friday. The Southeast Asian country&#8217;s manufacturing purchasing managers&#8217; index (PMI) came in at 50 last month, edging down from 50.4 in September, marking the end of [&#8230;]",
        "url": "https://bhaskarlive.in/thailands-manufacturing-sector-stagnates-in-october/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252995.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:20:00",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "category": "business",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261916122,
        "title": "Operationally ready at all times, says Eastern Army Commander on 104th Raising Day",
        "text": "Kolkata, Nov 1 (IANS) The Army’s Eastern Command celebrated its 104th Raising Day at Fort William here on Friday with its chief, Lt Gen Ram Chander Tiwari asserting that it is operationally ready at all times and continues to develop its capabilities to face present and future challenges.\n\nChief of Staff Lt Gen R.C. Srikanth laid a wreath at Vijay Smarak in Fort William to pay tribute to bravehearts, who made the supreme sacrifice in the service to the nation, in the morning. Several events were organised during the day, including interactions between officers and troops.\n\nAccording to an official, the Eastern Command was raised in Lucknow on November 1, 1920. It then had territorial jurisdiction over Delhi, Uttar Pradesh, Bihar, Odisha, and Assam. Thereafter, the Command headquarters moved to Barrackpore, Ranchi and back to Lucknow. After the India-China War of 1962, the Command settled down permanently at Fort William in Kolkata.\n\n“Eastern Command continues to remain the Army’s largest operational command with its jurisdiction covering eight states. It monitors 8,350 km of land borders with five neighbouring countries. The Eastern Command has actively participated in all wars fought by India but the crowning glory was the 1971 Indo-Pakistan War that led to the Liberation of Bangladesh. The ‘Warriors of the East’ have also conducted successful counter-insurgency operations in the northeastern states whenever required,” the official said.\n\nThe command is also entrusted with managing the Line of Actual Control (LAC) in the states of Sikkim and Arunachal Pradesh. The official said that personnel from the command cover terrain ranging from high-altitude peaks in the Himalayas with sub-zero temperatures to steaming rain forests with fast-flowing rivers.\n\n“The Command has also brought significant changes in the lives of citizens, particularly in the northeastern states, through initiatives like Operation Sadbhavana and Operation Samaritan. Officers and troops not only provide relief during disasters and help to restore law and order, they also interact with the local population on a regular basis through medical camps. Training is also provided to local youth to join the armed forces or take up professional courses like engineering and medicine,” the official added.",
        "summary": "Kolkata, Nov 1 (IANS) The Army’s Eastern Command celebrated its 104th Raising Day at Fort William here on Friday with its chief, Lt Gen Ram Chander Tiwari asserting that it is operationally ready at all times and continues to develop its capabilities to face present and future challenges. Chief of Staff Lt Gen R.C. Srikanth [&#8230;]",
        "url": "https://bhaskarlive.in/operationally-ready-at-all-times-says-eastern-army-commander-on-104th-raising-day/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252989.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:06:41",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.262
    },
    {
        "id": 261916126,
        "title": "‘Judicial legacy’: 10 landmark verdicts authored by CJI Chandrachud",
        "text": "New Delhi, Nov 1 (IANS) After a two-year-long stint as the Chief Justice of India (CJI) D.Y. Chandrachud is due to retire on November 10 on attaining the age of 65 years. During the period, he pronounced several notable judgements. \n\nHere are the 10 key judgments authored by him when he was in the highest judicial office of the country after taking over as the CJI on November 9, 2022.\n\n1. Revocation of Article 370\n\nA 5-judge Constitution Bench, headed by CJI D.Y. Chandrachud, had upheld the revocation of Article 370. It had ordered the Election Commission of India to take steps to conduct elections to the Legislative Assembly of Jammu and Kashmir by September 30, 2024.\n\nThe Constitution Bench, also comprising Justices S.K. Kaul, Sanjiv Khanna, B.R. Gavai and Surya Kant, had left open the question of whether Parliament can extinguish the character of statehood by converting a state into one or more union territories, relying on the statement made by Solicitor General Tushar Mehta that statehood would be restored to Jammu and Kashmir, but, it had said that “restoration of statehood shall take place at the earliest and as soon as possible”.\n\nThe Supreme Court had upheld the status of Ladakh as a union territory under Article 3(a) read with Explanation I of the Constitution, which permits the formation of a union territory by separating a territory from any state.\n\nIn May this year, the apex court refused to review the Constitution Bench verdict and dismissed a batch of review pleas filed against the decision upholding the revocation of Article 370 as valid.\n\n2. Same-sex marriage\n\nA 5-judge bench headed by CJI D.Y. Chandrachud had declined to strike down or read into gender-neutral “person” in place of “male” and “female” existing under the Special Marriage Act. All five judges of the Constitution Bench had unanimously agreed that there exists no unqualified right to marriage and accepted the Centre’s proposal that a committee to be headed by the Cabinet Secretary be set up to examine what administrative steps could be taken to address basic social benefit concerns relating to same-sex couples.\n\nThe Constitution Bench, also comprising Justices Sanjiv Khanna, Hima Kohli, B.V. Nagarathna and P.S. Narasimha, had left it to the legislature to take a call on enacting the marriage equality law. It had asked the Union and state governments to ensure that the LGBTQ+ community is not discriminated against on the basis of their sexual orientation and queer individuals are not refused access to any goods or services.\n\n3. Electoral bonds\n\nA five-judge Constitution Bench, headed by CJI D.Y. Chandrachud, had struck down the electoral bonds scheme, saying that denying voters the right to know the details of funding of political parties would lead to a dichotomous situation and the funding of political parties cannot be treated differently from that of the candidates who contest elections.\n\nIn a unanimous verdict, the Bench, also comprising Justices B.R. Gavai, Sajiv Khanna, J.B. Padriwala and Manoj Misra, had directed the State Bank of India (SBI) to forthwith stop the issuance of electoral bonds and ordered the Election Commission of India (ECI) to publish on its official website the details of the political parties which have received contributions through electoral bonds since April 2019.\n\nSubsequently, a bench headed by CJI Chandrachud declined to entertain a public interest litigation (PIL) seeking a Special Investigative Team (SIT) probe under the supervision of a retired apex court judge into an alleged scam in poll financing using electoral bonds.\n\nThe top court said that an SIT cannot be formed to probe “quid pro quo” unless there is an FIR already registered on the issue espoused in the PIL, adding that the ordinary course of law may remedy the allegations raised in the plea.\n\n4. Caste-based division of labour in prisons\n\nA bench headed by CJI DY Chandrachud held it unconstitutional the practice of employing “lower caste” jail inmates in cleaning and manual scavenging work in prisons. The Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, directed that the “caste” column and any references to caste in prisoners’ registers inside the prisons be deleted.\n\nIn its October 2024 verdict, the Supreme Court asked all states and union territories to revise their prison rules providing caste-based division of labour in jails within three months. It also asked the Union government to make changes in the Model Prison Manual 2016 and the Model Prisons and Correctional Services Act 2023 within three months.\n\n5. Effective implementation of Prohibition of Child Marriage Act, 2006\n\nA bench headed by CJI Chandrachud issued a slew of directions for the effective implementation of the Prohibition of Child Marriage Act, 2006.\n\nThe Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, ordered the state governments and union territories to appoint officers solely responsible for discharging the functions of Child Marriage Prohibition Officers (CMPOs) at the district level.\n\nIt said that child marriage deprives children of their agency, autonomy and right to fully develop and enjoy their childhood. “Both sexes are adversely affected by forced and early marriage. Marrying in childhood has the effect of objectifying the child. The practice of child marriage imposes mature burdens on children who are not physically or mentally prepared to comprehend the significance of marriage,” ordered SC.\n\n6. Section 6A of Citizenship Act\n\nA Constitution Bench, headed by CJI Chandrachud, upheld the constitutional validity of Section 6A of the Citizenship Act, 1955, which was inserted to give effect to the Assam Accord and formed the basis of the National Register of Citizens (NRC) in Assam in 2019.\n\nThe 5-judge Bench was dealing with a clutch of petitions challenging Section 6A of the Citizenship Act 1955, on the ground that it violates Articles 6,7,14, 29 and 355 of the Constitution.\n\nIn his opinion, CJI Chandrachud held that Section 6A of the Citizenship Act does not have the effect of amending Articles 6 and 7 of the Constitution, which prescribe a cut-off date for conferring citizenship for migrants from East and West Pakistan at the “commencement of the Constitution” (i.e., on January 26, 1950).\n\n7. NEET-UG 2024\n\nRefusing to order a fresh exam, a bench headed by CJI Chandrachud observed there was no systematic leak of the question paper of the NEET-UG 2024 examination.\n\nThe Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, said there was no sufficient material available on the record to order a re-test but clarified that its judgment won’t prevent authorities from taking action against candidates who had secured admission using malpractices.\n\n8. Adani-Hindenburg controversy\n\nA bench presided over by CJI Chandrachud refused to form any SIT or group of experts to conduct the investigation in the Adani-Hindenburg controversy and said the facts of the case did not warrant a transfer of investigation from SEBI.\n\nThe Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, said that reports prepared by third-party organisations such as the Organised Crime and Corruption Reporting Project (OCCRP) and Hindenburg Research cannot be regarded as “conclusive proof”.\n\n9. Manipur violence\n\nA bench headed by CJI Chandrachud took suo moto cognizance of the disturbing viral videos where two tribal women were paraded naked and sexually assaulted in Manipur.\n\nThe Supreme Court had set up a committee comprising three woman judges tasked with collecting information related to violence against women in Manipur as well as monitoring the conditions at relief camps and deciding on compensation to victims.\n\nThe Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, had also appointed former Maharashtra DGP Dattatray Padsalgikar to investigate the allegations that certain police officers colluded with perpetrators of violence, including sexual violence, during the conflict in Manipur.\n\n10. Cases against MPs/MLAs\n\nA bench headed by CJI Chandrachud directed Chief Justices of all High Courts across the country to register suo moto cases to monitor the expeditious disposal of criminal cases pending against MPs and MLAs.\n\nThe Supreme Court said that the special bench to be formed in every High Court will issue continuing directions to curb the criminalisation of politics and may seek assistance from the Advocate General and other officers of the state government.\n\nFurther, it said that the High Court may also call for status reports on the issue from all District and Session Courts under their jurisdiction.\n\nJustice Chandrachud was first appointed as judge of the Bombay High Court on March 29, 2000, and served as Chief Justice of the Allahabad High Court since October 31, 2013, until his elevation as an apex court judge on May 13, 2016.\n\nCJI Chandrachud passed BA with honours in economics from St Stephen’s College, New Delhi and completed LLB from Campus Law Centre, Delhi University. He also served as Additional Solicitor General of India from 1998 till 2000. In June 1998, he was designated as a senior advocate by the Bombay High Court.\n\nAfter CJI Chandrachud recommended the name of Justice Sanjiv Khanna as his successor last month, the Centre has cleared the appointment of Justice Khanna as the 51st CJI with effect from November 11.",
        "summary": "New Delhi, Nov 1 (IANS) After a two-year-long stint as the Chief Justice of India (CJI) D.Y. Chandrachud is due to retire on November 10 on attaining the age of 65 years. During the period, he pronounced several notable judgements. Here are the 10 key judgments authored by him when he was in the highest [&#8230;]",
        "url": "https://bhaskarlive.in/judicial-legacy-10-landmark-verdicts-authored-by-cji-chandrachud/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252998.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:27:17",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.076
    },
    {
        "id": 261916124,
        "title": "Son of South Korean missionary detained in North Korea appeals for international support",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Seoul, Nov 1 (IANS) The son of a South Korean Christian missionary who has remained detained in North Korea for 10 years has appealed for international support to address issues involving detainees while meeting with key human rights figures in Europe, the country&#8217;s unification ministry said on Friday. Choi Jin-young, the son of missionary Choi [&#8230;]",
        "url": "https://bhaskarlive.in/son-of-south-korean-missionary-detained-in-north-korea-appeals-for-international-support/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252992.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:13:11",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    }
]