[
    {
        "id": 261770540,
        "title": "Governors, CMs of Telugu states greet people on Diwali",
        "text": "Hyderabad, Oct 31 (IANS) Governors and Chief Ministers of Telangana and Andhra Pradesh have greeted people on the occasion of Diwali.\n\nTelangana Governor Jishnu Dev Varma conveyed the warmest greetings to people on this joyous occasion of Diwali.\n\n“This festival of lights signifies the victory of righteousness over the evil. I am sure occasions like this inspire us to conquer the evils of modern-day and build a society in which peace, amity, and communal harmony prevail,” he said in his message.\n\nThe Governor appealed to all to buy local products to celebrate this festival to bring “new light into the lives of the indigenous manufacturers in the true spirit of Atmanirbhar Bharat.”\n\n“May this Deepavali usher in new thoughts and promote new ideas to further the brightness, happiness, and prosperity in the lives of the people all around us. I once again extend my warmest greetings to the people of the State and wish them happiness and prosperity,” he added.\n\nChief Minister A. Revanth Reddy also extended greetings to Telangana people on the occasion of Diwali. He said in his message that Telangana state got rid of 10 years of “destructive” rule and the “people’s government” brought light in the lives of all sections of people aiming for all-round development and the welfare of all.\n\nThe Chief Minister wished that people celebrate the festival of lights, a symbol of victory of good over evil, with jubilation. He hoped that every household would be filled with joy and happiness during the festivities.\n\nCM Revanth Reddy appealed to all the young and elderly to celebrate the festival without causing any harm to the environment and take proper precautions to avoid fire accidents.\n\nAndhra Pradesh Governor S. Abdul Nazeer greeted people on the occasion of Diwali. “May the divine lights of Deepavali bring peace, prosperity and happiness to all. Deepavali symbolizes the victory of light over darkness, good over evil and knowledge over ignorance. The lights of Deepavali signify a time to destroy all our dark desires and thoughts, eradicate evils and give us the strength and zeal to help each other,” he said.\n\n“Festivals like these inspire us to build a society filled with peace, amity, brotherhood and communal harmony,” added the Governor.\n\nChief Minister N. Chandrababu Naidu also conveyed Diwali greetings to people.",
        "summary": "Hyderabad, Oct 31 (IANS) Governors and Chief Ministers of Telangana and Andhra Pradesh have greeted people on the occasion of Diwali. Telangana Governor Jishnu Dev Varma conveyed the warmest greetings to people on this joyous occasion of Diwali. &#8220;This festival of lights signifies the victory of righteousness over the evil. I am sure occasions like [&#8230;]",
        "url": "https://bhaskarlive.in/governors-cms-of-telugu-states-greet-people-on-diwali/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410313252482.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 07:32:28",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.397
    },
    {
        "id": 261770544,
        "title": "No reason to celebrate: NC leader on J&K UT Foundation Day",
        "text": "Jammu, Oct 31 (IANS) As the newly-elected Omar Abdullah-led National Conference (NC) government in Jammu and Kashmir promised to boycott the Union Territory (UT) Foundation Day on Thursday, senior party leader Sheikh Bashir Ahmad called it a day of “humiliation” for people of J&K.\n\nAt the same time, Bashir Ahmad also extended Diwali greetings to fellow countrymen and hoped that better days would prevail in the Union territory in 2025.\n\nSpeaking to IANS, the NC leader said: “First of all, I want to extend my greetings to all the people across the country on the pious occasion of Diwali, and I pray that this festival of happiness brings good times in the coming year. The Union Territory Foundation Day is actually a day of humiliation for the people of Jammu and Kashmir.”\n\nSpeaking about NC boycotting the UT Foundation Day, Bashir Ahmad added: “On this day, the people of Jammu and Kashmir were humiliated. There’s no reason to celebrate it; it’s a day for officials and bureaucracy. From this day, the destruction of Jammu and Kashmir began. This day holds no relevance for the people of Jammu and Kashmir. In a democracy, everybody has a right to express their views. The day when J&K became a UT, will be etched in history.”\n\nThe NC leader further said: “The people have given a mandate to a democratically-elected government, and they should let go of this day. Whether in the opposition or ruling party, everyone should come together to solve the people’s issues. Prime Minister Narendra Modi and the Union Home Minister Amit Shah have also spoken about statehood, using the term ‘appropriate’ time, which could mean any moment they deem fit. However, the mandate of the people of Jammu and Kashmir must be respected, and statehood should be restored as soon as possible so that the elected government can function.”\n\nThe first Assembly session is set to be held on November 4, which will be the first session for the UT, and traditionally, it has been said that this will be a session that will last four to five days with question-answer rounds involving the Assembly members, he added.\n\n“It will be a kind of inaugural function held and no business will take place inside the Assembly. The debate will only be held over the Budget session over which question-answer rounds will be held,” the NC leader said.",
        "summary": "Jammu, Oct 31 (IANS) As the newly-elected Omar Abdullah-led National Conference (NC) government in Jammu and Kashmir promised to boycott the Union Territory (UT) Foundation Day on Thursday, senior party leader Sheikh Bashir Ahmad called it a day of &#8220;humiliation&#8221; for people of J&#38;K. At the same time, Bashir Ahmad also extended Diwali greetings to [&#8230;]",
        "url": "https://bhaskarlive.in/no-reason-to-celebrate-nc-leader-on-jk-ut-foundation-day/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410313252463.JPG?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 08:08:04",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.14
    },
    {
        "id": 261770542,
        "title": "VBA chief Prakash Ambedkar rushed to Pune hospital after chest pains, undergoes angiography",
        "text": "Pune, Oct.31 (IANS) Vanchit Bahujan Aghadi (VBA) President Prakash Y. Ambedkar was admitted to a hospital here following intense chest pains, his close aides said on Thursday. \n\nHe was taken to the intensive care unit and underwent an angiography for a suspected blood clot in his heart, but his condition is stable now, said VBA chief spokesperson Siddharth Mokle.\n\n“An angiography has been done and its report is awaited. Thereafter, the medical team will decide on the next course of treatment in consultation with his family members,” Mokle told IANS.\n\nHowever, Ambedkar is likely to remain under medical observation at the hospital for the next three to five days, and the Ambedkar family has requested privacy in the matter.\n\nThis is the second time in barely three years that Ambedkar, 70 – the grandson of the Chief Architect of the Indian Constitution Dr B. R. Ambedkar – has been afflicted by a cardiac-related problem.\n\nIn July 2021, he had undergone emergency heart surgery at a Pune hospital. He was out of action for many weeks after the surgery.\n\nThe latest developments came even as he was busy spearheading the VBA for a big poll fight in the November 20 Maharashtra Assembly elections.\n\nMeanwhile, Mokle said that in his absence, VBA state President Rekha Thakur will be leading the party’s election campaign, along with the Election Coordination Committee and the Media and Research Department.\n\nThe VBA – which failed to open its account in the 2024 Lok Sabha elections for 48 seats in the state – is contesting in a majority of the 288 Assembly constituencies. It has entered into friendly tie-ups with certain groups and smaller parties to give a tough fight to the ruling MahaYuti and opposition Maha Vikas Aghadi alliances.",
        "summary": "Pune, Oct.31 (IANS) Vanchit Bahujan Aghadi (VBA) President Prakash Y. Ambedkar was admitted to a hospital here following intense chest pains, his close aides said on Thursday. He was taken to the intensive care unit and underwent an angiography for a suspected blood clot in his heart, but his condition is stable now, said VBA [&#8230;]",
        "url": "https://bhaskarlive.in/vba-chief-prakash-ambedkar-rushed-to-pune-hospital-after-chest-pains-undergoes-angiography/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202408283213314.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 08:29:02",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.208
    },
    {
        "id": 261770546,
        "title": "BJP’s Waqf protest for political gains in bypolls, Maha elections: K’taka CM",
        "text": "Bengaluru, Oct 31 (IANS) Karnataka Chief Minister Siddaramaiah on Thursday dubbed the statewide protest call given by the BJP on the Waqf land row as politics with an eye on Karnataka bypolls and the Maharashtra Assembly elections.\n\n“The BJP wants to benefit in the bye-elections in the state and also in the Maharashtra Assembly polls by raking up the Waqf issue,” he slammed.\n\nSpeaking to reporters in Bengaluru, CM Siddaramaiah stated, “The BJP has given a call for a protest over the Waqf property row for political reasons. They themselves issued notices to farmers from the Waqf Board during their tenure, so what do they have to say about that? During the BJP’s rule in the state, 200 notices were given to farmers. They should not carry out dual politics.”\n\n“I have already made a statement that all the notices would be withdrawn, so where is the issue? If notices were issued, we have stated that they will be withdrawn and we have also assured that no one will be removed from their land. So, where is the issue?” CM Siddaramaiah questioned.\n\n“It doesn’t matter if notices are issued to farmers by the Waqf Board. Majority of the notices in different districts barring Vijayapura district were issued during the BJP government. Why were they issued? Why are they pursuing this kind of politics?” CM Siddaramaiah asked.\n\n“I have clearly stated that the notices issued during the rule of the Congress government would be withdrawn and assured that no farmer would be vacated. Where is the issue?” CM Siddaramaiah reiterated.\n\n“The BJP is planning a protest on November 4 because of the bye-elections and the Maharashtra Assembly polls. The BJP always carries out dual politics in everything. They won’t tell the truth and only lie,” he maintained.\n\nDwelling on the programme for the upcoming bye-elections the CM said that he would start campaigning from November 4.\n\n“I will take up campaigning for bypolls in the state from November 4 and will be out on the hustings till the last day of campaigning. I will visit three constituencies.\n\n“On the Shiggaon seat, the rebellion has been quelled. Congress leader Sayed Khadri who filed his nomination as an Independent candidate has taken back his nomination papers. Minister Zameer Ahmad Khan is staying back in the constituency and we will win the seat,” he stated.\n\n“We will win Sandur and Channapatna seats as well. Union Minister H.D. Kumaraswamy and BJP always indulge in telling lies,” he stated while answering a question on Union Minister Kumaraswamy’s allegations that Khadri had been kidnapped by Congress leaders.\n\n“I convey Diwali wishes to all people of the state,” CM Siddaramaiah stated.",
        "summary": "Bengaluru, Oct 31 (IANS) Karnataka Chief Minister Siddaramaiah on Thursday dubbed the statewide protest call given by the BJP on the Waqf land row as politics with an eye on Karnataka bypolls and the Maharashtra Assembly elections. “The BJP wants to benefit in the bye-elections in the state and also in the Maharashtra Assembly polls [&#8230;]",
        "url": "https://bhaskarlive.in/bjps-waqf-protest-for-political-gains-in-bypolls-maha-elections-ktaka-cm/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/SIDDARAMAIAH.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 07:58:48",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.539
    },
    {
        "id": 261770550,
        "title": "MahaYuti govt will return in Maha, more Cong leaders to join BJP: Devendra Fadnavis",
        "text": "Mumbai, Oct 31 (IANS) BJP leader and Maharashtra Deputy Chief Minister Devendra Fadnavis began Diwali celebrations by announcing that the MahaYuti government will come back to power in the state and also by inducting a veteran Mumbai Congress leader Ravi Raja into the party fold.\n\nDeputy Chief Minister Fadnavis said that the Maharashtra Chief Minister Eknath Shinde will be elected as Chief Minister after the elections hinting that many top leaders from Congress will join the BJP after Diwali.\n\n“In the next few days, many Congress leaders will join the BJP. Don’t ask me who those Congress leaders are. The MahaYuti alliance (grand coalition) government will come back to power. One can see positivity in favour of the MahaYuti,” he added.\n\nAsked a query over Maharashtra Navnirman Sena (MNS) Chief Raj Thackeray’s statement that the MahaYuti will form the government in the state, Deputy Chief Minister Fadnavis said, “What Raj Thackeray said is a good thing. But today I tell you that the MahaYuti government will come back to power in the state with its Chief Minister.”\n\nThe BJP leader also downplayed Raj Thackeray’s comment that BJP will hold the Chief Minister’s post.\n\nOn rebellion and cross forms filed by the MahaYuti allies in various Assembly constituencies, Deputy CM Fadnavis said, “Filing of nominations was completed on October 30. In some places, we had cross-forms. A meeting was held at Chief Minister Eknath Shinde’s house on Wednesday night in this regard. It was attended by the CM, myself, Deputy CM Ajit Pawar, State BJP Chief Chandrashekhar Bawankule, NCP Working President Praful Patel, and State NCP Chief Sunil Tatkare. We have discussed the issues about rebels and cross-forms extensively and we hope that they will be sorted out soon. It will be reflected in the days to come.”\n\nHe added that BJP rebels will withdraw their nominations before the last date of nominations scheduled for November 4.\n\n“In some places, nominees from MahaYuti allies have filed their nominations against each other. Three parties have also decided an action plan to deal with the issue,” he said.\n\nAccording to Deputy CM Fadnavis, the campaigning will begin on November 4 or 5, while saying that Prime Minister Narendra Modi, Home Minister Amit Shah, Defence Minister Rajnath Singh, Transport and Highways Minister Nitin Gadkari, BJP President JP Nadda and other top Central leaders, including state leaders will address rallies in the state.\n\nHe added that the BJP has already released a list of 40-star campaigners for the ongoing Assembly polls.\n\nOn former BJP MP Gopal Shetty’s decision to file nomination as an independent, BJP leader Fadnavis claimed that he will soon follow the party norms.\n\nOn Shiv Sena legislator Sada Sarvankar’s reluctance to withdraw his nomination in support of MNS nominee Amit Shah from the Mahim constituency, BJP leader Fadnavis said he and Chief Minister Eknath Shinde are of the view that the MahaYuti should support Raj Thackeray’s son Amit Thackeray.\n\nOn NCP candidate Nawab Malik’s nomination from Mankhurd Shivajinagar, the Deputy CM said that the Mumbai BJP chief Ashish Shelar has already declared that the party will not campaign for Nawab Malik, adding that it has been his stance as well.\n\nHowever, he added that the BJP will campaign for the Shiv Sena nominee who is contesting against Nawab Malik.",
        "summary": "Mumbai, Oct 31 (IANS) BJP leader and Maharashtra Deputy Chief Minister Devendra Fadnavis began Diwali celebrations by announcing that the MahaYuti government will come back to power in the state and also by inducting a veteran Mumbai Congress leader Ravi Raja into the party fold. Deputy Chief Minister Fadnavis said that the Maharashtra Chief Minister [&#8230;]",
        "url": "https://bhaskarlive.in/mahayuti-govt-will-return-in-maha-more-cong-leaders-to-join-bjp-devendra-fadnavis/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202409303233763.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 08:25:18",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.075
    },
    {
        "id": 261770548,
        "title": "11 cities in country completed SA studies to assess pollution sources, Centre tells NGT",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "New Delhi, Oct 31 (IANS) In an Action Taken Report (ATR) filed before the National Green Tribunal (NGT), the Union Ministry of Environment, Forest and Climate Change (MOEF&#38;CC) said that 11 cities in the country have completed Source Apportionment Studies (SAS) to assess the contribution of various sources of pollution for prioritising air pollution control [&#8230;]",
        "url": "https://bhaskarlive.in/11-cities-in-country-completed-sa-studies-to-assess-pollution-sources-centre-tells-ngt/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410313252511.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 08:27:04",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261770552,
        "title": "Australia’s temperature surpasses 1.5 C of warming: Report",
        "text": "Canberra, Oct 31 (IANS) Australia’s climate has warmed by an average of 1.51 degrees Celsius (C) since records began in 1910, a landmark report has found.\n\nNational science agencies, the Commonwealth Scientific and Industrial Research Organisation (CSIRO) and the Bureau of Meteorology (BoM), published the latest State of the Climate Report on Thursday, which they have prepared every two years since 2010.\n\nThe 2024 report found that the changing climate has caused an increase in extreme heat events, longer bushfire seasons, more intense heavy rainfall events and sea level rise, reports Xinhua news agency.\n\nIt said that oceans around Australia are continuing to warm and that higher levels of carbon dioxide (CO2) in the atmosphere have led to more acidic oceans, particularly south of Australia.\n\nAccording to the report, Australia’s temperature has warmed by an average of 1.51 C since 1910, exceeding the maximum warming goal of 1.5 C set under the 2016 Paris Agreement, and sea surface temperatures have increased by an average of 1.08 C since 1900.\n\nEight of Australia’s nine warmest years on record have occurred since 2013, including the warmest year on record in 2019. On a global scale, 2023 was the warmest year on record.\n\nJaci Brown, a CSIRO research manager and co-author of the report, said that the highest average sea surface temperatures on record occurred in 2022.\n\n“Increases in temperature have contributed to significant impacts on marine habitats, species and ecosystem health, such as the most recent mass coral bleaching event on the Great Barrier Reef this year,” she said in a statement.\n\n“Rising sea levels around Australia are increasing the risk of inundation and damage to coastal infrastructure and communities,” she said.\n\nThe global mean sea level has risen by 22 centimetres since 1900, the report said, with half of the rise having occurred since 1970.\n\nIn 2023, the global annual mean concentration of CO2 in the atmosphere reached 419.2 parts per million (ppm), and the CO2 equivalent of all greenhouse gases reached 524 ppm, the highest levels on Earth in over 2 million years.\n\nThe report warned that projected global warming and sea level rise through 2040 are already locked in due to greenhouse gases that have already been emitted.\n\nKarl Braganza, climate services manager at the BoM, said that warming that has already occurred has led to an increase in extreme fire weather in Australia and longer fire seasons across large parts of the country.\n\nIn 2019, there were 33 days when Australia’s national average maximum temperature exceeded 39 C, more than in the years between 1960 and 2018 combined.\n\nSince 1970, April to October rainfall in southwest Australia has declined by 16 per cent. In the country’s southeast, April-October rainfall has decreased by nine per cent since 1994.\n\n“The lower rainfall in the cooler months is leading to lower average streamflow in those regions, which can impact soil moisture and water storage levels and increase the risk of drought. Droughts this century have been significantly hotter than those in the past,” Braganza said.\n\n“However, when heavy rainfall events occur, they are becoming more intense, with an increase of around 10 per cent or more in some regions,” Braganza said.\n\nThe highest rate of ocean warming in Australia has occurred in the Coral Sea, home to the iconic Great Barrier Reef, and off the coasts of the southeast Australian mainland and the southern island state of Tasmania.",
        "summary": "Canberra, Oct 31 (IANS) Australia&#8217;s climate has warmed by an average of 1.51 degrees Celsius (C) since records began in 1910, a landmark report has found. National science agencies, the Commonwealth Scientific and Industrial Research Organisation (CSIRO) and the Bureau of Meteorology (BoM), published the latest State of the Climate Report on Thursday, which they [&#8230;]",
        "url": "https://bhaskarlive.in/australias-temperature-surpasses-1-5-c-of-warming-report/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410313252481.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 07:31:11",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.114
    },
    {
        "id": 261763066,
        "title": "Shah Rukh Khan reveals Yash Chopra’s special connection with Diwali",
        "text": "Mumbai: Diwali, the festival of lights, has long been synonymous with the release of blockbuster films in Bollywood.\r\n\r\nWhile the trend of films clashing on this auspicious occasion has become commonplace in recent years, it is the late filmmaker Yash Chopra who is often credited with establishing this festive cinematic tradition. Yash Chopra, who has many hit movies to his credit. had a unique connection with Diwali. Chopra’s affection for Diwali was reflected in his choice of release dates, with several of his most beloved films debuting during the festival of lights.\r\n\r\nHis iconic movies, such as “Dilwale Dulhania Le Jayenge”, “Dil To Pagal Hai”, “Veer-Zaara” and “Jab Tak Hai Jaan” all hit the screens during Diwali, setting a precedent for filmmakers to follow. Interestingly, Shah Rukh Khan once shared his thoughts on Yash Chopra’s profound connection with Diwali. He revealed that Chopra intentionally chose to release his films during the festival, believing that doing so would bring joy and happiness to the audience.\r\n\r\nSRK said, “I have worked with Yash ji for 20 years. One thing that was always common was he wanted people to be happy after watching his movies and that’s why he chose Diwali or may be Diwali chose him when all his films came out.” It goes without saying that success of Yash Chopra’s films during this period paved the way for other filmmakers to view Diwali as an ideal window for releasing their projects.\r\n\r\nThis year, Rohit Shetty’s highly-awaited cop drama “Singham Again” and T-Series’ horror-comedy “Bhool Bhulaiyaa 3” will clash at the box-office on Diwali. “Singham Again” stars Ajay Devgn, Kareena Kapoor Khan, Ranveer Singh, Akshay Kumar, Deepika Padukone, Arjun Kapoor, Tiger Shroff, and Jackie Shroff. On the other hand, “Bhool Bhulaiyaa 3”, co-written and directed by Anees Bazmee, stars Kartik Aaryan, Vidya Balan, Triptii Dimri, Madhuri Dixit, Vijay Raaz, Rajpal Yadav, and Sanjay Mishra. Both movies will lock horns on November 1.",
        "summary": "His iconic movies, such as “Dilwale Dulhania Le Jayenge”, “Dil To Pagal Hai”, “Veer-Zaara” and “Jab Tak Hai Jaan” all hit the screens during Diwali, setting a precedent for filmmakers to follow",
        "url": "https://telanganatoday.com/shah-rukh-khan-reveals-yash-chopras-special-connection-with-diwali",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/09/When-Shah-Rukh-Khan-revealed-his-most-cringe-worthy-‘Kuch-Kuch-Hota-Hai-experience.jpg",
        "video": null,
        "publish_date": "2024-10-31 07:25:41",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.154
    },
    {
        "id": 261768328,
        "title": "Bhumi Pednekar: Last 10 years have just been nothing short of a dream",
        "text": "Mumbai: It has been almost a decade for Bhumi Pednekar, who stepped into Bollywood with the film “Dum Laga Ke Haisha”, and the actress says she is truly living her dream.\r\n\r\nAfter “Dum Laga Ke Haisha”, Bhumi was seen in movies such as “Toilet: Ek Prem Katha”, “Shubh Mangal Saavdhan”, “Sonchiriya”, “Saand Ki Aankh”, “Dolly Kitty Aur Woh Chamakte Sitare”, “Badhaai Do”, “Bheed” and “Afwah” to name a few.\r\n\r\nTalking about her journey in Hindi cinema, the actress, who was seen walking the runway in Lakme Fashion Week, earlier this month, told IANS: “The last 10 years have just been nothing short of a dream. I'm truly living my dream. This is all I ever wanted since I was a child and every day I wake up thanking God for letting me be a part of this phenomenal industry.”\r\n\r\nBhumi said that she has been lucky to work with the kind of filmmakers she has collaborated with. “I have been fortunate to have had some phenomenal filmmakers that have always supported me, some outstanding characters and I really hope that the next decade is full of such parts as well. Leaving impact with my cinema is a part of my purpose and I really hope that never goes.”\r\n\r\nEarlier the actress had shared that she wants to do a period film around the freedom struggle. In a conversation with IANS, Bhumi spoke about branching out to genres she has never tried her into – action and a period film. “I think what I would really want to do is maybe an action film, maybe do a film around the freedom struggle,” Bhumi said.\r\n\r\nShe added: “I'm constantly putting this out there in the universe that I want to do a film, a period film around the freedom struggle.” On the acting front, Bhumi was last seen in the crime thriller “Bhakshak”, which was based on the Muzaffarpur shelter case. The film also had Sanjay Mishra, Aditya Srivastava and Sai Tamhankar.",
        "summary": "After “Dum Laga Ke Haisha”, Bhumi was seen in movies such as “Toilet: Ek Prem Katha”, “Shubh Mangal Saavdhan”, “Sonchiriya”, “Saand Ki Aankh”, “Dolly Kitty Aur Woh Chamakte Sitare”, “Badhaai Do”, “Bheed” and “Afwah” to name a few.",
        "url": "https://telanganatoday.com/bhumi-pednekar-last-10-years-have-just-been-nothing-short-of-a-dream",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/02/Bhumi-Pednekar-eyes-Hollywood-after-Bhakshak-success.jpg",
        "video": null,
        "publish_date": "2024-10-31 07:51:59",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "entertainment",
        "source_country": "in",
        "sentiment": -0.055
    },
    {
        "id": 260224252,
        "title": "YS Sharmila Reddy takes dig at Chandrababu Naidu government, asks when will it implement free travel for women",
        "text": "Andhra Pradesh Congress chief YS Sharmila Reddy on Friday travelled on Road Transport Bus and took a dig at Andhra Pradesh Chief Minister N Chandrababu Naidu, saying “women across the state are asking when the free bus travel will be implemented”.The Telugu Desam Party (TDP) and Jana Sena Party in their manifesto for Andhra Pradesh elections earlier this year had promised free bus travel for women. YS Sharmila Reddy took a ticket and travelled on a ‘Pallevelugu’ RTC bus from Vijayawada Bus Stand to Tenali on Friday as part of her outreach efforts.This initiative aims to connect with the public and engage directly with constituents in the region.She has written a postcard to Chandrababu Naidu, demanding the immediate implementation of the poll promise of TDP. The state Congress chief said Chandrababu Naidu has been in power for four months, yet no decision has been made on free bus travel for women.“Women across the state are asking when the free bus travel will be implemented. In Telangana, the scheme was implemented within a week. Why is the delay in Andhra Pradesh? Is it because the government fears they’ll need to fund RTC (Road Transport Corporation)?”She said that around two million women travel daily in the state.“The RTC earns Rs 7 crore daily through these women. Are you afraid of compensating RTC with these Rs 300 crore if free travel is granted? You took votes from women and promised this benefit. Now, can’t you spend Rs 300 crore for them? Four out of your six key promises were for women, and free bus travel is the least expensive among them. If such a low-cost scheme cannot be implemented, how will larger promises be fulfilled? Will you delay for the next five years?” she asked.The Congress leader said that free bus travel ensures the safety of women, and many women would depend on buses if this scheme is implemented. “This is a very beneficial scheme, and we are demanding that Chandrababu Naidu immediately implement it. Similarly, other schemes promised to women must also be implemented without delay. Provide free gas cylinders to women as promised. Prices of essential commodities have already increased, adding to the burden on women. Women need support and assurance and steps must be taken to improve their safety,” she said.“The government has reduced alcohol prices which could lead to an increase in crimes against women. We are sending a letter to the Chief Minister, demanding free bus travel for women. In the coming days, we will send thousands of postcards. We hope this will prompt Chandrababu Naidu to immediately implement free bus travel for women,” she added",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/ys-sharmila-reddy-takes-dig-at-chandrababu-naidu-government-asks-when-will-it-implement-free-travel-for-women/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-18 15:53:54",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.036
    },
    {
        "id": 260224254,
        "title": "Takes away their choice of partner; violates their rights: SC urges Parliament to outlaw child betrothals",
        "text": "The Supreme Court on Friday, while stating that marriages fixed in the minority of a child have the effect of violating their rights to free choice, said that Parliament may consider outlawing child betrothals, which may be used to evade penalty under the Prohibition of Child Marriage Act (PCMA), 2006.A bench of Chief Justice of India DY Chandrachud and Justices JB Pardiwala and Manoj Misra said child betrothal takes away from them their choice of partner and life paths before they mature and form the ability to assert their agency.“We note that while the PCMA seeks to prohibit child marriages, it does not stipulate on betrothals. Marriages fixed in the minority of a child also have the effect of violating their rights to free choice, autonomy, agency and childhood. It takes away from them their choice of partner and life paths before they mature and form the ability to assert their agency. Parliament may consider outlawing child betrothals, which may be used to evade penalty under the PCMA. While a betrothed child may be protected as a child in need of care and protection under the Juvenile Justice Act, the practice also requires targeted remedies for its elimination,” the apex court said.Delivering a judgement on a PIL alleging a rise in child marriages in the country, the apex court issued a slew of guidelines for achieving the elimination of child marriage while bearing in mind the delicate socio-economic interplay.The judgement came on a PIL by the Society for Enlightenment and Voluntary Action, saying that despite the enactment of the Prohibition of Child Marriage Act 2006, the rate of child marriages in India is alarming and highlighted the failure of authorities to prevent child marriages.The top court in its verdict emphasised the need for more comprehensive approaches and community-driven strategies to ensure the complete eradication of child marriages.The PCMA as social legislation will only succeed through the collective efforts of all stakeholders to address the issue within a broader social framework that emphasises the need for multi-sectoral coordination, the verdict stated.“This necessitates the enhancement of reporting mechanisms, expansion of public awareness campaigns, and investment in the training and capacity-building of law enforcement officers and related actors. It is also crucial to regularly monitor the implementation of the Act, conduct evaluations to identify gaps, and establish feedback mechanisms to continually refine and improve responses to child marriage,” it added.The apex court said that it framed the guidelines for the effective and useful implementation of the PCMA and the orientation of these guidelines is to prioritise prevention before protection and protection before penalisation.It said the focus of penalisation reflects on a harm-based approach, which has been proven ineffective and the guidelines issued by the top court are on awareness campaigns, funding campaigns, community involvement, education, social support, etc.“We are cognizant of the impact that criminalisation has on families and communities. To ensure effective use of penal provisions in the PCMA, there must be widespread awareness and education about child marriage and the legal consequences of its commission. We must not be understood to discourage prosecution of those who commit illegal acts. However, the aim of the law enforcement machinery must not be solely focused on increasing prosecutions without making the best efforts to prevent and prohibit child marriage. The focus on penalisation reflects a harm-based approach that waits for harm to occur before taking any steps. This approach has proven to be ineffective at bringing about social change,” it added.The 141-page judgement said that addressing child marriage requires an intersectional approach that acknowledges the overlapping vulnerabilities experienced by children, especially girls from marginalised communities.“Intersectionality involves considering factors like gender, caste, socioeconomic status, and geography, which often increase the risks of early marriage. Preventive strategies should therefore be tailored to the unique needs of various communities and focus on addressing the root causes of child marriage, such as poverty, gender inequality, lack of education, and entrenched cultural practices,” it stated.It further said that state governments also must monitor and enforce compliance with these laws and work closely with civil society organisations to implement effective interventions.The top court further said that the state’s role is not limited to merely punishing offenders but extends to creating an enabling environment where children can exercise their rights freely.“This includes the responsibility to not only to legislate against child marriage but also to address the underlying socio-economic factors–poverty, lack of education, and gender discrimination–that perpetuate this practice,” added the verdict.It further stressed that the right to childhood belongs to all sexes. “Education–primary, sexual and life-enhancing–is integral to the right to childhood. Realisation of this right is crucial in dealing with the evils of child marriage,” stated the judgement",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/takes-away-their-choice-of-partner-violates-their-rights-sc-urges-parliament-to-outlaw-child-betrothals/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/takes-away-their-choice-of-partner-violates-their-rights-sc-urges-parliament-to-outlaw-child-betrothals.jpg",
        "video": null,
        "publish_date": "2024-10-18 16:34:37",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.173
    },
    {
        "id": 260224258,
        "title": "Spike in rabies and dengue cases exposes broken healthcare system in PoGB",
        "text": "The government in Pakistan-occupied Gilgit-Baltistan (PoGB) has consistently overlooked the pressing issues and concerns of its residents, as reported by Pamir Times. Currently, the population is grappling with alarming problems, including dire health and sanitation conditions. As a result, many lives have been lost to diseases like rabies and dengue, highlighting the ineffectiveness of the administration, according to Pamir Times.The healthcare situation in PoGB is increasingly concerning, characterized by inadequate infrastructure, a shortage of medical staff, and severe water scarcity. Despite repeated calls for improvements, the Pakistani government has continually ignored these problems, leaving people to suffer or, in the worst cases, die, Pamir Times reported.The recent spike in cases of rabies and deliberate dog attacks on locals have further underscored the incompetence of the Pakistani administration, resulting in tragic losses of life.In response to these concerns, a Medical Superintendent told Pamir Times, “The cases of dog bites are on the rise in PoGB, and several deaths have already been reported. Rabies infection, if untreated, can also be fatal. I urge pet owners to vaccinate their animals and keep them from roaming freely. Additionally, I request parents to keep their children at home, as there is a risk of attacks if they go outside, which could potentially lead to rabies.”The rising cases of rabies and dengue fever in PoGB present a significant challenge. The deprivation of basic necessities such as clean drinking water and proper sanitation, coupled with poor healthcare services, a lack of essential supplies, and the absence of modern medical equipment, has not only led to inadequate treatment but has also worsened the situation for the local population without substantial improvements in healthcare and environmental management, the ongoing health crisis in PoGB is likely to escalate further.Imtiaz Ahmed, a doctor in Chilas, told Pamir Times, “I have been working in the hospital for the past four years. There has been an outbreak of dengue, particularly in Khyber Pakhtunkhwa and Gilgit-Baltistan, with cases increasing rapidly. In our hospital alone, more than a hundred cases have been reported in just the span of two to three weeks.”The local administration’s failure to address rising health concerns and provide basic necessities in PoGB exposes both corruption and ineptitude. Their inaction on critical issues such as healthcare, clean water, and sanitation has left the population vulnerable to serious diseases like rabies and dengue.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/spike-in-rabies-and-dengue-cases-exposes-broken-healthcare-system-in-pogb/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/spike-in-rabies-and-dengue-cases-exposes-broken-healthcare-system-in-pogb.jpg",
        "video": null,
        "publish_date": "2024-10-18 16:33:54",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.596
    },
    {
        "id": 260224256,
        "title": "UP bypolls: “Will fight together with Pallavi Patel’s Apna Dal-Kamerawadi”, says Asaduddin Owaisi",
        "text": "All India Majlis-e-Ittehadul Muslimeen (AIMIM) president Asaduddin Owaisi on Friday said that the party will contest Uttar Pradesh by-polls with Apna Dal-Kamerawadi. “We will contest these elections together with our sister Dr Pallavi Patel (Apna Dal, Kamerawadi). Our Uttar Pradesh Chief has told me that we will contest on two seats. And the remaining seats would be decided by Pallavi Patel… We will contest this bye-election together,” Owaisi said. There are 10 vacant assembly seats in Uttar Pradesh but bypolls were announced for nine seats. Kumar said the election was not announced for the Milkipur seat in Ayodhya as the election petition is pending.The largest number of bypolls will be held in Uttar Pradesh and seats going to the polls are Meerapur, Kundarki, Ghaziabad, Khair, Karhal, Phulpur, Katehari, Majhawan, and Sishamau.Ahead of Maharashtra and Jharkhand assembly polls, AIMIM Chief Owaisi said that his party has sent Aadil Hasan and Riyaz Ul Hassan Effendi (to Jharkhand). “Our party has sent Aadil Hasan and Riyaz Ul Hassan Effendi (to Jharkhand). They will go there and see what we should do and how many seats we should contest or not. Akhtarul Iman will see if we should contest the Bihar bye-election or not… For Maharashtra, we have declared 5 candidates… We already have 2 MLAs in Maharashtra. We will try to increase the no. of our MLAs. We hope that the Shinde-Fadnavis government does not get the mandate… We think that every community should have a political voice,” Owaisi said.Assembly elections in Maharashtra will be held in a single phase on November 20 and Jharkhand elections will be held in two phases on November 13 and November 20. Votes will be counted in the two states on November 23",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/up-bypolls-will-fight-together-with-pallavi-patels-apna-dal-kamerawadi-says-asaduddin-owaisi/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-18 15:57:31",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.685
    },
    {
        "id": 260224260,
        "title": "“It’s important to take chances”: Ben Stokes reflects on England’s missed opportunities in loss to Pakistan",
        "text": "England captain Ben Stokes expressed his thoughts on the team’s approach and the missed opportunities in their loss to Pakistan by 152 runs in the second Test in Multan. Speaking after the match, Stokes defended his team’s strategy and highlighted the challenges posed in the game.When asked if England could have changed their approach slightly, Stokes responded firmly, “No, not at all. If you look throughout the Test match, the guys who had success from our side and Pakistan’s side were the ones who put the spin bowlers under pressure. Ben Duckett’s first innings hundred showed us the way. The sweep shots made it very difficult to control the run-rate and set fields to. When you get extreme conditions like that, you got to find a way to negate that spin which we managed to do in some good parts, but we’d have liked to go on, especially myself and a couple of guys who got starts.”Reflecting on the missed chances, particularly dropping Agha Salman twice, Stokes emphasized the importance of taking opportunities, “I don’t like to live by hindsight. It just proves how important taking the chances are out here. You don’t get them very often behind the wickets. You take those chances, the game might look a little different.”Stokes also praised the efforts of his seamers, Matthew Potts and Brydon Carse, who toiled tirelessly in tough conditions, “In conditions like these, spinners will get spoken about a lot. Matthew Potts and Brydon Carse kept charging in spell after spell, ball after ball and created so much atmosphere when the spinners needed a break. That’s what you want. There’s a lot that we look in terms of attitude, they both certainly showed that. They constantly felt that they were a big threat which massively helps.”Acknowledging the physical demands of the match, Stokes noted, “Good to get through this game, worked hard to get fit for this game. Nothing can prepare you for standing in the field for as long as we did and in this heat. Looking forward to the next week now. It’s been a great series so far.”Coming to the match, Pakistan kept a tight leash on the match after staging a comeback as they brought about a mid-order collapse for the visitors in the first innings.The resounding victory came after Pakistan lost the first Test match by an innings.England faltered in their final innings, managing only 144 runs chasing a target of 297.England resumed Day 4 with a score of 36/2, but their innings quickly unravelled. Sajid Khan struck early, dismissing Ollie Pope for 22, setting the tone for the day. The in-form Joe Root soon followed, falling to Noman Ali for 18, leaving England struggling at 55/4.Harry Brook, who previously scored a triple century on this ground in the first Test, could only muster 16 runs before being dismissed by Noman Ali. Jamie Smith was trapped for 6, marking Noman’s fourth wicket of the innings.Captain Ben Stokes attempted a counter-attack, scoring a resilient 37, but his departure at 125/7 marked the beginning of the end for England. Brydon Carse (27), Jack Leach (1), and Shoaib Bashir (0) were quickly sent back to the pavilion, all falling to Noman Ali’s masterful bowling.Noman Ali delivered a career-best performance in the Multan Cricket Stadium, claiming 8/46 in the second innings. His remarkable effort brought his match total to 11 wickets for 147 runs, showcasing his dominance.Sajid Khan, who took 7 wickets in England’s first innings, added 2 more in the second. His pivotal role in dismantling the English batting lineup earned him the Player of the Match award.This is Pakistan’s first victory at home since February 2021.The team last won a test match at home in Rawalpindi as they defeated South Africa. Pakistan have played 11 Tests on their home soil since February 2021 and four of them have resulted in a draw while they have lost eight matches.Pakistan and England will clash in the third and final Test at Rawalpindi from October 24. (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/its-important-to-take-chances-ben-stokes-reflects-on-englands-missed-opportunities-in-loss-to-pakistan/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/its-important-to-take-chances-ben-stokes-reflects-on-englands-missed-opportunities-in-loss-to-pakistan.jpg",
        "video": null,
        "publish_date": "2024-10-18 16:33:27",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.087
    },
    {
        "id": 260224262,
        "title": "“Implementation of sub-classification for reservation is conspiracy to divide Dalits”: BSP chief Mayawati",
        "text": "Bahujan Samaj Party (BSP) chief Mayawati Friday criticised the Haryana BJP government’s decision to implement the sub-classification of Scheduled Castes (SC) for reservation, calling it a “conspiracy to divide Dalits once again”.“The decision of the new BJP government of Haryana to implement classification in reservation for SC community i.e. to implement a new system of quota within the reservation quota is a conspiracy to divide Dalits again and keep them fighting among themselves. This is not only an anti-Dalit decision but also a blatant anti-reservation decision,” Mayawati posted on X. She further said that central BJP leadership’s failure to intervene against this decision demonstrates that “like the Congress”, they are engaged in a conspiracy to render reservations “The fact that the central leadership of BJP did not come forward to stop the Haryana government from doing this proves that like the Congress, the BJP is also engaged in a conspiracy to first make the reservation inactive and ineffective and ultimately abolish it, which is completely unfair and the BSP is strongly opposed to it,” she added. The BSP chief further underlined the BSP’s commitment to combating the “divide and rule” tactics employed by “casteist parties”. “In reality, BSP is the name of the struggle against the divide and rule policy of casteist parties in SC-ST and OBC society and their anti-reservation conspiracy etc. Our struggle to organize and unite these classes and make them the ruling class will continue,” she said. This comes after Haryana Chief Minister Nayab Singh Saini said the state will also implement the Supreme Court’s decision empowering states to make sub-classifications within the Scheduled Castes for granting reservation “today itself”",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/implementation-of-sub-classification-for-reservation-is-conspiracy-to-divide-dalits-bsp-chief-mayawati/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/implementation-of-sub-classification-for-reservation-is-conspiracy-to-divide-dalits-bsp-chief-mayawati.jpg",
        "video": null,
        "publish_date": "2024-10-18 15:56:50",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.092
    },
    {
        "id": 260224266,
        "title": "Paddy procurement issue discussed in first cabinet meeting in Haryana, informs Anil Vij",
        "text": "After the first meeting of the Haryana cabinet, BJP senior leader Anil Vij on Friday informed that crucial issues such as the paddy procurement and availability of DAP fertilizer were discussed in the meeting.Vij emphasized that the state government is working to ensure that all farmers receive the necessary amount of DAP fertilizer as per their requirements.“Today, in the first meeting of the Haryana Cabinet, the purchase of paddy was discussed. DAP fertilizer was discussed so that everyone gets DAP as per their requirement”\n\nAccording to the official website of the Haryana government, HAFED (Haryana State Co-operative Supply and Marketing Federation Limited), in the year 2024-25, 35.37 lakh metric tonnes of wheat has been procured by the Hafed while the total quantity of 70.80 LMT has been procured in the state.In the year 2022-23, HAFED through its network has sold 0.79 Lakh MTs.\n\nOn BJP’s victory for the third consecutive time in the Haryana polls, Vij stated that the party faced pro-incumbency for its developmental works in the state. \n\n“Before today, the governments kept changing by facing anti-incumbency. BJP has registred a hattrick victory. This is the first time Our opponents, who used to sleep every night as self-proclaimed Chief Ministers, used to jump several feet saying that there was anti-incumbency. Where was the anti-incumbency?… We had pro-incumbency. The people have voted for the positive work done in the state. People felt that ours is a working government,” Vij said. Haryana Minister Shruti Choudhry also spoke on the cabinet’s focus on farmers during the meeting, assuring that there would be no obstacles in the procurement of paddy and that the state was working to prevent any shortages in DAP fertilizer. “Today in the cabinet meeting, there was a discussion about farmers that there should be no problem in paddy procurement. There was a discussion that farmers should not face any problems regarding DAP fertilizer… Just yesterday, 24,000 youth got jobs. How government has worked for the state has shown up in the results,” Choudhry said. \n\nMeanwhile, Haryana Minister Ranbir Gangwa echoed the government’s commitment to fulfilling promises made to the people. “We have started working on the promises made to the people of the state. The purchase of paddy and millet from farmers was discussed in the cabinet meeting today. DAP and urea fertilizer were also discussed. We have said that we will provide jobs to 2 lakh youths, just yesterday more than 24,000 youths got jobs. This will continue in the future as well,” Gangwa said.\n\nMeanwhile, Bharatiya Janata Party’s (BJP) Nayab Singh Saini on Friday took charge as the Chief Minister of Haryana at the Haryana Civil Secretariat in Chandigarh.\n\n“Taking a vow to tirelessly serve his 2.80 crore family members of Haryana state, he has assumed charge as the Chief Servant of the state. I am emotional and bowed down. The resolve of Sabka Sath, Sabka Vikas and Sabka Vishwas is paramount. We will leave no stone unturned in making Haryana the best, prosperous and self-reliant state. Under the leadership and guidance of Prime Minister Shri @narendramodi ji, our full majority government will be dedicated to service, good governance, equality, prosperity and welfare of the poor,” Haryana CM wrote on X.\n\n“We had promised in the manifesto that we would provide free treatment to kidney patients. We have signed the file regarding that… The Haryana government will bear the expense of kidney dialysis… I thank the people of Haryana for giving a huge mandate for the third time and approving PM Modi’s policies… The people of Haryana destroyed the Opposition’s narrative… Congress tried to instigate the farmers… They created a doubt amongst the youth… They used the athletes of Haryana. Athletes are the pride of our country… PM Modi has taken historic steps for the farmers in the last 10 years… The people of Haryana have approved PM Modi’s policies and destroyed the narrative of the Congress,” the CM said in his first cabinet briefing",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/paddy-procurement-issue-discussed-in-first-cabinet-meeting-in-haryana-informs-anil-vij/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/paddy-procurement-issue-discussed-in-first-cabinet-meeting-in-haryana-informs-anil-vij.jpg",
        "video": null,
        "publish_date": "2024-10-18 16:28:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.128
    }
]