[
    {
        "id": 265022470,
        "title": "TNCC nominates leaders to represent party before finance panel",
        "text": "The chairman of the State Minorities Commission and former Rajya Sabha member, Peter Alphonse, and Anand Srinivasan will represent the Tamil Nadu Congress before the 16th Finance Commission when its committee visits the State. \n\nMeanwhile, the Tamil Nadu Congress Committee, led by its president K. Selvaperunthagai, celebrated the 150th birth anniversary of freedom fighter and tribal leader Birsa Munda at Sathyamurthy Bhavan on Friday by paying floral tributes to his portrait. The celebrations were organised by the party’s Scheduled Tribe wing.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/tamil-nadu/tncc-nominates-leaders-to-represent-party-before-finance-panel/article68872131.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 13:48:47",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.96
    },
    {
        "id": 265022474,
        "title": "KTR behind Lagacharla incident: Congress",
        "text": "Congress has increased its attack on BRS working president K.T. Rama Rao by squarely blaming him for the Lagacharla village incident, where the Vikarabad Collector and other officials were attacked recently.\n\nWhile addressing the media on Friday, Tourism Corporation Chairman Patel Ramesh Reddy, Roads Development Corporation Chairman Malreddy Ramreddy and MBC Corporation Chairman Jaipal alleged that it was part of “KTR’s plan to destabilise the government”.\n\nThey said people were fed up with the ‘hate politics’ being spread by KTR and were wondering why the BRS has stooped to such low-level politics. While the Chief Minister is focussing on providing jobs to youngsters, Mr. Rama Rao’s only job seems to be to defame the government at any cost and stall development.\n\nMr. Patel Ramesh Reddy reminded how violent acquisition of land for various projects during the BRS rule was. In both cases, BRS was behind the attacks, he said.\n\nMr. Ramreddy said that Telangana has never witnessed such attacks on officials. Congress fought democratically despite the BRS government clamping down on protests. He argued that BRS leaders were worried about their scams being unearthed and huge debts they had left behind, being exposed. BRS government sold land and looted the State, he alleged.\n\nMr. Jaipal said that the concern being shown by BRS on land acquisition was fake and wondered whether they had any answer for the lakhs of acres that were fraudulently snatched away from farmers using the Dharani portal. Congress is only concerned about bringing industries to the State and not loot land, like the BRS, he said.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/telangana/ktr-behind-lagacharla-incident-congress/article68872002.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 13:50:41",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.658
    },
    {
        "id": 265022478,
        "title": "Light Rail Transit between Hubballi and Dharwad being considered: Santosh Lad",
        "text": "Labour Minister and district in-charge for Dharwad Santosh Lad has said that the proposal on introducing Light Rail Transit (LRT) between Hubballi and Dharwad in place of the Bus Rapid Transit System (BRTS) was being contemplated and further steps would be taken after discussion with officials.\n\nSpeaking to presspersons in Hubballi on Friday, Mr. Lad said that a clear picture on LRT would emerge after a month after the pros and cons of the project were discussed threadbare. He said that he had held discussions on the quality of the works completed under Smart City Scheme and handing over the same to the municipal corporation and another meeting would be held next month.\n\nMr. Lad said that efforts were required to encourage patients to get treated at ESI Hospitals by providing advanced treatment. There were around 40 lakh ESI beneficiaries and there was need for hi-tech medical equipment and quality treatment at ESI hospitals. A plea for additional grants had been submitted to the Union government, he said.\n\nMr. Lad expressed confidence that guarantee schemes would help the ruling party win the bypolls in the State. The BJP, which had expertise in Operation Lotus had been trying hard for the last 16 months to topple the government but had failed, he said.\n\nTaking a dig at the BJP, he sought to know where were the 100 smart cities that BJP had promised. The roads laid and airports built during BJP regime had suffered damages within no time. Buildings built by the BJP governments were collapsing in 10-11 years. Prime Minister Narendra Modi should answer the public on these issues, he said.\n\nTaking exception to Union Minister Pralhad Joshi’s comment on Justice John Michael D’Cunha, he sought to know whether someone could make such disparaging remarks against judges and judiciary.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/karnataka/light-rail-transit-between-hubballi-and-dharwad-being-considered-santosh-lad/article68872286.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 13:52:44",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.33
    },
    {
        "id": 265022476,
        "title": "Vaiko expresses shock over Sri Lankan election results",
        "text": "Expressing shock over the election results in neighbouring Sri Lanka, MDMK founder Vaiko on Friday called for the unity of the Tamils in India and the diaspora to ensure the safety of Tamils in the neighbouring Island. \n\n“The Government of India should not betray the Tamils in Sri Lanka. There has not been a solution for the Tamils issue in Sri Lanka,” Mr. Vaiko said in a statement. He also charged that the Sri Lankan president Anura Kumara Dissanayake was against the Tamils. Though Rajapaksa government was responsible for the genocide against Tamils, Mr. Dissanayake has been consistently raising his voice against Tamils, he said. The National People’s Power was only another version of the Janatha Vimukthi Peramuna, he added.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/tamil-nadu/vaiko-expresses-shock-over-sri-lankan-election-results/article68872432.ece",
        "image": "https://th-i.thgim.com/public/incoming/pr8r66/article68872628.ece/alternates/LANDSCAPE_1200/IMG_VAIKO_MDMK_SECRETARY_2_1_C8BU7H2S.jpg",
        "video": null,
        "publish_date": "2024-11-15 13:50:56",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -1.0
    },
    {
        "id": 265026688,
        "title": "Central government is prioritising tribal welfare, says Srikakulam Collector",
        "text": "Srikakulam Collector Swapnil Dinkar Pundkar on Friday said that the Union Government is currently focusing on the welfare and development of tribal people with its innovative schemes including the Pradhan Mantri Janjatiya Unnat Gram Abhiyan and others.\n\nAlong with Sithampet Integrated Tribal Development Agency (ITDA) project director Yashwant Kumar Reddy, Mr. Pundkar participated in the Jana Jatiya Gowrava Diwas programme organised at Ekalavya School in Meliyaputti, on the occasion of the birth anniversary of tribal leader Birsa Munda. The Collector said that the government was providing marketing resources for tribal products to enable tribal people to generate income.\n\nMr. Yeshwant said that the ITDA was prioritising the supply of safe drinking water by arranging RO water plants in remote areas. He said that ₹1.3 crore funds were sanctioned for the construction of compound wall for Ekalavya School. He added that the government was releasing funds for the improvement of roads and health facilities in remote areas.",
        "summary": "Swapnil Dinkar Pundkar says the government is providing marketing resources for tribal products, releasing funds for improvement of roads and health facilities in remote areas",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/central-government-is-prioritising-tribal-welfare-says-srikakulam-collector/article68872196.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 14:09:49",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.176
    },
    {
        "id": 265026692,
        "title": "Sringeri seer to visit Vijayawada on November 17",
        "text": "The newly renovated Sharada Sadanam and other religious buildings at the Sivarama Krishna Kshetram will be inaugurated by Vidhushekhara Bharati Mahasawamiji, the successor of the Sringeri Peetham (Karnataka) during his visit to the city. He is scheduled to visit Vijayawada from November 17 to 20. \n\nSivarama Krishna Kshetram’s Dharmadhikari Sishtla Hanumat Prasad said that the swamiji, as part of his ‘Vijaya Yatra’ will stay at the Sivarama Krishna Kshetram for four days starting from November 17. After conducting special prayers for the ‘Sharada Chandramouleeswara’ deities, he will address the devotees. \n\nOn November 18, he will visit the Paduka Kshetram and Maruthi Vyayasa Shala in Satyanarayanapuram, and in the evening, participate in the ‘Kumbhabhishekam’ ceremony at the Shiva temple in Yanamalakuduru. At 7 p.m., Chief Minister Nara Chandrababu Naidu will meet the swamiji, he said.\n\nOn November 19, special prayers will be held at the Durga Malleswara Swami Temple, and on November 20, swamiji will participate in the Kumbhabhishekam of the temple complex at Sivarama Krishna Kshetram. After the ceremonies, he will proceed to Narasaraopet, he added.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/sringeri-seer-to-visit-vijayawada-on-november-17/article68872462.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 14:05:53",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.143
    },
    {
        "id": 265026690,
        "title": "Shivamogga police book case against Eshwarappa over his ‘provocative’ statements",
        "text": "Jayanagar Police in Shivamogga have booked a case against former Minister K.S. Eshwarappa on charges of promoting enmity between groups and deliberate attempts to outrage religious feelings.\n\nSidde Gowda H.M., police officer, filed the complaint on Thursday, following media reports of his press conference in Shivamogga held the previous day, Wednesday. Mr. Eshwarappa, in his press conference, alleged that Congress government in the State had been silent even after repeated incidents of waqf properties and a Muslim leader’s statement over B.R. Ambedkar, architect of the Indian Constitution.\n\nFurther referring to the demand for reservations for Muslims in contracts, he wanted to know if the Congress wanted to make Hindustan into Pakistan. He also stated that there would be a rebellion under the leadership of religious leaders, and people would look for Congress leaders to murder.\n\nHis statements went viral on social media platforms. The police registered the case considering his statement was provocative under Sections 196 and 299 of the Bharatiya Nyaya Sanhita, 2023.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/karnataka/shivamogga-police-book-case-against-eshwarappa-over-his-provocative-statements/article68872124.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 14:11:02",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.559
    },
    {
        "id": 265026696,
        "title": "36,000 public EV charging guns would be required by 2030 to meet growing EV demand: Study",
        "text": "A study conducted by the Center for Study of Science, Technology, and Policy (CSTEP), a Bengaluru-based think tank, shows that in order to meet the growing demand of electric vehicles (EVs), the city would require more than 36,000 public EV charging guns (25 times more than the number in 2023) and 400 more charging stations by 2030.\n\nBy using the stock projection method, the study, which is called the “Bengaluru 2030: EV charging demand and infrastructure”, finds that Bengaluru will have more than 23 lakh EVs on the road by 2030. To help this transition, around 141 acres of land (equivalent of having 700 petrol pumps) would be required to set up the charging stations.\n\nIt has also identified 400 potential spots for setting up the stations. They include IT parks, metro stations, fuel stations, shopping malls, and in nine Regional Transport Office (RTO) zones.\n\nPotential impact on grid\n\nThe study further looks at the potential impact the EV demand could have on the electricity grid and estimates that by 2030, the energy demand would be around 3.3 - 4.1 Billion Units (BU), which would account for around 7% to 9% of the city’s annual energy demand. While the peak load from EV charging was 0.096 gigawatts (GW) in 2023, it is expected to touch around 1.2 GW by 2030.\n\nThe assessment of business viability for charge point operators indicate that the charger utilisation rates would be 25%–50% in 2030, and the corresponding tariffs for various types of charger guns could be capped at ₹11–15/kWh. \n\nThe study also administered detailed survey questionnaires to over 1,000 existing and potential EV users (personal and commercial) and found that over 56% of potential buyers prefer electric vehicles over conventional vehicles. More than 55% of the EV owners (both two-wheelers and four-wheelers) responded that they charged their vehicles either at their residence or workplace, while 40% of the commercial two-wheeler EV users preferred to use public charging stations. Commercial three-wheeler and four-wheeler EV users preferred company-provided charging stations.\n\nThe study says that overnight home-charging would cause the least strain on the electricity grid. “Two extreme charging scenarios were considered - 90% of EV users charging at home and 90% at public charging stations. The scenario wherein 90% of EV users charge at public stations could lead to a peak power demand of 1.4 GW, which is 16% of the city’s projected peak power demand. On the contrary, the peak power demand when 90% of EV users charge at home would be 1.1 GW (~7% lower than the 1.2 GW projection for 2030), resulting in relatively lower stress on the grid,” it says. \n\nHowever, promoting daytime charging at workplaces or public charging stations, through policy measures, may be beneficial for increasing the share of renewable energy used for EV charging.”",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/karnataka/36000-public-ev-charging-guns-would-be-required-by-2030-to-meet-growing-ev-demand-study/article68872035.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 14:12:28",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.098
    },
    {
        "id": 265026700,
        "title": "Satheesan condemns Centre’s inaction on Wayanad",
        "text": "Leader of the Opposition V.D. Satheesan has lashed out at the Union government for denying Central aid for the victims of the Wayanad landslides. “It’s not just a neglect for Wayanad; it’s a neglect for Kerala,” he said here on Friday.\n\nMr. Satheesan said it was shocking that no Central aid was given to the victims of Wayanad even after visits by the Prime Minister and a Central study team. “The BJP government is behaving as though Kerala is not there on the Indian map. The United Democratic Front (UDF) members will raise a strong protest against it in Parliament,” he said.\n\n“Nobody has asked for aid from the BJP. What the State asked was for special financial assistance from the Centre. What Wayanad requires now is not the State Disaster Response Fund (SDRF). The Union government has revealed its true colours by denying aid for Wayanad,” he said, adding that the BJP government did not say a word about it until polling in Wayanad was over.\n\nThe Leader of the Opposition challenged the Centre to say if the State had not given the estimates for the Wayanad disaster. “BJP State president K. Surendran does not have to say that the State had not given the estimates. The State has sought the Central aid, and not the BJP’s aid.”\n\nIllegal votes\n\nMr. Satheesan lashed out at the Communist Party of India (Marxist) [CPI(M)] and the BJP for illegally enrolling votes ahead of the byelection. He said it was the municipality ruled by the BJP that gave false residence certificate to Left Democratic Front (LDF) candidate P. Sarin to enrol his vote in Palakkad.\n\n“The rule says that one should be a resident of a place for at least six months to enrol his/her vote. Dr. Sarin has not been living in Palakkad for the past six months. He shifted to Palakkad recently. Then how did he get a residence certificate of more than six months stay?” Mr. Satheesan asked.\n\nHe said that CPI(M) district secretary E.N. Suresh Babu and Minister for Local Self-Government M.B. Rajesh were under duress within their party. He said Mr. Suresh Babu had failed as a district head of the party, and that was why he was protesting when he found that the UDF had worked systematically by enrolling 5,500 votes.\n\n“Electoral officers are responsible for enrolment of fake voters. They should be taken to task if anyone is found to be a fake voter,” he said.\n\nMr. Satheesan said that the CPI(M) had made party central committee member and senior leader E.P. Jayarajan a scapegoat. The party insulted Mr. Jayarajan by making him read out a scripted speech in favour of Dr. Sarin in Palakkad on Thursday evening, he said. “Was it a felicitation meeting, or a condolence meeting in Palakkad? Even the candidate would have laughed. It’s a joke that Kerala’s political annals should limn.”\n\nMr. Satheesan said that the UDF would examine the reasons for the slump in voting in Wayanad.\n\nMunambam issue\n\nIt was the State government and the Waqf Board that took antagonistic stand towards the people of Munambam, he said. The Leader of the Opposition accused the CPI(M) of playing a dirty game by planting news that could instigate communities in the Waqf issue on the eve of the elections.",
        "summary": "Leader of the Opposition says the BJP government has revealed its true colours by denying aid to Wayanad disaster victims",
        "url": "https://www.thehindu.com/news/national/kerala/satheesan-condemns-centres-inaction-on-wayanad/article68872497.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 14:08:34",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.6
    },
    {
        "id": 265024962,
        "title": "Nearly one lakh devotees take part in 11-km Giri Pradakshina at Annavaram temple",
        "text": "Nearly one lakh devotees took part in Giri Pradakshina, walking for 11 kilometres surrounding the Annavaram hill on the campus of Sri Veera Venkata Satyanarayana Swamy temple at Annavaram in Kakinada district. \n\nThe Giri Pradakshina is an annual ritual held on the day of Karthika Pournami. The Pradakshina began at the main temple and ended down the hill, covering the Pampa river and the national highway. The devotees, along with their family members, took part in the event. \n\nGuarded by the security personnel, police and medical and health staff, the Pradakshina commenced at 8 a.m. and concluded by 5 p.m. \n\n“At least one lakh devotees have turned up for the Giri Pradakshina on Friday. The darshan of the devotees who completed the Pradakshina was peaceful by evening,” according to an official release issued by the Endowments Department.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/nearly-one-lakh-devotees-take-part-in-11-km-giri-pradakshina-at-annavaram-temple/article68872224.ece",
        "image": "https://th-i.thgim.com/public/incoming/xjl5rl/article68872609.ece/alternates/LANDSCAPE_1200/10237_15_11_2024_18_13_53_1_WHATSAPPIMAGE2024_11_15AT170311_D086B755.JPG",
        "video": null,
        "publish_date": "2024-11-15 13:56:52",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.07
    },
    {
        "id": 265024964,
        "title": "State School Science Festival begins in Alappuzha",
        "text": "Deliberate attempts are being made from various quarters, including by individuals holding constitutional positions, to promote superstitions, misconceptions and unscientific practices in society, Chief Minister Pinarayi Vijayan has said.\r\n\nHe was inaugurating the 56th edition of the State School Science Festival at St. Joseph’s Higher Secondary School in Alappuzha on Friday.\n\nMr. Vijayan said Article 51A of the Constitution of India emphasises the development of scientific temper. However, this principle is not being upheld. “Instead of fostering a culture of scientific temper, efforts are being made to peddle superstitions and false beliefs. They are using scientific institutions to advance their false agendas and even school textbooks are being exploited to propagate unscientific ideas. Those participating in the science festival should apply their knowledge to the welfare of the society,” Mr. Vijayan said.\n\nStating that a small number of teachers have contributed to spreading false beliefs and propaganda, often through social media, the Chief Minister urged them to instead promote scientific knowledge.\r\n\n‘Least on research’\n\nMr. Vijayan pointed out that among the BRICS nations, India spends the least on research. “India is spending only 0.7% of its GDP on research and development, while the global average stands at 1.8%. What is most concerning is that a portion of funds earmarked for scientific research is being diverted to promote unscientific practices,” he said.\r\n\nThe Chief Minister reiterated Kerala’s commitment to research and development. He highlighted that the State government has allocated ₹3,500 crore for research purposes in the State Budget.\n\nHe also emphasised that scientific research should not only ensure the bright future of humankind, but also contribute to the conservation of the environment.\n\nMore than 5,000 students from across the State are expected to participate in 180 events in the four-day festival, which is being organised under the aegis of the General Education department. As part of the festival, fairs in science, mathematics, social sciences, work experience, and IT will be held. Besides career and vocational expos, seminars and entertainment programmes are also planned.\n\nGeneral Education Minister V. Sivankutty, Fisheries Minister Saji Cherian, Agriculture Minister P. Prasad, and others attended the inaugural function.",
        "summary": "Chief Minister inaugurates the 56th edition of the State School Science Festival. More than 5,000 students from across the State are expected to participate in 180 events in the four-day fete",
        "url": "https://www.thehindu.com/news/national/kerala/state-school-science-festival-begins-in-alappuzha/article68872525.ece",
        "image": "https://th-i.thgim.com/public/incoming/azs0f9/article68872586.ece/alternates/LANDSCAPE_1200/11073_15_11_2024_19_13_10_3_16TVAL3_CM.JPG",
        "video": null,
        "publish_date": "2024-11-15 13:59:34",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.355
    },
    {
        "id": 265024966,
        "title": "KMML to plant tree saplings on land used for mining",
        "text": "The Kerala Minerals and Metals Limited (KMML) will launch Punarjani Pachathuruthu, a green initiative as part of its commitment to environmental restoration and combating climate change. \n\nThe initiative, being implemented in coordination with the Haritha Keralam Mission, aims to cultivate 30 acres of land previously used for mining. Industries Minister P Rajeeve will inaugurate the project on Saturday. Sujith Vijayan Pillai, MLA, will preside over the function. N.K. Premachandran, MP, will the chief guest on the occasion.\n\nIt is for the first time in the State that the Haritha Keralam Mission is converting a land used for mining into a green island. As part of the project, the soil of the mined land will be prepared using coir pith and leaf litter before planting saplings. Experts from the Jawaharlal Nehru Tropical Botanic Garden and Research Institute, Palode have conducted a study to select suitable tree saplings for this project and most are endangered plant species. \n\nIn addition, high-yielding cashew saplings suitable for the region, procured from the Kerala State Agency for the expansion of Cashew Cultivation (KSACC), and saplings of various native trees will also be planted. \n\nDistrict Collector N. Devidas, block panchayat president Sathosh Thuppassery, Panmana grama panchayat president I. Jayachitra, district panchayat member C.P. Sudhish Kumar, KMML managing director V. Pradeepkumar and Navakeralam Karma Padhathi (NKP) assistant coordinator T.P. Sudhakaran will attend the inauguration.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/kerala/kmml-to-plant-tree-saplings-on-land-used-for-mining/article68872578.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 13:55:00",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.33
    },
    {
        "id": 265024972,
        "title": "Logo design competition as part of  World Soil Day",
        "text": "A logo design competition is being organised for high school students in Kollam district as part of World Soil Day. The best logo will be awarded a cash prize and a certificate. Interested students should submit their entries along with their name, address, parent’s phone number and certification from school authorities to the Assistant Director (Soil Survey), Mullathara Apartments, Jawahar Junction, Kollam 691 001. The last date for accepting applications is November 23. Contact 9496620291/ 0474 2767121 for more details.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/kerala/logo-design-competition-as-part-of-world-soil-day/article68872585.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 13:57:47",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.063
    },
    {
        "id": 265034364,
        "title": "Vigil intensified at border checkpoints in Adilabad ahead of Maharashtra polls",
        "text": "In the run-up to Maharashtra Assembly elections on November 20, vigil has been intensified at various checkpoints in Adilabad district bordering Maharashtra to curb illegal transportation of liquor and cash.\n\nThe district police have intensified surveillance at the checkpoints in Jainad, Boath, Talamadugu and other mandals that share the border with Maharashtra.\n\nAdilabad Superintendent of Police Gaush Alam attended an inter-State coordination meeting with his counterparts in Yavatmal district headquarters town in Maharashtra, a fortnight ago, to ensure strict enforcement of the model code of conduct.\n\nThe district police have also mounted a vigil on the movement of vehicles on the bridge across Penganga river on NH 44.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/telangana/vigil-intensified-at-border-checkpoints-in-adilabad-ahead-of-maharashtra-polls/article68872549.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 14:41:59",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.107
    },
    {
        "id": 265034366,
        "title": "‘Young journalists should strive to uncover truth’",
        "text": "Veteran journalist Gopal Nayak urged young journalists to strive to uncover the truth and speak truth to power. \n\n“Journalism is a sacred profession. We should realise its impact on society and be careful while doing our duties. We should aim at uncovering the truth at all times and never be afraid to speak truth to power,” he said during the National Press Day celebrations in Vijayapura on Friday. \n\nJournalists should protect the health of society and stand up for the victims of injustice. However, we should not offend anyone, group, or any faith, he said. Senior journalist Vasudev Herakal called for fraternity among journalists. \n\nJournalists like Sangamesh Churi, Karnataka media academy member, various award winners like Rudrappa Asangi, Rafi Bhandari, Mohammad Irfan Sheikh, Mohan Kulkarni, Basavaraj Ullagaddi, Shreeshail Kottalagi, Mahesh Shetgar and others were felicitated. \n\nThe Karnataka Union of Working Journalists organised the event.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/karnataka/young-journalists-should-strive-to-uncover-truth/article68872759.ece",
        "image": "https://th-i.thgim.com/public/incoming/imi7iw/article68872882.ece/alternates/LANDSCAPE_1200/9727_15_11_2024_19_47_41_1_16BGMKUWJBIJAPUR1.JPG",
        "video": null,
        "publish_date": "2024-11-15 14:43:07",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.246
    },
    {
        "id": 265036806,
        "title": "Govt. to examine need to file appeal against Kerala High Court order on captive elephant management, says Minister",
        "text": "Forest Minister A.K. Saseendran said the government will consider filing an appeal against the High Court ruling on parading elephants after a detailed examination of the order. \n\nThe Minister stressed the need to conduct festivals like the Thrissur Pooram without any hindrance even while taking steps to ensure the safety of elephants and the people participating in the events. “The government will examine the practical aspects before deciding on the next move.”\n\nThe Minister said the government had convened a workshop in Thiruvananthapuram on November 20 to discuss the draft rules on management of captive elephants. Officials ands other stakeholders including representatives of various devaswoms, elephant owners, NGOs and legal experts would attend the workshop. “The issues discussed at the workshop and the outcome would be taken into consideration before deciding further action by the government”, he added.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/kerala/govt-to-examine-need-to-file-appeal-against-kerala-high-court-order-on-captive-elephant-management-says-minister/article68872801.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-15 14:56:15",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.21
    }
]