[
    {
        "id": 261261392,
        "title": "Early days in Gambhir’s career as head coach, he’ll soon learn, says Ravi Shastri",
        "text": "New Delhi: Former India player and head coach Ravi Shastri backed current coach Gautam Gambhir to soon learn from the setbacks in the early phase of his stint at the helm in the national set-up.\r\n\r\nShastri's comments come after India suffered their first-ever Test series loss at home in 12 years, through a 113-run defeat to New Zealand in the second Test at Pune.\r\n\r\nGambhir, who took over as India's coach from Rahul Dravid in July, also saw the team lose its first bilateral ODI series against Sri Lanka after 27 years in August.\r\n\r\n\"New Zealand have beaten them (India) handsomely in both the Test matches. It's food for thought (on series loss). He (Gambhir) has just taken over the job. It's never easy being coach of a team that has such a big following. It's still early days in his career as a coach. But he'll soon learn,\" said Shastri when on air in the match at MCA Stadium, Gahunje.\r\n\r\nAfter an eight-wicket loss to New Zealand in the first Test at Bengaluru, the defeat in Pune inside three days meant India's unbeaten 18-series streak at home was brought to a screeching halt.\r\n\r\nThe last time India lost a Test series at home was in November-December 2012, when they lost to Alastair Cook-led England 2-1.\r\n\r\nThough India have retained their top spot in the ongoing World Test Championship cycle, the Rohit Sharma-led side has suffered a drop in their points percentage to be at 62.82 points percentage.\r\n\r\nThere is now not much to separate India from Australia, who are at number two on the standings with 62.50 points percentage. With New Zealand having an unassailable 2-0 lead, India will be aiming for a consolation win when the third and final Test of the series takes place at the Wankhede Stadium in Mumbai from November 1-5, before heading to Australia for the all-important five-match Border-Gavaskar Trophy Test series.",
        "summary": "Shastri's comments come after India suffered their first-ever Test series loss at home in 12 years, through a 113-run defeat to New Zealand in the second Test at Pune",
        "url": "https://telanganatoday.com/early-days-in-gambhirs-career-as-head-coach-hell-soon-learn-says-ravi-shastri",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/10/indias-coach.jpg",
        "video": null,
        "publish_date": "2024-10-27 10:21:50",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "sports",
        "source_country": "in",
        "sentiment": 0.017
    },
    {
        "id": 261261396,
        "title": "Lewandowski scores brace as Barca thrash Real Madrid in Clasico",
        "text": "Madrid: Robert Lewandowski scored twice, while Lamine Yamal and Raphinha also hit the target as FC Barcelona thrashed Real Madrid 4-0 in the Santiago Bernabeu Stadium on Saturday night.\r\n\r\nThe win lifts Barca six points clear of Real Madrid at the top of La Liga and also means Real Madrid's run of 42 La Liga games without defeat comes to an end, reports Xinhua.\r\n\r\nThe first half saw 47 minutes of high-octane football with Kylian Mbappe having the first chance in the opening minute, although the offside flag ruled his effort out as Barca played a high defensive line.\r\n\r\nThe French striker then almost took advantage of a poor clearance from Pau Cubarsi, but his effort from distance was just over the bar with Barcelona goalkeeper Inaki Pena well off his line.\r\n\r\nYamal looked as if he was through at the other end, but could only shoot tamely at goalkeeper Andriy Lunin under pressure before play went straight down the other end where Pena saved brilliantly from Jude Bellingham in another chance ruled out for Mbappe's offside.\r\n\r\nVinicius Jr also got into the game as Real Madrid looked to be aggressive, firing one chance over and dragging another wide before Lunin reacted to parry Pedri's shot from outside the Madrid penalty area.\r\n\r\nMbappe had the ball in the net in the 31st minute, but once again he had strayed behind the defense, with Madrid chalking up eight offsides in the first 45 minutes.\r\n\r\nThe opening minutes of the second half were end-to-end football with neither side having control, before Lewandowski left Madrid reeling with two goals in three minutes.\r\n\r\nThe striker found space between Antonio Rudiger and Eder Militao to run onto a defense-splitting pass from Marc Casado and cooly beat Lunin with a low shot in the 54th minute.\r\n\r\nHe then doubled Barca's lead with a wonderful header following Alejandro Balde's cross, as Madrid's central defenders were nowhere near the striker.\r\n\r\nLuka Modric came on to try and give more control to Madrid, and Bellingham could have scored from his free kick, while Mbappe fired another good chance at Pena.\r\n\r\nLewandowski had two magnificent opportunities to score a hat-trick as Madrid left space in defense, but side-footed wide of an open goal in the 66th minute and then shot over the bar two minutes later.\r\n\r\nYamal smashed home Barca's third after another counter-attack and Raphinha added a fourth with six minutes left with a dink over Lunin after finding wide-open spaces again.",
        "summary": "The first half featured 47 minutes of intense football, with Kylian Mbappe getting the first opportunity in the opening minute, only to have his effort ruled out for offside as Barcelona maintained a high defensive line.",
        "url": "https://telanganatoday.com/lewandowski-scores-brace-as-barca-thrash-real-madrid-in-clasico",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/10/Lewandowski-scores-brace-as-Barca-thrash-Real-Madrid-in-Clasico.jpg",
        "video": null,
        "publish_date": "2024-10-27 10:30:00",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.305
    },
    {
        "id": 261261394,
        "title": "Carlos Sainz secures pole position for Mexico City Grand Prix amid dramatic qualifying",
        "text": "Mexico City: Ferrari's Carlos Sainz is eyeing a perfect start in the Mexico City Grand Prix after taking a stunning pole position ahead of Max Verstappen and Lando Norris during what had been a dramatic qualifying session featuring a red flag in Q2 and two shock exits in Q1.\r\n\r\nVerstappen enters the race with a 57-point lead over Norris, who needs to gain nearly 12 points per race on the Red Bull driver to overtake him in the remaining five races.\r\n\r\nNorris qualified his McLaren just 0.089 seconds behind Verstappen, while Sainz dominated with a pole position lap 0.225 seconds faster than the Dutchman, showcasing Ferrari's recent surge in form.\r\n\r\nCharles Leclerc, Ferrari’s second driver and winner of last weekend's United States Grand Prix, starts fourth, followed by Mercedes’ George Russell and Lewis Hamilton.\r\n\r\nAll eyes are on the top four as they head to the season's longest first corner, where the strong slipstream effect could favour those starting in second and third.\r\n\r\n\"Probably the biggest difficult thing will be the run down into Turn One and starting on pole with a slipstream, no?\r\n\r\n\"I just need to make sure I do a good 0-100km/h, which is the most important thing when you start on pole, just make sure you do a good jump. And from there obviously do the best I can to defend,\" Sainz said.\r\n\r\n\"I have two guys behind fighting for quite important things and the run down into Turn One should be interesting. I have obviously less to lose in that sense,\" he added.\r\n\r\nTo boost his title hopes, Norris needs to win the race and hope the Ferraris finish between him and Verstappen. But the Briton fears the pace of the Ferraris - Leclerc has taken two wins and a second in the last four races.\r\n\r\nNorris, who needs to win the race and hopes Ferraris to finish ahead of Verstappen to bolster his title hopes. \"The last few weekends, they've been extremely quick and quicker than us, so it's... I don't have the confidence to say, yes, we can just beat them on pace. Like today, not on their level,\" said Norris, who needs to win the race and hope Ferraris to finish ahead of Verstappen to bolster his title chances. I had definitely nowhere near close to 0.3 seconds left in the car. So it was more that they just went quicker. I was at the limit.\"\r\n\r\nVerstappen was pleased to secure a front-row start after a challenging Friday, during which he completed only six laps due to an engine issue that left him with \"basically no data.\"\r\n\r\n\"We were massively on the back foot,\" Verstappen said. \"After yesterday, I knew it would be a tough weekend, but we kept making little improvements with the car. \"Qualifying felt better and to be on the front row is an incredible result if you look back at yesterday.\"",
        "summary": "Verstappen heads into the race with a 57-point lead over Norris, who must gain nearly 12 points per race on the Red Bull driver to surpass him in the final five races.",
        "url": "https://telanganatoday.com/carlos-sainz-secures-pole-position-for-mexico-city-grand-prix-amid-dramatic-qualifying",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/10/Sainz-eyeing-good-jump-after-securing-pole-at-Mexico-City-GP.jpg",
        "video": null,
        "publish_date": "2024-10-27 10:20:00",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.123
    },
    {
        "id": 260223268,
        "title": "Telangana Governor appoints Vice Chancellors of nine state universities",
        "text": "Hyderabad, Oct 18 (IANS) Telangana Governor Jishnu Dev Varma on Friday appointed Vice Chancellors for nine State universities. \n\nThe Governor, who is the Chancellor of the State universities, appointed Prof Kumar Moglaram as the Vice Chancellor of the prestigious Osmania University, Hyderabad.\n\nProf G.N. Srinivas has been appointed as the Vice Chancellor of Palamuru University, Mahabubnagar, Prof Pratap Reddy the Vice Chancellor of Kakatiya University, Warangal, Prof Umesh Kumar as the Vice Chancellor of Satavahana University, Karimnagar, Prof Nityananda Rao as Vice Chancellor of Telugu University, Hyderabad and Prof Altaf Hussain as Vice Chancellor of the Mahatma Gandhi University, Nalgonda.\n\nThe other Vice Chancellors appointed are Prof Yadagiri Rao of Telangana University, Nizamabad), Prof Aldas Janaiah of Prof. Jayashankar Telangana State Agricultural University, Hyderabad, and Prof Raji Reddy of the Sri Konda Laxman Telangana Horticultural University.\n\nOn May 21, the state government appointed senior Indian Administrative Service (IAS) officers as in-charge Vice Chancellors of the state universities. The officials holding key posts in the government were appointed as in-charges as existing Vice-Chancellors demitted their office.\n\nThe government had invited applications for the posts of regular Vice-Chancellors. A total of 1,382 applications were received from 312 teachers. Most of them applied for multiple universities. Search Committees were also constituted to expedite the process of appointing regular vice-chancellors. The committees, comprising a representative from the university concerned, the University Grants Commission, and the state government went through the applications and recommended three names for each VC post.\n\nThe Committees submitted the lists to the Governor, who then appointed Vice Chancellors. Chief Minister A. Revanth Reddy had announced after assuming office in December last year that he would not keep the posts of Vice Chancellors pending for years like the previous government.",
        "summary": "Hyderabad, Oct 18 (IANS) Telangana Governor Jishnu Dev Varma on Friday appointed Vice Chancellors for nine State universities. The Governor, who is the Chancellor of the State universities, appointed Prof Kumar Moglaram as the Vice Chancellor of the prestigious Osmania University, Hyderabad. Prof G.N. Srinivas has been appointed as the Vice Chancellor of Palamuru University, [&#8230;]",
        "url": "https://bhaskarlive.in/telangana-governor-appoints-vice-chancellors-of-nine-state-universities/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202401303112429.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 15:41:22",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.253
    },
    {
        "id": 260223272,
        "title": "Sharad Pawar met Dawood in Dubai, govt must clarify: Prakash Ambedkar",
        "text": "Mumbai, Oct 18 (IANS) The Vanchit Bahujan Aghadi (President) Prakash Ambedkar has alleged that the Nationalist Congress Party (SP) President Sharad Pawar met the absconding mafia don Dawood Ibrahim Kaskar in Dubai and was gifted a gold chain.\n\nMaking a sensational claim, Ambedkar told media persons that the purported meeting took place when Pawar was the Chief Minister of Maharashtra (1988-1991) and had travelled abroad, first to California (USA), and then to London (UK).\n\nHe further claimed that Pawar had gone on an official tour that time, first went to London, then California and returned to London where he stayed for two days after which he travelled to Dubai (UAE).\n\n“In Dubai, he met Dawood at the airport and he (Pawar) was welcomed and even gifted a gold necklace by the don there. Then he took a flight back to London that evening and then returned to India after two days,” alleged Ambedkar, the grandson of the Chief Architect of the Indian Constitution B. R. Ambedkar.\n\nRejecting the claims, NCP (SP) National Spokesperson Clyde Crasto said that it is clear that Ambedkar is attempting to create a ‘fake narrative’ ahead of the Maharashtra Assembly elections.\n\n“It’s clear… He is speaking on behalf of the Bharatiya Janata Party… He is just trying to float a narrative with the state assembly polls coming up soon,” said Crasto dismissively.\n\nOn the purported trip around 35 years ago, Ambedkar questioned that as Pawar was the Chief Minister then did he get the permission of the Central government before travelling abroad.\n\n“Did the Centre allow him to travel and attend the meetings in California then? If yes, then was he also permitted to go and meet Dawood in Dubai? Were those meetings official or unofficial and reported to the central government or not,” demanded Ambedkar.\n\nWhen pointed out, the VBA chief said that he was raising it as it’s (Assembly) election time and he wanted to caution the people to choose the party which they vote for carefully, in view of the current political situation in the world, and attacks like the killing of MahaYuti ally Nationalist Congress Party leader Baba Ziauddin Siddique on October 12.\n\nHe called upon the NCP (SP), and the Central government to come clean on this and provide an explanation on all this, why the meetings were held since the country had faced a series of bomb blasts and terror strikes in the 1990s, and a similar situation unfolding now for which we must be on alert. \n\n“I am not making any allegations, but merely putting forth certain facts, and demand that the NCP (SP) and the (current) government should give an explanation. Moreover, the current international situation is disturbing and India’s relations are getting damaged with the USA, Canada, and in the Middle East,” contended Ambedkar.",
        "summary": "Mumbai, Oct 18 (IANS) The Vanchit Bahujan Aghadi (President) Prakash Ambedkar has alleged that the Nationalist Congress Party (SP) President Sharad Pawar met the absconding mafia don Dawood Ibrahim Kaskar in Dubai and was gifted a gold chain. Making a sensational claim, Ambedkar told media persons that the purported meeting took place when Pawar was [&#8230;]",
        "url": "https://bhaskarlive.in/sharad-pawar-met-dawood-in-dubai-govt-must-clarify-prakash-ambedkar/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410183245454.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 16:08:51",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.3
    },
    {
        "id": 261260744,
        "title": "Japan heads to polls as new PM Ishiba faces challenge amid money scandal",
        "text": "Tokyo, Oct 27 (IANS) Voting began across Japan on Sunday in a general election as newly appointed Prime Minister Shigeru Ishiba seeks a fresh mandate amid growing scrutiny over the ruling party’s handling of political funds, local media reported.\n\nThe Liberal Democratic Party (LDP), along with its junior coalition partner, Komeito, aims to retain a majority in the 465-member House of Representatives. However, Kyodo News polls suggest they are facing significant challenges.\n\nIn Japan’s first general election since 2021, voters will cast two ballots each — one for a candidate in a single-seat constituency and another for a party in proportional representation. Final results are anticipated by early Monday, reports Kyodo News.\n\nA total of 1,300 candidates are competing for the 465 seats — 289 in single-seat districts and 176 through proportional representation.\n\nIshiba dissolved the lower house on October 9, just eight days after taking office, pledging to restore public trust in politics and advance key policy initiatives.\n\nThe 67-year-old premier has promised to ease the inflationary burden on households, bolster national defence against regional threats, and enhance regional economies and disaster resilience.\n\nHowever, during the 12-day campaign, the LDP faced backlash after reports emerged that the party provided 20 million yen (approximately $132,000) to local branches led by members who lacked official party backing due to a slush funds scandal.\n\nThe scandal has shadowed the LDP since late 2023, eroding public support to levels that ultimately led Ishiba’s predecessor, Fumio Kishida, to step down and clear the way for a leadership change.\n\nThe main opposition, the Constitutional Democratic Party of Japan (CDPJ), hopes to leverage public discontent with the LDP, which has governed Japan for most of the postwar period.\n\nPrior to the recent dissolution, the ruling camp controlled the more powerful lower house with 288 seats, comfortably above the majority threshold of 233. The LDP held 256 seats, while the CDPJ had 98.\n\nTo achieve its long-sought goal of amending Japan’s Constitution, the LDP must secure a two-thirds majority, or 310 seats, allowing them to propose a revision ahead of a national referendum.",
        "summary": "Tokyo, Oct 27 (IANS) Voting began across Japan on Sunday in a general election as newly appointed Prime Minister Shigeru Ishiba seeks a fresh mandate amid growing scrutiny over the ruling party&#8217;s handling of political funds, local media reported. The Liberal Democratic Party (LDP), along with its junior coalition partner, Komeito, aims to retain a [&#8230;]",
        "url": "https://bhaskarlive.in/japan-heads-to-polls-as-new-pm-ishiba-faces-challenge-amid-money-scandal/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410273250380.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-27 10:16:40",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.433
    },
    {
        "id": 261260748,
        "title": "Uzbekistan holds first mixed-system parliamentary election",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Tashkent, Oct 27 (IANS) Uzbekistan began voting in its parliamentary and local council elections on Sunday, conducting its first use of a mixed electoral system. Polls opened at 8:00 a.m. and will close at 8:00 p.m. local time, Xinhua news agency reported. &#8220;For the first time in the history of Uzbekistan, elections to the Legislative [&#8230;]",
        "url": "https://bhaskarlive.in/uzbekistan-holds-first-mixed-system-parliamentary-election/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410273250368.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-27 09:49:56",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261260746,
        "title": "South Korean President’s office reviews economic impact of Israel’s attack on Iran",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Seoul, Oct 27 (IANS) South Korea&#8217;s presidential office on Sunday held a meeting to discuss the economic impact of Israel&#8217;s recent attack on Iran, and measures to protect and evacuate its nationals in the Middle East in the event of an emergency. Early Saturday, Israel&#8217;s military conducted strikes against various targets in Iran, including missile [&#8230;]",
        "url": "https://bhaskarlive.in/south-korean-presidents-office-reviews-economic-impact-of-israels-attack-on-iran/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410273250345.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-27 09:51:47",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261260752,
        "title": "Afghanistan sees around 4,000 foreigners make inbound, outbound trips in 1 month",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Kabul, Oct 27 (IANS) The Afghan caretaker government&#8217;s National Statistics and Information Authority announced on Sunday that airports and border ports had processed around 4,000 inbound and outbound trips of foreign nationals in Afghanistan in the past month. Among them, 2,231, including 63 women, made inbound trips, while 1,809, including 11 women, made outbound trips. [&#8230;]",
        "url": "https://bhaskarlive.in/afghanistan-sees-around-4000-foreigners-make-inbound-outbound-trips-in-1-month/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410273250357.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-27 09:36:58",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261260750,
        "title": "Maharashtra key to India’s growth story being scripted in Modi 3.0: EAM Jaishankar",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Mumbai, Oct 27 (IANS) Ahead of the November 20 Assembly elections in the state, External Affairs Minister S Jaishankar on Sunday said a developed Maharashtra is indispensable for a developed India and highlighted that economic, employment and development issues are being addressed at an unprecedented pace in the third term of the Narendra Modi government. [&#8230;]",
        "url": "https://bhaskarlive.in/maharashtra-key-to-indias-growth-story-being-scripted-in-modi-3-0-eam-jaishankar/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410273250383.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-10-27 10:25:06",
        "author": "German Chancellor Olaf,IANS",
        "authors": [
            "German Chancellor Olaf",
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261260754,
        "title": "Iran says reserves right to respond to Israeli attack",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Tehran, Oct 27 (IANS) Iran said that it reserves the right to respond &#8220;legally and legitimately&#8221; to an earlier Israeli attack on multiple targets in three of its provinces. In a statement on the Iranian army&#8217;s public relations website, the General Staff of Iran&#8217;s Armed Forces on Saturday said that Israeli aircraft launched &#8220;long-range air-launched [&#8230;]",
        "url": "https://bhaskarlive.in/iran-says-reserves-right-to-respond-to-israeli-attack/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410273250356.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-27 09:42:25",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261260758,
        "title": "PM Modi gifts exquisite artworks from Jharkhand, Maha to world leaders at BRICS Summit",
        "text": "New Delhi, Oct 27 (IANS) In the recently concluded BRICS Summit in Kazan, Prime Minister Narendra Modi gifted exquisite artworks from Jharkhand and Maharashtra to state heads of Russia, Iran and Uzbekistan.\n\nThe gifts that PM Modi gave to world leaders include Jharkhand’s popular Sohrai Painting to Russian President Vladimir Putin, a Mother of Pearl vase to the President of Iran, and a Warli painting to the President of Uzbekistan.\n\nWith PM Modi gifting captivating paintings and exquisite artwork to the world leaders, the artisans and craftsmen of both states saw their products shine on a global platform.\n\nSohrai Painting: A timeless folk art tradition\n\nThe Sohrai painting from Jharkhand’s Hazaribagh district is a beautiful representation of the region’s indigenous artistic traditions and is recognised as an ODOP (One District One Product) item.\n\nSohrai paintings are known for their use of natural pigments and simple tools. Artists often use brushes made from twigs, rice straw, or even fingers to create intricate designs. They have been traditionally created by women, especially during festivals and harvest seasons. The art is a form of gratitude for the harvest and is believed to bring good fortune for the coming year.\n\nMother of Pearl Vase: A masterpiece of coastal craftsmanship\n\nThe Mother of Pearl (MOP) sea shell vase from Maharashtra is a captivating example of fine craftsmanship that combines natural beauty with the rich artisanal tradition of the region.\n\nMother of Pearl, known for its iridescent shimmer, is sourced from the inner layer of certain mollusc shells. It has been prized in many cultures for its symbolic associations with purity, tranquillity, and prosperity.\n\nThe vase features a visually appealing mosaic design, with small, carefully cut pieces of Mother of Pearl in various shades of yellow, black, white, and gray. It represents the perfect blend of nature’s beauty and human craftsmanship. By using sustainable materials from the sea and traditional techniques, artisans create pieces that are as timeless as they are beautiful.\n\nWarli Painting: A traditional art with a modern identity\n\nWarli painting is a tribal art form originating from the Warli tribe primarily located in the Dahanu, Talasari and Palghar regions of Maharashtra, India, renowned for its simplicity and deep connection to nature and daily life. This tribal art form is one of the oldest in India, with roots tracing back to around 3000 BCE.\n\nThe art was traditionally created by Warli women on the walls of their mud homes during special occasions like weddings and harvest festivals. Through their art, they documented their lifestyle, customs, and rituals in a visual storytelling format that transcended language.\n\nWhat makes Warli art distinctive is its monochromatic colour scheme. Traditionally, Warli artists used a white pigment made from rice paste, applied on the earthen, red ochre background of the mud walls. Warli painting is more than just an art form—it is a living narrative of tribal culture, spirituality, and life’s simple yet profound truths.",
        "summary": "New Delhi, Oct 27 (IANS) In the recently concluded BRICS Summit in Kazan, Prime Minister Narendra Modi gifted exquisite artworks from Jharkhand and Maharashtra to state heads of Russia, Iran and Uzbekistan. The gifts that PM Modi gave to world leaders include Jharkhand’s popular Sohrai Painting to Russian President Vladimir Putin, a Mother of Pearl [&#8230;]",
        "url": "https://bhaskarlive.in/pm-modi-gifts-exquisite-artworks-from-jharkhand-maha-to-world-leaders-at-brics-summit/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410273250361.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-27 09:40:08",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 1.0
    },
    {
        "id": 261260756,
        "title": "India has emerged leader in fighting terrorism under PM Modi’s leadership: Jaishankar",
        "text": "Mumbai, Oct 27 (IANS) External Affairs Minister S. Jaishankar on Sunday asserted that India has emerged as a leader in fighting terrorism under the leadership of Prime Minister Narendra Modi. \n\nFurther, amid tense global scenarios and ongoing Iran-Israel and Ukraine-Russia war, he said that India is ready to provide all possible support in the times to come.\n\nAddressing a press conference in Mumbai, Jaishankar said that as far as terrorism is concerned, India has adopted a zero tolerance policy.\n\n“I am in Mumbai which has become a counter terrorism centre for the country and for the world especially after the 26/11 terror attacks. The UNSC’s Counter Terrorism Council summit recently held in Mumbai and in the same hotel which was attacked by the terrorists. We have to be very clear. We say zero tolerance for terrorism and we should not have a repeat about what happened in Mumbai. It cannot be day time doing business and nighttime terrorism… this will not be accepted. We will expose terrorism and then we will act,’’ he said.\n\nJaishankar said that after the disengagement agreement between India and China to end the standoff between armies of two countries, India will focus on de-escalation.\n\n“India and China on October 21 reached a disengagement agreement whereby soldiers belonging to both the countries will resume patrolling as they did before the 2020 border face-off. The agreement is anticipated to ease patrolling in the Depsang and Demchok areas where patrolling will be restored. However, for implementation of this agreement, it will need some time.”\n\nHe further said, the next level is de-escalation and the third larger issue is how do you manage the border and how do you negotiate the boundary settlement,” he added.\n\nAs far as Kashmir is concerned, he said, “We have been very clear that there is cross border terrorism… we have felt that there are many ways to deal with the issue. When Assembly elections were held, voter’s turnout was more than 60 per cent and it was a big statement considering the people’s response. Who wins is a secondary part. India won that day, that many people put their faith on the government’s move to scrap article 370 and remove the hold of separatist policy.”\n\nThe minister said that he went to Pakistan recently with a clear message that India would not compromise on its zero tolerance policy.\n\nOn the issue of entry of illegal migrants from Bangladesh and Myanmar, Jaishankar said that the government’s focus is to tighten the border security.\n\nJaishankar made a strong pitch for a double engine government to achieve the Viksit Bharat goal.\n\n“For Viksit Bharat, Viksit Maharashtra is necessary. Maharashtra is the most industrialised with a long history. There are factories, technology, research, quality of people, environment but there are new possibilities. With the implementation of Centre’s India Middle East Economic Corridor initiative, Maharashtra will benefit a lot with investors investing in ports, logistics, roads and railways. Investors are interested to invest in the state,’’ he added.\n\nJaishankar however, also called for proper alignment between the Centre and the states to implement slew of development decisions and attract investments.\n\n“Investors are coming to India and Maharashtra as they look at various factors including governance, alignment between the Centre and the states, smooth implementation of policies on the ground,” he noted.",
        "summary": "Mumbai, Oct 27 (IANS) External Affairs Minister S. Jaishankar on Sunday asserted that India has emerged as a leader in fighting terrorism under the leadership of Prime Minister Narendra Modi. Further, amid tense global scenarios and ongoing Iran-Israel and Ukraine-Russia war, he said that India is ready to provide all possible support in the times [&#8230;]",
        "url": "https://bhaskarlive.in/india-has-emerged-leader-in-fighting-terrorism-under-pm-modis-leadership-jaishankar/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410273250369.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-10-27 09:53:01",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.17
    },
    {
        "id": 261260760,
        "title": "Diwali rush: TN forms special teams to monitor bus fare hikes by private operators",
        "text": "Chennai, Oct 27 (IANS) The Tamil Nadu government has established special teams to monitor the bus fare charges imposed by private bus operators during the Diwali rush. \n\nIn a statement on Sunday, State Transport Minister S. S. Sivasankar stated that if any operators were found charging more than the rates stipulated by the government, excess charges would be refunded.\n\nThe minister also confirmed that notifications have been sent to bus booking apps, including RedBus, instructing them not to raise charges during the peak festival period, starting tomorrow.\n\nS. S. Sivasankar added that any private bus operators, charging excessive fares, will face vehicle seizure and fines.\n\nFor Diwali, the Tamil Nadu Transport Department will deploy 9,658 buses from Chennai’s main bus terminal to various destinations across the state.\n\nThis includes 3,408 routine daily services, 4,250 special buses, and 2,000 omnibuses, as announced by Minister Sivasankar.\n\nChief Secretary N. Miruganandam has been coordinating with the Union government to avoid congestion at toll plazas during the festival.\n\nAdditionally, reserve parking facilities have been arranged for extra buses if required.\n\nTNSTC Kumbakonam buses will park at the Vandalur Zoo parking area, while omnibuses will use the Maraimalai Nagar Municipality parking.\n\nLong-distance buses to other districts will operate from Kilambakkam, with the Transport Corporation arranging buses from all areas of Chennai to this terminal.\n\nFurthermore, eight electric vehicles will shuttle between the MTC terminal and the intercity bus area.\n\nThe waiting area at the Kilambakkam terminal can accommodate up to 2,000 passengers. It has been equipped with eight ATMs, three feeding centres, 18 water purifiers, and 140 accommodation facilities for passengers.\n\nTo maintain cleanliness, the number of sanitation workers has been increased three times.",
        "summary": "Chennai, Oct 27 (IANS) The Tamil Nadu government has established special teams to monitor the bus fare charges imposed by private bus operators during the Diwali rush. In a statement on Sunday, State Transport Minister S. S. Sivasankar stated that if any operators were found charging more than the rates stipulated by the government, excess [&#8230;]",
        "url": "https://bhaskarlive.in/diwali-rush-tn-forms-special-teams-to-monitor-bus-fare-hikes-by-private-operators/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410273250372.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-27 10:08:32",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.478
    },
    {
        "id": 261136292,
        "title": "JK Bank Q2 profit rises 45 pc",
        "text": "Srinagar, Oct 25: Jammu and Kashmir Bank on Friday reported 45 per cent rise in September quarter standalone profit at Rs 551 crore.\n\nIn the year-ago period, the bank had logged a profit of Rs 381.07 crore.\n\nNet profit in April-September FY25 grew 36.6 per cent to Rs 966.41 crore from Rs 707.52 crore in the same period a year ago, a statement said.\n\nBacked by both core and non-core income growth, the bank's operating profit in Q2 rose more than 47 per cent YoY and 32 per cent QoQ to Rs 787 crore.\n\nNet Interest Income (NII) was up 7.7 per cent YoY to Rs 1,435.93 crore in the September quarter. Other income surged 55.6 per cent YoY to Rs 296.08 crore.\n\nNet Interest Margin (NIM) improved to 3.90 per cent from 3.86 per cent recorded in Q1 while the cost to income ratio improved significantly to 54.56 per cent YoY from 64.93 per cent.\n\nCommenting on the bank's Q2 numbers, MD and CEO Baldev Prakash said the results are almost in line with the expectations.\n\n“The bottom-line growth underscores our financial prudence and operational excellence while reflecting our commitment to deliver consistent value for our stakeholders as we stay steady on course to achieve the annual numbers,” he said.\n\n“I believe, with a healthy balance sheet, a diversified portfolio and consistent focus on digital transformation, we are well-positioned to maintain this growth momentum and capitalize on emerging opportunities.”\n\nThe bank's gross NPA ratio decreased by 131 basis points YoY to 3.95 per cent as against 5.26 per cent recorded in September 2023. Net NPA ratio also moderated to 0.85 per cent from 1.04 per cent.\n\nMeanwhile, during the quarter the Return on Assets (RoA) jumped to 1.41 per cent YoY. Provision Coverage Ratio (PCR) also improved 55 basis-points YoY to 90.54 per cent.\n\nPrakash said keeping gross NPA below 4 per cent highlights the success of the robust risk management practices of the bank.\n\n“We have been focusing on proactive asset-quality management and ensuring long-term sustainability in lending. Another highlight of this quarter is RoA, which has surged to 1.41 per cent,” he said.\n\nWith continued improvement in key performance indicators, the bank is reinforcing its position as a leading financial institution focused on profitability and sound asset management, he added.\n\nThe bank's CASA stood at 48.60 per cent, which continues to be one of the highest in the industry.\n\nRegarding business growth, the MD and CEO said during September quarter, “our growth in advances is near 10 per cent, while we have maintained the deposit growth within the range of industry average.”\n\nGoing forward, the bank will intensify efforts to strengthen deposit base and increase loan book to achieve its top-line growth numbers, he said.\n\n“With a CRAR of almost 15 per cent, we remain well-capitalized, ensuring that the bank is positioned to support future growth opportunities while maintaining financial discipline. Pertinently, the CAR is exclusive of half-yearly profit of Rs 966 crore, which would otherwise result in taking the ratio to 16 per cent,” Prakash added.\n\nHe also emphasized on the prioritisation of carrying forward the digital momentum.\n\n“Since our role as a developmental financial institution here is not just to provide credit, we have to take care that businesses are equipped with the tools they need to manage growth sustainably,” he said.\n\nTherefore, by carrying forward the digital momentum, the bank is also revolutionizing the way its customers experience banking, making it more convenient, swift, secure and efficient for them with every passing day, Prakash added.\n\n“Going forward, we have devised a comprehensive road map to help businesses particularly MSMEs get equipped with beneficial, convenient and efficient management solutions, through collaborative banking with our fintech partners, so that these enterprises sustain growth and enjoy prosperity.”",
        "summary": "Srinagar, Oct 25: Jammu and Kashmir Bank on Friday reported 45 per cent rise in September quarter standalone profit at Rs 551 crore. In the year-ago period, the bank had logged a profit of Rs 381.07 crore. Net profit in April-September FY25 grew 36.6 per cent to Rs 966.41 crore from Rs 707.52 crore in [&#8230;]\n\n\nThe post JK Bank Q2 profit rises 45 pc appeared first on Northlines.",
        "url": "https://thenorthlines.com/jk-bank-q2-profit-rises-45-pc/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/gdsgggs-4.jpg",
        "video": null,
        "publish_date": "2024-10-26 00:17:56",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "business",
        "source_country": "in",
        "sentiment": -0.167
    },
    {
        "id": 261136296,
        "title": "Man injured in landmine blast in Poonch",
        "text": "JAMMU, Oct 25: A man was injured in a landmine blast in Poonch district on Friday, officials said.\n\nThe 40-year-old man, identified as Haneef, was gathering wood on his land in the border belt of the Shahpur area when he accidentally stepped on a landmine, they said.\n\nHaneef sustained injuries in the incident, they said, adding that he has been evacuated and sent to a hospital for treatment.",
        "summary": "JAMMU, Oct 25: A man was injured in a landmine blast in Poonch district on Friday, officials said. The 40-year-old man, identified as Haneef, was gathering wood on his land in the border belt of the Shahpur area when he accidentally stepped on a landmine, they said. Haneef sustained injuries in the incident, they said, [&#8230;]\n\n\nThe post Man injured in landmine blast in Poonch appeared first on Northlines.",
        "url": "https://thenorthlines.com/man-injured-in-landmine-blast-in-poonch/",
        "image": "https://thenorthlines.com/wp-content/uploads/2024/10/blast.webp",
        "video": null,
        "publish_date": "2024-10-26 00:14:21",
        "author": "Northlines",
        "authors": [
            "Northlines"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.014
    }
]