[
    {
        "id": 261917610,
        "title": "Ektaa Kapoor revives ‘Kyunki Saas Bhi Kabhi Bahu Thi’ for ‘The Sabarmati Report’",
        "text": "Mumbai: Ektaa Kapoor is set to bring back the legendary song “Ram Ram” from her popular TV series “Kyunki Saas Bhi Kabhi Bahu Thi” in her forthcoming film “The Sabarmati Report.”\r\n\r\nThe song has been reimagined and given a new title, “Raja Ram\" This revamped track beautifully merges the cherished memories of the original with a contemporary cinematic flair.\r\n\r\nThe makers shared the teaser for the song on their social media handles, writing, “This Diwali, Truth will prevail!” The film's teaser was recently released and it hinted at the revelation of long-hidden truths surrounding the incident. In the teaser, Vikrant impresses as a bold journalist dedicated to uncovering the truth, while Raashii Khanna delivers a powerful performance as his fellow reporter.\r\n\r\nThe teaser also offers a glimpse of Ridhi’s role as a seasoned anchor. “The Sabarmati Report” is directed by Dheeraj Sarna and produced by Shobha Kapoor, Ektaa R Kapoor, Amul V Mohan, and Anshul Mohan. The film recounts the tragic events of February 27, 2002, when a devastating fire broke out on the Sabarmati Express, resulting in the deaths of 59 pilgrims and karsevaks returning from Ayodhya. It marks Massey’s first on-screen collaboration with both Raashii Khanna and Ridhi Dogra.The film is set to release in theatres on November 15.\r\n\r\nApart from this, Vikrant also has an upcoming film Aankhon Ki Gustaakhiyaan in the pipeline. He was last featured in Aditya Nimbalkar’s crime thriller Sector 36, where he starred alongside Deepak Dobriyal and Akash Khurana.\r\n\r\nThe film was inspired by the notorious Noida serial murders of 2006. Talking about, ‘Kyunki Saas Bhi Kabhi Bahu Thi’, the Star Plus’s daily soap opera was one of the most popular and loved shows. It aired from 3 July 2000 to 6 November 2008. The show starred Smriti Irani in the lead role.",
        "summary": "The song has been reimagined and given a new title, “Raja Ram\" This revamped track beautifully merges the cherished memories of the original with a contemporary cinematic flair.",
        "url": "https://telanganatoday.com/ektaa-kapoor-revives-kyunki-saas-bhi-kabhi-bahu-thi-for-the-sabarmati-report",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/ektaa.jpg",
        "video": null,
        "publish_date": "2024-11-01 10:28:37",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "entertainment",
        "source_country": "in",
        "sentiment": 0.706
    },
    {
        "id": 261917614,
        "title": "ISRO launches India’s first analog space mission to study extraterrestrial challenges",
        "text": "New Delhi: The Indian Space Research Organization (ISRO) on Friday announced the launch of its first analog space mission, to study the challenges of extraterrestrial conditions that will help in future space missions.\r\n\r\nThe mission, which includes a compact, inflatable habitat named Hab-1 will simulate life in an interplanetary habitat. It is being held in Leh, in Ladakh.\r\n\r\nEven as India plans to launch several space missions, the new mission will help understand the challenges that future astronauts may encounter on missions beyond Earth.\r\n\r\n“India’s first analog space mission kicks off in Leh!” ISRO said in a post on X.\r\n\r\n“This mission will simulate life in an interplanetary habitat to tackle the challenges of a base station beyond Earth,” the space agency added.\r\n\r\nHab-1 is equipped with essentials like a hydroponics farm, kitchen, and sanitation facilities. It provides a self-sustaining environment, offering valuable data as India is planning long-duration space missions to the Moon, Mars, and beyond.\r\n\r\nThe mission is a collaborative effort by the Human Spaceflight Centre, ISRO, AAKA Space Studio, University of Ladakh, IIT Bombay, and is supported by the Ladakh Autonomous Hill Development Council.\r\n\r\nLadakh was chosen as the place for the mission due to its unique geological characteristics that closely resemble Martian and lunar landscapes.\r\n\r\nIts cold, arid conditions and high altitude will provide an ideal environment for testing technologies and strategies necessary for long-duration space missions.\r\n\r\nDuring the mission, the scientists will test new technologies, robotic equipment, vehicles, habitats, and communications. They will also seek to understand power generation, mobility, infrastructure, and storage during the analog mission.\r\n\r\nHab-1 will also study the effects of isolation and confinement on human health and performance.\r\n\r\nThe findings may help ISRO understand the strengths, limitations, and validity of planned human-robotic exploration operations.\r\n\r\n“This analog mission is a significant step towards understanding the complexities of living on other planets,” said Rajnagar Divisional Forest Officer Sudarshan Gopinath.\r\n\r\n\"The insights gained will be crucial for the success of future space missions,\" he added.\r\n\r\nThe country's Space Vision 2047 includes setting up an Indian Space Station - - Bharatiya Antariksha Station (BAS) -- by 2035 and landing an Indian on the Moon by 2040.",
        "summary": "The mission, featuring a compact inflatable habitat called Hab-1, will simulate life in an interplanetary environment and is taking place in Leh, Ladakh. As India prepares for upcoming space missions, this initiative aims to explore the challenges future astronauts may face on missions beyond Earth.",
        "url": "https://telanganatoday.com/isro-launches-indias-first-analog-space-mission-to-study-extraterrestrial-challenges",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/ISRO-launches-Indias-first-analog-space-mission.jpg",
        "video": null,
        "publish_date": "2024-11-01 10:30:54",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.718
    },
    {
        "id": 261916120,
        "title": "Thailand’s manufacturing sector stagnates in October",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Bangkok, Nov 1 (IANS) Thailand&#8217;s manufacturing sector slowed to stagnation in October as new orders fell slightly despite a continued rise in output and employment, a survey showed on Friday. The Southeast Asian country&#8217;s manufacturing purchasing managers&#8217; index (PMI) came in at 50 last month, edging down from 50.4 in September, marking the end of [&#8230;]",
        "url": "https://bhaskarlive.in/thailands-manufacturing-sector-stagnates-in-october/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252995.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:20:00",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "category": "business",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261916122,
        "title": "Operationally ready at all times, says Eastern Army Commander on 104th Raising Day",
        "text": "Kolkata, Nov 1 (IANS) The Army’s Eastern Command celebrated its 104th Raising Day at Fort William here on Friday with its chief, Lt Gen Ram Chander Tiwari asserting that it is operationally ready at all times and continues to develop its capabilities to face present and future challenges.\n\nChief of Staff Lt Gen R.C. Srikanth laid a wreath at Vijay Smarak in Fort William to pay tribute to bravehearts, who made the supreme sacrifice in the service to the nation, in the morning. Several events were organised during the day, including interactions between officers and troops.\n\nAccording to an official, the Eastern Command was raised in Lucknow on November 1, 1920. It then had territorial jurisdiction over Delhi, Uttar Pradesh, Bihar, Odisha, and Assam. Thereafter, the Command headquarters moved to Barrackpore, Ranchi and back to Lucknow. After the India-China War of 1962, the Command settled down permanently at Fort William in Kolkata.\n\n“Eastern Command continues to remain the Army’s largest operational command with its jurisdiction covering eight states. It monitors 8,350 km of land borders with five neighbouring countries. The Eastern Command has actively participated in all wars fought by India but the crowning glory was the 1971 Indo-Pakistan War that led to the Liberation of Bangladesh. The ‘Warriors of the East’ have also conducted successful counter-insurgency operations in the northeastern states whenever required,” the official said.\n\nThe command is also entrusted with managing the Line of Actual Control (LAC) in the states of Sikkim and Arunachal Pradesh. The official said that personnel from the command cover terrain ranging from high-altitude peaks in the Himalayas with sub-zero temperatures to steaming rain forests with fast-flowing rivers.\n\n“The Command has also brought significant changes in the lives of citizens, particularly in the northeastern states, through initiatives like Operation Sadbhavana and Operation Samaritan. Officers and troops not only provide relief during disasters and help to restore law and order, they also interact with the local population on a regular basis through medical camps. Training is also provided to local youth to join the armed forces or take up professional courses like engineering and medicine,” the official added.",
        "summary": "Kolkata, Nov 1 (IANS) The Army’s Eastern Command celebrated its 104th Raising Day at Fort William here on Friday with its chief, Lt Gen Ram Chander Tiwari asserting that it is operationally ready at all times and continues to develop its capabilities to face present and future challenges. Chief of Staff Lt Gen R.C. Srikanth [&#8230;]",
        "url": "https://bhaskarlive.in/operationally-ready-at-all-times-says-eastern-army-commander-on-104th-raising-day/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252989.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:06:41",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.262
    },
    {
        "id": 261916126,
        "title": "‘Judicial legacy’: 10 landmark verdicts authored by CJI Chandrachud",
        "text": "New Delhi, Nov 1 (IANS) After a two-year-long stint as the Chief Justice of India (CJI) D.Y. Chandrachud is due to retire on November 10 on attaining the age of 65 years. During the period, he pronounced several notable judgements. \n\nHere are the 10 key judgments authored by him when he was in the highest judicial office of the country after taking over as the CJI on November 9, 2022.\n\n1. Revocation of Article 370\n\nA 5-judge Constitution Bench, headed by CJI D.Y. Chandrachud, had upheld the revocation of Article 370. It had ordered the Election Commission of India to take steps to conduct elections to the Legislative Assembly of Jammu and Kashmir by September 30, 2024.\n\nThe Constitution Bench, also comprising Justices S.K. Kaul, Sanjiv Khanna, B.R. Gavai and Surya Kant, had left open the question of whether Parliament can extinguish the character of statehood by converting a state into one or more union territories, relying on the statement made by Solicitor General Tushar Mehta that statehood would be restored to Jammu and Kashmir, but, it had said that “restoration of statehood shall take place at the earliest and as soon as possible”.\n\nThe Supreme Court had upheld the status of Ladakh as a union territory under Article 3(a) read with Explanation I of the Constitution, which permits the formation of a union territory by separating a territory from any state.\n\nIn May this year, the apex court refused to review the Constitution Bench verdict and dismissed a batch of review pleas filed against the decision upholding the revocation of Article 370 as valid.\n\n2. Same-sex marriage\n\nA 5-judge bench headed by CJI D.Y. Chandrachud had declined to strike down or read into gender-neutral “person” in place of “male” and “female” existing under the Special Marriage Act. All five judges of the Constitution Bench had unanimously agreed that there exists no unqualified right to marriage and accepted the Centre’s proposal that a committee to be headed by the Cabinet Secretary be set up to examine what administrative steps could be taken to address basic social benefit concerns relating to same-sex couples.\n\nThe Constitution Bench, also comprising Justices Sanjiv Khanna, Hima Kohli, B.V. Nagarathna and P.S. Narasimha, had left it to the legislature to take a call on enacting the marriage equality law. It had asked the Union and state governments to ensure that the LGBTQ+ community is not discriminated against on the basis of their sexual orientation and queer individuals are not refused access to any goods or services.\n\n3. Electoral bonds\n\nA five-judge Constitution Bench, headed by CJI D.Y. Chandrachud, had struck down the electoral bonds scheme, saying that denying voters the right to know the details of funding of political parties would lead to a dichotomous situation and the funding of political parties cannot be treated differently from that of the candidates who contest elections.\n\nIn a unanimous verdict, the Bench, also comprising Justices B.R. Gavai, Sajiv Khanna, J.B. Padriwala and Manoj Misra, had directed the State Bank of India (SBI) to forthwith stop the issuance of electoral bonds and ordered the Election Commission of India (ECI) to publish on its official website the details of the political parties which have received contributions through electoral bonds since April 2019.\n\nSubsequently, a bench headed by CJI Chandrachud declined to entertain a public interest litigation (PIL) seeking a Special Investigative Team (SIT) probe under the supervision of a retired apex court judge into an alleged scam in poll financing using electoral bonds.\n\nThe top court said that an SIT cannot be formed to probe “quid pro quo” unless there is an FIR already registered on the issue espoused in the PIL, adding that the ordinary course of law may remedy the allegations raised in the plea.\n\n4. Caste-based division of labour in prisons\n\nA bench headed by CJI DY Chandrachud held it unconstitutional the practice of employing “lower caste” jail inmates in cleaning and manual scavenging work in prisons. The Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, directed that the “caste” column and any references to caste in prisoners’ registers inside the prisons be deleted.\n\nIn its October 2024 verdict, the Supreme Court asked all states and union territories to revise their prison rules providing caste-based division of labour in jails within three months. It also asked the Union government to make changes in the Model Prison Manual 2016 and the Model Prisons and Correctional Services Act 2023 within three months.\n\n5. Effective implementation of Prohibition of Child Marriage Act, 2006\n\nA bench headed by CJI Chandrachud issued a slew of directions for the effective implementation of the Prohibition of Child Marriage Act, 2006.\n\nThe Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, ordered the state governments and union territories to appoint officers solely responsible for discharging the functions of Child Marriage Prohibition Officers (CMPOs) at the district level.\n\nIt said that child marriage deprives children of their agency, autonomy and right to fully develop and enjoy their childhood. “Both sexes are adversely affected by forced and early marriage. Marrying in childhood has the effect of objectifying the child. The practice of child marriage imposes mature burdens on children who are not physically or mentally prepared to comprehend the significance of marriage,” ordered SC.\n\n6. Section 6A of Citizenship Act\n\nA Constitution Bench, headed by CJI Chandrachud, upheld the constitutional validity of Section 6A of the Citizenship Act, 1955, which was inserted to give effect to the Assam Accord and formed the basis of the National Register of Citizens (NRC) in Assam in 2019.\n\nThe 5-judge Bench was dealing with a clutch of petitions challenging Section 6A of the Citizenship Act 1955, on the ground that it violates Articles 6,7,14, 29 and 355 of the Constitution.\n\nIn his opinion, CJI Chandrachud held that Section 6A of the Citizenship Act does not have the effect of amending Articles 6 and 7 of the Constitution, which prescribe a cut-off date for conferring citizenship for migrants from East and West Pakistan at the “commencement of the Constitution” (i.e., on January 26, 1950).\n\n7. NEET-UG 2024\n\nRefusing to order a fresh exam, a bench headed by CJI Chandrachud observed there was no systematic leak of the question paper of the NEET-UG 2024 examination.\n\nThe Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, said there was no sufficient material available on the record to order a re-test but clarified that its judgment won’t prevent authorities from taking action against candidates who had secured admission using malpractices.\n\n8. Adani-Hindenburg controversy\n\nA bench presided over by CJI Chandrachud refused to form any SIT or group of experts to conduct the investigation in the Adani-Hindenburg controversy and said the facts of the case did not warrant a transfer of investigation from SEBI.\n\nThe Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, said that reports prepared by third-party organisations such as the Organised Crime and Corruption Reporting Project (OCCRP) and Hindenburg Research cannot be regarded as “conclusive proof”.\n\n9. Manipur violence\n\nA bench headed by CJI Chandrachud took suo moto cognizance of the disturbing viral videos where two tribal women were paraded naked and sexually assaulted in Manipur.\n\nThe Supreme Court had set up a committee comprising three woman judges tasked with collecting information related to violence against women in Manipur as well as monitoring the conditions at relief camps and deciding on compensation to victims.\n\nThe Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, had also appointed former Maharashtra DGP Dattatray Padsalgikar to investigate the allegations that certain police officers colluded with perpetrators of violence, including sexual violence, during the conflict in Manipur.\n\n10. Cases against MPs/MLAs\n\nA bench headed by CJI Chandrachud directed Chief Justices of all High Courts across the country to register suo moto cases to monitor the expeditious disposal of criminal cases pending against MPs and MLAs.\n\nThe Supreme Court said that the special bench to be formed in every High Court will issue continuing directions to curb the criminalisation of politics and may seek assistance from the Advocate General and other officers of the state government.\n\nFurther, it said that the High Court may also call for status reports on the issue from all District and Session Courts under their jurisdiction.\n\nJustice Chandrachud was first appointed as judge of the Bombay High Court on March 29, 2000, and served as Chief Justice of the Allahabad High Court since October 31, 2013, until his elevation as an apex court judge on May 13, 2016.\n\nCJI Chandrachud passed BA with honours in economics from St Stephen’s College, New Delhi and completed LLB from Campus Law Centre, Delhi University. He also served as Additional Solicitor General of India from 1998 till 2000. In June 1998, he was designated as a senior advocate by the Bombay High Court.\n\nAfter CJI Chandrachud recommended the name of Justice Sanjiv Khanna as his successor last month, the Centre has cleared the appointment of Justice Khanna as the 51st CJI with effect from November 11.",
        "summary": "New Delhi, Nov 1 (IANS) After a two-year-long stint as the Chief Justice of India (CJI) D.Y. Chandrachud is due to retire on November 10 on attaining the age of 65 years. During the period, he pronounced several notable judgements. Here are the 10 key judgments authored by him when he was in the highest [&#8230;]",
        "url": "https://bhaskarlive.in/judicial-legacy-10-landmark-verdicts-authored-by-cji-chandrachud/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252998.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:27:17",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.076
    },
    {
        "id": 261916124,
        "title": "Son of South Korean missionary detained in North Korea appeals for international support",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Seoul, Nov 1 (IANS) The son of a South Korean Christian missionary who has remained detained in North Korea for 10 years has appealed for international support to address issues involving detainees while meeting with key human rights figures in Europe, the country&#8217;s unification ministry said on Friday. Choi Jin-young, the son of missionary Choi [&#8230;]",
        "url": "https://bhaskarlive.in/son-of-south-korean-missionary-detained-in-north-korea-appeals-for-international-support/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252992.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:13:11",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261916130,
        "title": "Amid poster war in UP, Cong’s Rashid Alvi backs SP’s ‘judenge to jeetenge’ pitch",
        "text": "New Delhi, Nov 1 (IANS) Congress leader Rashid Alvi on Friday extended support to the Samajwadi Party (SP) over its ‘judenge to jeetenge’ posters, claiming that it was an effort to unite the people unlike the ‘divisive’ rhetoric of the Bharatiya Janata Party (BJP).\n\nA poster war has broken out in Uttar Pradesh ahead of by-elections, with BJP sharpening its ‘batenge ko katenge’ pitch while opposition Samajwadi Party (SP) looking to counter it with slogans like ‘judenge toh jeetenge’ and others. \n\nCongress spokesperson, talking to IANS, also trained guns at Uttar Pradesh chief minister and asked the latter to point out – to whom his comments were directed at.\n\n“When Yogi Adityanath talks about Batenge toh Katenge, it is natural to react. I want to ask the Chief Minister, you say ‘Batenge toh Katenge’ but whom do you wish to divide, and who is supposed to attack? Is it Pakistan? No, they lack the courage. Or China, with whom your government has signed agreements.”\n\n“If it’s an internal threat, then say so directly. If you have the courage, define who you’re referring to. Who is to be divided, and who is to attack?” he added.\n\nOn Thursday, SP workers put up posters at many places in Lucknow, featuring SP supremo Akhilesh Yadav with ‘Judenge Toh Jeetenge’ slogans.\n\nResponding to Uttarakhand government announcing roll-out of the Uniform Civil Code (UCC) on November 9, he said, “They are not implementing UCC because they genuinely believe it is necessary, but rather to spread hate and perpetuate anti-Muslim sentiment.”\n\n“The Prime Minister himself has recently said that they would establish a secular code. How can a party that does not believe in secularism claim to create a secular code? They did nothing on this issue for 11 years, and now, just before elections, they bring up UCC, Waqf issues, and divorce reforms. It feels as if there are no other pressing issues in the country,” he added.",
        "summary": "New Delhi, Nov 1 (IANS) Congress leader Rashid Alvi on Friday extended support to the Samajwadi Party (SP) over its ‘judenge to jeetenge’ posters, claiming that it was an effort to unite the people unlike the ‘divisive’ rhetoric of the Bharatiya Janata Party (BJP). A poster war has broken out in Uttar Pradesh ahead of [&#8230;]",
        "url": "https://bhaskarlive.in/amid-poster-war-in-up-congs-rashid-alvi-backs-sps-judenge-to-jeetenge-pitch/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252973.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:19:53",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.29
    },
    {
        "id": 261916128,
        "title": "Army contingent leaves for joint exercise in Indonesia",
        "text": "New Delhi, Nov 1 (IANS) An Indian Army contingent comprising 25 personnel departed for Cijantung, Jakarta, Indonesia to take part in the 9th edition of India-Indonesia Joint Special Forces Exercise Garud Shakti 24. \n\nThe exercise will be conducted from November 1 to 2, a statement said on Friday.\n\nThe Indian contingent is being represented by troops from The Parachute Regiment (Special Forces) and an Indonesian contingent comprising 40 personnel is being represented by Indonesian Special Forces Kopassus, the statement said.\n\nThe aim of Garud Shakti 24 is to acquaint both sides with each other’s operating procedures and enhance mutual understanding, cooperation and interoperability between the Special Forces of both armies.\n\nThe exercise is designed to develop bilateral military cooperation and strengthen the bond between two armies through the conduct of discussions and rehearsal of tactical military drills.\n\nThe exercise will involve planning and execution of special operations, orientation to advance special forces skills, and sharing of information on weapons, equipment, innovations, tactics, techniques and procedures, the defence ministry said in a statement.\n\nJoint Exercise Garud Shakti 24 will also involve jointly practising Special Forces Operations in jungle terrain, strikes on terrorist camps and a Validation Exercise integrating basic and advanced special forces skills apart from gaining an insight into the lifestyle and culture of both countries to foster military cooperation.\n\nThe exercise will provide an opportunity for both contingents to strengthen their bond and share best practices. It will also act as a platform to achieve shared security objectives and foster bilateral relations between two friendly nations.\n\nIn September, the Indian Army held a joint military exercise with the US forces in Rajasthan. The 20th edition of the ‘Yudh Abhyas 2024’ was held at Mahajan Fields in Rajasthan’s Bikaner from September 9 to 22.\n\nIt was the biggest joint military exercise between India and America with 1,200 soldiers from India and America participating.\n\nThe Indian Army contingent, comprising 600 personnel, was represented by a Battalion of the Rajput Regiment and personnel from other arms and services.\n\nThe US contingent comprising similar strength was represented by the troops of 1-24 Battalion of the Alaska-based 11th Airborne Division of the US Army.\n\nThe aim of the Joint Exercise was to enhance the joint military capability of both sides to undertake counter-terrorism operations in a sub-conventional scenario under Chapter VII of the United Nations Mandate. The exercise focused on operations in the semi-desert environment, an Indian Army official said.",
        "summary": "New Delhi, Nov 1 (IANS) An Indian Army contingent comprising 25 personnel departed for Cijantung, Jakarta, Indonesia to take part in the 9th edition of India-Indonesia Joint Special Forces Exercise Garud Shakti 24. The exercise will be conducted from November 1 to 2, a statement said on Friday. The Indian contingent is being represented by [&#8230;]",
        "url": "https://bhaskarlive.in/army-contingent-leaves-for-joint-exercise-in-indonesia/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/e546ba3ce4d1ed09fd5ce2cd152c421f.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 09:44:03",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.408
    },
    {
        "id": 261916132,
        "title": "Our guarantee schemes are a model for the country: K’taka Dy CM",
        "text": "Bengaluru, Nov 1 (IANS) Karnataka Deputy Chief Minister D.K. Shivakumar said on Friday that the guarantee schemes implemented in Karnataka have become a model for other states in the country.\n\nHe was reacting to queries from the media near Kanteerava stadium in Bengaluru.\n\nShivakumar’s statement on the review of Shakthi’s free travel scheme for women across the state stirred a major controversy in the state.\n\nAsked about the implementation of Karnataka’s model guarantee schemes in Maharashtra, he said, “The guarantee schemes implemented in Karnataka have become a model for other states in the country. Even states governed by the BJP and other parties are emulating our schemes.”\n\n“This is a matter of pride and honour for us,” he added.\n\n“The opposition parties were unable to implement the people-oriented guarantee schemes that we have brought forward. They create discord among siblings, parents, and children, manipulating emotions — that’s their agenda. In this way, they have broken many homes,” said Shivakumar.\n\n“I only mentioned the feedback of about 5-10 per cent of women on the Shakti scheme. We will not stop the guarantee schemes under any circumstances. Some women said they would buy tickets, but conductors are hesitant to collect money. I only suggested that this needs to be considered,” he added.\n\nAsked about Congress President Mallikarjun Kharge’s message of unity, Shivakumar said, “He conveyed a message to the workers in light of various circumstances. Since I became the state party president and Deputy Chief Minister, has there been any untoward incident within the party or the government? We are running both the government and the party smoothly.”\n\n“Mallikarjun Kharge is a senior party leader. If he offers wise advice, we must listen. I ask everyone to revisit my remarks on the Shakti scheme,” he added.\n\n“The Opposition has nothing to discuss other than politics. They said guarantee schemes would ruin households. But that didn’t happen, as they claimed. Seeing our efforts, they are burning with envy,” Shivakumar said.\n\nAsked about several Congress leaders visiting New Delhi, the Deputy Chief Minister said, “No one has gone to Delhi. Mallikarjun Kharge has not intervened in any matter. So far, no such incident has occurred. As a senior leader, he has offered advice of unity.”\n\n“Kharge spoke with a national political perspective in mind and said that different states have adopted different policies on reservations. Kharge subtly indicated that each state should frame its policies locally, and he will not interfere in that,” Shivakumar added.\n\n“We are celebrating the 69th anniversary of Karnataka’s unification and 50 years since it was renamed Karnataka. More than a thousand school children have given international-level dance performances and participated in other programmes. I have instructed the ministers and officials to issue certificates to all these children. These school children have worked hard to take part in programmes for Karnataka,” he said.\n\n“This time, all private institutions and educational institutions were instructed to hold Rajyotsava celebrations. Around 70 per cent of institutions conducted the event. In the first phase, we issued this directive from the government. We encouraged everyone to preserve their language and culture voluntarily. We instructed that no legal action be taken against private institutions,” he added.\n\nAsked about the demand for a law to take action against those who insult Kannada, Shivakumar said, “People from other states and countries come and live in our state. Private educational institutions, particularly Christian educational institutions, have celebrated Rajyotsava with great dedication.”",
        "summary": "Bengaluru, Nov 1 (IANS) Karnataka Deputy Chief Minister D.K. Shivakumar said on Friday that the guarantee schemes implemented in Karnataka have become a model for other states in the country. He was reacting to queries from the media near Kanteerava stadium in Bengaluru. Shivakumar&#8217;s statement on the review of Shakthi&#8217;s free travel scheme for women [&#8230;]",
        "url": "https://bhaskarlive.in/our-guarantee-schemes-are-a-model-for-the-country-ktaka-dy-cm/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/20240925112.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 09:52:41",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.351
    },
    {
        "id": 261916136,
        "title": "South Korea, US stage joint drone strike drills for first time",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Seoul, Nov 1 (IANS) South Korea and the US on Friday held joint drone strike drills for the first time, the South&#8217;s Air Force said, a day after North Korea launched an Inter Continental Ballistic Missile (ICBM). The live-fire drills, involving a South Korean RQ-4B Global Hawk surveillance drone and a US MQ-9 Reaper attack [&#8230;]",
        "url": "https://bhaskarlive.in/south-korea-us-stage-joint-drone-strike-drills-for-first-time/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252869.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 09:32:18",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261916134,
        "title": "As Joshi seeks ouster of K’taka Waqf Min, Zameer says notices given during BJP rule too",
        "text": "Bengaluru, Nov 1 (IANS) A war of words broke out between Union Minister for Food, Public Distribution and Food, Pralhad Joshi and Karnataka Minister for Waqf and Tourism, Zameer Khan on Friday over the issue of Waqf Board notices to farmers.\n\nEven as Joshi reiterated his demand for the ouster of Zameer Khan for allegedly pressurising authorities to mark farmers’ lands and other properties as belonging to the Waqf Board, the Karnataka Minister for Waqf hit back saying that from 2008 to 2013 and 2019 to 2023, during the tenure of BJP governments in the state, thousands of notices were given to farmers by the Waqf Board.\n\nSpeaking to reporters, Joshi stated in Hubballi on Friday, “I had demanded that Chief Minister Siddaramaiah sack Minister Zameer for misusing his name to pressurise authorities. No action has been taken and CM Siddaramaiah has not bothered to answer.”\n\n“The ‘Waqf Adalats’ being conducted by Minister Zameer should be stopped immediately. I had urged CM Siddaramaiah to issue orders in this regard, there is no response,” he added.\n\nJoshi further demanded that the entry in the land records where the ownership was given to the Waqf should be changed, unless otherwise.\n\nReacting to the Waqf row on Friday in Bengaluru, Zameer stated, “We won’t take any agricultural lands owned by farmers. If notices were issued to farmers, they will be taken back. The farmers or anyone’s property cannot be claimed just like that.”\n\nZameer added, “From 2008 to 2013 and 2019 to 2023, during the tenure of BJP governments in Karnataka, thousands of notices were given to farmers from the Waqf Board. The process of issuing notices to people from the Waqf Board has been there for a long time. This is not new.”\n\n“The notices were issued when BJP leader C.T. Ravi was the minister. I am convening a press conference in this regard soon and will expose the BJP,” he stated.\n\nThe Waqf Board has not taken an inch of the government’s land and out of the total 1.12 lakh acres belonging to the Waqf Board in Karnataka, only 23 acres remain with it, Zameer said.\n\n“We are rectifying that. About 800 acres of land of the Muzrai department, which manages temples and religious institutions has been encroached upon. The Muzrai Department has 30,000 acres of land,” he stated.",
        "summary": "Bengaluru, Nov 1 (IANS) A war of words broke out between Union Minister for Food, Public Distribution and Food, Pralhad Joshi and Karnataka Minister for Waqf and Tourism, Zameer Khan on Friday over the issue of Waqf Board notices to farmers. Even as Joshi reiterated his demand for the ouster of Zameer Khan for allegedly [&#8230;]",
        "url": "https://bhaskarlive.in/as-joshi-seeks-ouster-of-ktaka-waqf-min-zameer-says-notices-given-during-bjp-rule-too/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252982.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 09:51:48",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.746
    },
    {
        "id": 261916138,
        "title": "Typhoon Trami leaves 8 dead, 14 injured in Vietnam",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Hanoi, Nov 1 (IANS) Typhoon Trami and its subsequent rains and floods over the past week claimed eight lives in Vietnam&#8217;s central region and injured 14 others, the National Steering Committee on Natural Disaster Prevention and Control said on Friday. As of 7 a.m. on Friday, Quang Binh was the hardest-hit province, with seven deaths [&#8230;]",
        "url": "https://bhaskarlive.in/typhoon-trami-leaves-8-dead-14-injured-in-vietnam/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252990.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-11-01 10:07:18",
        "author": "Cji Chandrachud,IANS",
        "authors": [
            "Cji Chandrachud",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 261915432,
        "title": "Indian Army team heads to Jakarta for Garud Shakti 24 exercise",
        "text": "New Delhi: An Indian Army contingent comprising 25 personnel departed for Cijantung, Jakarta, Indonesia to take part in the 9th edition of India-Indonesia Joint Special Forces Exercise Garud Shakti 24.\r\n\r\nThe exercise will be conducted from November 1 to 2, a statement said on Friday.\r\n\r\nThe Indian contingent is being represented by troops from The Parachute Regiment (Special Forces) and an Indonesian contingent comprising 40 personnel is being represented by Indonesian Special Forces Kopassus, the statement said.\r\n\r\nThe aim of Garud Shakti 24 is to acquaint both sides with each other’s operating procedures and enhance mutual understanding, cooperation and interoperability between the Special Forces of both armies.\r\n\r\nThe exercise is designed to develop bilateral military cooperation and strengthen the bond between two armies through the conduct of discussions and rehearsal of tactical military drills.\r\n\r\nThe exercise will involve planning and execution of special operations, orientation to advance special forces skills, and sharing of information on weapons, equipment, innovations, tactics, techniques and procedures, the defence ministry said in a statement.\r\n\r\nJoint Exercise Garud Shakti 24 will also involve jointly practising Special Forces Operations in jungle terrain, strikes on terrorist camps and a Validation Exercise integrating basic and advanced special forces skills apart from gaining an insight into the lifestyle and culture of both countries to foster military cooperation.\r\n\r\nThe exercise will provide an opportunity for both contingents to strengthen their bond and share best practices. It will also act as a platform to achieve shared security objectives and foster bilateral relations between two friendly nations.\r\n\r\nIn September, the Indian Army held a joint military exercise with the US forces in Rajasthan. The 20th edition of the 'Yudh Abhyas 2024' was held at Mahajan Fields in Rajasthan's Bikaner from September 9 to 22.\r\n\r\nIt was the biggest joint military exercise between India and America with 1,200 soldiers from India and America participating.\r\n\r\nThe Indian Army contingent, comprising 600 personnel, was represented by a Battalion of the Rajput Regiment and personnel from other arms and services.\r\n\r\nThe US contingent comprising similar strength was represented by the troops of 1-24 Battalion of the Alaska-based 11th Airborne Division of the US Army.\r\n\r\nThe aim of the Joint Exercise was to enhance the joint military capability of both sides to undertake counter-terrorism operations in a sub-conventional scenario under Chapter VII of the United Nations Mandate. The exercise focused on operations in the semi-desert environment, an Indian Army official said.",
        "summary": "The exercise, scheduled for November 1-2, includes troops from India’s Parachute Regiment (Special Forces) and 40 personnel from Indonesia's Special Forces, Kopassus, a statement said Friday.\n\n\n\n\nThe Indian contingent includes troops from the Parachute Regiment (Special Forces), while the Indonesian contingent, consisting of 40 personnel, is represented by Special Forces Kopassus, the statement said.",
        "url": "https://telanganatoday.com/indian-army-team-heads-to-jakarta-for-garud-shakti-24-exercise",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Indian-Army-team-heads-to-Jakarta-for-Garud-Shakti-24-exercise.jpg",
        "video": null,
        "publish_date": "2024-11-01 10:06:30",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.442
    },
    {
        "id": 261770540,
        "title": "Governors, CMs of Telugu states greet people on Diwali",
        "text": "Hyderabad, Oct 31 (IANS) Governors and Chief Ministers of Telangana and Andhra Pradesh have greeted people on the occasion of Diwali.\n\nTelangana Governor Jishnu Dev Varma conveyed the warmest greetings to people on this joyous occasion of Diwali.\n\n“This festival of lights signifies the victory of righteousness over the evil. I am sure occasions like this inspire us to conquer the evils of modern-day and build a society in which peace, amity, and communal harmony prevail,” he said in his message.\n\nThe Governor appealed to all to buy local products to celebrate this festival to bring “new light into the lives of the indigenous manufacturers in the true spirit of Atmanirbhar Bharat.”\n\n“May this Deepavali usher in new thoughts and promote new ideas to further the brightness, happiness, and prosperity in the lives of the people all around us. I once again extend my warmest greetings to the people of the State and wish them happiness and prosperity,” he added.\n\nChief Minister A. Revanth Reddy also extended greetings to Telangana people on the occasion of Diwali. He said in his message that Telangana state got rid of 10 years of “destructive” rule and the “people’s government” brought light in the lives of all sections of people aiming for all-round development and the welfare of all.\n\nThe Chief Minister wished that people celebrate the festival of lights, a symbol of victory of good over evil, with jubilation. He hoped that every household would be filled with joy and happiness during the festivities.\n\nCM Revanth Reddy appealed to all the young and elderly to celebrate the festival without causing any harm to the environment and take proper precautions to avoid fire accidents.\n\nAndhra Pradesh Governor S. Abdul Nazeer greeted people on the occasion of Diwali. “May the divine lights of Deepavali bring peace, prosperity and happiness to all. Deepavali symbolizes the victory of light over darkness, good over evil and knowledge over ignorance. The lights of Deepavali signify a time to destroy all our dark desires and thoughts, eradicate evils and give us the strength and zeal to help each other,” he said.\n\n“Festivals like these inspire us to build a society filled with peace, amity, brotherhood and communal harmony,” added the Governor.\n\nChief Minister N. Chandrababu Naidu also conveyed Diwali greetings to people.",
        "summary": "Hyderabad, Oct 31 (IANS) Governors and Chief Ministers of Telangana and Andhra Pradesh have greeted people on the occasion of Diwali. Telangana Governor Jishnu Dev Varma conveyed the warmest greetings to people on this joyous occasion of Diwali. &#8220;This festival of lights signifies the victory of righteousness over the evil. I am sure occasions like [&#8230;]",
        "url": "https://bhaskarlive.in/governors-cms-of-telugu-states-greet-people-on-diwali/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410313252482.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 07:32:28",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.397
    },
    {
        "id": 261770544,
        "title": "No reason to celebrate: NC leader on J&K UT Foundation Day",
        "text": "Jammu, Oct 31 (IANS) As the newly-elected Omar Abdullah-led National Conference (NC) government in Jammu and Kashmir promised to boycott the Union Territory (UT) Foundation Day on Thursday, senior party leader Sheikh Bashir Ahmad called it a day of “humiliation” for people of J&K.\n\nAt the same time, Bashir Ahmad also extended Diwali greetings to fellow countrymen and hoped that better days would prevail in the Union territory in 2025.\n\nSpeaking to IANS, the NC leader said: “First of all, I want to extend my greetings to all the people across the country on the pious occasion of Diwali, and I pray that this festival of happiness brings good times in the coming year. The Union Territory Foundation Day is actually a day of humiliation for the people of Jammu and Kashmir.”\n\nSpeaking about NC boycotting the UT Foundation Day, Bashir Ahmad added: “On this day, the people of Jammu and Kashmir were humiliated. There’s no reason to celebrate it; it’s a day for officials and bureaucracy. From this day, the destruction of Jammu and Kashmir began. This day holds no relevance for the people of Jammu and Kashmir. In a democracy, everybody has a right to express their views. The day when J&K became a UT, will be etched in history.”\n\nThe NC leader further said: “The people have given a mandate to a democratically-elected government, and they should let go of this day. Whether in the opposition or ruling party, everyone should come together to solve the people’s issues. Prime Minister Narendra Modi and the Union Home Minister Amit Shah have also spoken about statehood, using the term ‘appropriate’ time, which could mean any moment they deem fit. However, the mandate of the people of Jammu and Kashmir must be respected, and statehood should be restored as soon as possible so that the elected government can function.”\n\nThe first Assembly session is set to be held on November 4, which will be the first session for the UT, and traditionally, it has been said that this will be a session that will last four to five days with question-answer rounds involving the Assembly members, he added.\n\n“It will be a kind of inaugural function held and no business will take place inside the Assembly. The debate will only be held over the Budget session over which question-answer rounds will be held,” the NC leader said.",
        "summary": "Jammu, Oct 31 (IANS) As the newly-elected Omar Abdullah-led National Conference (NC) government in Jammu and Kashmir promised to boycott the Union Territory (UT) Foundation Day on Thursday, senior party leader Sheikh Bashir Ahmad called it a day of &#8220;humiliation&#8221; for people of J&#38;K. At the same time, Bashir Ahmad also extended Diwali greetings to [&#8230;]",
        "url": "https://bhaskarlive.in/no-reason-to-celebrate-nc-leader-on-jk-ut-foundation-day/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410313252463.JPG?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 08:08:04",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.14
    },
    {
        "id": 261770542,
        "title": "VBA chief Prakash Ambedkar rushed to Pune hospital after chest pains, undergoes angiography",
        "text": "Pune, Oct.31 (IANS) Vanchit Bahujan Aghadi (VBA) President Prakash Y. Ambedkar was admitted to a hospital here following intense chest pains, his close aides said on Thursday. \n\nHe was taken to the intensive care unit and underwent an angiography for a suspected blood clot in his heart, but his condition is stable now, said VBA chief spokesperson Siddharth Mokle.\n\n“An angiography has been done and its report is awaited. Thereafter, the medical team will decide on the next course of treatment in consultation with his family members,” Mokle told IANS.\n\nHowever, Ambedkar is likely to remain under medical observation at the hospital for the next three to five days, and the Ambedkar family has requested privacy in the matter.\n\nThis is the second time in barely three years that Ambedkar, 70 – the grandson of the Chief Architect of the Indian Constitution Dr B. R. Ambedkar – has been afflicted by a cardiac-related problem.\n\nIn July 2021, he had undergone emergency heart surgery at a Pune hospital. He was out of action for many weeks after the surgery.\n\nThe latest developments came even as he was busy spearheading the VBA for a big poll fight in the November 20 Maharashtra Assembly elections.\n\nMeanwhile, Mokle said that in his absence, VBA state President Rekha Thakur will be leading the party’s election campaign, along with the Election Coordination Committee and the Media and Research Department.\n\nThe VBA – which failed to open its account in the 2024 Lok Sabha elections for 48 seats in the state – is contesting in a majority of the 288 Assembly constituencies. It has entered into friendly tie-ups with certain groups and smaller parties to give a tough fight to the ruling MahaYuti and opposition Maha Vikas Aghadi alliances.",
        "summary": "Pune, Oct.31 (IANS) Vanchit Bahujan Aghadi (VBA) President Prakash Y. Ambedkar was admitted to a hospital here following intense chest pains, his close aides said on Thursday. He was taken to the intensive care unit and underwent an angiography for a suspected blood clot in his heart, but his condition is stable now, said VBA [&#8230;]",
        "url": "https://bhaskarlive.in/vba-chief-prakash-ambedkar-rushed-to-pune-hospital-after-chest-pains-undergoes-angiography/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202408283213314.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-31 08:29:02",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.208
    }
]