[
    {
        "id": 260223256,
        "title": "Baba Siddique murder: 5 more nabbed from Raigad, sent to police custody for a week",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Mumbai, Oct 18 (IANS) The Mumbai Police Crime Branch has arrested five more persons in connection with the killing of ruling Nationalist Congress Party (NCP) leader and businessman Baba Ziauddin Siddique in Bandra on October 12, officials said on Friday. With this, the total number of suspects arrested has gone up to nine. The arrests [&#8230;]",
        "url": "https://bhaskarlive.in/baba-siddique-murder-5-more-nabbed-from-raigad-sent-to-police-custody-for-a-week/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410133242269.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 15:47:59",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260223254,
        "title": "Jitan Ram Manjhi disappointed over Jharkhand seat-sharing arrangement",
        "text": "Patna, Oct 18 (IANS) Union MSME Minister Jitan Ram Manjhi expressed disappointment on Friday after his party, Hindustani Awam Morcha Secular (HAM-S), was not allotted any seats in the NDA’s seat-sharing arrangement for the upcoming Jharkhand Assembly elections.\n\nDespite his party’s demand for representation, the BJP did not offer HAM-S any seat.\n\nThe NDA seat-sharing formula was announced by Himanta Biswa Sarma, BJP’s in-charge for Jharkhand and the Chief Minister of Assam, in Ranchi.\n\nAccording to the arrangement, the BJP will contest 68 seats, the All Jharkhand Students Union (AJSU) will contest 10 seats, JD-U has been given 2 seats, and Chirag Paswan’s Lok Janshakti Party Ram Vilas (LJPRV) will contest 1 seat.\n\nWhen asked about HAM-S’s exclusion from the seat allocation, Manjhi stated, “My party had initially requested 10 seats, which was later reduced to five and finally three as a compromise, but none were granted.”\n\nHowever, Manjhi reaffirmed his commitment to the NDA saying, “I am a true soldier of the NDA, and I will remain part of it.” \n\nHe noted that during the Lok Sabha elections, his party contributed to the NDA by securing just one seat, but in return, Prime Minister Narendra Modi rewarded him with a cabinet position. \n\n“So, it happens in seat sharing,” Manjhi said.\n\nThe seat-sharing formula also dealt a blow to another NDA partner, the JD-U.\n\nKhiru Mahto, the state president of the JD-U and Rajya Sabha MP had claimed that his party would contest 11 seats in Jharkhand and was negotiating with BJP leaders. \n\nHowever, despite the discussions, the BJP ultimately allotted only 2 seats to the JD-U, creating a sense of disappointment within the party ranks.\n\nThe LJPRV, led by Chirag Paswan, was given 1 seat in the alliance, with the BJP keen on leveraging Paswan’s popularity among the Dalit community in Jharkhand.\n\nChirag Paswan had delivered a strong performance in the Lok Sabha elections in Bihar, winning all five seats his party contested. The BJP now plans to utilise Paswan as a star campaigner for the Jharkhand elections, hoping to replicate his success in appealing to Dalit voters.\n\nPolling in Jharkhand is scheduled in two stages on November 13 and November 20, with the results to be declared on November 23.",
        "summary": "Patna, Oct 18 (IANS) Union MSME Minister Jitan Ram Manjhi expressed disappointment on Friday after his party, Hindustani Awam Morcha Secular (HAM-S), was not allotted any seats in the NDA&#8217;s seat-sharing arrangement for the upcoming Jharkhand Assembly elections. Despite his party&#8217;s demand for representation, the BJP did not offer HAM-S any seat. The NDA seat-sharing [&#8230;]",
        "url": "https://bhaskarlive.in/jitan-ram-manjhi-disappointed-over-jharkhand-seat-sharing-arrangement/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410183245439.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 15:42:30",
        "author": "Himanta Biswa Sarma,IANS",
        "authors": [
            "Himanta Biswa Sarma",
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.089
    },
    {
        "id": 260223260,
        "title": "Telangana HC dismisses petitions for postponing Group-I Mains exam",
        "text": "Hyderabad, Oct 18 (IANS) Clearing decks for the Telangana Public Service Commission Group-1 Main examination, the Telangana High Court on Friday dismissed two petitions challenging the order of its single judge bench, refusing to order postponement of the exam.\n\nA division bench declined to pass orders to the Telangana Public Service Commission (TGSPSC) to postpone the examination, scheduled to begin on October 21.\n\nThe High Court has made biometric attendance mandatory for the candidates.\n\nA single-judge bench on October 15 dismissed the petitions of some candidates for postponement of the exams.\n\nMeanwhile, a section of the candidates continued their protest demanding the government to postpone the exams, citing the short time for preparation and demanding revision of a Government Order that tweaked the reservation policy.\n\nSome candidates have also approached the Supreme Court, seeking direction to the Telangana government and the TGSPSC to defer the exams. The candidates demanding the postponement of exams argue that GO 29 will rearrange the prelims list upside down. About 22 cases challenging the GO are pending in the High Court. They say that the GO tweaked the reservation policy and this would limit the chances of candidates from reserved categories.\n\nThe Group-I Main exams to fill 563 posts in various departments are scheduled to be held from October 21 to 27.\n\nGoing ahead with the conduct of the examination, authorities reviewed preparations. Chief Secretary Santhi Kumari held a meeting with officials of various departments and directed them to make fool-proof arrangements. A total of 31,383 candidates will appear in the exam to be conducted at 46 centres in Hyderabad, Rangareddy, and Medchal Malkajgiri districts.\n\nThe candidates qualified for the Group-1 Mains examination out of around 3.02 lakh who appeared for the preliminary examination held in June. The Group-1 prelims have been marred by controversies over paper leaks and legal battles for not following the norms and irregularities in 2022 and 2023. The Chief Secretary directed officials to make necessary security arrangements around the exam centres to prevent any irregularities or untoward incidents. TGSPSC Chairman Mahender Reddy said that since Group-I Mains are being held for the first time since 2011, the officials should take all precautions to ensure smooth conduct of the exam.",
        "summary": "Hyderabad, Oct 18 (IANS) Clearing decks for the Telangana Public Service Commission Group-1 Main examination, the Telangana High Court on Friday dismissed two petitions challenging the order of its single judge bench, refusing to order postponement of the exam. A division bench declined to pass orders to the Telangana Public Service Commission (TGSPSC) to postpone [&#8230;]",
        "url": "https://bhaskarlive.in/telangana-hc-dismisses-petitions-for-postponing-group-i-mains-exam/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/aa7383d826513147eeb45a0f811833f2.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 16:24:05",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.249
    },
    {
        "id": 260223258,
        "title": "Nitish Kumar inspects multi-level parking & subways in Patna",
        "text": "Patna, Oct 18 (IANS) Bihar Chief Minister Nitish Kumar inspected the construction of the multi-level parking and subways near Patna Junction railway station on Friday.\n\nThe project, aimed at easing congestion in the heavily crowded area, is underway near the Patna GPO and will have the capacity to accommodate 32 buses and 225 cars.\n\nDuring the inspection, the Secretary of Urban Development and Housing briefed the Chief Minister on the progress.\n\n“The multi-level parking facility will be directly connected to subways leading to Patna Junction, the Hanuman Temple, and Buddha Smriti Park. The primary goal is to decongest the area and develop it into a transportation hub. This will allow people to park their private vehicles, three-wheelers, buses, and taxis with ease,” said the Secretary.\n\nChief Minister Nitish Kumar visited all three floors of the parking structure and directed the officials to expedite the completion of the project.\n\nThe multi-level parking project near Patna Junction is designed to be energy-efficient, with a solar power system installed on the rooftop to meet the electricity requirements of the facility.\n\nThe Secretary elaborated that the parking area is located 440 meters from Patna Junction and will feature four travel ways of varying lengths—18 meters, 30 meters, 45 meters, and 55 meters—to facilitate easy movement of people between the parking and key locations.\n\nThe facility will also include two escalators and two underground box area lifts for added convenience.\n\n“One lift and one escalator will be installed at the car parking area, and another set will be placed near the Hanuman temple. The subways connecting the parking area to nearby landmarks, such as Patna Junction and Buddha Smriti Park, will be equipped with ventilation and air conditioning systems to ensure a comfortable environment for users,” said the Secretary.\n\nDuring the inspection, the Chief Minister was accompanied by Water Resource Minister Vijay Kumar Chaudhary, Urban Development Minister Nitin Nabin, Principal Secretary to the Chief Minister, Patna Divisional Commissioner, Patna District Magistrate, Patna SSP, president of Bihar Rajya Pul Nirman Nigam Limited Shirsat and Patna Municipal Commissioner.",
        "summary": "Patna, Oct 18 (IANS) Bihar Chief Minister Nitish Kumar inspected the construction of the multi-level parking and subways near Patna Junction railway station on Friday. The project, aimed at easing congestion in the heavily crowded area, is underway near the Patna GPO and will have the capacity to accommodate 32 buses and 225 cars. During [&#8230;]",
        "url": "https://bhaskarlive.in/nitish-kumar-inspects-multi-level-parking-subways-in-patna/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410183245451.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 15:57:13",
        "author": "IANS,Water Resource Minister",
        "authors": [
            "IANS",
            "Water Resource Minister"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.351
    },
    {
        "id": 260223262,
        "title": "MoS Margherita to represent India at Indonesian President’s inauguration ceremony ​",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "New Delhi, Oct 18 (IANS) Minister of State for External Affairs Pabitra Margherita will be on an official visit to Indonesia from Saturday to attend the Inauguration Ceremony of President Prabowo Subianto and Vice President Gibran Rakabuming Raka in Jakarta on October 20, the Ministry of External Affairs said. The MEA said that 2024 is [&#8230;]",
        "url": "https://bhaskarlive.in/mos-margherita-to-represent-india-at-indonesian-presidents-inauguration-ceremony/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202404243151590.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 16:15:35",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260223266,
        "title": "Odisha H&FW orders probe into organ theft allegations against private hospital",
        "text": "Bhubaneswar, Oct 18 (IANS) Odisha Health and Family Welfare (H&FW) Minister Mukesh Mahaling on Friday ordered a probe into the allegations of organ theft labelled against a private hospital in Cuttack.\n\n“After the news about the allegations came to the fore, the officials of the H&FW department were immediately asked to conduct a departmental probe into the matter. The officials are carrying out a detailed probe and action will be taken following the receipt of the report,” said Mahaling.\n\nThe H&FW minister also told the media persons that the Bhubaneswar-Cuttack Commissionerate police are also investigating the matter.\n\nThe deceased identified as Babula Diggal, a resident of Tikarbaju village under Baliguda police limits in Kandhamal district met with an accident while travelling with wife and son by a motorcycle on October 13.\n\nHe was immediately rushed to a local hospital where the doctors referred him to MKCG Medical College and Hospital in Berhampur. Babula was later referred to AIIMS, Bhubaneswar for further treatment.\n\nMeanwhile, the family admitted a seriously injured Babula to the private hospital in Cuttack as per the suggestions of the ambulance driver on October 15. The seriously injured Babula succumbed while undergoing treatment at the hospital on October 16.\n\nThe family members also alleged that after the hospital authorities informed about the death of Babula they urged the doctors there to conduct the post mortem which the doctors denied. While on their way home, the family members were shocked to find the stitch marks on the stomach of the deceased as he suffered injuries on his head. The family members alleged that the doctors in the private hospital had removed some organs from the body of the deceased.\n\nThe family members stated that they had paid Rs 70,000 initially and Rs 30,000 after the completion of the surgery.\n\nBased on a complaint lodged by the deceased’s family members, the Baliguda police registered a case and launched a probe in this regard.\n\nThe police on Friday exhumed the body of Babula and sent it for autopsy to find out whether any body part was missing or not. A team of Commissionerate police also visited the private hospital in Cuttack to investigate the organ theft allegations. \n\nOn the other hand, the manager of the concerned hospital Sushant Behera on Friday denied the allegations of organ theft and said that the hospital will cooperate in the investigation.",
        "summary": "Bhubaneswar, Oct 18 (IANS) Odisha Health and Family Welfare (H&#38;FW) Minister Mukesh Mahaling on Friday ordered a probe into the allegations of organ theft labelled against a private hospital in Cuttack. “After the news about the allegations came to the fore, the officials of the H&#38;FW department were immediately asked to conduct a departmental probe [&#8230;]",
        "url": "https://bhaskarlive.in/odisha-hfw-orders-probe-into-organ-theft-allegations-against-private-hospital/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410183245445.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 15:46:27",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.699
    },
    {
        "id": 260223270,
        "title": "SC asks Abbas Ansari to petition Allahabad HC for bail in Gangsters Act case, allows bail in unlawful visit case (Lead)",
        "text": "New Delhi, Oct 18 (IANS) The Supreme Court on Friday disposed of Suheldev Bhartiya Samaj Party (SBSP) MLA Abbas Ansari’s plea against the Uttar Pradesh Police slapping the stringent Gangster Act on him. \n\nA bench, headed by Justice Surya Kant, asked Abbas Ansari, son of late gangster-turned-politician Mukhtar Ansari, to first approach the Allahabad High Court for the grant of bail.\n\nThe Bench, also comprising Justice Ujjal Bhuyan, asked the Allahabad HC to decide the bail application on a priority basis, positively within a period of four weeks, considering the fact that Abbas Ansari has been incarcerated “for a reasonably long period” in other cases.\n\n“Registry of the High Court is directed to place this order before the Hon’ble Chief Justice of the High Court so that the bail application to be moved by the petitioner can be listed before the appropriate Bench to ensure compliance of the time-line mentioned above,” ordered the apex court.\n\nIt granted liberty to Abbas Ansari to revive his petition before the Supreme Court in the event of any delay due to unforeseen circumstances.\n\nAt the same time, the Justice Surya Kant-led Bench allowed another plea filed by Abbas Ansari seeking bail in connection with the unlawful jail visit case.\n\nAbbas Ansari, when lodged at Chitrakoot jail, was caught meeting his wife Nikhat illegally in the jail in connivance with jail officials. In May, the Allahabad High Court had declined to grant bail to Abbas Ansari, considering his “profile and the background and family antecedents”.\n\nThe Supreme Court granted bail to Abbas Ansari in the unlawful visit case, having regard to the fact that the investigation is complete, the charge sheet has already been filed and he has been in custody for more than 1.5 years and the conclusion of the trial will take some reasonable time. Without expressing any opinion on the merits of the case, the apex court ordered Abbas Ansari to be released on bail subject to his furnishing bail bonds to the satisfaction of the trial court.\n\n“The petitioner shall fully cooperate with the trial proceedings and shall remain present in Court on each and every date of hearing unless granted exemption from personal appearance,” the SC said.\n\nEarlier in the day, a bench headed by Justice M.M. Sundresh granted bail to the sitting MLA from Uttar Pradesh’s Mau in connection with a money laundering case lodged by the Enforcement Directorate (ED). The Bench, also comprising Justice Pankaj Mithal, set aside the May 9 order of the Allahabad High Court rejecting his bail application and ordered the petitioner to be released on bail on such conditions as may be imposed by the trial court.\n\nThe apex court said that the trial court will impose conditions so that the accused cannot influence witnesses or tamper with evidence. However, with the disposal of the plea seeking bail in the Gangsters Act, Abbas Ansari will remain in jail unless granted relief by the Allahabad High Court.",
        "summary": "New Delhi, Oct 18 (IANS) The Supreme Court on Friday disposed of Suheldev Bhartiya Samaj Party (SBSP) MLA Abbas Ansari&#8217;s plea against the Uttar Pradesh Police slapping the stringent Gangster Act on him. A bench, headed by Justice Surya Kant, asked Abbas Ansari, son of late gangster-turned-politician Mukhtar Ansari, to first approach the Allahabad High [&#8230;]",
        "url": "https://bhaskarlive.in/sc-asks-abbas-ansari-to-petition-allahabad-hc-for-bail-in-gangsters-act-case-allows-bail-in-unlawful-visit-case-lead/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202404103144790.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-18 15:54:16",
        "author": "IANS,Justice Surya Kant",
        "authors": [
            "IANS",
            "Justice Surya Kant"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.064
    },
    {
        "id": 260925444,
        "title": "Basavaraj Bommai’s son files nomination for K’taka Assembly bypolls",
        "text": "Haveri, Oct 24 (IANS) Bharat Bommai, son of former Chief Minister and BJP MP Basavaraj Bommai, filed his nomination as a BJP candidate from Shiggaon Assembly constituency in Karnataka on Thursday.\n\n“I submitted my nomination at an auspicious time following my mother’s guidance. I will submit another set of nominations on Friday,” said Bharat Bommai while talking to media persons after filing his nomination in Shiggaon town.\n\nBharat said that people have blessed his father always and requested that people to bless him as well just like they have done with his father.\n\n“I will work for the welfare of the poor, youth, and women. If victorious, I would share details of various initiatives to be implemented in the coming days,” said Bharat.\n\nMeanwhile, Congress is expected to finalise the candidate for the Shiggaon Assembly constituency seat by Thursday evening. The district in charge Minister Zameer Ahmad Khan has demanded a ticket for a Muslim candidate. However, the local leaders have maintained that fielding a Muslim candidate will result in BJP’s victory and the ticket must be given to a Hindu leader.\n\nHowever, sources said there are demands for fielding Congress MLA Vinay Kulkarni’s daughter from the constituency to stop the polarisation of Lingayat and Hindu votes.\n\n“I don’t know the reasons for the delay. An internal survey is going on. We are looking at what will benefit us politically,” Deputy Chief Minister D.K. Shivakumar said.\n\nKarnataka Home Minister G. Parameshwara said the screening committee is collecting all information.\n\n“The final decision is made on the winnability and it is the criterion. Based on the party workers’ opinion, a candidate would be selected,” he said.\n\nHowever, former Congress MP D.K. Suresh said that there is nothing wrong if Minister Zameer is demanding a ticket for a Muslim candidate.\n\n“Naturally, in the interest of his community, he will raise the voice,” he added.",
        "summary": "Haveri, Oct 24 (IANS) Bharat Bommai, son of former Chief Minister and BJP MP Basavaraj Bommai, filed his nomination as a BJP candidate from Shiggaon Assembly constituency in Karnataka on Thursday. “I submitted my nomination at an auspicious time following my mother’s guidance. I will submit another set of nominations on Friday,” said Bharat Bommai [&#8230;]\n\n\nThe post Basavaraj Bommai’s son files nomination for K’taka Assembly bypolls appeared first on Bhaskar Live.",
        "url": "https://bhaskarlive.in/basavaraj-bommais-son-files-nomination-for-ktaka-assembly-bypolls/",
        "image": "https://iansportalimages.s3.amazonaws.com/thumbnails/202410243248773.jpg",
        "video": null,
        "publish_date": "2024-10-24 10:37:43",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.206
    },
    {
        "id": 260925448,
        "title": "Man kills wife by pushing her off roof, arrested in Gurugram",
        "text": "Gurugram, Oct 24 (IANS) A man has been arrested on the charges of killing his wife by pushing her off a roof in Gurugram, police said.\n\nThe accused had also tried to mislead the family of the deceased and the police by saying that the victim died due to slipping and falling.\n\nAccording to the police, on the intervening night of October 22 and 23, they received information regarding the death of a woman.\n\nUpon information, the police team reached SGT Hospital Budhera and after inspecting the body, they sent it to the mortuary for an autopsy.\n\nThe accused, Dharam Singh alias Dharmu (32), pushed his wife Geeta (28) off the roof after an argument with her over consuming drugs.\n\nMeanwhile, the victim’s father told the police that Geeta was beaten by her husband Dharmu, a native of Dausa, Rajasthan.\n\nHe alleged that On October 22, her daughter’s husband, Dharam, killed her by pushing her off the roof of the Wazirpur area, Gurugram.\n\nActing on the complaint of Geeta’s father, a case of murder was registered under the relevant sections at the Sector-10A police station, Gurugram.\n\nDuring the investigation, Sandeep Kumar, Station House Officer (SHO) of Sector-10 A police station, along with his team, nabbed the accused from Garhi Harsaru village on Wednesday.\n\nDuring interrogation, it was found that the accused works as a bike repairer in Garhi Harsaru village.\n\n“The accused used to beat his wife. On October 22, the accused was consuming drugs in an old building when his wife reached, and they fought. After this, the accused thrashed his wife and pushed her off the roof, leading to her death,” Sandeep Kumar said.\n\nDuring interrogation, the accused also revealed that after committing the crime, he tried to mislead his in-laws, saying that Geeta slipped and fell.\n\nAn investigation was underway.",
        "summary": "Gurugram, Oct 24 (IANS) A man has been arrested on the charges of killing his wife by pushing her off a roof in Gurugram, police said. The accused had also tried to mislead the family of the deceased and the police by saying that the victim died due to slipping and falling. According to the [&#8230;]\n\n\nThe post Man kills wife by pushing her off roof, arrested in Gurugram appeared first on Bhaskar Live.",
        "url": "https://bhaskarlive.in/man-kills-wife-by-pushing-her-off-roof-arrested-in-gurugram/",
        "image": "https://iansportalimages.s3.amazonaws.com/thumbnails/202410243248755.jpg",
        "video": null,
        "publish_date": "2024-10-24 10:40:21",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.556
    },
    {
        "id": 260925446,
        "title": "TN: Fraudulent online firecracker sales dupe public ahead of Deepavali",
        "text": "Chennai, Oct 24 (IANS) As Deepavali is approaching, firecracker sales are booming in Tamil Nadu while many online sites advertising firecrackers are duping the gullible public. \n\nAccording to the firecracker industry, scammers are exploiting the festive season by offering big discounts, especially on crackers. Industry sources told IANS that several complaints of fraudulent operators cheating people have surfaced. \n\nThe Tamil Nadu Cyber Police has already warned people about online cracker sale fraud, with several dubious websites offering freebies. \n\nPolice said that 17 cases have already been registered on the National Cyber Crime Reporting Portal (www.cybercrime.gov.in). \n\nAccording to the police, scammers create websites that appear genuine. The cybercrime wing of the Tamil Nadu Police has cautioned people about these fraudulent schemes, where dubious websites offer crackers at discounted rates but abscond with the money.\n\nPolice said scammers prey on festive enthusiasm by creating fake social media advertisements on popular platforms.\n\nThese advertisements often promote significant discounts on firecrackers or other festive items, luring unsuspecting buyers. \n\nThe cyber cell also reported that scammers design attractive advertisements promoting discounted crackers. Victims contact scammers via WhatsApp, phone calls, or through fake websites that look legitimate but are designed to steal money. \n\nAccording to the Tamil Nadu Cyber Cell Police, these fraudulent sites often display authentic-looking product catalogues, prices, and payment options. \n\nThese sites may request payment for crackers at discounted prices, but once payment is made, victims are deceived, and the scammers disappear without delivering the crackers. \n\nThe police also warned that those who attempt to purchase crackers online may compromise their security by sharing personal financial information.\n\nR. Sakthivel, owner of a firecracker manufacturing company based in Virudhunagar, told IANS that there are several fly-by-night operators who dupe the public. \n\n“Deepavali firecrackers are available in all small areas of Tamil Nadu in licensed shops. It is up to the public to decide whether they want genuine firecrackers from these licensed shops or risk being duped by fraudulent operators,” he said. \n\nHe also added that the police and government should conduct proper awareness campaigns to inform the public about these scammers who take advantage of gullible people and steal their money during one of the biggest festivals. \n\nVirudhunagar district in Tamil Nadu has an annual turnover of Rs 6,000 crore, with crackers being supplied across the country.",
        "summary": "Chennai, Oct 24 (IANS) As Deepavali is approaching, firecracker sales are booming in Tamil Nadu while many online sites advertising firecrackers are duping the gullible public. According to the firecracker industry, scammers are exploiting the festive season by offering big discounts, especially on crackers. Industry sources told IANS that several complaints of fraudulent operators cheating [&#8230;]\n\n\nThe post TN: Fraudulent online firecracker sales dupe public ahead of Deepavali appeared first on Bhaskar Live.",
        "url": "https://bhaskarlive.in/tn-fraudulent-online-firecracker-sales-dupe-public-ahead-of-deepavali/",
        "image": "https://iansportalimages.s3.amazonaws.com/thumbnails/202410243248763.jpg",
        "video": null,
        "publish_date": "2024-10-24 10:47:26",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.424
    },
    {
        "id": 260925452,
        "title": "Afghanistan produces 2,200 tonnes of honey annually",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Kandhar, Oct 24 (IANS) Afghanistan produces 2,200 tonnes of honey annually and efforts are underway to increase the amount in future. The spokesman for the Ministry of Agriculture, Irrigation and Livestock Mawlawi Musbahudin Mustain said so on Wednesday. &#8220;There are 3,397 bee farms in the country, which produce 2,200 tonnes of honey annually,&#8221; Mustain told [&#8230;]\n\n\nThe post Afghanistan produces 2,200 tonnes of honey annually appeared first on Bhaskar Live.",
        "url": "https://bhaskarlive.in/afghanistan-produces-2200-tonnes-of-honey-annually/",
        "image": "https://iansportalimages.s3.amazonaws.com/thumbnails/d7cf4981492850186b92c9b128887119.jpg",
        "video": null,
        "publish_date": "2024-10-24 10:42:23",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260925450,
        "title": "Israel strikes Hezbollah weapon facilities in Beirut’s southern suburb: IDF",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Jerusalem, Oct 24 (IANS) The Israel Defense Forces (IDF) said in a statement on Thursday that its Air Force struck overnight Hezbollah weapons storage and manufacturing facilities in Beirut&#8217;s southern suburb of Dahieh. The statement added that the attack was conducted with intelligence guidance, and that all targeted sites were situated under or within civilian [&#8230;]\n\n\nThe post Israel strikes Hezbollah weapon facilities in Beirut&#8217;s southern suburb: IDF appeared first on Bhaskar Live.",
        "url": "https://bhaskarlive.in/israel-strikes-hezbollah-weapon-facilities-in-beiruts-southern-suburb-idf/",
        "image": "https://iansportalimages.s3.amazonaws.com/thumbnails/202410093239407.jpg",
        "video": null,
        "publish_date": "2024-10-24 10:53:22",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260925454,
        "title": "Bihar: Deepa Manjhi files nomination for Imamganj bypolls",
        "text": "Patna, Oct 24 (IANS) Deepa Manjhi, the candidate for the Hindustani Awam Morcha Secular (HAMS), filed her nomination for the Imamganj reserved seat by-election on Thursday.\n\nAccompanied by her father-in-law, Union MSME Minister Jitan Ram Manjhi, she submitted her nomination at the SDM’s office.\n\nJitan Ram Manjhi has faced criticism for promoting dynastic politics in Bihar, as his daughter-in-law is being fielded for the election.\n\nHowever, he defended the decision, stating that Deepa is a committed and hardworking individual, emphasising her qualifications beyond family ties.\n\n“She has been actively involved in politics, having previously served as a Zila Parishad member and narrowly losing the election for Zila Parishad President by just two votes. At that time, she was not married,” Majhi said.\n\nHe highlighted her dedication to social work, stressing that she is a dedicated worker first and then his daughter-in-law second.\n\nManjhi also spoke about the positive changes in the Imamganj constituency, stating that before 2015, the area was riddled with violence, including bomb blasts and false legal cases, which made it unsafe for people.\n\nHe credited the peace and security in the region to his tenure as an MLA, expressing confidence that Deepa Manjhi faces no serious electoral challenge in the upcoming by-election.\n\nAfter the nomination, Deepa Manjhi emphasised her commitment to continue the work initiated by her father-in-law, Jitan Ram Manjhi in the constituency.\n\n“We are receiving widespread support from the people and I promise to address the remaining issues in the constituency. I would focus on development, particularly on women’s empowerment, creating small employment opportunities, and improving education,” Deepa Manjhi said.\n\nOne of her main priorities will be addressing the lack of adequate medical facilities in the area, stating that there is a need for a better hospital to provide quality treatment. \n\n“My father-in-law Jitan Ram Manjhi made significant progress during his tenure, Despite that, there is still work to be done, and I intend to fulfil his unfinished dreams,” she said.\n\nDeepa Manjhi assured the public that efforts have already been made to improve the situation in Imamganj, particularly in terms of peace and development. \n\nShe also dismissed rumours about dissatisfaction among party workers, attributing such claims to opposition propaganda.",
        "summary": "Patna, Oct 24 (IANS) Deepa Manjhi, the candidate for the Hindustani Awam Morcha Secular (HAMS), filed her nomination for the Imamganj reserved seat by-election on Thursday. Accompanied by her father-in-law, Union MSME Minister Jitan Ram Manjhi, she submitted her nomination at the SDM&#8217;s office. Jitan Ram Manjhi has faced criticism for promoting dynastic politics in [&#8230;]\n\n\nThe post Bihar: Deepa Manjhi files nomination for Imamganj bypolls appeared first on Bhaskar Live.",
        "url": "https://bhaskarlive.in/bihar-deepa-manjhi-files-nomination-for-imamganj-bypolls/",
        "image": "https://iansportalimages.s3.amazonaws.com/thumbnails/202410243248774.jpg",
        "video": null,
        "publish_date": "2024-10-24 11:00:00",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.396
    },
    {
        "id": 260925458,
        "title": "SC declines to initiate contempt action against UP officials for defying freeze on demolitions",
        "text": "New Delhi, Oct 24 (IANS) The Supreme Court on Thursday refused to initiate contempt action against authorities in Uttar Pradesh for allegedly defying its September 17 order freezing demolition action nationwide. \n\nA bench, headed by Justice B.R. Gavai, refused to entertain the plea filed by an NGO, remarking that entertaining a contempt plea on the basis of newspaper reports may open Pandora’s box.\n\nThe apex court suggested that it could have entertained the plea for contempt action had it been instituted by an affected individual.\n\nAdditional Solicitor General K.M. Nataraj, representing the UP government, said that demolition was carried out to remove encroachments on footpaths and the plea was filed by a third-party organisation on the basis of newspaper reports.\n\nThe Supreme Court, in an interim order passed on September 17, directed that no demolition will take place anywhere across the country except without its permission after several petitions were filed before the apex court alleging that bulldozer action was taken by various state authorities without sufficient notice. However, the top court clarified that its “order would not be applicable if there is an unauthorised structure in any public place such as road, street, footpath, abutting railway line or any river body or water bodies and also to cases where there is an order for demolition made by a court”.\n\nLast week, the top court refused to entertain a public interest litigation (PIL) seeking direction to recover from administrative authorities the costs of bulldozed houses of individuals accused of criminal activities, riots, or other offences. The Justice Gavai-led Bench said that it could not reopen the issue as it had already reserved its decision on laying down pan-India directives governing demolitions.\n\n“Either you withdraw it, or we will reject it,” it told the PIL litigant.\n\nSensing the disclination of the top court to entertain the matter, the petitioner’s counsel chose to withdraw the plea. The PIL sought direction to make it mandatory to obtain permission from the jurisdictional District Judge before the start of the demolition process of any house, jhuggi or colony, apart from serving notice on the alleged unauthorised or illegal occupant. Further, it sought direction to publish a list of demolished houses district- and state-wise, along with names of DM, SDM, and SP/DCP concerned.",
        "summary": "New Delhi, Oct 24 (IANS) The Supreme Court on Thursday refused to initiate contempt action against authorities in Uttar Pradesh for allegedly defying its September 17 order freezing demolition action nationwide. A bench, headed by Justice B.R. Gavai, refused to entertain the plea filed by an NGO, remarking that entertaining a contempt plea on the [&#8230;]\n\n\nThe post SC declines to initiate contempt action against UP officials for defying freeze on demolitions appeared first on Bhaskar Live.",
        "url": "https://bhaskarlive.in/sc-declines-to-initiate-contempt-action-against-up-officials-for-defying-freeze-on-demolitions/",
        "image": "https://iansportalimages.s3.amazonaws.com/thumbnails/202311220345.jpg",
        "video": null,
        "publish_date": "2024-10-24 10:37:24",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.417
    },
    {
        "id": 260925456,
        "title": "Keeping Kharge out during Priyanka’s nomination an insult to Dalits: Pralhad Joshi",
        "text": "New Delhi, Oct 24 (IANS) Union Minister for Consumer Affairs, Food and Public Distribution Pralhad Joshi criticised the Congress on Thursday, saying that the party disrespected its own president, Mallikarjun Kharge, during Priyanka Gandhi’s nomination process in Wayanad by keeping him out of the process. \n\n“During Priyanka Gandhi’s nomination submission for the Congress ticket, the high command of the Congress humiliated Kharge by excluding him which exposed their behaviour,” the Union Minister told media persons.\n\nHe said that to align with the “fake Gandhi family,” even the Congress President had to wait in line, highlighting the current state of non-Gandhi Congress leaders in the party.\n\nThe BJP has accused Congress of “disrespecting” Mallikarjun Kharge after a video showed the party chief waiting outside a room where Priyanka Gandhi was filing her nomination papers.\n\nA section of social media users, however, responded by posting pictures of Kharge with Sonia Gandhi and Rahul Gandhi during the nomination filing process.\n\nUnion Minister said that Prime Minister Narendra Modi has announced a compensation of Rs 2 lakh each to the families of the workers who lost their lives in the under-construction building collapse in Bengaluru.\n\nHe also stated that the Prime Minister has announced Rs 50,000 for each of the injured workers in this tragic incident.\n\nExpressing deep sorrow over the building tragedy, Prime Minister Narendra Modi has extended support to the families affected by the disaster, Joshi said.\n\nFrom the Prime Minister’s National Relief Fund, Rs 2 lakh each will be given to the families of the eight workers who died in the building collapse and Rs 50,000 each to the six injured workers, Modi announced.\n\nThe building collapsed on Tuesday in which eight people were killed and 13 others were rescued. Of the 13 rescued, six were injured and admitted to hospital.\n\nKarnataka Chief Minister Siddaramaiah on Thursday announced Rs 5 lakh compensation to the families of each deceased person. The authorities will make all possible efforts to send the dead bodies to their respective places, he stated. The deceased hailed from Bihar, Andhra Pradesh and north Karnataka region.",
        "summary": "New Delhi, Oct 24 (IANS) Union Minister for Consumer Affairs, Food and Public Distribution Pralhad Joshi criticised the Congress on Thursday, saying that the party disrespected its own president, Mallikarjun Kharge, during Priyanka Gandhi’s nomination process in Wayanad by keeping him out of the process. “During Priyanka Gandhi’s nomination submission for the Congress ticket, the [&#8230;]\n\n\nThe post Keeping Kharge out during Priyanka’s nomination an insult to Dalits: Pralhad Joshi appeared first on Bhaskar Live.",
        "url": "https://bhaskarlive.in/keeping-kharge-out-during-priyankas-nomination-an-insult-to-dalits-pralhad-joshi/",
        "image": "https://iansportalimages.s3.amazonaws.com/thumbnails/202410243248785.jpeg",
        "video": null,
        "publish_date": "2024-10-24 11:14:39",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.326
    },
    {
        "id": 260925460,
        "title": "Cabinet okays 2 railways projects worth Rs 6,798 crore",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "New Delhi, Oct 24 (IANS) The Cabinet Committee on Economic Affairs (CCEA) on Thursday approved two railway projects with an estimated cost of Rs 6,798 crore. The projects will be completed in five years to provide connectivity, facilitate ease of travelling, minimise logistics costs, reduce oil imports, and lower CO2 emissions, said the CCEA, chaired [&#8230;]\n\n\nThe post Cabinet okays 2 railways projects worth Rs 6,798 crore appeared first on Bhaskar Live.",
        "url": "https://bhaskarlive.in/cabinet-okays-2-railways-projects-worth-rs-6798-crore/",
        "image": "https://iansportalimages.s3.amazonaws.com/thumbnails/202410243248768.jpg",
        "video": null,
        "publish_date": "2024-10-24 10:49:00",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    }
]