[
    {
        "id": 263562756,
        "title": "Kannangattu Kadavu bridge construction: compensation disbursal begins",
        "text": "Compensation disbursal to landowners displaced by the construction of Kannangattu Kadavu bridge began on Friday with Kovoor Kunjumon, MLA, handing over the documents to beneficiaries at a meeting held at the chamber of the District Collector. \n\nThe money was given to those who lost land, buildings, business establishments, and jobs as part of the land acquisition for the construction of the bridge and connecting roads. The bridge across the Kallada river connecting Munroe Thuruthu and West Kallada will be built using the Kerala Infrastructure Investment Fund Board (KIIFB) fund. \n\nFor the project, 54.55 ars (01 acre 34.739 cents) of land was acquired, including 42.68 ars from Munroe Thuruthu village and 11.87 ars from West Kallada village. A total of 84 awards worth ₹4,41,68,598 were distributed. \n\nMr. Kunjumon said that once the bridge connecting Kollam and Kunnathur taluks becomes a reality, the transport facility to Munroe Thuruth will improve. He added that the steps for the construction of the Konnelkadav bridge is also progressing. District Collector N. Devidas presided over the function. District panchayat president P.K. Gopan, Munroe Thuruthu panchayat president Mini Suryakumar, West Kallada panchayat president B. Unnikrishnan, and other officials were present.",
        "summary": "Steps for the construction of Konnelkadav bridge is also progressing, says MLA",
        "url": "https://www.thehindu.com/news/national/kerala/kannangattu-kadavu-bridge-construction-compensation-disbursal-begins/article68845516.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 14:02:32",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.227
    },
    {
        "id": 263562758,
        "title": "Land survey for expansion of Konaseema national highway to begin from November 11",
        "text": "The Departments of Roads and Buildings, Revenue, and Rural Water Supply will carry out a fresh land survey from November 11 to acquire land for the expansion of National Highway 216E, proposed by the National Highways Authority of India (NHAI) between Ravulapalem and Amalapuram in Dr. B.R. Ambedkar Konaseema district. \n\nThe estimated distance proposed for the expansion of the national highway is nearly 30 km, in an area nestled between the canals of the Godavari river and coconut groves.\n\nAt a review meeting held here on Thursday (November 7), with the officials of the NHAI and other departments, Joint Collector T. Nishanthi directed them to complete the land survey within two weeks, identifying government land, private land and the government facilities such as electricity poles, and drinking water pipelines existing in the proposed stretch and the availability of government land along the irrigation canals.\n\nThe expansion of the road has been proposed in four mandals — Ambajipeta, Kothapeta, Ainavalli and Ravulapalem. The Department of Survey authorities have been told to provide the survey data to identify the government land along the banks of the irrigation canals during the land survey.\n\nRoads and Buildings Superintending Engineer B. Ramu, RWS Superintending Engineer C.H.N.V. Krishna Reddy, Water Resources Divisional Engineer B. Srinivasa Rao, National Highways EE E. Srinivasulu, RDOs K. Madhavi, P. Srikar and other officials were present.",
        "summary": "NH 216E is proposed to be expanded between Ravulapalem and Amalapuram in Dr. B.R. Ambedkar Konaseema district",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/land-survey-for-expansion-of-konaseema-national-highway-to-begin-from-november-11/article68845427.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 14:02:29",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.2
    },
    {
        "id": 263563828,
        "title": "Kannada language through Bhakti Sangeetha touches core of your heart: Nirmala Sitharaman",
        "text": "Union Finance Minister Nirmala Sitharaman on Friday said she strongly believed that Kannada language, through Bhakti Sangeetha, directly touches the core of your heart. In Dasa Sangeetha, each of the verses sung by the Dasas reaches us without language barriers. The verses are a humble plea of these Dasas, who lived on Bhiksha, followed a Guru and attained Diksha with that Guru’s guidance, she said.\n\nMs. Sitharaman was speaking after inaugurating the three-day Mysuru Sangeetha Suganda, a music festival celebrating the Dasa tradition of Carnatic music, at the KSOU Convocation Hall here.\n\nThe music festival is jointly organised by the Central Ministry of Tourism and State Ministry of Culture and the Tourism Department. The event aims to celebrate Mysuru’s rich Carnatic music traditions, and also promote lesser-known tourist destinations, cuisine, handicrafts and textiles of Karnataka. Many renowned musicians are attending the festival and also performing.\n\nIn her inaugural address, Ms. Sitharaman, who was instrumental in organising the music festival for promoting Carnatic music, said language does not come as a barrier in Dasa Sangeetha as it reaches everybody.\n\nThe Finance Minister, who spoke on the greatness of Mysuru’s Carnatic music traditions and the Dasa Sangeetha, said the festival organised jointly by the Tourism and Culture Ministries should become a calendar event organised annually to promote Kannada language and the Dasa Sangeetha. The Karnataka government must come forward to support the event every year.\n\nWhile complimenting the Tourism Ministry for choosing Mysuru for the music festival, Ms. Sitharaman said the Dasas during the Bhakti movement kept the entire population together and helped people to remain positive. Because of their roles, Karnataka contributed immensely despite the difficult era. Mysuru is a blessed place.\n\nExplaining the vision of the Modi government, she said ‘Vikas Bhi, Virasat Bhi’, which highlights the country’s development and at the same time emphasises on safeguarding our heritage and culture. India has diverse languages and cultures. The Prime Minister’s message is, that besides the country’s economic progress, we also need to preserve our cultural heritage. We need language, culture, music and so on, she explained.\n\nShe also spoke on the programme “Ek Bharat Shreshtha Bharat”. India is blessed by diverse languages. Every language is superior or “Shrestha”. All the beautiful languages make Bharat where different languages are spoken. There is a need to strengthen these languages, the finance minister opined.\n\nDuring her talk, Ms. Sitharaman also spoke on the contributions of the Mysuru kings for the promotion of Carnatic music, and mentioned about the songs composed by Sri Jayachamarajendra Wadiyar.\n\nShe said the music festival needs to be supported and all Kannadigas, even through the digital modes, have to come together to promote Carnatic music as many stalwarts of Carnatic music hailed from Mysuru, which was a nerve centre for culture, and who set golden standards for music. It was Purandara Dasaru, known as “Pitamaha” of Carnatic music, who codified Carnatic music.\n\nBesides Mysuru, the performances of Dasa Sankeerthana as part of the music festival are also being held simultaneously at the National Gallery of Modern Art, Bengaluru; Sri Aprameya Swamy Temple; Rudrapatna in Hassan district and Araga.\n\nMinister of State for Petroleum and Natural Gas and Tourism Suresh Gopi, Minister in charge of Mysuru district H.C. Mahadevappa, and Mysuru MP Yaduveer Krishnadatta Chamaraja Wadiyar also spoke. Additional Secretary to the Tourism Ministry Suman Billa welcomed. MLA T.S. Srivatsa was present.\n\nThe Finance Minister later had an informal chat with the musicians and experts after the event.",
        "summary": "Union Finance Minister inaugurates three-day Mysuru Sangeetha Suganda Music Festival that celebrates the Dasa tradition of Carnatic music",
        "url": "https://www.thehindu.com/news/national/karnataka/kannada-language-through-bhakti-sangeetha-touches-core-of-your-heart-nirmala-sitharaman/article68845298.ece",
        "image": "https://th-i.thgim.com/public/incoming/sjzla0/article68845885.ece/alternates/LANDSCAPE_1200/2303_8_11_2024_18_24_58_1_FMMUSICFEST.JPG",
        "video": null,
        "publish_date": "2024-11-08 14:06:15",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.465
    },
    {
        "id": 263563826,
        "title": "When the FM recited ‘Ragi Tandira’",
        "text": "Union Finance Minister Nirmala Sitharaman on Friday narrated the lyrics of one of the songs of Purandara Dasa – Ragi Tandira – to emphasise her view on the amazing words penned in the Sankeerthana.\n\nDuring her inaugural speech at the Mysuru Sangeetha Suganda Music Festival here, she even requested the musicians who were present in the audience to sing the song during one of the days of the festival. “I must try to recite the Sankeerthana as the music festival aims to celebrate the Dasa tradition of Carnatic music,” she said.\n\nMs. Sitharaman managed to recount the Kannada lyrics while explaining the meaning of the words which, she said, bring out the quality of Ragi (finger millet) and also the quality of a person who is giving the ‘Bhiksha’. Every word is musical, the Minister said, while speaking on the beauty of words.\n\nHer effort and admiration for the song drew applause from the audience.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/karnataka/when-the-fm-recited-ragi-tandira/article68845399.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 14:08:48",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.935
    },
    {
        "id": 263561418,
        "title": "Small-scale handloom park to come up at Sengunthapuram",
        "text": "Minister for Textiles and Handlooms R. Gandhi on Friday said that the State government will set up a small-scale handloom park at Sengunthapuram in Ariyalur district. \n\nInspecting the proposed site for setting up the park, along with Minister for Transport S.S. Sivasankar, Mr. Gandhi said it had been decided to allot 13,205 sq. ft. of land owned by the Tamil Nadu Cotton Corporation to set up the park at Sengunthapuram. It was an ideal place to establish the park, which was aimed at assisting the handloom weavers. There was a building at the proposed site. It would be refurbished to house handlooms. The officials were asked to complete the work within two or three months. \n\nThe Minister said it was part of the announcement made by Chief Minister M.K. Stalin in the State Assembly. He had announced that 10 small-scale handloom parks would be set up in the State in 2023-24 to boost the handloom sector. In the first phase, 50 handlooms would be erected at the Sengunthapuram Park. Fifty more looms would be added subsequently. \n\nHandloom Department secretary V. Amuthavalli, Collector P. Rathinasamy, Jayankondam MLA K.S.K. Kannan and senior officials were present.",
        "summary": "Ministers R. Gandhi and S.S. Sivashankar inspect the 13,205 sq. ft. site belonging to the Tamil Nadu Cotton Corporation at Sengunthapuram",
        "url": "https://www.thehindu.com/news/cities/Tiruchirapalli/small-scale-handloom-park-to-come-up-at-sengunthapuram/article68845569.ece",
        "image": "https://th-i.thgim.com/public/news/cities/Tiruchirapalli/z2ru82/article68845549.ece/alternates/LANDSCAPE_1200/Pro%20Ariyalur%20Photo%20-%2008.11.2024%2001.jpg",
        "video": null,
        "publish_date": "2024-11-08 13:39:38",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.044
    },
    {
        "id": 263561416,
        "title": "Drones to emerge as game changer in fisheries sector, says Union Minister",
        "text": "Drones will emerge as a gamechanger in the fisheries sector, addressing several critical challenges with precision and efficiency, Union Minister of State for Fisheries George Kurian said here on Friday.\n\nHe was inaugurating an awareness workshop and demonstration of drone applications in the fisheries sector at the ICAR-Central Marine Fisheries Research Institute. \n\n“Drones play a pivotal role in managing aquaculture farms, monitoring fish markets, and assessing damage to fisheries infrastructure, particularly during natural disasters, when rescue operations are essential. On their part, underwater drones help closely monitor fish behaviour in natural habitats, to detect signs of distress like erratic swimming patterns and also provide real-time data that strengthen sustainable fisheries management,” he said.\n\nThe event saw live demonstration of drone applications in fisheries, including transportation of fish from the farm, dispensing aquafeeds and rescue operation.\n\nThe Minister said the Centre would develop 100 climate-resilient coastal fishermen villages across the country, to help fisher communities who encounter climate-change challenges, by allocating ₹2 crore per village under the Pradhan Mantri Matsya Sampada Yojana. This would help ready common facilities like fish-drying yards, processing centres, fish markets, and emergency rescue facilities, whilst promoting climate-resilient practices like seaweed cultivation, artificial reefs, and green fuel initiatives. \n\nThe Union Department of Fisheries would install transponders in about one lakh marine fishing vessels this year at an estimate of ₹364 crore. \n\nThis would provide a two-way communication system enabling real-time tracking of fishing vessels and help fishermen to send short messages using their Android mobile phone while fishing up to 200 nautical miles from the coast.\n\nThe system would also provide weather alerts to the fishermen, including cyclone warning. The Indian Space Research Organisation developed this technology indigenously using GSAT 6 satellite. Information related to potential fishing zones too would be made available to the fishermen on their mobile in regional languages, Mr Kurian said.\n\nNeetu Kumari Prasad, Joint Secretary in Union Department of Fisheries; B.K. Behra, Chief Executive of National Fisheries Development Board; Grinson George, Director of CMFRI; and George Ninan, Director of CIFT, spoke on the occasion",
        "summary": "George Kurian says Centre will develop 100 climate-resilient coastal villages to protect fishers’ livelihood",
        "url": "https://www.thehindu.com/news/national/kerala/drones-to-emerge-as-game-changer-in-fisheries-sector-says-union-minister/article68845140.ece",
        "image": "https://th-i.thgim.com/public/news/national/kerala/fq0wll/article68845225.ece/alternates/LANDSCAPE_1200/IMG-20241106-WA0199.jpg",
        "video": null,
        "publish_date": "2024-11-08 13:32:42",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.202
    },
    {
        "id": 263561420,
        "title": "Puthiya Tamilagam submits memorandum to Governor Ravi demanding to nullify internal reservation for Arunthathiyars",
        "text": "Puthiya Tamilagam party founder K. Krishnasamy on Friday submitted a memorandum to Tamil Nadu Governor R.N. Ravi, highlighting the “adverse impact” of 3% internal reservation for Arunthathiyars within the Scheduled Caste quota of 18%.\r\n\nThe party, in a press release, said “The recent Supreme Court judgement on the sub-classification of Scheduled Castes underscores that, although various subgroups exist, it is unjust to allocate all opportunities to a single community. The 3% internal reservation granted to Arunthathiyars in Tamil Nadu represents grave injustice and a violation of social equity…We urge the Governor to advise the Central and State governments to promptly nullify this injustice.”\r\n\nAmong other issues that the party brought to the attention of the Governor include extending benefits of the Forest Rights Act to tea plantation workers in Tamil Nadu, implementing total prohibition in the State, deploying Central agencies in southern Tamil Nadu to curtail recurrent caste-based violence and murders against members of Devendrakula Vellalars, attracting foreign investments to southern districts, and prioritising employment opportunities for native population.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/tamil-nadu/puthiya-tamilagam-submits-memorandum-to-governor-ravi-demanding-to-nullify-internal-reservation-for-arunthathiyars/article68845174.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 13:31:59",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.241
    },
    {
        "id": 263561426,
        "title": "BJP is trying to convert Vijayapura into a Hindutva laboratory, says Minister M.B. Patil",
        "text": "“The BJP is trying to convert Vijayapura district into a Hindutva laboratory and divide people on the basis of religion. But its plans will not succeed as it is a land of communal harmony,” Minister M.B. Patil said in Vijayapura on Friday.\n\n“The BJP is using the waqf issue to create rifts between communities and spread hatred. It will not succeed, as the people can see through the conspiracy,” he told reporters.\n\n“The BJP is trying to portray Congress as an anti-Hindu party by saying that we are supporting Waqf Board in reclaiming its land. This is not true because the Waqf Board is a statutory body that regularly issues notices to remove encroachments from its land. During its tenure, the BJP has taken several pro-Waqf Board steps, including issuing notices and mutation of Record of Rights, Tenancy and Crops (RTCs),” he said.\n\nReleasing a list of documents to support his claim, he said that the Congress will also release a booklet containing the BJP’s pro-Waqf Board activities.\n\nThe BJP, which has been in power at the Centre since 2014 and also in the and State intermittently, is very concerned about the protection of waqf properties. Its leaders and Ministers have made several statement and took steps towards that end. When the BJP was in power in the State, it allowed the Waqf Board to take back property of farmers, religious places and people from all religions, he said. “It is now conducting a false campaign propaganda against us in the State and national level,” he added.\n\nHe claimed that the BJP government mutated in favour of the Waqf Board land belonging to many farmers in 2023, citing examples.\n\nThe then Revenue Minister issued circulars in 2010, regarding updating of waqf documents. The Chief Secretary issued a circular in 2010 to remove all encroachments from waqf land by private individuals, government bodies and corporations. The Regional Commissioner of Kalaburagi issued orders in 2011 on protecting waqf property and regularization of records, the Minister pointed out, to show that clearing encroachments is an ongoing process.\n\nThe Principal Secretary, Minority Welfare, issued orders in 2011, on compulsory depositing of compensation against acquisition of waqf land to the board’s account. In 2020, the Deputy Secretary (Land Grant, Land Reforms and Revenue Department) issued orders for flagging wakf property in the Bhoomi portal. In 2021, the BJP government set up district-level task forces to protect waqf property.\n\nIn 2021, the BJP government issued orders for flagging and locking of waqf property in gramthana land in the Panchatantra and e-Swattu software.\n\nIn 2014, the BJP’s election manifesto proposed, in consultation with religious leaders, to empower the Waqf Board and clear encroachments.\n\nIn 2019, MP Shobha Karandlaje asked a question in Parliament seeking information about steps taken to preserve waqf property like geo-tagging and digitization, lease terms, financial assistance to State Waqf Boards, video conferencing facilities, Mr. Patil said, citing these instances.\n\nIn Karnataka, Chief Minister Siddaramaiah has ordered withdrawal of all notices when the BJP started making false allegations about waqf assets, he said.\n\n“Even after all this, the BJP is spreading false information among farmers, religious leaders and public for political gains and publicity. Were they not following anti-Hindu policies, when they were in power? Why are they posing now that the BJP is the only party in favor of the Hindus?” he asked.\n\nHe said that the BJP has politicised religious institutions. The BJP has dragged into the anti-waqf agitation innocent swamis of various maths who have no clear idea of the double-speak of the party, he added.\n\n“But then, we will take steps to convince them of the BJP’s hypocrisy. Sri Adrushya Kadasiddeshwar Swami of Kaneri Math, who addressed the rally in Vijayapura, will turn against the BJP. That is because we are true Hindus, but the BJP has fake Hindu leaders who are carrying out a false propaganda for political gains,” Mr. Patil claimed.",
        "summary": "The Congress is planning to release a booklet containing the BJP’s pro-Waqf Board activities",
        "url": "https://www.thehindu.com/news/national/karnataka/bjp-is-trying-to-convert-vijayapura-into-a-hindutva-laboratory-says-minister-mb-patil/article68845580.ece",
        "image": "https://th-i.thgim.com/public/incoming/jnhnda/article68845789.ece/alternates/LANDSCAPE_1200/9727_8_11_2024_18_41_7_1_09BGMMBPBIJAPURWAQF1.JPEG",
        "video": null,
        "publish_date": "2024-11-08 13:42:13",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.369
    },
    {
        "id": 263561422,
        "title": "Improve tech. skills to handle cybercrimes, false social media posts, police told",
        "text": "Vizianagaram Superintendent of Police Vakul Jindal on Friday advised the police officials of all ranks to enhance their technological skills to handle cyber crimes and unethical social media posts.\n\nSpeaking to the media here, he said that the department had been conducting special training programmes for all station house officers and other personnel in view of increasing incidence of cyber crimes. \n\nMr. Jindal urged people not to respond to calls from unknown persons seeking One Time Passwords, PAN numbers, and bank account details.\n\nHe said the department would take stern action on people who would use social media platforms to target public representatives, officials and individuals with false allegations and derogatory remarks.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/improve-tech-skills-to-handle-cybercrimes-false-social-media-posts-police-told/article68845423.ece",
        "image": "https://th-i.thgim.com/public/incoming/qkct5p/article68845846.ece/alternates/LANDSCAPE_1200/10215_8_11_2024_19_14_17_1_WHATSAPPIMAGE2024_11_08AT61900PM.JPEG",
        "video": null,
        "publish_date": "2024-11-08 13:50:12",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.364
    },
    {
        "id": 263561428,
        "title": "Fishermen seek healthcare and cold storage facilities",
        "text": "The Tamil Nadu Fishermen’s Welfare Board (TNFWB) based in Mallipattinam, Thanjavur district, has urged the government to provide emergency healthcare access and establish cold storage facilities to improve the lot of the coastal communities in the State this week.\r\n\nBoard’s general secretary A. Thajuddin submitted a memorandum containing 11 demands to Deputy Chief Minister Udhayanidhi Stalin in Thanjavur on Thursday, detailing the requirements of fishermen in the State.\n\nAccess to hospitals and medical assistance was among the issues raised by the board. “Fishermen who get injured while at sea due to natural calamities, accidents, or health problems are left waiting for medical attention. The authorities should organise ambulance and helicopter rescue services at the ports in order to save lives,” the memorandum said. \n\nThe document pointed out that despite the heavy footfall and vehicular traffic at the Mallipattinam fish market, the nearest hospital was in Tiruchi or Thanjavur. “A full-fledged hospital closer to the market would be able to attend to accidents and injuries,” it said.\n\nAmong the other demands were to early installation of curved groynes to protect the Mallipattinam port from sea erosion and climate change. \n\nThe body sought official help to settle disputes between fishermen in Tamil Nadu and Sri Lanka. “We urge the authorities to resolve the issue of fishermen straying into foreign waters through high-level bilateral talks and secure the release of those who have been arrested along with their vessels from Sri Lankan custody,” the statement said.\n\nFishermen of Thanjavur district could be permitted to stay at sea with their power boats for at least three days, like those of Nagapattinam district, in order to increase the size of their catch, and profits, said the body. Cold storage facilities would help preserve the stock of fish caught daily.",
        "summary": "",
        "url": "https://www.thehindu.com/news/cities/Tiruchirapalli/fishermen-seek-healthcare-and-cold-storage-facilities/article68845482.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 13:33:17",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "health",
        "source_country": "in",
        "sentiment": -0.109
    },
    {
        "id": 263561432,
        "title": "Guidelines issued for fertilizer distribution in Karaikal for samba, thaladi paddy cultivation",
        "text": "With samba and thaladi paddy cultivation under way on 4,148 hectares in Karaikal district, the Agriculture Department has issued guidelines to ensure fair and sufficient distribution of fertilizers. \n\nKaraikal’s Additional Director of Agriculture R. Ganesan, in a statement, outlined the measures and cautioned vendors that strict action would be taken for non-compliance with these rules. \n\nMr. Ganesan confirmed that fertilizers, including urea, DAP, complex, and potash, are adequately stocked at authorised private and cooperative outlets for local farmers. To maintain transparent and efficient distribution, the department had directed fertilizer vendors to display their sales licences prominently, list stock levels and prices clearly, and sell fertilizers exclusively at government-mandated rates. Sales are restricted to farmers within Karaikal district to prevent unauthorised distribution to neighbouring areas. \n\nThe guidelines stipulate that vendors must avoid combining fertilizer sales with unrelated products and are prohibited from selling unapproved items. All sales are to be documented via POS systems, with receipts provided to farmers. Vendors are required to submit inventory and sales reports bi-monthly, on the 15th and 30th. \n\nMr. Ganesan reiterated that any violations of these regulations would lead to action under the Fertiliser Control Order of 1985, reinforcing the department’s commitment to ensuring a fair and efficient fertilizer supply chain.",
        "summary": "",
        "url": "https://www.thehindu.com/news/cities/Tiruchirapalli/guidelines-issued-for-fertilizer-distribution-in-karaikal-for-samba-thaladi-paddy-cultivation/article68845775.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 13:55:49",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.02
    },
    {
        "id": 263561436,
        "title": "JNTU-GV to hone communication skills of rural students",
        "text": "JNTU-GV Vice-Chancellor D. Rajyalakshmi on Friday said special training programmes would be conducted for students to improve their communication and technical skills. \n\nSpeaking at the Freshers’ Day function at St. Theressa Institute of Engineering and Technology at Garividi in the district, she said that every college affiliated to the university should make students focus on certificate courses apart from regular academic studies to meet the expectations of the industries. She also stressed the need for teaching faculty to improve their skills and knowledge. \n\nAvanthi group chairperson Muttamsetti Srinivasa Rao said that the management was giving priority to campus selections. \n\nThe college principal Jashuva Jayaprasad, M. Mahesh, director A. Chandrasekhar, vice-principal B. Venkata Ramana and others were present.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/jntu-gv-to-hone-communication-skills-of-rural-students/article68845342.ece",
        "image": "https://th-i.thgim.com/public/incoming/ynivqn/article68845746.ece/alternates/LANDSCAPE_1200/10215_8_11_2024_17_51_42_1_WHATSAPPIMAGE2024_11_08AT54318PM.JPEG",
        "video": null,
        "publish_date": "2024-11-08 13:36:54",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.102
    },
    {
        "id": 263561434,
        "title": "State govt. to consider introducing forensic science in legal education",
        "text": "The State government will consider introducing subjects like forensic science in legal education, Law Minister H.K. Patil said on Friday.\n\nHe was speaking after inaugurating the 32nd Annual State Conference of the Karnataka Medico-Legal Society (KAMLS) organized by the Department of Forensic Medicine and Toxicology, JN Medical University, at KLE Society in Belagavi.\n\n“Subjects like forensics and toxicology are becoming increasingly important in the administration of criminal justice. They are essential to providing conclusive proof by preparing significant documents and evidence to enable courts to determine the truth,” he said.\n\nHe said that their importance cannot be minimized in cases of unnatural death, murders, poisoning, drug use, suicide and other such offences.\n\n“We will not only consider introducing forensic science and toxicology in law colleges but also extend all support and cooperation to colleges and institutions. We can also see that research in the field of forensics and toxicology are few. Serious research should be increased as it can help speedy justice delivery. Medical experts are adept at collecting sensitive evidence unseen by investigating officers. We need to support them,” the Minister said.\n\nThe Minister also said that a significant number of criminal cases is not being dealt in a professional manner. It seems they are being seen as commercial deals. Some lawyers have become adept in confusing witnesses. But then, this trend is reducing as the levels of legal awareness are increasing among the common public, he said.\n\n“We should realise that ensuring justice in criminal cases will act as a deterrent and reduce the occurrence of serious offences. It is our responsibility to see that prosecutors present proper material and human witnesses before courts. This has become easy due to the increased use of technological tools for evidence collection,” Mr. Patil said.\n\nKLE Society chairman Prabhakar Kore said that the number of trained doctors in areas like forensic sciences and toxicology has increased significantly making it easy for carrying out procedures like post-mortem.\n\n“That is because training is free and students get stipend. But it was very difficult to find such professionals in the 1980s,” he said. He suggested that the government provide proper training to those who maintain law and order and carry out criminal investigation.\n\nKAHER Vice-Chancellor Nithin Gangane, principal N.S. Mahantshetty, event organizer Ravindra Honnungara Vinaya Bannur, Avinash Kavi and others were present.",
        "summary": "There is a huge demand for experts in medico-legal cases, says Minister",
        "url": "https://www.thehindu.com/news/national/karnataka/state-govt-to-consider-introducing-forensic-science-in-legal-education/article68845787.ece",
        "image": "https://th-i.thgim.com/public/incoming/y4s11y/article68845882.ece/alternates/LANDSCAPE_1200/9727_8_11_2024_19_9_40_1_09BGMHKPKLEML1.JPG",
        "video": null,
        "publish_date": "2024-11-08 13:56:15",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.15
    },
    {
        "id": 263561442,
        "title": "Chamarajanagar DC calls upon public to use ₹10 coin in daily transactions",
        "text": "Deputy Commissioner of Chamarajanagar district Shilpa Nag has called upon the general public to use ₹10 coins during their daily financial transactions.\n\nIn a statement here, Ms. Nag appealed to the general public not to pay heed to the baseless rumours with regard to use of ₹10 coins in their day to day transactions.\n\nShe pointed out that the general public was hesitant to accept ₹10 coin in view of the rumours that fake ₹10 coins were in circulation.\n\nThe ₹10 coins were legal tender issued by the Reserve Bank of India and were valid for use across India. \n\nShe also pointed out that the ₹10 coin was in use in daily transactions across all the States of the country.\n\nThe general public should not pay heed to baseless rumours about the ₹10 coin and disrupt normal economic activity, Ms. Nag said while calling upon KSRTC conductors, auto drivers, hotels, restaurants, Indira Canteen, hospitals, medical shops, cinema halls, street vendors, private organisations in Chamarajanagar district to accept and circulate the ₹10 coin.",
        "summary": "",
        "url": "https://www.thehindu.com/news/national/karnataka/chamarajanagar-dc-calls-upon-public-to-use-10-coin-in-daily-transactions/article68844464.ece",
        "image": "https://www.thehindu.com/theme/images/og-image.png",
        "video": null,
        "publish_date": "2024-11-08 13:52:41",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.391
    },
    {
        "id": 263561440,
        "title": "High-level committee formed to facilitate  clearances for companies that signed MoU, says Minister",
        "text": "Industries Minister T.R.B. Rajaa on Friday said the State government has constituted a committee comprising himself, the Chief Secretary and other top officials to coordinate and prevent any delay in providing necessary clearances to enable companies start their industrial units speedily in the State after signing of memorandums of understanding. \n\nSpeaking to journalists at Pudukottai, Mr. Rajaa said constant monitoring was being done now from the time of signing of memorandums of understanding to providing employment in new industrial units. There were instances wherein companies had started their operations in Tamil Nadu providing employment to many within a year of the signing of the MoU, he pointed out. \n\nMr. Rajaa said over 160 clearances had been given through the single window system and the probability of the clearances exceeding 200 was bright. Guidance Tamil Nadu was the nodal agency for investment promotion and single window facilitation to guide investors and handhold in providing land by taking up the issue with the SIPCOT and in ensuring that the necessary clearances were obtained, the Minister said. \n\nMr. Rajaa said Tamil Nadu was the talent capital and those from this State were running big companies even abroad. The State government had made efforts to facilitate employment to the educated youth of the State by organising job camps at different places. \n\nIndustrial partnership with Naan Mudhalvan Scheme is being done to facilitate jobs to the talented and skilled youth of Tamil Nadu within the State and outside. Tidel Neo was being set up at different locations within the State to enable educated youth of Tamil Nadu get employment, he added.",
        "summary": "Constant monitoring was being done now from the time of signing of MoUs to providing employment in new industrial units, says Industries Minister T.R.B. Rajaa",
        "url": "https://www.thehindu.com/news/cities/Tiruchirapalli/high-level-committee-formed-to-facilitate-clearances-for-companies-that-signed-mou-says-minister/article68845511.ece",
        "image": "https://th-i.thgim.com/public/incoming/ebfpna/article68845693.ece/alternates/LANDSCAPE_1200/IMG_TRB_RAJAA_2_1_0ED3RG16.jpg",
        "video": null,
        "publish_date": "2024-11-08 13:26:40",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.425
    },
    {
        "id": 263561444,
        "title": "Merchants’ associations stage protest to resume demolition of roadside shops in Munnar",
        "text": "Merchants staged a protest in front of the Munnar panchayat office on Friday demanding the removal of all unauthorised roadside shops in the hill station. \n\nAccording to organisers, the protest was jointly held by the Kerala Vyapari Vyavasayi Ekopana Samithy (KVVES), Vyapari Vyavasyi Samithy, and Munnar Hotel and Restaurant Association. C.K. Babulal, Munnar unit president of KVVES, inaugurated the event. \n\n“A traffic committee meeting held in September had decided to clear all shops that encroach on roadsin the panchayat. Authorities should complete the eviction process. The increasing number of such shops are posing a threat to traditional merchants in Munnar,“ said Mr. Babulal.\n\nAccording to Munnar panchayat secretary Udayakumar, an emergency panchayat committee meeting had decided to put on hold the eviction drive. “I have informed the District Collector and Devikulam RDO about the situation. Further action will be based on the directives from the district administration,” said the official.\n\n“The merchants’ associations has submitted a letter to the panchayat secretary demanding to resume the eviction drive,” said Mr. Udayakumar.\n\nIf the panchayat authorities fail to remove the roadside shops, we will hold district-level protests, said the merchants.\n\nMeanwhile, officials said that new shops were erected in the panchayat, including in Rajamala, within days after the eviction drive was put on hold.",
        "summary": "New roadside shops were erected in Munnar panchayat within days after the eviction drive was put on hold, say officials",
        "url": "https://www.thehindu.com/news/national/kerala/merchants-associations-stage-protest-to-resume-demolition-of-roadside-shops-in-munnar/article68845341.ece",
        "image": "https://th-i.thgim.com/public/incoming/8qm3si/article68845345.ece/alternates/LANDSCAPE_1200/80759_8_11_2024_17_44_40_1_PROTESTMUNNAR.JPEG",
        "video": null,
        "publish_date": "2024-11-08 13:53:46",
        "author": "The Hindu Bureau",
        "authors": [
            "The Hindu Bureau"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.378
    }
]