[
    {
        "id": 262754026,
        "title": "Kartik Aaryan Shares Glimpse Of ‘Chill Scenes’ With Madhuri Dixit And Vidya Balan, Fans React",
        "text": "Kartik Aaryan is currently basking in the success of his recently released film Bhool Bhulaiyaa 3. The film has been performing well at the box office. It has crossed the Rs 100 cr mark, and fans are equally excited about it. Well, amid this, the team was seen celebrating the success. Kartik took to his social handle and shared a glimpse of his chill scenes with Vidya Balan and Madhuri Dixit.\nTaking to his Instagram handle, Kartik Aaryan dropped a photo in which he is seen having enjoyment with Vidya Balan and Madhuri Dixit. “#AboutLastNight Chill scenes with my Manjus,” read the caption. One of the fans wrote, “Ye toh ulta kr diya aapne Kartik sir dono Manjulika ko nhi choda”. Another wrote, “Born to be besties, Forced to be rivals.”\nTake a look here:\n\nView this post on Instagram\n\nA post shared by KARTIK AARYAN (@kartikaaryan)\n\nThe movie had an impressive start, raking in Rs 35.5 crore on its opening day. The momentum picked up even more on Saturday with Rs 37 crore, though there was a slight dip on Sunday, with earnings of Rs 33.5 crore. Despite this minor drop, the film maintained strong occupancy, with a reported 37.45 percent Hindi occupancy on Monday, solidifying its position as a blockbuster.\nKartik Aaryan, who plays the beloved character Rooh Baba, seems thrilled by the overwhelming response. On Sunday, he surprised fans by making an appearance at Mumbai’s iconic Gaiety Galaxy theatre, where he was greeted with roaring applause. Dressed in a casual checkered shirt, Kartik climbed onto his car and held up a “Housefull” sign, soaking in the love from his fans. Sharing the moment on Instagram, he wrote, “H O U S E F U L L boards everywhere. I wanted to take it home as a souvenir but they said they need it again tomorrow!”\nBhool Bhulaiyaa 3 is the latest chapter in a franchise that began with Priyadarshan’s 2007 hit Bhool Bhulaiyaa, which starred Akshay Kumar in the iconic role of a ghostbuster. Kartik first stepped into the franchise with Bhool Bhulaiyaa 2 in 2022, a film that redefined horror-comedy and became a runaway hit. This time, the franchise brings back Vidya Balan as the infamous Manjulika after 17 years, adding even more excitement to the mix.\nWith Anees Bazmee once again at the helm, Bhool Bhulaiyaa 3 is set to continue the franchise’s legacy of blending horror with humour, while Kartik’s Rooh Baba and Vidya’s Manjulika promise an unforgettable showdown. Fans and critics alike are already calling it one of the best releases of the year, and the film’s box office journey seems unstoppable as it heads into its first full week.",
        "summary": "Kartik Aaryan, who plays the beloved character Rooh Baba, is thrilled by the overwhelming response.",
        "url": "https://www.news18.com/movies/kartik-aaryan-shares-glimpse-of-chill-scenes-with-madhuri-dixit-and-vidya-balan-fans-react-9109691.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/kartik-vidya-2-2024-11-ced2f4bbe28eccfda470d7125351205e-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 08:16:43",
        "author": "Akriti Anand,News18",
        "authors": [
            "Akriti Anand",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.067
    },
    {
        "id": 262715218,
        "title": "CBSE To Open Office In Tripura After Affiliated Schools' Dismal Performance In Board Exams",
        "text": "The CBSE will open a sub-regional office in Agartala amid outrage over the dismal performance of state-run schools affiliated to it in board examinations, an official said on Monday.\nAfter the BJP came to power in Tripura in 2018, 125 state-run schools were rechristened as Vidyajyoti Schools, and the CBSE’s English-medium curriculum was introduced.\nThis year, while 61 per cent of students of these schools cleared the CBSE class 10 examinations, 59 per cent of students were successful in the class 12 exams.\nThe medium of education in these schools was earlier Bengali, and they used to function under the Tripura Board of Secondary Education (TBSE).\nThe state government will allocate suitable land for the CBSE office to strengthen educational infrastructure in the state, Education Department’s Officer on Special Duty (OSD) Abhijit Samajpati said.\nThe office will operate temporarily from a building of Ramakrishna Mission Vidyalaya, he said.\nThe sub-regional office will provide various services to the CBSE-affiliated schools, including admission assistance, subject corrections, student record updates, exam centre coordination, mark sheet corrections, grievance redressal and teacher training facilitation, Samajpati said.\n”It will also work closely with state education bodies and other regional educational institutions to support smooth operations of the examination process and student development activities. This initiative will foster a stronger educational environment and expand learning opportunities for students throughout the state,” he said.\nFollowing the poor results, the opposition has been alleging that the government was playing with the future of thousands of students, who studied in Bengali-medium schools till class 8 and were forced to appear in the board examinations in English, which resulted in the disaster.",
        "summary": "In 2018, 125 state-run schools were rechristened as Vidyajyoti Schools, and the CBSE’s English-medium curriculum was introduced.",
        "url": "https://www.news18.com/education-career/cbse-to-open-office-in-tripura-after-affiliated-schools-dismal-performance-in-board-exams-9109354.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/08/cbse-2024-08-a545d021ae36246ac1b99ae02c7b8699-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 03:24:22",
        "author": "News18,Surbhi Pathak",
        "authors": [
            "News18",
            "Surbhi Pathak"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.168
    },
    {
        "id": 262789926,
        "title": "US Elections 2024: Why Does New York's Ballot Paper Have Bengali But Not Hindi?",
        "text": "As Americans await the November 5 election day to elect their next president, New York’s ballot paper has caught everyone’s attention for a unique reason. New York has included the Bengali language on its 2024 presidential ballot this year. This move surprises many, as Hindi is also widely spoken by the Indian community.\nA large number of immigrants live in New York City, 66% of whom do not speak English as their first language. Asian Americans form a significant part of this demography.\nWith this in mind, Michael J Ryan, Executive Director of the New York City Board of Elections, decided to include languages like Chinese, Spanish, Korean and Bengali on the ballot to make voting easier for more people.\n“By including Asian languages, we are fulfilling our duty to make it easier for every voter to understand the voting process,” Ryan said.\nData from the Asian American Federation reveals that Bengali is the second most spoken Asian language in New York. It is spoken by 12.2% of Asian New Yorkers, encompassing residents originally from both India and Bangladesh. In contrast, Hindi ranks sixth, spoken by 3.3% of the residents in New York. This prevalence led to Bengali being chosen to facilitate voting access for a larger segment of the community.\nThe inclusion of the Bengali language in New York’s ballot is not just an amicable step, but there was also a legal requirement behind it. In the early 2010s, following a lawsuit over language access, New York had to provide voting assistance in at least one South Asian language. Bengali was chosen after negotiations because it had the largest number of speakers. Since then, the first Bengali ballot was made available in Queens in 2013.\nThe decision is in line with the Voting Rights Act of 1965, which requires that language assistance should be provided to enable minority groups to fully participate in the electoral process.\nUnder this law, New York is required to provide not only ballots but other voting materials as well, in Bengali so that Bengali-speaking residents can participate in elections without language barriers.\nThe Bengali-speaking community in New York has warmly welcomed the move. Subhasesh, a Bengali-origin sales agent working in Times Square, expressed his happiness and said, “It will be easier for my father to vote in Queens. Many elders in our community feel more comfortable in their mother tongue. The Bengali ballot will help them a lot.”\nDr Avinash Gupta, President of the Federation of Indian Associations, also considered it a positive step for the Indian community. He said, “This will encourage more Indians to vote and raise their voice. Political participation of the community is increasing, and this step supports them.”",
        "summary": "Following a lawsuit concerning language accessibility, New York was compelled to provide voting assistance in at least one South Asian language. Bengali, having the largest number of speakers, was selected after negotiations",
        "url": "https://www.news18.com/world/us-elections-2024-why-does-new-yorks-ballot-paper-have-bengali-but-not-hindi-9109951.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/voting-in-us-2024-11-245aaee98b5dbb355e45b3cbe18bf25d-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 11:03:58",
        "author": "News18,Satyaki Baidya",
        "authors": [
            "News18",
            "Satyaki Baidya"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.185
    },
    {
        "id": 262730372,
        "title": "'Properties Can't Be Taken Over By Govt': Supreme Court",
        "text": "In a majority verdict, the Supreme Court on Tuesday said not all private property could be acquired by the government even if it were for the greater good.\nIn a majority judgment, the court said, “Not all privately-owned resources can be acquired by the State even as the State can stake claims over resources that are material and are held by the community, for the public good.”\nWith Chief Justice of India DY Chandrachud along with six other judges pronounced the majority judgment, Justice Nagrathna partially concurred, and Justice Dhulia penned a dissent.\nMore details to follow…",
        "summary": "In a majority verdict, the Supreme Court on Tuesday said not all private property could be acquired by the government even if it were for the greater good.",
        "url": "https://www.news18.com/india/not-all-private-property-can-be-taken-by-govt-for-serving-greater-good-supreme-court-9109513.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-36-2024-10-ead80f35d4fdca63e79d515e52b7f54e-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 05:41:19",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.022
    },
    {
        "id": 262737254,
        "title": "Suniel Shetty Shares Unseen Adorable Childhood Pictures Of 'All Time Favourite Human' Athiya On Her Birthday",
        "text": "Actress Athiya Shetty is celebrating her 32nd birthday today. On her special day, her father Suniel Shetty took to his social media to share a sweet birthday wish for his daughter. He shared a series of unseen childhood pictures of the actress and fans cannot get over how adorable the post is.\nTaking to his Instagram, Suniel Shetty shared a series of childhood pictures of Athiya Shetty on her birthday. The first picture shows a baby Athiya standing in her cot. Another picture shows her looking intently at the camera. The third picture shows her posing with her toys, while the fourth picture also features Suniel as they enjoy a day out at the golf course. Calling her the ‘greatest joy’ of her life, Suniel wrote, “Happy birthday to the best part of me …my all time favourite human….my best friend…my confidante and the greatest joy of my life ……love you beyond measure Tiaaaaa.”\nTake a look at the post shared by Suniel here.\n\nView this post on Instagram\n\nA post shared by Suniel Shetty (@suniel.shetty)\n\nAdditionally, Athiya’s mother Mana Shetty also shared a series of birthday wishes on her Instagram Stories. Sharing a picture from Athiya’s childhood, she wrote, “Happy Happy Birthday, My Gudiya… You are My World.”\nAthiya made her Bollywood debut alongside Sooraj Pancholi in Hero which was released in 2015. She won three awards for her role in the film. She was next seen in Arjun Kapoor’s Mubarakan, which was followed by Motichoor Chaknachoor where she shared the screen with Nawazuddin Siddiqui. The actor also made a special appearance in a song in Nawabzaade. She will be next seen in footballer Afshan Ashiq’s upcoming biopic film – Hope Solo. She will be seen essaying the footballer’s role in the film.\nOn the personal front, she is married to her long-term partner and Indian cricketer, KL Rahul.",
        "summary": "Suniel Shetty shared a series of unseen childhood pictures of Athiya Shetty on her birthday. The actress is celebrating her 32nd birthday today.",
        "url": "https://www.news18.com/movies/suniel-shetty-shares-unseen-adorable-childhood-pictures-of-all-time-favourite-human-athiya-on-her-birthday-9109610.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/mixcollage-05-nov-2024-11-28-am-8631-2024-11-9da739db1984e24c10ad26a64f59d837-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 06:37:23",
        "author": "News18,Snigdha Oreya",
        "authors": [
            "News18",
            "Snigdha Oreya"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.868
    },
    {
        "id": 262684984,
        "title": "Chhath Puja 2024: Nahay Khay Muhurat, Rituals And Do’s & Don’ts",
        "text": "Chhath Puja is one of the most significant festivals celebrated in Bihar, Jharkhand, and eastern Uttar Pradesh. This ancient tradition honours the Sun God and spans four days, during which devotees observe fasting from sunrise to sunset. The timings of Suryodaya (sunrise) and Suryast (sunset) are particularly important for those participating in the rituals.\nThe festivities begin with Nahay Khay, which occurs on the Chaturthi Tithi of Kartik Shukla Paksha. This is followed by Kharna on Panchami Tithi, Chhath Puja on Sashti, and concludes with Usha Arghya on Saptami Tithi. This year, Chhath Puja will be celebrated from November 5 to November 8.\nNahay Khay Date And Muhurat\n\nNahay Khay is on November 5.\nTimings: According to Drik Panchang, the sunrise is at 6:16 am, and sunset at 5:43 pm.\n\nNAHAY KHAY RITUALS\nOn the first day of Chhath Puja, devotees wake up early to worship Lord Surya before breaking their fast. This day marks the start of the four-day fasting period. Participants dress in their finest clothes, observe the fast, and prepare chana dal and pumpkin rice as prasad for the Sun God.\nNahay Khay is on November 5. (Image: Shutterstock)\nNAHAY KHAY PUJA SAMAGRI\nThe following items are essential for the rituals:\n\nCotton Balls\n\nIdol of Lord Surya\nIdol of Lord Ganesha\n\nKumkum (Roli)\nKhajur (Dates)\n\nPaan (Betel Leaves)\n\nRed Sandal (Laal Chandan)\n\nRice (Chawal/Akshat)\nSupari (Betel Nuts)\nVrat Katha Book\nWhite Flowers\n\nNAHAY KHAY DO’S AND DON’TS\nThe preparations for Chhath Puja begin the day after Diwali, with devotees committing to a Satvik diet, avoiding onion, garlic, and non-vegetarian items.\nOn Nahay Khay, devotees start their day by thoroughly cleaning their homes, emphasizing cleanliness and hygiene throughout the festival.\nThey take a bath early in the morning before consuming any food.\nThekua is made from whole wheat flour, ghee, and jaggery, and is often flavoued with cardamom. (Image: Shutterstock)\nAfter bathing, they prepare thekua as prasad. Thekua is a traditional sweet dish that is offered to the Sun God as part of Chhath Puja rituals.\nFor cooking, it is important to use fresh or thoroughly cleaned ingredients, such as rice, beans, and vegetables, without mixing them with anything previously handled. Prasad is prepared using rock salt, adhering strictly to Satvik principles.\nALSO READ: Delhi Govt Declares Public Holiday on November 7 For Chhath Puja\nAfter offering the food to the Sun God and Chhathi Maiya, the person fasting consumes the prasad first, followed by sharing it with family members.\nAdditionally, devotees offer milk and water to Lord Surya and don’t forget to listen to the Chhath Puja Vrat Katha in the evening.\nCHHATH PUJA NAHAY KHAY WISHES 2024\nHappy Chhath Puja wishes to you and your family. (Image: Shutterstock)\nWishing you a joyous Nahay Khay filled with blessings and positivity!\nMay the Sun God bring happiness and prosperity to your home this Chhath Puja!\nOn this auspicious Nahay Khay, may your prayers be answered and your dreams fulfilled!\nHappy Nahay Khay! May you and your family be blessed with health and harmony.\nAs you celebrate Nahay Khay, may the light of the Sun illuminate your path!\nWishing you a blessed Nahay Khay, filled with love, peace, and abundance.\nMay the spirit of Chhath Puja fill your heart with joy and your home with warmth!\nOn this special day, may you receive the blessings of Lord Surya and Chhathi Maiya!\nHappy Nahay Khay! May this festival bring you closer to your loved ones.\nWishing you a fulfilling Nahay Khay, where every moment is filled with gratitude and joy!",
        "summary": "Chhath Puja festivities begin with Nahay Khay on November 5, followed by Kharna, Sandhya Arghya and ends with Usha Arghya on November 8.",
        "url": "https://www.news18.com/lifestyle/chhath-puja-2024-nahay-khay-date-rituals-samagri-dos-donts-9108025.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/chhath-puja-2024-23-2024-11-566e3e1c2d2d71f280bbe4e04c757fe7-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 01:00:41",
        "author": "News18,Nibandh Vinod",
        "authors": [
            "News18",
            "Nibandh Vinod"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.663
    },
    {
        "id": 262712548,
        "title": "Thailand Announces Indefinite Visa-Free Entry for Indian Nationals: What You Need to Know",
        "text": "Exciting news for Indian travelers! Thailand has announced an indefinite extension of its visa-free entry policy for Indian nationals, which was initially set to end on November 11, 2024. This policy allows Indian visitors to enjoy a stay in Thailand for up to 60 days without a visa, with the option to extend for an additional 30 days at a local immigration office. The extended policy aims to make travel more accessible for Indian tourists, offering them the freedom to explore Thailand’s captivating landscapes and cultural treasures without the need for a visa application.\nThe Tourism Authority of Thailand (TAT) confirmed this decision, and officials at the Royal Thai Embassy in New Delhi have shared their enthusiasm for the indefinite extension, recognizing its positive impact on both Thai tourism and the ease of travel for Indian visitors.\nVisa-free travel brings significant advantages, simplifying travel arrangements while boosting the economy of the host country. Key benefits include:\n\nIncreased tourism revenue\nMore tourists mean greater demand for accommodations, dining, tours, and transportation services, driving growth in the hospitality and tourism sectors.\nJob creation\nWith rising visitor numbers, there’s a corresponding increase in employment opportunities, supporting local businesses and benefiting communities across Thailand.\n\nDiscover the Wonders of Thailand\nThailand is an extraordinary destination that offers a unique blend of culture, natural beauty, and adventure. Begin your journey in Bangkok, the dynamic capital city known for its beautiful temples such as the Grand Palace and Wat Arun, which stand majestically against the city’s skyline.\nFor a more tranquil experience, head north to Chiang Mai, where you’ll find serene temples and access to lush, mountainous regions perfect for trekking. Just outside of Bangkok, you can also visit the famous Floating Markets, where vibrant stalls float along the canals, offering a unique shopping experience.\nWith its incredible food, welcoming locals, and budget-friendly options, Thailand is a dream destination for travelers. From stunning beaches and ancient temples to lively cities, Thailand promises unforgettable experiences for every type of traveler.",
        "summary": "Thailand extends visa-free entry for Indian travelers indefinitely, boosting tourism appeal",
        "url": "https://www.news18.com/lifestyle/thailand-announces-indefinite-visa-free-entry-for-indian-nationals-what-you-need-to-know-9109359.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/shutterstock_2501780187-2024-11-5e9ccf21f49b052eaee4307a0cf02c08-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 03:05:16",
        "author": "News18,Swati Chaturvedi",
        "authors": [
            "News18",
            "Swati Chaturvedi"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 1.0
    },
    {
        "id": 262703688,
        "title": "What If The US Election Ends In A Trump-Harris Tie?",
        "text": "So what exactly happens if neither Kamala Harris or Donald Trump achieves the Electoral College majority required to win the US election?\nWhile not highly likely, such an outcome remains possible, tormenting Americans already perched painfully on the edge of their seats ahead of the November 5 election. Under the US system, it is not the national popular vote that decides who becomes president, but a 538-member “Electoral College,” in which each state gets as many “electors” as their representation in Congress.\nEvery state except Nebraska and Maine award all of their electors to whomever comes first in the state-wide popular vote. If both Harris and Trump fail to reach the majority threshold of 270 electors, the US Constitution says that Congress would play a deciding role. Specifically, the newly elected House of Representatives would select the president in January, while the Senate would designate the next vice president. Several possible scenarios could produce a 269-269 Electoral College split.\nOne example would occur if Democrat Harris prevails in the states of Wisconsin, Michigan and Pennsylvania, while the Republican former president carries Georgia, Arizona, Nevada and North Carolina, plus a single left-leaning district in Nebraska.\n– 200 years –\nA tie would force a so-called contingent election in Congress — something which has never happened in modern American history. The last time a tie forced Congress to pick the president was in the 1800 election, which pitted Thomas Jefferson against incumbent president John Adams.\nLawmakers in a badly divided House struggled mightily to agree, finally selecting Jefferson on their 36th ballot. The excruciating muddle led to the adoption four years later of the 12th Amendment to the US Constitution, to somewhat clarify procedures around the election. This time, if such a House vote should be necessary, it would take place on January 6, 2025. How would that vote proceed?\n– One state, one vote –\n“Each state, regardless of population, casts a single vote for President in a contingent election,” according to the Congressional Research Service (CRS). In other words, Republican-leaning Wyoming with its city-sized population of 500,000 would have the same influence as Democratic California, where 39 million people live.\nThough the US capital city Washington has three Electoral College votes, it would not get a vote in a contingent election, as it is not a state. States with two or more representatives would need to hold an internal vote to determine which candidate to support, a CRS report said.\nA candidate needs to win a majority of the 50 states, or 26 votes. At present, that would likely give Republicans the edge. Specific rules to govern the process would likely have to be adopted by the House, potentially leading to intense disagreements and a protracted period of constitutional crisis.\nIt is not hard to imagine how such a process, at the end of a razor-close campaign, would weigh on the already badly frayed nerves of American voters, many of whom are convinced that the vote has been rife with irregularities.",
        "summary": "If neither Harris nor Trump wins the Electoral College majority in 2024, US Congress could decide the president",
        "url": "https://www.news18.com/world/what-if-the-us-election-ends-in-a-trump-harris-tie-9109318.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/09/untitled-design-2024-09-a8a54c7c93ece38953c41a003ba2327b-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 02:16:09",
        "author": "News18,Rohit",
        "authors": [
            "News18",
            "Rohit"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.307
    },
    {
        "id": 262760958,
        "title": "KL Rahul Shares Goofy Pics To Wish ‘Craziee Birthday Baby’ Athiya Shetty; Ahan Is ‘Grateful’ For His Sister",
        "text": "Actress Athiya Shetty is celebrating her 32nd birthday today, and celebrities such as Kareena apoor Khan, Parineeti Chopra, Ananya Panday, Samantha Ruth Prabhu, and many others wished her on social media. Her father Suniel Shetty was among the first ones to share a lovely post for Athiya on her birthday. Now, Athiya’s hubby and cricketer KL Rahul has also shared a romantic, goofy post for her, sharing their unseen pictures together. Meanwhile, Athiya’s brother Ahan expressed how grateful he is for her.\nOn Tuesday afternoon, KL Rahul took to his Instagram account to share a series of pictures with his wife Athiya Shetty. On her special day, the cricketer wished her with a simple yet sweet caption that read, “My craziee birthday baby ,” along with a red heart and infinity emojis. The first picture seems to be from their pre-wedding festivities. The actress donned a golden silk saree with a rani pink blouse for their Muhurtham ceremony. She is seen making a goofy face at her hubby KL Rahul, who is seen holding her in his arms.\nIn another picture, the couple is seen gorging on noodles, while the next picture appears to be from a vacation together. The last photo shows Athiya with a hilarious expression on her face. Athiya reacted to the post, and wrote, “Love you.” Check out the post below!\n\nView this post on Instagram\n\nA post shared by KL Rahul? (@klrahul)\n\nMeanwhile, Athiya’s brother Ahan Shetty shared a few pictures with her. One of them is a childhood picture that shows Athiya laughing as she holds Ahan. Another picture is a recent one, and it shows the brother-sister duo posing in a stadium. “I’m so grateful for you.. Happy Birthday @athiyashetty,” he wrote.\nSuniel Shetty wished his daughter by sharing the most adorable childhood pictures of Athiya. He wrote, “Happy birthday to the best part of me …my all time favourite human….my best friend…my confidante and the greatest joy of my life ……love you beyond measure Tiaaaaa.”\n\nView this post on Instagram\n\nA post shared by Ahan Shetty (@ahan.shetty)\n\nOn the professional front, Athiya made her acting debut with Nikkhil Advani’s 2015 film Hero, which also starred debutant Sooraj Pancholi. Post that, she went on to star in Mubarakan, and Motichoor Chaknachoor. She also made a special appearance in a song in Nawabzaade. She will be next seen in footballer Afshan Ashiq’s biopic film ‘Hope Solo’, in which she will essay the lead character.",
        "summary": "On Athiya Shetty’s birthday, her hubby KL dropped their unseen pictures together. Meanwhile, Ahan Shetty shared a major throwback picture featuring his sister.",
        "url": "https://www.news18.com/movies/kl-rahul-shares-goofy-pics-to-wish-craziee-birthday-baby-athiya-shetty-ahan-is-grateful-for-his-sister-9109797.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/kl-rahul-shares-goofy-pics-to-wish-craziee-birthday-baby-athiya-shetty-ahan-is-grateful-for-his-1-2024-11-f237f0848c07e62b7e4febbfa79a70f9-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 08:53:00",
        "author": "Lubna Khan,News18",
        "authors": [
            "Lubna Khan",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.742
    },
    {
        "id": 262785504,
        "title": "MP TET 2024 Admit Cards Released at esb.mp.gov.in, Steps To Download Hall Ticket",
        "text": "The Madhya Pradesh Employees Selection Board (MPESB) has released the state Primary School Teacher Eligibility Test (TET) 2024 admit cards. Candidates who applied for the exam can check and download the hall tickets via the official website at esb.mp.gov.in.\nAs per the official schedule, the MP TET 2024 exam will be held on November 10 in two shifts. The morning shift will be held from 9 am to 11:30 am and the afternoon shift from 2:30 pm to 5 pm.\nMP TET 2024 Admit Card: How To Download?\nStep 1: Go to the official website at esb.mponline.gov.in.\nStep 2: On the homepage, look for and click on the ‘MP TET 2024’ registration link (once activated).\nStep 3: As a new window opens, candidates must register themselves.\nStep 4: After registration, proceed to fill out the application form.\nStep 5: To complete the process, pay the examination fee.\nStep 6: Crosscheck all the details and submit the form.\nThis eligibility test is held for government teaching jobs in schools across Madhya Pradesh. The MP TET 2024 registration process took place from October 1 to 15.\nThe MP TET test is intended to measure candidates’ proficiency in essential subjects required for primary school. The examination will be divided into five sections: Language 1, Language 2, Child Development and Pedagogy, Mathematics, and Environmental Studies. Each section will include 30 multiple-choice questions (MCQs). Candidates should keep in mind that 30 marks will be allotted to each section, for a total of 150 questions and 150 marks.",
        "summary": "As per the official schedule, the MP TET 2024 exam will be held on November 10 in two shifts. The morning shift will be held from 9 am to 11:30 am and the afternoon shift from 2:30 pm to 5 pm",
        "url": "https://www.news18.com/education-career/mp-tet-2024-admit-cards-released-at-esb-mp-gov-in-steps-to-download-hall-ticket-9109915.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/09/jobs-2024-09-278af6a3f62dc784730c0b398ab1e1d7-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 10:44:52",
        "author": "News18,Sukanya Nandy",
        "authors": [
            "News18",
            "Sukanya Nandy"
        ],
        "language": "en",
        "category": "education",
        "source_country": "in",
        "sentiment": 0.454
    },
    {
        "id": 262752764,
        "title": "Now Tax Officials Can Waive, Reduce Your Interest Dues, CBDT Allows Big Change, Check Details",
        "text": "The income tax department has allowed tax officials to either waive or reduce the interest payable by a taxpayer, subject to specified conditions.\nOverview of Section 220 (2A)\nUnder the Income Tax Act Section 220 (2A), if a taxpayer fails to pay the tax amount specified in any demand notice, he/she is liable to pay interest at 1 per cent per month for the period of delay in making the payment.\nAuthority to Waive or Reduce Interest\nThe Act also empowers Principal Chief Commissioner (PrCCIT) or Chief Commissioner (CCIT) or Principal Commissioner (PrCIT) or Commissioner rank officers to reduce or waive the amount of interest due to be paid.\nCBDT Circular on Monetary Threshold\nThe Central Board of Direct Taxes (CBDT) through a circular dated November 4 has specified the monetary threshold of the interest that can be waived or reduced by the tax officers.\nDelegation of Decision-Making\nAccordingly, the PrCCIT rank officer can decide on reducing or waiving interest due of over Rs 1.5 crore. For interest due above Rs 50 lakh to Rs 1.5 crore, the CCIT rank officer will decide on the waiver/reduction, while PrCIT or Income Tax Commissioners can decide on interest due up to Rs 50 lakh.\nConditions for Waiver or Reduction\nThe power of reduction or waiver of the interest payable under Section 220(2A) would be subject to satisfaction of three specified conditions — payment of such amount has caused or would cause genuine hardship to the assessee; default in interest payment was due to circumstances beyond the control of the assessee; the assessee has cooperated in inquiry relating to assessment or proceeding of the recovery of any amount due from him.\nExpert Opinions\nNangia & Co LLP Partner Sachin Garg said, “This move of CBDT is expected to facilitate expeditious disposal of applications by a taxpayer for waiver or reduction of interest under section 220. It may be noted that there is no change in the specified conditions that are required to be met for seeking such a reduction or waiver of interest under section 220 of the Act.” A\nMRG & Associates Senior Partner Rajat Mohan said this move will promote transparency and efficiency in granting interest relief.\n“Based on the waiver amount, it empowers officials at different levels to make quicker decisions, enhancing consistency across cases and reducing administrative bottlenecks,” he added.",
        "summary": "The income tax department has allowed tax officials to either waive, reduce interest payable by a taxpayer, subject to conditions",
        "url": "https://www.news18.com/business/tax/now-tax-officials-can-waive-reduce-your-interest-dues-cbdt-allows-big-change-check-details-9109707.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/income-tax-1200-1-2024-11-e4e939da76bd804519d211dbad4e6cb7-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 08:04:48",
        "author": "Namit Singh Sengar,News18",
        "authors": [
            "Namit Singh Sengar",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.216
    },
    {
        "id": 262797134,
        "title": "SSC GD 2025 Application Correction Window Opens at ssc.gov.in, Steps To Edit",
        "text": "The Staff Selection Commission (SSC) has opened the application correction form for the General Duty (GD) Recruitment 2025 today, November 5, 2024. Candidates who have already applied for the recruitment process can now make necessary edits and corrections until November 7, 2024.\nCandidates have the opportunity to modify certain fields in the SSC GD 2025 application form which include their name, date of birth, father’s name, mother’s name, category, status regarding differently abled status, correspondence address, the first choice of exam centre, and the name of the institute.\nSSC GD 2025 Application Correction Window Opens: Steps To Edit\nStep 1: Go to the official website at ssc.gov.in.\nStep 2: Log in to your account on the homepage.\nStep 3: Locate your SSC GD application form and identify the fields that need correction.\nStep 4: If applicable, pay any required fees and then click on the submit button.\nIn this recruitment drive, a total of 39,481 positions have been announced for various Central Armed Police Forces (CAPFs) and paramilitary organizations. Selected candidates will serve as General Duty Constables in various forces:\nBorder Security Force (BSF): 15,654 posts\nCentral Industrial Security Force (CISF): 7,145 posts\nCentral Reserve Police Force (CRPF): 11,541 posts\nSashastra Seema Bal (SSB): 819 posts\nIndo-Tibetan Border Police (ITBP): 3,017 posts\nAssam Rifles (AR): 1,248 posts\nSecretariat Security Force (SSF): 35 posts\nNarcotics Control Bureau (NCB): 22 posts\nCandidates who have completed their class 10 examination from a recognised board or university prior to January 1, 2025 are eligible to apply for SSC GD exam. They must also be aged between 18 and 23 years as of January 1, 2025.",
        "summary": "SSC GD 2025: Candidates who have already applied for the recruitment process can now make necessary edits and corrections until November 7, 2024.",
        "url": "https://www.news18.com/education-career/ssc-gd-2025-application-correction-window-opens-at-ssc-gov-in-steps-to-edit-9110045.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/08/ssc3-2024-08-30d67021f237bf53b817ae744f5049e3-16x9.jpeg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 11:36:29",
        "author": "News18,Sukanya Nandy",
        "authors": [
            "News18",
            "Sukanya Nandy"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.15
    },
    {
        "id": 262758782,
        "title": "Indian Boxer Mandeep Jangra Wins WBF's Super Featherweight World Title",
        "text": "Indian professional boxer Mandeep Jangra won the World Boxing Federation’s super featherweight world title after defeating Britain’s Conor McIntosh in the Cayman Islands.\nThe 31-year-old, who trains under former Olympic silver medallist Roy Jones Jr and has faced only one defeat in his professional career so far, had the upper hand in most rounds.\nHe delivered powerful punches from the outset, maintaining his stamina throughout the 10 rounds, while the British boxer struggled to keep pace.\nConor did try to make a comeback, but Jangra continued to maintain the upper hand in most rounds.\n“This is one of the biggest victories of my career. I am thankful to my sponsor Nash Built Construction, Chief Coach Roy Jones, Assistant Coach Asa Beard and Angel,” Jangra said in a media release\n“I have worked hard for years to achieve this. It is a matter of pride for me that I could bring glory to the country.”\nThe Haryana boxer, who made his professional boxing debut in 2021, hopes the title will inspire more Indian pugilists to turn professional.\n“I think this title will open the way for other boxers of the country and they will also decide to make a career in professional boxing.\n“Our boxers are good and there is no dearth of talent in them. If they get good promoters and managers, they can also become world champions,” Jangra added.\nJangra has won 11 out of his 12 fights in his pro career with seven being knockout victories.\nHe had a decent run in the amateur circuit as well and won a Commonwealth Games silver medal in the 2014 Glasgow edition.",
        "summary": "The Haryana boxer, who made his professional boxing debut in 2021, hopes the title will inspire more Indian pugilists to turn professional.",
        "url": "https://www.news18.com/sports/indian-boxer-mandeep-jangra-wins-wbfs-super-featherweight-world-title-9109678.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/gbbtuxmaeaa9ygt-fotor-202411051492-2024-11-009bddb4381cc6d3d5c49940a458a16c-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 08:39:55",
        "author": "News18,Siddarth Sriram",
        "authors": [
            "News18",
            "Siddarth Sriram"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.135
    },
    {
        "id": 262736654,
        "title": "Chhath Puja 2024 Begins Today With Nahay-Khay; Know The Rituals, Timings, Best Satvik Food For Fasts",
        "text": "Chhath Puja, a grand four-day festival, begins each year on the sixth day of the lunar month of Kartik. This year, it commences on November 5, with the first day observed as Nahay-Khay. This festival of devotion is dedicated to Surya Dev and his sister, Chhathi Maiyya, and is celebrated for the well-being and prosperity of children.\nOn the first day, people perform a ritual bath and begin their preparations for the festival.\nAstrologer and Vastu expert Rakesh Chaturvedi of Ghaziabad explains the rituals of Nahay-Khay and provides the auspicious timing for Arghya during Chhath.\nHe says the Chhath Mahaparv is celebrated from Chaturthi Tithi to Saptami Tithi of Shukla Paksha in the Kartik month. The festival begins with Nahay-Khay, followed by Kharna the next day. Arghya is offered to the setting sun on the Shashthi Tithi and to the rising sun on the Saptami Tithi, marking the festival’s conclusion.\nDevotees observe a 36-hour fast without even water after Kharna Puja.\nSunrise-Sunset Timing For Nahay-Khay\nThe astrologer further added that all the auspicious timings for Chhath Puja depend on the sunrise and sunset. “Today in Delhi, sunrise occurred at 6:36 am, and sunset is expected at 5:33 pm. During this time, those fasting will worship the sun god with a ritual bath and meditation before consuming satvik food.”\nAuspicious Timings For Chhath Puja 2024\nAccording to the Vedic Panchang, this year, the Shashthi Tithi of Shukla Paksha in Kartik month starts on November 7 at 12:41 pm and ends on November 8 at 12:34 pm. The evening Arghya will be offered on November 7, while the morning Arghya will be offered on November 8.\nObserving A Satvik Diet\nOn the day of Nahay-Khay, those observing the Chhath fast eat satvik food. Traditionally, foods that reduce hunger and thirst are consumed on this day. Vegetables are prepared without onion and garlic, and cooking gourd and pumpkin is especially significant. Chickpea lentils with rice are a common meal. Pumpkin is particularly favoured for its hydrating properties, which help devotees sustain their energy during the long fast.",
        "summary": "Chhath Puja 2024: According to the Vedic Panchang, this year, the Shashthi Tithi of Shukla Paksha in Kartik month starts on November 7 at 12:41 pm and ends on November 8 at 12:34 pm",
        "url": "https://www.news18.com/lifestyle/chhath-puja-2024-begins-today-with-nahay-khay-know-the-rituals-timings-best-satvik-food-for-fasts-9109512.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/coffee-3-2024-11-6000f64279b924b709a051daeef6c560-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 06:36:04",
        "author": "News18,Sameeksha Sharma",
        "authors": [
            "News18",
            "Sameeksha Sharma"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.625
    },
    {
        "id": 262749604,
        "title": "Hyderabad: 6-Year-Old Dies Of Head Injuries After Iron Gate Falls On Him At School",
        "text": "A six-year-old boy died of severe head injuries after an iron gate fell on him while he was playing with his friends at a school in Hyderabad’s Hayath Nagar on Monday evening.\nAccording to police, the Class 1 boy, Ajay, was playing near the iron gate at MPP School around 4 pm when the incident took place.\nPolice sources said, some children climbed atop the gate and swung it to and fro, the weakly welded joints crumbled and the gate fell on Ajay and he suffered serious head injuries.\nHe eventually succumbed to his injuries. Police have launched a probe into the matter.\nThis is not a one-off incident.",
        "summary": "the Class 1 boy, Ajay, was playing near the iron gate at MPP School around 4 pm when the incident took place",
        "url": "https://www.news18.com/india/hyderabad-6-year-old-dies-of-head-injuries-after-iron-gate-falls-on-him-at-school-9109688.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/befunky-collage-82-2024-11-6e8e7fd5587c6f6dd5a8b612f66119de-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 07:49:44",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.462
    },
    {
        "id": 262729114,
        "title": "I Want To Talk Trailer: Abhishek Bachchan, Shoojit Sircar Set To Roll Out An Emotional Film",
        "text": "I Want To Talk Trailer: The trailer of Abhishek Bachchan’s new film, I Want To Talk has finally released and it shows the actor in a never-before-seen avatar. The film, directed by Shoojit Sircar, shows Abhishek sporting a potbelly while handing out life gyaans to people. The trailer gives a glimpse of the slice of life story. \nThe trailer was released on Tuesday, November 5. The film is slated to release on November 22 in theatres. Besides Abhishek, the Shoojit Sircar film also stars Banita Sandhu and Johny Lever. Although Shoojit has collaborated with Amitabh Bachchan several times, this is his first project with Abhishek Bachchan. Watch the trailer below: \n\nIn August this year, Shoojit opened up about the film and praised Abhishek as well. “It’s a very simple observation of life with a little smile. When I watch the film, its post-production, it brings a smile . And, I can guarantee that it is one of the finest of Abhishek Bachchan films. We always wanted to work together but we were not getting the right kind of script,” the filmmaker told PTI.\nAlthough Shoojit had released Gulaabo Sitabo and Sardar Udham, I Want To Talk marks his first big screen release since 2018’s October, which starred Varun Dhawan and Banita in the lead. Speaking about the long breaks between the films, Shoojit said, “I make very few films and my subjects are very offbeat but it’s usually stories of everyday life that I see. Some love them and some don’t but I am okay with it. I’m thankful to those who appreciate them.”\nShoojit and Abhishek released the first look and poster a few days ago and it has caught everyone’s attention. At the time, the director and the actor got shoutouts from many, including Vicky Kaushal and Amitabh Bachchan, besides the fans.",
        "summary": "I Want To Talk trailer: Abhishek Bachchan appears in a never-before-seen avatar in Shoojit Sircar's slice-of-life drama.",
        "url": "https://www.news18.com/movies/i-want-to-talk-trailer-abhishek-bachchan-shoojit-sircar-film-9109504.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/i-want-to-talk-trailer-abhishek-bachchan-2024-11-73852caba2ca59378f738c6d8244a581-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-05 05:36:25",
        "author": "Dishya Sharma,News18",
        "authors": [
            "Dishya Sharma",
            "News18"
        ],
        "language": "en",
        "category": "entertainment",
        "source_country": "in",
        "sentiment": 0.578
    }
]