[
    {
        "id": 263704780,
        "title": "Madrassa teacher in Kerala held for branding student with iron box",
        "text": "Kannur (Kerala): A Madrassa teacher was arrested for allegedly branding a student with an iron box in this north Kerala district, police said on Saturday.Umair Ashrafi, hailing from Tanur in neighbouring Malappuram district, was also accused of smearing chilli powder on the private parts of the boy, alleging disobedience, they said. As the student lodged a complaint with the police recently, the accused fled from the state and was staying in hideouts in various places in Karnataka and Tamil Nadu.Based on a tip-off that he was coming to his home district from Coimbatore in Tamil Nadu, a police team reached Tanur and waited for his arrival on Thursday. Though Ashrafi tried to run away on seeing the police, he was later caught. Kannavam police arrested him and booked him under relevant sections of the Bharatiya Nyaya Sanhita (BNS). Ashrafi was produced before a local court here which remanded him to judicial custody on Friday, police added.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/kerala/madrassa-teacher-in-kerala-held-for-branding-student-with-iron-box-1836723",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/28/1846368-crime.webp",
        "video": null,
        "publish_date": "2024-11-09 08:48:16",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.335
    },
    {
        "id": 263734448,
        "title": "Don't judge Kohli on current form: Ricky Ponting",
        "text": "Dubai: Indian batting stalwart Virat Kohli should not be judged on the basis of current form and that the champion cricketer could make a powerful statement during the upcoming five-Test Border-Gavaskar series given his class, feels legendary Australian player Ricky Ponting. The much-awaited series against Pat Cummins' Australia will commence in Perth on November 22 and Kohli, as always, will be a vital cog in India's scheme of things if they are to retain the prestigious trophy. India's famed legacy in Test cricket at home was torn to shreds during their 0-3 decimation by New Zealand recently, with Kohli scoring just 93 runs in six innings. But Ponting, the former Australian skipper, said he had full faith in Kohli's fighting abilities. \"I've said it before about Virat -- you don't ever question the greats of the game. There's no doubt he's a great of the game,\" Ponting told ICC. Kohli scored 93 runs in three Tests against the Black Caps, scoring a half-century and averaging 15.50 runs. The 36-year-old Kohli was averaging 50-plus runs between 2016-19, but his average has dipped to 31.68. However, Ponting said playing against Australia brings the best out of the Indian stalwart. \"He loves playing against Australia. In fact, I know he loves playing against Australia. And his record (in Australia) is very good.\" Ponting believes the Border-Gavaskar series could see the revival of Kohli's Test career. \"If there's a time for him to turn it around, it'd be this series. So, I wouldn't be surprised to see Virat make runs in the first game. Since the beginning of this year, Kohli has averaged just 22.72 in six Tests -- the lowest in the format for him in a year since his debut in 2011. He has slipped in the ICC Test rankings as well, moving out of the top-20 list for the first time in 10 years, and Ponting does feel it is a matter of concern. \"I saw a stat the other day about Virat; it said he's only scored two (three) Test hundreds in the last five years. That didn't seem right to me, but if that is right, then that is, I mean, that's a concern. \"There wouldn't be anyone else probably even playing international cricket as a top-order batsman that's only scored two Test match hundreds in five years.\"",
        "summary": "Ponting says Australia series could change it all",
        "url": "https://www.deccanchronicle.com/sports/cricket/dont-judge-kohli-on-current-form-ricky-ponting-1836806",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/09/1860895-untitleddesign79.webp",
        "video": null,
        "publish_date": "2024-11-09 12:25:44",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.149
    },
    {
        "id": 263686144,
        "title": "Caste census, removing 50 per cent cap on reservations central to vision for country: Congress",
        "text": "New Delhi: The Congress on Saturday asserted that a nationwide caste survey and the lifting of the Supreme Court's “arbitrary ceiling” of 50 per cent on reservations for Scheduled Castes, Scheduled Tribes, and Other Backward Classes are central to its vision for the country. Congress general secretary in-charge, communications, Jairam Ramesh said in a post on X that the party's government in Telangana will begin its caste survey on Saturday. He said 80,000 enumerators will be going door to door over the next few weeks, covering over 1.17 crore households across 33 districts. This is the first time a caste-based survey is being conducted by the government in Telangana since 1931, Ramesh said. “It is a historic, revolutionary moment -- one that is a realisation of the Telangana Movement's aspirations for the state and a fulfillment of one of the key ideals of Dr. Babasaheb Ambedkar's Constitution,” the Congress general secretary said. It is also, as Rahul Gandhi noted in Hyderabad earlier this week, a blueprint for the national caste survey that the INDIA coalition's government will conduct, he said. “This census, and the lifting of the Supreme Court's arbitrary ceiling of 50% on reservations for Scheduled Castes, Scheduled Tribes, and Other Backward Classes are central to Congress' vision for the country,” Ramesh said. “We are committed to the idea of social, political and economic justice in India, as laid out in our Constitution and as envisioned by India's founding fathers,” he asserted. Gandhi, who attended a meeting organised by Telangana Congress on the caste survey on November 5, had said he was fully committed to ensuring the caste survey in Telangana.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/politics/caste-census-removing-50-per-cent-cap-on-reservations-central-to-vision-for-country-congress-1836673",
        "image": "https://www.deccanchronicle.com/h-upload/2024/05/31/1096587-jairamramesh.webp",
        "video": null,
        "publish_date": "2024-11-09 06:07:50",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.188
    },
    {
        "id": 263737150,
        "title": "Pakistan: Imran Khan gets bail in four cases related to May 9 violence",
        "text": "Lahore: An anti-terrorism court in Pakistan has granted post-arrest bail to jailed former prime minister Imran Khan in four arson cases in Lahore and adjourned hearings in another eight ones till November 30.The Pakistan Tehreek-e-Insaf (PTI) supreme leader was booked in 12 cases in Lahore in connection with May 2023 violence, including for allegedly attacking the government and military buildings following his arrest in a graft case.Khan is lodged at the Adiala Jail in Rawalpindi.On Friday, he was granted bail in four cases in connection with allegedly burning the office of the Pakistan Muslim League-Nawaz (PML-N) in Model Town area, a container near Kalma Chowk, police vehicles in Gulberg, and violence at Sherpao Bridge during the May 9, 2023 riots.Khan had sought post arrest bails in these cases.Punjab government law officer, prosecutor Farhad Ali Shah, argued that Khan made a narrative of resorting to violence in case of his arrest. \"The PTI leadership and workers attacked sensitive installations, including military ones on Khan's instructions,\" he said and requested dismissal of the bail pleas.Khan's counsel Barrister Salman Safdar had already completed his arguments on his behalf. However, he sought permission from the court to advance more arguments, saying the prosecution presented arguments contrary to the facts.He requested the court to defer the decision for one hearing.Judge Arshad Javed of the Anti-Terrorism Court (ATC) here then announced the decision, allowing Khan's bail petitions in the four cases.Khan, who was arrested on August 5 last year after his conviction in the first Toshakhana corruption case filed by the Election Commission of Pakistan, has been in jail since then in different cases, with conviction in few of them.Separately, ATC-I judge Manzer Ali Gill gave one last opportunity to Khan's counsel to complete arguments in post-arrest bail petitions in eight other cases connected with the May 9 riots, including an attack on the senior military officer's residence in Lahore.The judge said a decision in the eight cases will be announced in the light of the record of the cases if the petitioner's counsel does not appear at the next hearing.The judge adjourned the hearing till November 30.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/world/pakistan-imran-khan-gets-bail-in-four-cases-related-to-may-9-violence-1836815",
        "image": "https://www.deccanchronicle.com/h-upload/2024/08/21/1832532-imrankhan.webp",
        "video": null,
        "publish_date": "2024-11-09 12:56:28",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.203
    },
    {
        "id": 263721378,
        "title": "Maharashtra polls: Friendly face-offs between allies in 29 out of 288 assembly seats",
        "text": "Mumbai: The November 20 Maharashtra election will witness friendly contests among the Mahayuti and Maha Vikas Aghadi (MVA) allies in 29 out of 288 assembly seats.Friendly fights, however, are more complicated for the MVA, especially since smaller parties who are part of the INDIA bloc are also in the mix. The ruling Mahayuti's partners BJP, Eknath Shinde-led Shiv Sena and Ajit Pawar's Nationalist Congress, will contest alongside each other in six seats Mankhurd Shivajinagar (Mumbai), Ashti (Beed), Sindhkhed Raja (Buldhana), Katol (Nagpur), Morshi (Amravati), Dindori (Nashik), Shrirampur (Ahmednagar) and Purandar (Pune).The opposition alliance of the Shiv Sena (UBT), NCP (SP) and Congress will engage in such face-offs in 21 assembly constituencies. One of the major fights will take place in the Nanded North seat, where Congress's Abdul Gaffoor is in the fray with Shiv Sena (UBT) candidate Sangita Patil.In most constituencies, MVA allies are contesting alongside candidates fielded by the Peasants and Workers Party of India (PWPI), Samajwadi Party and the Left.The Samajwadi Party has fielded eight candidates and will be contesting alongside the Congress on six seats, namely Bhiwandi West (Thane), Tuljapur (Dharashiv), Aurangabad East (Chhatrapati Sambhajinagar), Malegaon Central (Nashik) and with NCP SP in Paranda (Dharashiv), and Shiv Sena UBT in Dhule City assembly seats.The PWPI has fielded candidates on 14 seats and is in contest with the Shiv Sena (UBT) in Sangole, Loha, Pen, Uran, Ausa, Malegaon Outer and Panvel, and with NCP (SP) in Katol.A PWPI leader said they had sought six seats where they are in serious contest. \"However, the bigger parties fielded candidates despite our strong presence in these constituencies,\" he said.The leader said the party had to field candidates wherever it has influence, as it needed to fulfil the electoral criteria of getting the desired number of votes. Asked about the possibility of eating into the alliance's votes, he said, \"It will happen. But what can we do? We sought seats from bigger parties, but they remained adamant.\"In an interview earlier this year, Samajwadi Party leader Abu Azmi said the Maha Vikas Aghadi should have fought the polls as a united front, but it had not even called his party for talks.He said, \"They (MVA) think they can win the polls on their strength, and there is no need for us (SP).\" Solapur City Central will see a contest between the CPM's Narsaya Adam and the Congress, while in the Wani constituency, CPI's Hepat and Shiv Sena (UBT) candidate Sanjay Derkar are in the fray.In Mahayuti, the Shiv Sena and the NCP are in a friendly contest in Purandar, Dindori, Mankhurd Shivaji Nagar, Sindkhedraja and Shrirampur. The NCP and BJP will battle it in Katol, Morshi and Ashti.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/maharashtra-polls-friendly-face-offs-between-allies-in-29-out-of-288-assembly-seats-1836777",
        "image": "https://www.deccanchronicle.com/h-upload/2024/08/07/1829478-1080601-elections.webp",
        "video": null,
        "publish_date": "2024-11-09 10:53:21",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.093
    },
    {
        "id": 263676516,
        "title": "Four, including 3 of family from Hyd, killed in Kalaburagi road accident",
        "text": "Kalaburagi: Four people were killed after their car collided with a pickup goods vehicle near Maragutti cross in Kamalapura taluk here, during the early hours on Saturday, police said.\r\n\r\nThe deceased were identified as Bhargav Krishna (55) from Hyderabad, his wife Sangeetha (45), and their son Uttam Raghavan (28), police said, adding that the identity of the deceased car driver has not yet been established.\r\n\r\nAccording to police sources, the family was said to be on a pilgrimage to the Dattatreya Temple in Ganagapura in Afzalpura taluk. Police reached the spot and shifted the bodies to a local hospital, they said.",
        "summary": "According to officials, the family was said to be on a pilgrimage to the Dattatreya Temple in Ganagapura in Afzalpura taluk when the incident occurred",
        "url": "https://telanganatoday.com/four-including-3-of-family-from-hyd-killed-in-kalaburagi-road-accident",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Accident11-2.jpg",
        "video": null,
        "publish_date": "2024-11-09 04:30:49",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -1.0
    },
    {
        "id": 263707572,
        "title": "AI Express plans more international flights; to have over 110 planes by March 25",
        "text": "New Delhi: Expanding its network and tapping group synergies, Air India Express will focus on connecting smaller cities and towns with metros as well as fly to new overseas destinations, according to senior officials. The airline, which recently completed the merger of AIX Connect with itself, has a fleet of around 90 aircraft and the count is expected to cross 110 by the end of this fiscal.It also aims to fly to a total of 55 destinations by the end of March 2025 and has also rationalised its network as part of Air India Group strategy. Apart from adding domestic routes, the Tata Group-owned airline will start flights to more foreign destinations, including Bangkok and Phuket in Thailand, the officials said.Air India Express Managing Director Aloke Singh said the airline will focus on Tier 2 and 3 cities and towns as they are the growth engines, and the largest chunk of the market is metro to non-metro.\"On the regional short haul international network, it will be primarily from Tier 2, 3 cities to points in the Gulf, Middle East, South East Asia and going forward, South Asia. Perhaps, Far East in a couple of years,\" Singh said at a select media interaction on Friday.He also stressed that the airline's network strategy is also deeply woven into the group network strategy. As part of consolidating its airline business, Tata Group has merged AIX Connect with Air India Express and the integration of Vistara with Air India is scheduled to be completed next week.Air India Express Chief Commercial Officer (CCO) Ankur Garg said that Bangkok and Phuket are being looked at to start services. To Bangkok, the flights are likely from Tier 2 cities and to Phuket, the service could be from a metro, Garg said.Among other destinations, the airline might also explore the possibility of flying to Malaysia, Hong Kong and CIS countries in the future. \"We don't want to spread too thin. We want to focus on Tier 2, 3 markets from the metros. We want to provide connectivity between the full service, long haul, wide body side of the business and the domestic Tier 2, 3 cities,\" Singh said.In response to a question, he said there are no plans to have premium economy class seats in its flights. At present, Air India Express offers economy class seats and business class seats in some planes.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/ai-express-plans-more-international-flights-to-have-over-110-planes-by-march-25-1836731",
        "image": "https://www.deccanchronicle.com/h-upload/2024/08/06/1829255-airindia.webp",
        "video": null,
        "publish_date": "2024-11-09 09:07:32",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.122
    },
    {
        "id": 263686476,
        "title": "Vivek Ramaswamy says Trump’s victory is hopefully US’ comeback",
        "text": "Washington: Donald Trump's victory in the US presidential election will renew national self-confidence, an Indian-American politician and a close confidant of the President-elect has said, expressing hope that his comeback will signify America's comeback.\r\n\r\nIn a historic election on Tuesday, Trump defeated his Democratic rival Vice President Kamala Harris and was elected the 47th President of the United States, becoming only the second commander-in-chief in over a century to win two nonconsecutive presidential terms.\r\n\r\n“America has this great tradition. We believe in our own manifest destiny...We are born to be the greatest nation that sets an example for everybody else of what's possible for human capacity,” Vivek Ramaswamy told the Tucker Carlson Show in an interview.\r\n\r\n“I think that that's the kind of leader we need right now to bring that back. And that's Donald Trump as a person. So, in some ways, Trump's story is America's story. Trump's comeback is now hopefully America's comeback,” Ramaswamy said in response to a question.\r\n\r\nA Trump win, he said, will result in the renewal of national self-confidence. “I think that we're going to be more sure of ourselves as Americans. I think we already are,\" the entrepreneur-turned-politician said.\r\n\r\n\"The markets reflect confidence. The revival of our self-confidence is the most important thing...Everything else, we could talk about the issues, fixing the border, restoring law and order, enforcing the law, ending rampant crime in the country, and growing the economy all of those things require a certain level of self-confidence in America, require a certain sense of spine in who we are to be able to say, an economy grows when people are willing to take risks,” he said.\r\n\r\nHe said there is a spiritual revival of American identity. “That was the pinnacle of what we saw on Tuesday night. There was a moment, there was a moment,” he said. Ramaswamy revealed that he, Vice President-elect JD Vance and his spouse Usha Vance were classmates in Yale Law School.\r\n\r\n“We were in the same class. Me, Usha, and J D, we're all classmates. And my wife was in med school at the same time. So we were all friendly,” he said. Trump, he noted, has learned a lot from that first term. “This time around, he is laser-focused on making sure that the people he puts into those positions actually share broadly his vision for the country, broadly share an allegiance,” Ramaswamy said.",
        "summary": "A Trump win will result in the renewal of national self-confidence, says the Indian-American politician and close confidant of President-elect",
        "url": "https://telanganatoday.com/vivek-ramaswamy-says-trumps-victory-is-hopefully-us-comeback",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Donald-Trump-5.jpg",
        "video": null,
        "publish_date": "2024-11-09 06:09:49",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.159
    },
    {
        "id": 263681010,
        "title": "Gujarat: Amreli Family Hosts 1,500 People For Unique Burial Ceremony Of 12-Year-Old 'Lucky' Wagon R; Visuals Surface",
        "text": "Nearly 1,500 people, including seers and spiritual leaders, attended the function organised by Sanjay Polara and his family at Padarshinga village of Lathi taluka on Thursday. A video of the event that went viral on social media shows Polara and his family performing rituals at their farm, where a slope and 15-foot deep pit was dug for their 12-year-old Wagon R.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/gujarat-amreli-family-hosts-1500-people-for-unique-burial-ceremony-of-12-year-old-lucky-wagon-r-visuals-surface",
        "image": "https://media.assettype.com/freepressjournal/2024-11-09/oshtsdju/her-1.jpg",
        "video": null,
        "publish_date": "2024-11-09 05:16:56",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "IN",
        "sentiment": 0.512
    },
    {
        "id": 263691812,
        "title": "Zendaya and Anne Hathaway join Christopher Nolan's next movie",
        "text": "Los Angeles: Hollywood star Zendaya and Oscar winner Anne Hathaway are the latest additions to the cast of Christopher Nolan's upcoming feature film. The untitled project marks Nolan's next offering following the success of the multiple award-winning \"Oppenheimer\", which also earned him his first Best Director Academy Award. According to The Hollywood Reporter, plot details are being kept under wraps, but sources say the setting is not contemporary. It is also unclear whether the currently untitled movie is set in the past or future. In the movie, Zendaya will join Tom Holland, her partner and co-star from three \"Spider-Man\" movies, as well as Matt Damon, who appeared in Nolan's 2014 film \"Interstellar\" and \"Oppenheimer\" (2023). Hathaway will reunite with Nolan after working with the filmmaker on \"The Dark Knight Rises\" (2012) and \"Interstellar\". Nolan wrote the script and is directing the film, which will be distributed by Universal Pictures. The filmmaker is also backing the project alongside producing partner and wife, Emma Thomas, for their Syncopy banner. Universal Pictures has set a release date of July 17, 2026, for the movie.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/entertainment/hollywood/zendaya-and-anne-hathaway-join-christopher-nolans-next-movie-1836685",
        "image": "https://images.deccanchronicle.com/dc-Cover-og3q6vfulk1q62t15qhnkls0b1-20190603004605.Medi.jpeg",
        "video": null,
        "publish_date": "2024-11-09 06:44:03",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.214
    },
    {
        "id": 263676514,
        "title": "India slams Pakistan for peddling falsehoods",
        "text": "United Nations: In a strong retort, India slammed Pakistan for peddling “falsehood” after it referred to Jammu and Kashmir during a debate on peacekeeping operations in the UN.\r\n\r\n“India chooses its right to reply in response to the comments made by Pakistan that has yet again made an attempt to divert this august body from its agenda,” Member of the Rajya Sabha and BJP national spokesperson Sudhanshu Trivedi said.\r\n\r\nHis remarks came during a debate on peacekeeping operations at the Special Political and Decolonisation (Fourth Committee) of the UN General Assembly here Friday. Trivedi asserted that the Union Territory of Jammu and Kashmir “was, is and will remain an integral part of India\".\r\n\r\n“The people of Jammu and Kashmir have recently exercised their democratic and electoral rights and elected a new government. Pakistan must desist from such rhetoric and falsehood because it will not alter the facts,” Trivedi said.\r\n\r\nHe added that out of respect for the august members of the UN forum, India will refrain from responding to any further attempts by Pakistan to “abuse” the UN procedures.\r\n\r\nTrivedi delivered India's strong response after the Pakistani delegate spoke about the United Nations Military Observer Group in India and Pakistan (UNMOGIP), mandated to supervise the ceasefire along the Line of Control.\r\nIndia maintains that UNMOGIP has outlived its utility and is irrelevant after the Simla Agreement and the consequent establishment of the Line of Control.\r\n\r\nLater in a post on X, Trivedi said during discussions in the United Nations on peacekeeping operations, the representative from Pakistan, while speaking on the subject of UN peacekeeping, “tried to digress the subject and unnecessarily mentioned that Pakistan's involvement with UN peacekeepers started when UN has put up peacekeepers in 1948\" in territory Jammu and Kashmir.\r\n\r\nTrivedi added that \"taking a sharp exception of this remark,” he exercised the Right of Reply and “firmly stated on the floor that the Union territory of Jammu and Kashmir was, is and will remain an integral part of India.”\r\n\r\n“It has also recently gone through a proper democratic election. So the august forum of United Nations cannot be used in mentioning these types of non-substantive and misleading terms,” Trivedi said.\r\n\r\nHe added that this could have been “possible because of firm foreign policies” of Prime Minister Narendra Modi-led government for a “strong and assertive India on the international stage.”\r\n\r\nTrivedi is part of a delegation of 12 Members of Parliament from India who are visiting the UN for diverse engagements at the world body.",
        "summary": "BJP MP Sudhanshu Trivedi says Union Territory of Jammu and Kashmir “was, is and will remain an integral part of India\"",
        "url": "https://telanganatoday.com/india-slams-pakistan-for-peddling-falsehoods",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/India-slams-Pakistan-for-peddling-falsehoods.jpg",
        "video": null,
        "publish_date": "2024-11-09 04:20:20",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.117
    },
    {
        "id": 263684416,
        "title": "Income Tax raids in J'khand, premises of CM Soren's aide also being searched",
        "text": "Ranchi: The Income Tax Department Saturday conducted searches at multiple locations in poll-bound Jharkhand, including on the premises of a person linked to Chief Minister Hemant Soren, as part of a tax evasion probe, official sources said. A total of nine premises in state capital Ranchi and Jamshedpur are being raided in an operation that started early morning. A security team of the CRPF is assisting the I-T teams, the sources said.The locations linked to Sunil Shrivastava, an advisor to the CM, are also being searched, they said. The action is linked to recent investigations launched by the ED and the CBI over alleged illegal liquor trade and mining in the state, the sources said. The state is scheduled to votes in two phase on November 13 and November 20.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/income-tax-raids-in-jkhand-premises-of-cm-sorens-aide-also-being-searched-1836664",
        "image": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-0885rda8bgh9sds8jg6776vda3-20231220220727.Medi.jpeg",
        "video": null,
        "publish_date": "2024-11-09 05:53:09",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 263702412,
        "title": "Andhra CM launches demo seaplane flight from Vijayawada to Srisailam",
        "text": "Amaravati: Andhra Pradesh Chief Minister N Chandrababu Naidu on Saturday launched a seaplane demo flight operation from Prakasam Barrage in Vijayawada to Srisailam in Nandyal district.Addressing a meeting after the launch of the demo flight at Punnami Ghat on the Krishna river in Vijayawada, he said, \"This is a new experiment (seaplane demo flight). I am very happy. If anything new happens in the country, it should happen in Amaravati. We are going ahead with that motto.\"Later, the chief minister boarded the seaplane, accompanied by Union Civil Aviation Minister K Ram Mohan Naidu and others and set off for the temple town. According to CM Naidu, seaplane services would be an innovative opportunity which will promote economic activities to create employment.He highlighted that Prime Minister Narendra Modi also came forward to promote seaplane operations in the southern state, which does not require the expensive infrastructure needed for a regular airport.With seaplane services, the state government aims to position Andhra Pradesh at the forefront of India's water-based aviation sector. The chief minister observed that innovative ideas will remove poverty and generate income which can fund welfare activities.Earlier, Ram Mohan Naidu said a new chapter is being opened in Andhra Pradesh, adding that seaplane operations will not only change the future of the state but also India.Though seaplane operations were tried earlier, the aviation minister noted that they did not take off due to Covid and other reasons and highlighted that CM Naidu suggested the potential of seaplanes. According to the union minister, seaplane services are also important for PM Modi and reminded that they were tried earlier in Gujarat.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/andhra-cm-launches-demo-seaplane-flight-from-vijayawada-to-srisailam-1836719",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/09/1860820-seaplane.jfif",
        "video": null,
        "publish_date": "2024-11-09 08:27:16",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.185
    },
    {
        "id": 263736302,
        "title": "Minor NEET aspirant held hostage, raped for months in Kanpur by coaching teachers",
        "text": "Kanpur: A minor student from Fatehpur who moved here to prepare for her medical entrance exam NEET at a prominent coaching institute was allegedly held hostage for over six months and raped by two of its teachers, police said on Saturday. They said the ordeal began for the student in December 2022, when she was putting up at a city hostel. Assistant Commissioner of Police (Kalyanpur) Abhishek Pandey said the case was registered on Friday after she approached the Kalyanpur police station.Both teachers -- Sahil Siddiqui, who taught biology, and Vikas Porwal, who taught chemistry -- have been arrested and charged with offences of rape, wrongful confinement, criminal intimidation and under provisions of the Protection of Children from Sexual Offences Act (POCSO) Act. The student was 17 years old when this happened.In her complaint, the survivor told police that in December 2022, Siddiqui invited her to his friend's flat in Kalyanpur's Makdi-Khera area for a New Year's party, saying other students would be there as well.She alleged that when she reached the flat, she found only Siddiqui there who drugged her by lacing her soft drink with sedatives and raped her while also recording the episode on video.According to the complaint, Siddiqui allegedly held her hostage in his flat for over six months, during which he repeatedly raped her and also threatened to share the video online if she spoke to anyone about it.The student alleged that Porwal raped her a few months after this.She said in the FIR that she could not muster the courage to seek police help as she was afraid that it might land her family in danger.Six months later, the girl's mother arrived in Kanpur and took her along.Initially, the girl was hesitant to approach the police but she made up her mind to take the step when she came across a video showing Siddiqui sexually harassing a coaching student.The case was registered against the two teachers under Indian Penal Code sections 328 (causing hurt by means of poison, etc., with intent to commit an offence), 376(2)(n) (commits rape repeatedly on the same woman), 344 (wrongful confinement for 10 or more days) and 506 (punishment for criminal intimidation) and the POCSO Act, an official said.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/minor-neet-aspirant-held-hostage-raped-for-over-six-months-in-kanpur-2-teachers-arrested-1836812",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/03/1837639-rape.webp",
        "video": null,
        "publish_date": "2024-11-09 12:46:04",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.263
    },
    {
        "id": 263730962,
        "title": "Patriarchy did not stop Indira Gandhi from becoming PM: Nirmala Sitharaman",
        "text": "Bengaluru: If patriarchy stopped women from achieving what they want in India, how come Indira Gandhi made it as prime minister, asked Union Finance Minister Nirmala Sitharaman. She met the students of CMS Business School here on Saturday and discussed various measures undertaken by the Centre to support innovation as well as the government schemes available for young people, including the 1 crore internships for the unemployable youth' in the age group of 21 to 24 years old. Replying to a question about women empowerment, Sitharaman insisted that patriarchy is a concept invented by the Left. “Don't get carried away by fantastic jargons. If you stand up for yourself and speak logically, patriarchy will not stop you from achieving your dreams,” she advised the women in the audience. However, she admitted that women are not facilitated adequately and that more facilitation is needed. Answering a question about the prospects of innovators in India, the finance minister said the Modi government is creating an environment that is conducive to innovators. “We do not just support innovation by bringing out policies,” she said, adding that the Indian government is doing its best to ensure that such innovations find markets too. As an example, she cited the support mechanism that is available for MSMEs. According to her, they are given priority in government procurements. Sitharaman said that 40 per cent of all government procurements is coming from MSMEs. “That is why we have more than 2 lakh startups today in India and more than 130 have become unicorns. The opportunity is immense but is not fully utilised,” she said. It is the same with digital banking transformation that is happening in India, she added. According to her, opportunities were created for the common people through Jan Dhan Yojana. “India's approach to spreading digital networks was funded by the government, while many other countries went through private players, resulting in some nominal charges somewhere. Because of this, even micro-level users also access digital banking without having to pay for it,” Sitharaman said, and added that in the future this will only grow. “Therefore, technology will have to be continuously updated so that we don't become redundant.” She also explained the concept of the 'Fund of Funds' offered by the Small Industries Development Bank of India, which is enabled by the Central government by infusing Rs 10,000 crore to help small businesses and innovative ideas needing support. “Private equity funds are also backing this because we have given them concessions,” she added. As for the latest government scheme offering one crore internships to the unemployable, Sitharaman urged the students present to help get the target audience on to the platform so that more youth can become skilled.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/karnataka/patriarchy-did-not-stop-indira-gandhi-from-becoming-pm-nirmala-sitharaman-1836795",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/09/1860879-9nirmalasitharaman.webp",
        "video": null,
        "publish_date": "2024-11-09 12:02:26",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.115
    }
]