[
    {
        "id": 260889102,
        "title": "Jharkhand: JMM’s Kalpana Soren files nomination from Gandey Assembly constituency",
        "text": "Kalpana Soren, the JMM leader and wife of Jharkhand Chief Minister Hemant Soren, filed her nomination as her party candidate from Gandey Assembly constituency on Thursday. Kalpana Soren is currently representing the Gandey constituency. She had won the constituency in a bypoll held in May this year by beating BJP’s Dilip Kumar Verma by a margin of 27,149 votes. The seat became vacant following the resignation of JMM MLA Sarfaraz Ahmad.Jharkhand Mukti Morcha has released its first list of 35 candidates for the upcoming assembly polls in the state which are to be held in two phases on November 13 and 20.As per the list, Chief Minister Hemant Soren will contest from the Barhait Assembly constituency.Other candidates include MT Raja from Rajmahal seat, Dhananjay Soren from Boriyo, Basant Soren from Dumka, Hafizul Hasan from Madhupur, Bebi Devi from Damuri, Baidhnath Ram from Latehar and Kedar Hazra from Jamua seat.Meanwhile, Rashtriya Janata Dal (RJD) released a list of six candidates for the Jharkhand Assembly polls on Tuesday after former Bihar Deputy Chief Minister and RJD leader Tejashwi Yadav stated that talks for seat sharing have been completed and the deadlock has been resolved.Tejashwi Yadav said that the INDIA alliance is united and the people of Jharkhand want Hemant Sorent to become the CM of Jharkhand again. CPI state secretary Mahendra Pathak released the list of candidates for the upcoming Jharkhand Assembly polls.This comes as the party expressed disappointment over the current seat-sharing arrangement of the INDIA bloc. Pathak said that the party would field candidates on a total of 15 seats for the Jharkhand Assembly polls.Earlier, Jharkhand Chief Minister Hemant Soren, accompanied by Jharkhand Congress in-charge Ghulam Ahmad Mir announced that the JMM and the Congress would share 70 seats between them, and the RJD and Left parties would split the remaining 11.Meanwhile, the Bharatiya Janata Party (BJP) announced its first list of 66 candidates for the Jharkhand Assembly elections on Saturday.The party’s state chief, Babulal Marandi, will contest from Dhanwar, Lobin Hembrom from Borio, and Sita Soren from Jamtara. Former Chief Minister of Jharkhand Champai Soren has been nominated as the candidate from Saraikella, Geeta Balmuchu from Chaibasa, Geeta Koda from Jaganathpur, and Meera Munda, the wife of Union Minister Arjun Munda will contest from Potka.The Assembly elections in Jharkhand will be held in two phases on November 13 and November 20 and votes will be counted on November 23",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/jharkhand-jmms-kalpana-soren-files-nomination-from-gandey-assembly-constituency/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/jharkhand-jmms-kalpana-soren-files-nomination-from-gandey-assembly-constituency.jpg",
        "video": null,
        "publish_date": "2024-10-24 07:03:36",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.124
    },
    {
        "id": 260898216,
        "title": "Delhi HC issues notice to Centre on plea seeking norms to regulate re-sale of concert tickets, banning of illegal sites",
        "text": "The Delhi High Court on Thursday issued a notice to the Centre and three private entities regarding a plea that seeks the establishment of norms to regulate the resale of concert tickets and to block illegal ticket-selling websites. The division bench, led by Chief Justice Manmohan, while seeking the response of all respondents, including Union ministries of information and broadcasting and electronics and information technology, tagged the matter with ongoing PIL and recently moved against ticket scalping, which is listed for hearing on February 18, 2025.The plea, prompted by recent concerts featuring Coldplay, Diljit Dosanjh, etc.The petition stated that the resellers have also acted in violation of the Consumer Protection Rules, 2020, as the resellers do not carry out any verification of the tickets being sold on their platform, nor they require any undertaking from the sellers, as is also evident from their terms and conditions. Thus, an individual with no ticket can also advertise via Resellers and secure unjust and unlawful benefits. Moreover, the resellers have no effective grievance redressal mechanism in place which may protect the interests of the purchasers if the seller fails to abide by its contractual obligations. Moreover, in the absence of a ticket or non-delivery of a legal ticket, it is the resellers who are to gain, as they further charge 25 euros per issue from the seller as ‘administrative fees’ for resolution of any issue raised by the purchaser. Such fees are independent of any successful resolution, and no compensation is provided to the buyer.It is further stated that Section 112 of BNS was also introduced with a similar aim to curb the practice of black-marketing and unauthorised dealing of tickets. The legislature intended to safeguard the public interest by outlawing any transactions for the sale of tickets that were without the express authority of the authorised ticketing platform or organiser. Prior to BNS, the state legislatures had prohibited such black-marketing activities via state legislation, as it deprived the state of a substantial amount of tax revenue and also resulted in the innocent public being cheated by the criminal elements. Thus, Section 112 of Bharatiya Nagarik Sanhita, 2023 [‘BNS’] aimed to protect the public by curbing the said acts of black-marketing with a severe punishment of imprisonment extending up to 7 years and imposition of fine. On October 9, the Delhi High Court sought the response of all respondents authorities against the practice of “ticket scalping,” which involves reselling event tickets at inflated prices.The plea filed in the Delhi High Court challenges the illegal practice of ticket scalping, where event tickets are resold at inflated prices for profit, harming the general public.The petition also claims that scalping contributes to a black market for counterfeit tickets, further victimising consumers. Additionally, it argued that these transactions, often unregulated, evade the official tax system, resulting in lost government revenue. This situation fosters a shadow economy that deprives the state of funds that could support public services and infrastructure.The petitioner called for a comprehensive legal framework, effective enforcement, and technological solutions to mitigate the negative impacts of ticket scalping. The goal is to promote fair ticketing practices, ensure consumer protection, and integrate revenue from ticket sales into the formal economy",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/delhi-hc-issues-notice-to-centre-on-plea-seeking-norms-to-regulate-re-sale-of-concert-tickets-banning-of-illegal-sites/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/delhi-hc-issues-notice-to-centre-on-plea-seeking-norms-to-regulate-re-sale-of-concert-tickets-banning-of-illegal-sites.jpg",
        "video": null,
        "publish_date": "2024-10-24 07:53:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.191
    },
    {
        "id": 260898206,
        "title": "BJP’s Wayanad LS candidate Navya Haridas files nomination",
        "text": "BJP candidate from Wayanad Lok Sabha constituency, Navya Haridas on Thursday filed her nomination papers. Former Mizoram Governor Kummanam Rajasekharan was among the leaders who accompanied her during the filing of the nomination. Earlier in the day, Navya Haridas said that the people of the constituency require a change in the way the politics is being conducted and exuded confidence that this time they will favour the BJP.“We started the election work a couple of days back. People require a change in the politics. So I think this time they are going to favour the BJP,” Navya Haridas told ANI.She alleged that the MPs who represented the constituency never raised the real issues of the constituency.“I know Wayanad very well and as a state general secretary of Mahila Morcha, I have visited Wayanad many times. I have been involved with the problems of Wayanad many times. I worked with the people of Wayanad. None of the issues of Wayanad were raised in the parliament. They have never cared about the real needs of Waynad. 10 per cent of the Wayanad consists of tribal population. Their upliftment has never been the consideration of the MPs,” she said.Meanwhile, Left Democratic Front (LDF) candidate from Wayanad Lok Sabha constituency Satyan Mokeri on Thursday slammed Congress leader Rahul Gandhi for imposing bye-elections on the people by vacating the Wayanad seat which he won in the 2024 general election.Mokeri also said that Congress leaders’ talk of a 5-6 lakh majority for its candidate Priyanka Gandhi comes out of the fear they have in the election.“The Congress is saying they will win by 5-6 lakh majority. this is coming out of fear. The bye-elections were imposed by them. Congress is not speaking politics here,” Mokeri told reporters after filing his nomination papers.“Are they ready for political debate? Rahul Gandhi contested like he was the PM candidate. Right after he won, he gave up this seat and declared another candidate soon,” she added.Congress candidate Priyanka Gandhi filed her nomination on Wednesday in the presence of top leaders of the party as she embarks on her electoral debut.She held a massive roadshow before the filing of her nomination. Congress leader Rahul Gandhi and other top leaders of the UDF participated in the roadshow.The Wayanad seat was vacated by Congress leader Rahul Gandhi after he was also elected to Lok Sabha from Raebareli in Uttar Pradesh in the general elections held earlier this year.Congress party approved Priyanka Gandhi’s candidature on October 15, after the bypoll schedule was announced by the Election Commission of India.Wayanad will go to the polls on November 13 along with voting for bye-elections in 47 assembly seats across 15 states. The first phase of assembly polls in Jharkhand will also be held on November 13",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/bjps-wayanad-ls-candidate-navya-haridas-files-nomination/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/bjps-wayanad-ls-candidate-navya-haridas-files-nomination.jpg",
        "video": null,
        "publish_date": "2024-10-24 08:03:51",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.064
    },
    {
        "id": 260883002,
        "title": "Arvind Kejriwal to campaign for INDIA bloc candidates in Maharashtra, Jharkhand, sources",
        "text": "Aam Aadmi Party Convenor Arvind Kejriwal will campaign for INDIA bloc candidates in Maharashtra and Jharkhand said sources. As per the sources Arvind Kejriwal is likely to campaign on assembly seats where AAP has a volunteer base and where the MVA candidates don’t have a controversial background.“Shiv Sena-UBT and NCP-SP have approached Aam Aadmi Party for Arvind Kejriwal to campaign in Maharashtra. Kejriwal is likely to campaign on assembly seats where AAP has a volunteer base and where the MVA candidates don’t have a controversial background. In addition to Kejriwal, other senior AAP leaders will also campaign for MVA candidates,” sources said. Kejriwal is also likely to campaign for JMM candidates in Jharkhand.“Arvind Kejriwal will campaign on the seats, where his appeal would translate into votes for INDIA Bloc, especially on urban seats,” as per sources. Kejriwal, who was arrested by the Enforcement Directorate in March this year, in connection with the Delhi excise policy case, came out of Tihar Jail last month, after being granted bail by the Supreme Court.After coming out, in a surprising move, the AAP national convenor announced his resignation from the CM post, and said he won’t take the position, till the public gives him the “certificate of honesty” by making AAP victorious again in the assembly elections next year.The Maharashtra assembly elections are scheduled for November 20, with counting for all 288 constituencies set for November 23.The main electoral contest will be between two alliances, namely the Mahayuti – comprising of BJP, Nationalist Congress Party (Ajit Pawar) and Shive Sena (Eknath Shinde). The other alliance is the MVA – comprising of Congress, Shiv Sena (UBT), and NCP (Sharad Pawar).The Assembly elections in Jharkhand will be held in two phases on November 13 and November 20 and votes will be counted on November 23.In Jharkhand, the BJP will be contesting the upcoming assembly elections in alliance with the All Jharkhand Students Union (AJSU), Janata Dal (United) (JD-U), and the Lok Janshakti Party (LJP). On the other hand, the Jharkhand Mukti Morcha (JMM), Rashtriya Janata Dal, and the Congress are contesting the election together",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/arvind-kejriwal-to-campaign-for-india-bloc-candidates-in-maharashtra-jharkhand-sources/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/arvind-kejriwal-to-campaign-for-india-bloc-candidates-in-maharashtra-jharkhand-sources.jpg",
        "video": null,
        "publish_date": "2024-10-24 05:58:59",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.144
    },
    {
        "id": 260902604,
        "title": "Centre notifies appointment of three advocates as Andhra Pradesh High Court judges",
        "text": "The Centre Government, through the Ministry of Law and Justice on Thursday notified the appointment of three advocates–Maheswara Rao Kuncheam (also known as Kuncham), Thoota Chandra Dhana Sekar (alias T.C.D. Sekhar), and Challa Gunaranjan–as judges of the Andhra Pradesh High Court.The notification issued in this regard stated that, in accordance with the powers conferred by the Constitution of India, the President, after consulting the Chief Justice of India, has appointed these advocates as Judges/Additional Judges of the Andhra Pradesh High Court.Recently, the Supreme Court Collegium, led by Chief Justice D Y Chandrachud, recommended the names of three advocates to the Centre for appointment as judges of the Andhra Pradesh High Court. The Collegium resolved to recommend the appointment of the following advocates as Judges of the Andhra Pradesh High Court: (i) Maheswara Rao Kuncheam (also known as Kuncham), (ii) Thoota Chandra Dhana Sekar (alias T.C.D. Sekhar), and (iii) Challa Gunaranjan. Their seniority will be determined according to existing practices, as stated in the resolution dated October 15. All three have been currently practising lawyers in the Andhra Pradesh High Court",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/centre-notifies-appointment-of-three-advocates-as-andhra-pradesh-high-court-judges/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/centre-notifies-appointment-of-three-advocates-as-andhra-pradesh-high-court-judges.jpg",
        "video": null,
        "publish_date": "2024-10-24 08:34:47",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.091
    },
    {
        "id": 260921404,
        "title": "Bengaluru: 5-yr-old drowns after falling into pit",
        "text": "Bengaluru (Karnataka): A five-year-old boy died after falling into a shaft opened for the installation of a lift in an under-construction building in Kadugodi on Thursday, according to the Bengaluru police. Police have registered a First Information Report (FIR) against Sunil, who was the owner and caretaker of the building, following the complaint filed by the minor's mother. The five-year-old deceased, identified as Suhas Gowad, died after he fell into the open pit around 9 am. The child was playing with his friends near the under-construction building. A five-foot-deep pit was dug to accommodate a lift shaft that caused the death of the minor. The boy while playing with his friends fell in the five-foot-deep shaft that was filled with water after heavy rains battered the city and drowned. It was alleged that the owner was negligent in following safety measures around the pit. After the incident, friends of the deceased rushed to inform the locals, where people rushed to rescue the boy and took him to the hospital. However, the boy was pronounced dead, the police said. The police further said that when the locals protested, a barrier was made so that proper safety measures were followed. A local stated that if precautionary measures had been taken earlier, the death would not have happened. According to the Bengaluru police, a case of negligence has been registered against Sunil, the owner and caretaker of the under-construction building. Earlier, Karnataka Chief Minister Siddaramaiah inspected the site of the building collapse at Huramavu Agara area of Bengaluru. According to official sources, the collapse on Tuesday had claimed the lives of 8 people, and injured 6 others. The Karnakata CM further announced Rs 5 lakh ex-gratia to the kin of the deceased, while ex-gratia for the injured will be given after seeing them in the hospital. \"Those hospitalized, expenditure will be taken care by the govt. Moreover, 5 Lakh ex-gratia is to be given by the government, ex-gratia for injured will be announced after seeing them at the hospital,\" he said while speaking to reporters at the site. He also said that Bruhat Bengaluru Mahanagar Palike (BBMP) has been directed to stop all illegal constructions in the city. (",
        "summary": "He fell into a shaft opened for the installation of a lift in an under-construction building in Kadugodi on Thursday",
        "url": "https://www.deccanchronicle.com/southern-states/karnataka/bengaluru-5-yr-old-drowns-after-falling-into-pit-1832669",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/25/1845200-accident.webp",
        "video": null,
        "publish_date": "2024-10-24 11:07:00",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.791
    },
    {
        "id": 260910524,
        "title": "Bengaluru Tragedy: 5-Year-Old Boy Drowns After Falling Into Five-Foot-Deep Pit Meant For Lift Shaft At Under-Construction Building In Kadugodi",
        "text": "The boy while playing with his friends fell in the five-foot-deep shaft that was filled with water after heavy rains battered the city and drowned. It was alleged that the owner was negligent in following safety measures around the pit.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/bengaluru-tragedy-5-year-old-boy-drowns-after-falling-into-five-foot-deep-pit-meant-for-lift-shaft-at-under-construction-building-in-kadugodi",
        "image": "https://media.assettype.com/freepressjournal/2022-11/66443239-c4db-4fc1-b93a-40fbb7b1daf2/Death.webp",
        "video": null,
        "publish_date": "2024-10-24 09:44:28",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "IN",
        "sentiment": 0.059
    },
    {
        "id": 260903400,
        "title": "Bengaluru: Five-year-old drowns after falling into pit of  under-construction building",
        "text": "A five-year-old boy died after falling into a shaft opened for the installation of a lift in an under-construction building in Kadugodi on Thursday, according to the Bengaluru police.Police have registered a First Information Report (FIR) against Sunil, who was the owner and caretaker of the building, following the complaint filed by the minor’s mother. The five-year-old deceased, identified as Suhas Gowad, died after he fell into the open pit around 9 am. The child was playing with his friends near the under-construction building. A five-foot-deep pit was dug to accommodate a lift shaft that caused the death of the minor. The boy while playing with his friends fell in the five-foot-deep shaft that was filled with water after heavy rains battered the city and drowned. It was alleged that the owner was negligent in following safety measures around the pit.After the incident, friends of the deceased rushed to inform the locals, where people rushed to rescue the boy and took him to the hospital. However, the boy was pronounced dead, the police said.The police further said that when the locals protested, a barrier was made so that proper safety measures were followed. A local stated that if precautionary measures had been taken earlier, the death would not have happened.According to the Bengaluru police, a case of negligence has been registered against Sunil, the owner and caretaker of the under-construction building.Earlier, Karnataka Chief Minister Siddaramaiah inspected the site of the building collapse at Huramavu Agara area of Bengaluru. According to official sources, the collapse on Tuesday had claimed the lives of 8 people, and injured 6 others.The Karnakata CM further announced Rs 5 lakh ex-gratia to the kin of the deceased, while ex-gratia for the injured will be given after seeing them in the hospital.“Those hospitalized, expenditure will be taken care by the govt. Moreover, 5 Lakh ex-gratia is to be given by the government, ex-gratia for injured will be announced after seeing them at the hospital,” he said while speaking to reporters at the site.He also said that Bruhat Bengaluru Mahanagar Palike (BBMP) has been directed to stop all illegal constructions in the city",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/bengaluru-five-year-old-drowns-after-falling-into-pit-of-under-construction-building/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/bengaluru-five-year-old-drowns-after-falling-into-pit-of-under-construction-building.jpg",
        "video": null,
        "publish_date": "2024-10-24 09:03:35",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.783
    },
    {
        "id": 260866276,
        "title": "Bangladesh bans student wing of Sheikh Hasina’s party",
        "text": "Bangladesh interim government on Wednesday banned Bangladesh Chatra League, the student organization of former Prime Minister Sheikh Hasina’s party Awami League, after a demand by a student group that led the July-August uprising.The government, under the powers provided in sub-section (1) of Section 18 of the “Anti-Terrorism Act 2009”, banned Bangladesh Awami League’s fraternal organization “Bangladesh Chatra League”, said the Bangladesh Home Ministry in an official order. A copy of the order was obtained by ANI.Earlier on Tuesday, the Anti-discrimination Student Movement, the group-led to oust Prime Minister Sheikh Hasina, announced a five-point demands, including the resignation of Bangladesh President, Mohammed Shahabuddin. The demands also included banning Awami League’s student organization, Bangladesh Chatra League.“At various times since the independence of Bangladesh, especially during the last 15 years od dictatorial rule, the Bangladesh Chatra League, the fraternal organization of Bangladesh Awami League, has been involved in various public security-related activities including killings, torture, harassment in common rooms, trading of seats in dormitories, gangs, rape and sexual harassment”, said an order issued by Bangladesh home ministry.“Documentary information regarding these have been published in all the major media of the country and in some terrorist incidents, the leaders and workers of the organization have also been proved in the criminal court”, the order issued on Wednesday evening said.According to the official order, Bangladesh Chatra League leaders-workers attacked the protesting students and general public with frenzied and reckless armed attacks during the anti-discrimination student movement from July 15. The official order stated, “During the anti-discrimination student movements from 15 July 2024, Bangladesh Chatra League leaders-workers attacked the protesting students and general public with frenzied and reckless armed attacks and killed hundreds of innocent students and persons and endangered the lives of many more people.” (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/bangladesh-bans-student-wing-of-sheikh-hasinas-party/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/bangladesh-bans-student-wing-of-sheikh-hasinas-party.jpg",
        "video": null,
        "publish_date": "2024-10-24 01:33:30",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.24
    },
    {
        "id": 260876406,
        "title": "Maharashtra: 3 labourers killed, 7 injured after portion of water tank collapses in Pimpri Chinchwad",
        "text": "At least 3 people have been killed and seven others injured after a portion of a tank collapsed in Pimpri Chinchwad city of Maharashtra, an official said.The incident unfolded in the Bhosari area in Pune on Thursday morning.Officials further said that all three killed people were labourers.“Three people died and seven others injured after a portion of a water tank collapsed in the Bhosari area of Pimpri Chinchwad this morning. All of them are labourers. Police is present at spot,” said a senior official of Pimpri Chinchwad Police.More details are awaited (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/maharashtra-3-labourers-killed-7-injured-after-portion-of-water-tank-collapses-in-pimpri-chinchwad/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/maharashtra-3-labourers-killed-7-injured-after-portion-of-water-tank-collapses-in-pimpri-chinchwad.jpeg",
        "video": null,
        "publish_date": "2024-10-24 04:44:00",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -1.0
    },
    {
        "id": 260892676,
        "title": "'All INDIA Bloc Candidates Will Contest In UP By-Polls On Cycle Symbol,' Says Samajwadi Party Chief Akhilesh Yadav",
        "text": "The Uttar Pradesh by-polls are slated to be held on nine Assembly seats including Meerapur, Kundarki, Ghaziabad, Khair, Karhal, Phulpur, and Katehari. The poll body has announced by-polls for nine of the 10 vacant assembly seats in Uttar Pradesh, except Milkipur of Ayodhya district.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/all-india-bloc-candidates-will-contest-in-up-by-polls-on-cycle-symbol-says-samajwadi-party-chief-akhilesh-yadav",
        "image": "https://media.assettype.com/freepressjournal/2022-01/d2d34ecb-808e-4830-8e10-dcb33a7658db/akhilesh_yadav_PTI_0.webp",
        "video": null,
        "publish_date": "2024-10-24 07:14:37",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "IN",
        "sentiment": -0.339
    },
    {
        "id": 260882482,
        "title": "Canada: Dissident MPs call for Trudeau’s resignation, deadline set for October 28",
        "text": "Internal calls for Canadian Prime Minister Justin Trudeau’s resignation as Liberal leader intensified on Wednesday as Liberal MPs convened on Parliament Hill, according to a report by CBC News.During the closed-door meeting, dissenting MPs conveyed their grievances to Trudeau, reflecting growing discontent within the party. This gathering was part of the weekly caucus meetings that take place while the House of Commons is in session. The Wednesday meeting served as a platform for MPs to voice their concerns and frustrations directly to PM Trudeau. Trudeau is facing mounting pressure from within his own party, with dissident Liberal MPs giving him an ultimatum to decide his future by October 28. During the caucus meeting on Wednesday, a document was presented outlining the case for Trudeau’s resignation, but it didn’t specify any consequences if he fails to meet the deadline.Sources speaking to Radio-Canada said that 24 MPs signed an agreement to call on Trudeau to step down as Liberal leader, CBC News reported.During the meeting, British Columbia MP Patrick Weiler presented a document that argued in favour of Trudeau’s resignation. The document suggested that the Liberal party could experience a resurgence similar to what the Democrats saw after US President Joe Biden opted not to run for re-election for the upcoming presidential elections in the country. MPs were given two minutes each to address the room during the three-hour-long meeting. About 20 — none of them cabinet ministers — stood up to urge Trudeau to step aside before the next election, sources said. But a number of MPs also stood to voice support for the prime minister, CBC News reported.Marc Miller, Immigration Minister has acknowledged the frustrations of some Liberal MPs and expressed respect for those who voiced their concerns directly to Trudeau.“Fundamentally, this is something that has been simmering for some time and it’s important for people to get it out. This isn’t a code red situation. The prime minister can sure as hell handle the truth,” CBC News reported.The latest political rift in Canada has indeed been fuelled by the escalating tensions between India and Canada. The ties between India and Canada soured after Trudeau alleged in the Canadian Parliament last year that he has “credible allegations” of India’s hand in the killing of Khalistani terrorist Hardeep Singh Nijjar.India has denied all the allegations, calling them “absurd” and “motivated” and has accused Canada of giving space to extremist and anti-India elements in their country.Nijjar, who was designated a terrorist by India’s National Investigation Agency in 2020, was shot and killed outside a Gurdwara in Surrey in June last year.The recent diplomatic row erupted when Canada labelled India’s High Commissioner and other diplomats as “persons of interest” in the investigation of Nijjar’s death.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/canada-dissident-mps-call-for-trudeaus-resignation-deadline-set-for-october-28/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-24 05:34:21",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.074
    },
    {
        "id": 260881896,
        "title": "Dissident MPs call for Trudeau's resignation, deadline set for Oct 28",
        "text": "Ottawa: Internal calls for Canadian Prime Minister Justin Trudeau's resignation as Liberal leader intensified on Wednesday as Liberal MPs convened on Parliament Hill, according to a report by CBC News.During the closed-door meeting, dissenting MPs conveyed their grievances to Trudeau, reflecting growing discontent within the party. This gathering was part of the weekly caucus meetings that take place while the House of Commons is in session. The Wednesday meeting served as a platform for MPs to voice their concerns and frustrations directly to PM Trudeau.Trudeau is facing mounting pressure from within his own party, with dissident Liberal MPs giving him an ultimatum to decide his future by October 28. During the caucus meeting on Wednesday, a document was presented outlining the case for Trudeau's resignation, but it didn't specify any consequences if he fails to meet the deadline.Sources speaking to Radio-Canada said that 24 MPs signed an agreement to call on Trudeau to step down as Liberal leader, CBC News reported.During the meeting, British Columbia MP Patrick Weiler presented a document that argued in favour of Trudeau's resignation. The document suggested that the Liberal party could experience a resurgence similar to what the Democrats saw after US President Joe Biden opted not to run for re-election for the upcoming presidential elections in the country.MPs were given two minutes each to address the room during the three-hour-long meeting. About 20 -- none of them cabinet ministers -- stood up to urge Trudeau to step aside before the next election, sources said. But a number of MPs also stood to voice support for the prime minister, CBC News reported.Marc Miller, Immigration Minister has acknowledged the frustrations of some Liberal MPs and expressed respect for those who voiced their concerns directly to Trudeau.\"Fundamentally, this is something that has been simmering for some time and it's important for people to get it out. This isn't a code red situation. The prime minister can sure as hell handle the truth,\" CBC News reported.The latest political rift in Canada has indeed been fuelled by the escalating tensions between India and Canada.The ties between India and Canada soured after Trudeau alleged in the Canadian Parliament last year that he has \"credible allegations\" of India's hand in the killing of Khalistani terrorist Hardeep Singh Nijjar.India has denied all the allegations, calling them \"absurd\" and \"motivated\" and has accused Canada of giving space to extremist and anti-India elements in their country.Nijjar, who was designated a terrorist by India's National Investigation Agency in 2020, was shot and killed outside a Gurdwara in Surrey in June last year.The recent diplomatic row erupted when Canada labelled India's High Commissioner and other diplomats as \"persons of interest\" in the investigation of Nijjar's death.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/world/americas/dissident-mps-call-for-trudeaus-resignation-deadline-set-for-oct-28-1832584",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/24/1855585-aa-3309495.webp",
        "video": null,
        "publish_date": "2024-10-24 05:45:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.095
    },
    {
        "id": 260894540,
        "title": "Congress Releases List Of 7 Candidates For Rajasthan Assembly By-Elections; Check It Here",
        "text": "As per the list, the party has fielded Amit Ola from Jhunjhunu, Aryaan Zubair from Ramgarh, Deen Dayal Bairwa from Dausa, Kastoor Chand Meena from Deoli-Uniara, Ratan Choudhary from Khinswar, Reshma Meena from Salumber (ST), and Mahesh Roat from Chorasi (ST).",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/congress-releases-list-of-7-candidates-for-rajasthan-assembly-by-elections-check-it-here",
        "image": "https://media.assettype.com/freepressjournal/2023-01/0d590099-ae82-4fbf-85c2-5dafe6408a5b/congress_flag.jpg",
        "video": null,
        "publish_date": "2024-10-24 07:52:05",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": -0.159
    }
]