[
    {
        "id": 264701902,
        "title": "Kanhaiya Kumar sparks row with remarks on Fadnavis' wife",
        "text": "Nagpur: Congress leader Kanhaiya Kumar sparked a row with his 'controversial' remarks against Maharashtra Deputy Chief Minister Devendra Fadnavis' wife Amruta Fadnavis stoking strong condemnation from the Bharatiya Janata Party.Targeting Deputy CM Fadnavis over his \"Dharamyuddh\" remark, Kanhaiya Kumar took a jibe and that the job of saving 'dharma' should be of everyone, and it should not be like people are saving the religion and Deputy CM's wife is \"making reels on Instagram.\"\"Deputy Chief Minister Devendra Fadnavis said that this is a 'Dharamyudh'. This is a good thing. It is our Dharam to protect the democracy and the constitution for which I am standing and giving a speech today. Whichever leader talks about saving religion, you have to ask only one thing to that leader who is giving you speech about saving religion that will your son or daughter join us in this fight to save religion?\" Kanhaiya said during a public rally in Nagpur on Wednesday.\"Will this happen that the responsibility of saving the religion will be ours and your children will study in Oxford Cambridge universities. If we want to save religion, let us save it together. It can't be like we save religion and the Deputy Chief Minister's wife makes reels on Instagram. It can't be like that. Everyone will save the religion together,\" he added.Last week, Devendra Fadnavis while campaigning for Mahayuti candidates for the upcoming assembly polls, said that \"Vote-Jihad\" should be countered by \"Dharma-Yuddha\" of the vote.Kanhaiya's remarks drew strong criticism from the BJP. Party spokesperson Shehzad Poonawalla called Kanhaiya \"Naxali Afzal Guru Samarthak\" and said his remarks are an insult to all the Marathi women.\"Hey you Naxali Afzal Guru supporter Congress' Kanhaiya Kumar. How dare you insult a daughter of Maharashtra. Amruta Fadnavis' insult is an insult of each and every Marathi woman. Those using terms like 'rejected maal', 'imported maal' will be taught a lesson by the people of Maharashtra,\" Poonawalla stated in a post on X.Meanwhile, the campaigning has intensified for the 288 assembly seats in Maharashtra with both the ruling Mahayuti and the opposition Maha Vikas Aghadi (MVA) making efforts to woo the electorate.The polls are scheduled for November 20 and counting will be held on November 23. In the 2019 Maharashtra assembly elections, the BJP won 105 seats, Shiv Sena secured 56, and Congress 44. In the 2024 Lok Sabha elections, MVA posed a strong performance winning 30 of 48 seats, while the Mahayuti could only win 17.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/news/politics/kanhaiya-kumar-sparks-row-with-remarks-on-fadnavis-wife-1838139",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/14/1862585-ani-20241114064128.webp",
        "video": null,
        "publish_date": "2024-11-14 07:22:12",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.155
    },
    {
        "id": 264665134,
        "title": "FBI raids Polymarket CEO's home after betting platform predicts Trump win",
        "text": "New York: The Federal Bureau of Investigation (FBI) agents raided the Manhattan apartment of Shayne Coplan, the chief executive officer (CEO) of Polymarket, a prediction market platform that accurately forecasted Donald Trump's victory in the 2024 presidential election, New York Post reported on Wednesday citing sources.26-year-old Polymarket CEO Coplan was woken up at 6 am (local time) in his Soho apartment by US law enforcement, who demanded he hand over his phone and other electronic devices, the NY Post reported citing a source close to the matter.Coplan was not provided with a reason for the raid, but the source suspects it was political retribution since Polymarket accurately predicted an easy Trump triumph over Vice President Kamala Harris - as opposed to traditional polls, as per the New York Post.Indian-origin Vivek Ramaswamy, who was appointed to head the Department of Government Efficiency (DOGE) in the Trump administration, responded to a post on X about the development, writing, \"Are they mad polymarket predicted the race correctly?\"The source also speculated that the US government could try to accuse Polymarket of market manipulation and rigging its polls in favour of Trump against Vice President Kamala Harris. \"This is obvious political retribution by the outgoing administration against Polymarket for providing a market that correctly called the 2024 presidential election,\" New York Post reported citing sources.Coplan was not arrested and has not been charged, a Polymarket spokesperson told the New York Post on Wednesday evening. He said, \"Polymarket is a fully transparent prediction market that helps everyday people better understand the events that matter most to them, including elections,\" addding, \"We charge no fees, take no trading positions, and allow observers from around the world to analyze all market data as a public good.\"The FBI did not immediately respond to a request for comment, as reported by New York Post.Reacting to the raid, Coplan posted on X, saying, \"New phone, who dis?\"The FBI action comes a week after Coplan said that Polymarket plans to return to the US. The platform had predicted a 58.6 per cent chance of a Trump victory on the morning before Election Day, with Vice President Kamala Harris at 41.4 per cent, as reported by New York Post. Polymarket has also been linked to Trump and his allies, with Billionaire Trump supporter Peter Thiel raising about USD 70 million in funding for the platform, according to a Forbes report earlier this year, New York Post reported.In 2022, Polymarket was forced to pause its trading in the US and pay a USD 1.4 million penalty to settle charges with the Commodity Futures Trading Commission for failing to register with the agency.A Polymarket \"whale\" who bet millions on a Trump win had reportedly managed to rake in about USD 85 million in profits. The anonymous bettor, who goes by Theo, was previously believed to operate four separate accounts on Polymarket, the online betting platform that sold Donald Trump and Kamala Harris contracts ahead of the presidential election, as reported by New York Post.According to the report, around USD 3.7 billion were spent on US presidential election betting, with the majority of bets placed on Trump.\"There was USD 3.7 billion spent on placing bets around the US presidential election, the most of which was spent on Trump, rather than Harris, something that had become an election indicator in the last month before the elections,\" as reported by New York Post.\"It's grand political theatre at its worst. They could have asked his lawyer for any of these things. Instead, they staged a so-called raid so they can leak it to the media and use it for obvious political reasons,\" New Post reported citing sources.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/world/americas/fbi-raids-polymarket-ceos-home-after-betting-platform-predicts-trump-win-1838069",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/14/1862516-ani-20241113231031.webp",
        "video": null,
        "publish_date": "2024-11-14 01:26:53",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.3
    },
    {
        "id": 264674766,
        "title": "Jaishankar arrives in UAE to strengthen bilateral ties, enhance cooperation",
        "text": "External Affairs Minister S. Jaishankar arrived in the United Arab Emirates on Thrusday for an official visit.Taking to social media platform X, the Consulate General of India in Dubai said that the EAM’s visit aims to further strengthen bilateral ties and enhance cooperation between the two countries.“External Affairs Minister S Jaishankar arrived in the UAE for an official visit. Looking forward to further strengthening bilateral ties and enhancing cooperation between our nations,” the Consulate General of India said on X.\n\nExternal Affairs Minister @DrSJaishankar arrived in the UAE for an official visit. \nLooking forward to further strengthening bilateral ties and enhancing cooperation between our nations. #IndiaUAE pic.twitter.com/Vwe8Zw99Lm\n— India in Dubai (@cgidubai) November 14, 2024\n\nIndia and the UAE established diplomatic relations in 1972. While the UAE opened its Embassy in India in 1972, India opened its Embassy in the UAE in 1973.India and the UAE enjoy strong cooperation with the United Nations. Both countries are also part of several plurilateral platforms such as BRICS, I2U2 (India-Israel-UAE-USA), and the UAE-France-India (UFI) Trilateral, among others. The UAE was invited as a guest country to the G20 Summit held under India’s presidency.The traditionally strong bilateral relations between India and the UAE gained new momentum when Prime Minister Narendra Modi visited the UAE in 2015, the first visit by an Indian Prime Minister in 34 years. This marked the beginning of a new Comprehensive and Strategic Partnership between the two nations. Since then, PM Modi has visited the UAE five more times, most recently in November-December 2023 to attend the COP28-World Climate Action Summit in Dubai.In 2022, India and the UAE signed the Comprehensive Economic Partnership Agreement (CEPA) during a virtual summit between PM Modi and UAE President Sheikh Mohamed bin Zayed Al Nahyan.From the UAE, there have been multiple visits by President Sheikh Mohamed bin Zayed. In 2016 and 2017, he visited as Crown Prince of Abu Dhabi. In September 2023, he visited India as the President of the UAE to attend the G20 Leaders’ Summit. In November 2023, he participated in the 2nd Virtual Global South Summit. In January 2024, he visited Gujarat to attend the 10th Vibrant Gujarat Global Summit as the Chief Guest.Earlier this year, in June, EAM Jaishankar held a meeting with his UAE counterpart, Sheikh Abdullah bin Zayed Al Nahyan, to discuss the Comprehensive Strategic Partnership.During his visit, Jaishankar also participated in the 10th International Day of Yoga celebrations in Abu Dhabi. He, along with the Indian Ambassador to the UAE, Sunjay Sudhir, led the Yoga Day celebrations at the Louvre Abu Dhabi.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/jaishankar-arrives-in-uae-to-strengthen-bilateral-ties-enhance-cooperation/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-11-14 03:34:28",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.531
    },
    {
        "id": 264682228,
        "title": "One dead after explosions near Brazil’s Supreme Court",
        "text": "The federal police in Brazil have started an investigation after explosions took place in the country’s capital, Al Jazeera reported. The explosions left one person dead. According to Al Jazeera, the blasts took place at the end of the Supreme Court session on Wednesday. The court was evacuated, as plumes of smoke and fire were visible from the air.“Police officers from the Tactical Operations Command, the Rapid Intervention Group of the PF Regional Superintendence in the Federal District, experts and the institution’s Bomb Control Group were called in, and are carrying out initial security actions and analyzing the site”, a press statement issued by the Brazil Police said. According to Al Jazeera, the federal police indicated it had deployed a rapid intervention group and a bomb control squad to the area, known as Brasilia’s Three Powers Plaza.In a statement issued by Brazil’s Supreme Court, it was noted, “Two loud bangs were heard and the ministers were safely removed from the building. The servers and collaborators of the headquarters building were removed as a precautionary measure”. The Supreme Court said that the investigation is underway and they are waiting for the facts to come out. It was also noted that the President of Brazil’s Supreme Court, Luis Roberto Barroso spoke with the President of Brazil, Lula da Silva along with other senior officials of the country.Al Jazeera reported that the Supreme Court buildings will undergo a complete sweep in the early hours of Thursday morning. The office hours were suspended until noon in all buildings, and the situation will be reassessed throughout the morningLocal media have reported that the explosions took place near the Supreme Court and along a street near an annexe building, where a car was parked. Some witnesses said they saw smoke pouring from the car’s boot before the second explosion in front of the court.No motive has been released yet in Wednesday’s bombing incident, nor has a suspect been identified. Al Jazeera noted that Celina Leao, the vice-governor of the Federal District, where the capital is located, said that at least one of the explosions coincided with an unknown individual approaching the doors of the Supreme Court. She indicated he was the same man reported dead in the explosion. She shared her press briefing on X. \n\nO Governo do Distrito Federal está no comando e empenhado em garantir a segurança e tranquilidade de todos. Estamos trabalhando com toda a força de nossa segurança pública para assegurar que as informações sejam atualizadas e verídicas, transmitidas diretamente pelas nossas… pic.twitter.com/BSiA72xADB\n— Celina Leão (@celinaleao) November 14, 2024\n\nThe Three Powers Plaza is the seat of Brazil’s federal government: It contains the presidential palace, buildings for both chambers of Congress and the Supreme Court.The blasts become a significant security concern as they occur days before the G20 conference is set to take place in Rio de Janeiro later this month.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/one-dead-after-explosions-near-brazils-supreme-court/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/one-dead-after-explosions-near-brazils-supreme-court.jpg",
        "video": null,
        "publish_date": "2024-11-14 04:33:55",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.083
    },
    {
        "id": 264724232,
        "title": "Maharashtra Elections 2024: 'Constitution Seems Blank To PM Modi Because He's Never Read It,' Says Congress Leader Rahul Gandhi Fires Back At Prime Minister",
        "text": "\"He has no idea what's written inside this book; that's why he says it's empty. He says Rahul Gandhi shows a red book. It doesn't matter to us what colour the book is; what matters is what's written inside it. We are ready to give our lives for what it represents,\" Rahul Gandhi said.",
        "summary": "",
        "url": "https://www.freepressjournal.in/mumbai/maharashtra-elections-2024-constitution-seems-blank-to-pm-modi-because-hes-never-read-it-says-congress-leader-rahul-gandhi-fires-back-at-prime-minister",
        "image": "https://media.assettype.com/freepressjournal/2024-11-14/fnmsyre5/Untitled-design-2024-11-14T143720.150.jpg",
        "video": null,
        "publish_date": "2024-11-14 09:13:12",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": 0.055
    },
    {
        "id": 264712510,
        "title": "“Constitution seems blank to him because he’s never read it”: Rahul Gandhi hits back at PM Modi",
        "text": "Hitting back at Prime Minister Narendra Modi over his attack on Rahul Gandhi for flaunting a ‘blank constitution’, the Lok Sabha Leader of Opposition said the Constitution seems blank to the Prime Minister because he has never read it in his life. Addressing a public gathering in poll-bound Maharashtra today, Rahul said that the Prime Minister says that I show the Constitution in public meetings that is empty. “Sanvidhan unke liye khali hai kyuki unhone ise zindagi mein pada nahi hai (The Constitution seems empty to him because he’s never read it in his life),” Rahul Gandhi said in a public gathering in poll-bound Maharashtra’s Nandurbar. Attacking the Prime Minister further, the Congress leader said that the Constitution is not blank, but carries thoughts and ideas of thousand years.“He has no idea what’s written inside this book; that’s why he says it’s empty. He says Rahul Gandhi shows a red book. It doesn’t matter to us what colour the book is; what matters is what’s written inside it. We are ready to give our lives for what it represents,” Rahul Gandhi said.“I want to explain to the Prime Minister that this Constitution is not hollow. It is filled with thousands of years of thought. When you call it hollow, you disrespect Birsa Munda, Mahatma Gandhi, Ambedkar, and others. This fight is about protecting it,” he added.Earlier, Prime Minister Modi attacked Rahul Gandhi saying the “Laal Kitab” of the Constitution which the Congress was flaunting contained “nothing”.“In ‘farziwada’, Congress has broken its own record. The ‘Laal Kitab’ of the Constitution which the Congress party was flaunting and distributing contained ‘nothing’. It was an empty book. This is nothing but a testament to Congress’ disregard and hate for Baba Saheb Ambedkar. The entire country is in shock over this foolish and unfortunate political play of Congress,” PM Modi said.Further in his address, the Lok Sabha LoP slammed the Bharatiya Janata Party over tribal population, and alleged that the Prime Minister and the BJP-RSS call indigenous people “Vanvasi” (forest dwellers) and carry out deforestation across the country. “Congress introduced the Land Acquisition Bill to protect your land. The Tribal Rights Act granted you rights to the forest, land, and water. But as soon as the BJP government comes to power, they take your land and hand it over to billionaires. The term “Vanvasi” implies that your children should not become doctors or engineers, should not get jobs, and should not do business. “Adivasi,” on the other hand, means that your children can achieve anything. That is the difference between “Adivasi” and “Vanvasi,” Rahul said.He further pointed out that in India, the Adivasi population is eight per cent, and their participation should match this percentage. “I investigated the representation of Adivasis in the Indian government. There are 90 officials who run the government. If the government spends 100 rupees, how many Adivasi officials make decisions about it? Adivasi officials make decisions over just 10 paise of that amount. Out of 90, there is only one Adivasi official, who is side-lined. We need to change this, and the way to do it is through a caste census,” the Congress leader said.The Lok Sabha LoP asserted that the Congress party has decided that as much money the Prime Minister waives off for billionaires, they will give to the common people.Highlighting his guarantees, the Congress MP said that under the Mahalaxmi Yojana, on the first day of every month, women will receive Rs 3,000 directly in their accounts. “After that, we will provide free bus travel for women. Farmers will have up to three lakh rupees of debt waived. When farmers sell paddy, cotton, or soybeans, our government will provide MSP (Minimum Support Price). We will conduct the caste census,” Rahul Gandhi said.“In Maharashtra, everyone will be provided with health insurance up to 25 lakh rupees. For any illness, you can go to the hospital and get treatment up to 25 lakh rupees free of charge. Unemployed youth will receive 4,000 rupees per month until they secure employment,” he added.The Congress leader also alleged that the BJP has moved 5 lakh jobs from Maharashtra to other states.“If we look at employment collectively, BJP has moved 5 lakh jobs from Maharashtra to other states. The INDIA bloc government will not do this. The projects of Maharashtra will remain here. We do not want projects from here to be shifted to other states, forcing Adivasis here to work as labourers there,” Rahul added.The campaigning has intensified for the 288 assembly seats in Maharashtra with both the ruling Mahayuti and the opposition Maha Vikas Aghadi (MVA) making efforts to woo the electorate.The polls are scheduled for November 20 and counting will be held on November 23.In the 2019 Maharashtra assembly elections, the BJP won 105 seats, Shiv Sena secured 56, and Congress 44. In the 2024 Lok Sabha elections, MVA posed a strong performance winning 30 of 48 seats, while the Mahayuti could only win 17",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/constitution-seems-blank-to-him-because-hes-never-read-it-rahul-gandhi-hits-back-at-pm-modi/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/constitution-seems-blank-to-him-because-hes-never-read-it-rahul-gandhi-hits-back-at-pm-modi.jpg",
        "video": null,
        "publish_date": "2024-11-14 08:23:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.183
    },
    {
        "id": 264677582,
        "title": "Jacqueline Fernandez Claims She Wasn't Aware Of Illicit Origin Of Gifts Received By Conman Sukesh Chandrasekhar",
        "text": "The Delhi High Court heard part of the arguments on behalf of Jacqueline Fernandez. She has challenged the charge sheet filed against her in the Rs 200 crore money laundering case involving conman Sukesh Chandrashekar. It was submitted that she was not involved in the offence of money laundering. She was unaware that the gifts she received were part of the alleged proceeds of crime",
        "summary": "",
        "url": "https://www.freepressjournal.in/entertainment/jacqueline-fernandez-claims-she-wasnt-aware-of-illicit-origin-of-gifts-received-by-conman-sukesh-chandrasekhar",
        "image": "https://media.assettype.com/freepressjournal/2023-12/820478fa-328b-44d4-a7c1-ecaad4675bec/Untitled_design___2023_12_27T132805_963.jpg",
        "video": null,
        "publish_date": "2024-11-14 04:12:01",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "IN",
        "sentiment": -0.382
    },
    {
        "id": 264706624,
        "title": "Lottery scams and money laundering: ED conducts raids in multiple places across Sikkim, Bengal and Tamil Nadu in Santiago Martin case",
        "text": "The Enforcement Directorate (ED) on Thursday conducted pan-India searches at multiple locations in West Bengal, Sikkim, and Tamil Nadu in connection with financial fraud of lottery and the corruption case involving money laundering through lottery tickets to certain influential people.\n\nThe raids have been underway since Thursday morning in at the premises of suspects in West Bengal’s Kolkata, Sikkim, and Tamil Nadu’s Chennai and Coimbatore.\n\nThe agency is probing a lottery scam case registered in 2012 against lottery baron Santiago Martin and others, in which the Sikkim government was allegedly cheated. The ED had earlier attached assets worth Rs 277.59 crore in the case. They included a large number of immovable properties in Tamil Nadu.\n\nOn the basis of the charge sheets filed by the Central Bureau of Investigation, the ED had initiated a money laundering probe against Martin and his company, Future Gaming Solutions (P) Limited (presently Future Gaming and Hotel Services (P) Limited and formerly Martin Lottery Agencies Limited).\n\nThe agency had then alleged that Martin and others conspired to make wrongful gains.\n\nThey entered into an agreement with State government officials, in contravention of the Lottery Regulations Act, under which the company could avoid remitting the face value of lottery tickets sold in Kerala to the State exchequer as sale proceeds.\n\nAn illegal gain of over Rs 910.30 crore was made by inflating the prize winning tickets’ claims from April 1, 2009, to August 31, 2010, as alleged.\n\nIn another case, the Enforcement Directorate in 2022 had also attached properties worth Rs 409.92 crore in the case against Future Gaming and Hotel Services Private Limited and its various sub-distributors and area distributors for West Bengal.\n\nThe ED probe is based on the cases registered by the Kolkata Police under various provisions of the Indian Penal Code and the Lotteries (Regulation) Act. The attached assets are in the form of bank balance and mutual fund holdings.\n\n(This news report is published from a syndicated feed. Except for the headline, the content has not been written or edited by OpIndia staff)",
        "summary": "On the basis of the charge sheets filed by the Central Bureau of Investigation, the ED had initiated a money laundering probe against Martin and his company, Future Gaming Solutions (P) Limited (presently Future Gaming and Hotel Services (P) Limited and formerly Martin Lottery Agencies Limited).",
        "url": "https://www.opindia.com/2024/11/lottery-scams-ed-conducts-raids-in-multiple-places-across-sikkim-bengal-and-tamil-nadu/",
        "image": "https://www.opindia.com/wp-content/uploads/2023/10/lottery-martin.jpg",
        "video": null,
        "publish_date": "2024-11-14 06:01:26",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.578
    },
    {
        "id": 264688260,
        "title": "Lottery scam: ED raids multiple places",
        "text": "New Delhi: The Enforcement Directorate (ED) on Thursday conducted pan-India searches at multiple locations in West Bengal, Sikkim, and Tamil Nadu in connection with financial fraud of lottery and the corruption case involving money laundering through lottery tickets to certain influential people.The raids have been underway since Thursday morning in at the premises of suspects in West Bengal's Kolkata, Sikkim, and Tamil Nadu's Chennai and Coimbatore.The agency is probing a lottery scam case registered in 2012 against lottery baron Santiago Martin and others, in which the Sikkim government was allegedly cheated. The ED had earlier attached assets worth Rs 277.59 crore in the case. They included a large number of immovable properties in Tamil Nadu.On the basis of the charge sheets filed by the Central Bureau of Investigation, the ED had initiated a money laundering probe against Martin and his company, Future Gaming Solutions (P) Limited (presently Future Gaming and Hotel Services (P) Limited and formerly Martin Lottery Agencies Limited).The agency had then alleged that Martin and others conspired to make wrongful gains.They entered into an agreement with State government officials, in contravention of the Lottery Regulations Act, under which the company could avoid remitting the face value of lottery tickets sold in Kerala to the State exchequer as sale proceeds.An illegal gain of over Rs 910.30 crore was made by inflating the prize winning tickets' claims from April 1, 2009, to August 31, 2010, as alleged.In another case, the Enforcement Directorate in 2022 had also attached properties worth Rs 409.92 crore in the case against Future Gaming and Hotel Services Private Limited and its various sub-distributors and area distributors for West Bengal.The ED probe is based on the cases registered by the Kolkata Police under various provisions of the Indian Penal Code and the Lotteries (Regulation) Act. The attached assets are in the form of bank balance and mutual fund holdings.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/news/current-affairs/lottery-scam-ed-raids-multiple-places-across-india-1838103",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/14/1862565-ani-20241114043010.webp",
        "video": null,
        "publish_date": "2024-11-14 05:47:40",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "business",
        "source_country": "in",
        "sentiment": -0.588
    },
    {
        "id": 264698894,
        "title": "Delhi Airport Issues Advisory For Passengers Amid City's Rising Air Pollution",
        "text": "The advisory requested the passengers to contact their respective airlines for 'updated information' about their flights. \"Low Visibility Procedures are in progress at Delhi Airport. All flight operations are presently normal. Passengers are requested to contact the airline concerned for updated flight information,\" the advisory reads.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/delhi-airport-issues-advisory-for-passengers-amid-citys-rising-air-pollution",
        "image": "https://media.assettype.com/freepressjournal/2019-07/24933ad3-1750-4a9c-8126-0b5a88ed26e6/Flight__plane__airplane.jpg",
        "video": null,
        "publish_date": "2024-11-14 07:00:31",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.093
    },
    {
        "id": 264682230,
        "title": "Delhi Airport issues advisory for passengers amid city’s rising air pollution",
        "text": "As Delhi continues to grapple with ‘severe’ air pollution, the Delhi Airport on Thursday issued an advisory for passengers and informed that all flight operations are currently normal, however, ‘Low Visibility Procedures’ are in progress at the airport. The advisory requested the passengers to contact their respective airlines for ‘updated information’ about their flights. “Low Visibility Procedures are in progress at Delhi Airport. All flight operations are presently normal. Passengers are requested to contact the airline concerned for updated flight information,” the advisory reads. https://x.com/DelhiAirport/status/1856872303633514646A dense layer of smog enveloped the national capital as the pollution levels continued to rise. The AQI level in Delhi at 8 a.m. was 428, as per the Central Pollution Control Board (CPCB). According to the India Meteorological Department, increased wind activity may help lower pollutant concentrations, with AQI expected to improve to the “very poor” category.The AQI turned “severe” for the first time this season on Wednesday, with the Commission for Air Quality Management describing the situation as an “episodic event” of “unprecedented extremely dense fog.”Bhayender, a local said that the daily activities were being affected due to the increased pollution. Speaking to ANI, he said “The pollution has increased. We are facing breathing problems and irritation in the eyes. Earlier we used to go for running, but we are not even able to do that now.”Delhi has been continuously battling with air pollution for the last 14 days, post-Diwali",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/delhi-airport-issues-advisory-for-passengers-amid-citys-rising-air-pollution/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/11/delhi-airport-issues-advisory-for-passengers-amid-citys-rising-air-pollution.jpg",
        "video": null,
        "publish_date": "2024-11-14 04:54:04",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.406
    },
    {
        "id": 264696514,
        "title": "US President-Elect Donald Trump Nominates Matt Gaetz As Attorney General Of United States & Marco Rubio As Secretary Of State",
        "text": "Trump's return to the White House marks only the second time in US history that a president has served two non-consecutive terms. The first such instance was Grover Cleveland, who served as president in 1884 and 1892. Trump had earlier served as US President from 2016 to 2020.",
        "summary": "",
        "url": "https://www.freepressjournal.in/world/us-president-elect-donald-trump-nominates-matt-gaetz-as-attorney-general-of-united-states-marco-rubio-as-secretary-of-state",
        "image": "https://media.assettype.com/freepressjournal/2024-11-14/mon91e8q/Untitled-design-2024-11-14T121154.386.jpg",
        "video": null,
        "publish_date": "2024-11-14 06:43:23",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": -0.318
    },
    {
        "id": 264694762,
        "title": "PM Modi Pays Tribute To Former Prime Minister Jawaharlal Nehru On His 135th Birth Anniversary",
        "text": "Children's Day is celebrated on November 14 every year as a mark of respect to the first Prime Minister of independent India. Nehru was fondly called 'Chacha Nehru' and was known for emphasising the importance of giving love and affection to children. After the death of Nehru, it was unanimously decided to celebrate his birthday as 'Bal Diwas' or Children's Day in India.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/pm-modi-pays-tribute-to-former-prime-minister-jawaharlal-nehru-on-his-135th-birth-anniversary",
        "image": "https://media.assettype.com/freepressjournal/2024-11-14/0reqy403/Untitled-design-2024-11-14T120338.999.jpg",
        "video": null,
        "publish_date": "2024-11-14 06:34:36",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.454
    },
    {
        "id": 264693552,
        "title": "Congress Leaders Rahul Gandhi, Priyanka Gandhi, & Mallikarjun Kharge Pay Tribute To India's First PM, Jawaharlal Nehru, On His 135th Birth Anniversary",
        "text": "Nehru was born on November 14, 1889, in Uttar Pradesh's Prayagraj. He breathed his last on May 27, 1964. He became the Prime Minister on August 15, 1947, following an active role in the freedom struggle of the country.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/congress-leaders-rahul-gandhi-priyanka-gandhi-mallikarjun-kharge-pay-tribute-to-indias-first-pm-jawaharlal-nehru-on-his-135th-birth-anniversary",
        "image": "https://media.assettype.com/freepressjournal/2024-05/27096dac-dfa3-4135-b772-dbc3be37df9d/Untitled_design___2024_05_27T120521_272.jpg",
        "video": null,
        "publish_date": "2024-11-14 06:28:26",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": 1.0
    },
    {
        "id": 264683084,
        "title": "Priyanka Gandhi pays tribute to former PM Jawaharlal Nehru on his 135th birth anniversary",
        "text": "Congress General Secretary Priyanka Gandhi Vadra and other party leaders paid tribute to former Prime Minister Jawaharlal Nehru at Shanti Van on Thursday on the occasion of his 135th birth anniversary. She called him the creator of modern India.In post on X, she said, “Fear is the root of all evil in the world. When we achieved independence after decades of struggle and innumerable sacrifices, even then there were people who used to play politics of scaring and misleading the innocent public. Pandit Jawaharlal Nehru ji strongly opposed them and told the common people – “Do not be afraid!””She further wrote that people who spread fear cannot be true representatives of the public.“Public servants stand in the forefront with their heads held high so that people can live without fear. Pandit Nehru always taught the public to be fearless and serve selflessly, while on the other hand he kept the public supreme at every stage of nation-building. Respectful salute to the creator of modern India,” she added.The Congress candidate for Wayanad Lok Sabha by-elections, Priyanka Gandhi Vadra has exuded confidence in winning and expects that the people will give her a chance to be their representative.Earlier today, Prime Minister Narendra Modi paid tribute to former PM Jawaharlal Nehru.In a post on X, PM Modi said, “On the occasion of his birth anniversary, I pay homage to our former Prime Minister Pandit Jawaharlal Nehru.”Children’s Day is celebrated on November 14 every year as a mark of respect to Nehru, the first Prime Minister of independent India.Fondly called ‘Chacha Nehru’, he was known for emphasising the importance of giving love and affection to children.After his demise, it was unanimously decided to celebrate his birthday as ‘Bal Diwas’ or Children’s Day in India.Nehru was born on November 14, 1889, in Uttar Pradesh’s Prayagraj. He breathed his last on May 27, 1964. He became the prime minister on August 15, 1947, following an active role in the freedom struggle of the country.On this day, a number of activities are organised for students in schools nationwide such as games, competitions, and so on, while government bodies pay tributes to the late prime minister and organise commemorative events on this day.In 1954, the United Nations declared November 20 as Universal Children’s Day and India used to celebrate Children’s Day on that day before 1956 but after the death of Prime Minister Nehru in 1964, a resolution was passed in the Parliament unanimously declaring the day of Pt. Nehru’s birth anniversary as National Children’s Day",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/11/priyanka-gandhi-pays-tribute-to-former-pm-jawaharlal-nehru-on-his-135th-birth-anniversary/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-11-14 05:03:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.033
    }
]