[
    {
        "id": 261334780,
        "title": "Congress leader Priyanka Gandhi Vadra leaves from residence to kick off election campaign in Wayanad",
        "text": "Congress leader Priyanka Gandhi Vadra on Monday left her residence for Wayanad Lok Sabha by-elections. Vadra will be kicking off her election campaign on Monday. The Wayanad seat was vacated by Congress leader Rahul Gandhi after he was also elected to Lok Sabha from Raebareli in Uttar Pradesh in the general elections held earlier this year.Congress party approved Priyanka Gandhi’s candidature on October 15, after the bypoll schedule was announced by the Election Commission of India.On October 26, after Vadra filed her nomination papers for the Wayanad Lok Sabha polls, she penned down an open letter to the people of Wayanad. In a post on X, the letter is titled “My Dear Sisters and Brothers of Wayanad”, where she expressed her deep connection with the constituency and her commitment to serving the people. She said she would work closely with the people and address their challenges, especially those faced by the women and the tribal communities.Furthermore, talking about her brother’s relationship with Wayanad, Priyanka Gandhi acknowledged the pride and sadness Rahul Gandhi felt when he asked her to contest from the constituency. She assured the people of her dedication to building upon her brother’s establishment and vowed to continue representing their needs and concerns in Parliament.“I promised Rahul Gandhi that my work here will serve to deepen this bong and that I will do all I can to fight for you and represent you in the way that you wish to be represented in the Parliament,” added Priyanka Gandhi in her letter.Priyanka Gandhi further emphasised that she would prioritise issues affecting tribal communities as well as new opportunities for women. She expressed a deep commitment to “creating new opportunities to strengthen your future.“In her letter, Priyanka Gandhi also spoke about the devastation caused by the landslide and the losses suffered by the people. “Through the darkness of the tragedy, what shone through to me was your immense courage and fortitude as a community,” she wrote.Congress leader also talked about the importance of protecting Wayanad’s natural beauty and rich cultural heritage as central to the region’s development.She held a massive roadshow before the filing of her nomination. Congress leader Rahul Gandhi and other top leaders of the UDF participated in the roadshow.Wayanad will go to the polls on November 13 along with voting for bye-elections in 47 assembly seats across 15 states. The first phase of assembly polls in Jharkhand will also be held on November 13",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/congress-leader-priyanka-gandhi-vadra-leaves-from-residence-to-kick-off-election-campaign-in-wayanad/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-28 05:13:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.308
    },
    {
        "id": 261356130,
        "title": "Rashid Engineer surrenders after interim bail expires, Delhi court defers order on regular bail",
        "text": "Independent Lok Sabha MP from Baramulla in Jammu and Kashmir, Engineer Rashid surrendered at Tihar Jail on Monday after his interim bail in a terror-funding case currently being investigated by the NIA expired.The Patiala House Court in New Delhi has deferred the pronouncement of order on regular bail for him till November 19 this year. On October 14, the court extended his interim bail on the health grounds of his ailing father and directed him to surrender to Tihar on October 28. The engineer initially got interim bail for campaigning in the recently held Jammu and Kashmir assembly elections.Polls for the 90-member Jammu and Kashmir Assembly were conducted in three phases from September 18 to October 1, with results announced on October 8, revealing a decisive victory for the National Conference-Congress alliance, which secured 48 seats.In 2005, Engineer Rashid was arrested by the Special Operations Group (SOG) in Srinagar for allegedly supporting militants and was held for three months and 17 days. He faced charges of anti-national activities and was incarcerated in Cargo, Humhama, and Raj Bagh prisons. However, the Chief Judicial Magistrate of Srinagar later dropped all charges against him on humanitarian grounds. In August 2019, Rashid was again arrested under the Unlawful Activities (Prevention) Act (UAPA). During his incarceration, he filed his nomination for the 2024 parliamentary elections from jail and won by a margin of 204,000 votes, defeating former Jammu and Kashmir Chief Minister Omar Abdullah",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/rashid-engineer-surrenders-after-interim-bail-expires-delhi-court-defers-order-on-regular-bail/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-28 09:18:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.096
    },
    {
        "id": 261322948,
        "title": "Hyderabad Police impose order prohibiting protests, gatherings to maintain public order",
        "text": "The Hyderabad Commissioner of Police imposed an order prohibiting public gatherings, dharnas and protests across the city for one month beginning from Sunday, October 27, in bid to maintain public order.Hyderabad City Police Commissioner CV Anand has issued the order under section 163 of Bharatiya Nagarik Suraksha Sanhita 2023 (earlier known as Section 144).This order prohibits the gathering of five or more persons, processions, rallies, public meetings and any display of symbols or messages that could incite a public disturbance.The notification issued by the Telangana police department stated that several organisations and parties are trying to create disturbances affecting public peace and order in Hyderabad city by resorting to dharna and protests.“Reliable information has been placed before me that several organizations, and parties are trying to create disturbances affecting public peace and order in Hyderabad City, by resorting to dharnas and protests,” the order read.“With a view to maintain public order. peace and tranquillity in Hyderabad City, I, CV Anand, IPS., Commissioner of Police, Hyderabad City in the exercise of the powers vested in me under section 163 of the Bharatiya Nagarik Suraksha Sanhita 2023 (earlier under section 144 CrPC) do hereby prohibit every kind of gathering of five or more persons, processions, dharnas, rallies or public meetings and prohibit any individual, groups of individuals from making any speeches, gestures or displaying pictures, any symbols, placards, flags and any type of messages of electronic form etc., which is likely to cause disturbance to the public peace and order in the limits of Hyderabad and Secunderabad,” it added.The police order further mentioned that peaceful dhamas and protests would allowed only at Indira Park Dharna Chowk, and any dharna or protest anywhere else in Hyderabad and Secunderabad is not permitted.“The public is hereby informed that any person violating the above orders, especially around the Secretariat and other sensitive places shall be liable for prosecution under appropriate penal provisions,” added the order",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/hyderabad-police-impose-order-prohibiting-protests-gatherings-to-maintain-public-order/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-28 01:18:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.027
    },
    {
        "id": 261331478,
        "title": "Test stars absent as Australia announce T20I squad for Pakistan series",
        "text": "Australia named a 13-player squad for next month’s three-match T20I series at home against Pakistan, with the captain’s name yet to be announced due to their regular leaders being absent for Test cricket duties. There is no room for Australia’s Test stars as they will continue their preparation for the crucial five-match Test series against India that starts on November 22, meaning the Aussies will need to find a new skipper for the Pakistan series.Fast bowling trio Xavier Bartlett, Nathan Ellis and Spencer Johnson all return to the squad after recovering from injury, with white-ball regulars Glenn Maxwell, Marcus Stoinis, Adam Zampa and Josh Inglis also named for the series that commences in Brisbane on November 14, as per ICC. Regular white-ball skipper Mitch Marsh and Test captain Pat Cummins will be in Perth ahead of the opening Test against India, leaving selectors with the chance to appoint a new player to lead the side for the first time against Pakistan.Selection Chair George Bailey is looking forward to seeing what the group can produce in the absence of many of their first-choice player away on Test duties.“This group of players have all represented Australia in T20 cricket, so we look forward to them continuing to enhance their international experience throughout this series. We are excited by the mix of experience combined with those closer to the start of their international journeys,” Bailey said as quoted by ICC. “It is particularly encouraging to have Xavier, Spencer and Nathan back in the national setup. It’s another opportunity for them to continue to show their ability on the international stage, as they have done in the past,” he added. Australia T20I squad: Sean Abbott, Xavier Bartlett, Cooper Connolly, Tim David, Nathan Ellis, Jake Fraser-McGurk, Aaron Hardie, Josh Inglis, Spencer Johnson, Glenn Maxwell, Matthew Short, Marcus Stoinis, Adam ZampaSeries schedule:First T20I: November 14, BrisbaneSecond T20I: November 16, SydneyThird T20I: November 18, Hobart. (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/test-stars-absent-as-australia-announce-t20i-squad-for-pakistan-series/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-28 04:33:29",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.47
    },
    {
        "id": 261358568,
        "title": "A New Era In Healthcare: PM Modi To Launch Multiple Projects Worth Around ₹13,000 Crore On Ayurveda Day",
        "text": "As a major addition to the flagship scheme Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (PM-JAY), Prime Minister will launch expansion of health coverage to all senior citizens aged 70 years and above.",
        "summary": "",
        "url": "https://www.freepressjournal.in/business/a-new-era-in-healthcare-pm-modi-to-launch-multiple-projects-worth-around-13000-crore-on-ayurveda-day",
        "image": "https://media.assettype.com/freepressjournal/2024-10-03/anjq32yu/Narendra-Modi.jpg",
        "video": null,
        "publish_date": "2024-10-28 09:36:47",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.043
    },
    {
        "id": 261360588,
        "title": "LSG likely to retain Pooran, Mayank and Bishnoi for IPL 2025",
        "text": "West Indies batter Nicholas Pooran, Indian stars Mayank Yadav and Ravi Bishnoi and uncapped pair of Mohsin Khan and Ayush Badoni are likely to be retained by Lucknow Super Giants (LSG) ahead of the Indian Premier League (IPL) 2025.With batter KL Rahul, who has captained the side since its inception in 2022, is unlikely to be retained, barring any last-minute change of mind from both parties, LSG will have one right-to-match (RTM) card at the auction, as per ESPNCricinfo. The exact amount of money for which these five stars have been signed for is not known yet, but based on retention slabs of the IPL, Rs 51 crores will be deducted from LSG’s purse. In case the sum paid exceeds that, then a higher amount will be deducted from Rs 120 crore purse of each franchise that they have been given to build their squads. It is understood the top retention will be Pooran, followed by Mayank and Bishnoi. In the 2024 IPL, with 499 runs in 14 matches and three fifties, the left-hander was only behind KL (520 runs in 14 matches with four fifties) in run-scoring charts and has dominated T20 cricket this year, with 2,251 runs in 68 matches with a century and 15 fifties at a strike rate of 160.90. He was also the interim captain and wicketkeeper during the first half when KL missed out due to injury. Pooran is considered as one of the best hitters in the game and the 29-year-old was brought by LSG in the 2023 season for Rs 16 crore. Mayank picked up two Player of the Match awards in his first IPL, which was an injury-cut affair. He still impressed with seven wickets in four matches, clocking 150 kmph consistently. His performances saw him being handed over a fast bowling contract by the Board of Control for Cricket in India (BCCI) and made his international debut against Bangladesh recently. He was brought by LSG for Rs 20 lakhs in the 2024 season. Bishnoi was one of three players picked by LSG ahead of IPL 2022 for Rs 4 crores as an uncapped player. After LSG made it to the playoffs that season, in which he took 13 wickets at an average of 13.44, he was given his international debut that year and has been impressive In the last season though, he could pick up 10 wickets in 14 matches at 8.77, as compared to 16 wickets in 2023. Badoni and Mohsin, two uncapped youngsters were brought for Rs 20 lakh each in 2022 auction and have been crucial to the franchise’s success. Badoni is an aggressive middle-order batter and his best season came in 2023, scoring 238 runs in 12 innings at a strike rate of 138. He has played some crucial knocks for the franchise in pressure situations. He also recently played for India A in Emerging Team’s Asia Cup. Mohsin is a tall, 6’3\" left-arm fast bowler from Uttar Pradesh, impressed in his maiden season back in 2022, taking 14 scalps at an economy of below six in just nine matches. After an injury, he was not considered for next season initially after he almost lost his arm, but bounced back by taking 10 wickets in 10 matches during 2023 IPL. (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/lsg-likely-to-retain-pooran-mayank-and-bishnoi-for-ipl-2025/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/lsg-likely-to-retain-pooran-mayank-and-bishnoi-for-ipl-2025.jpg",
        "video": null,
        "publish_date": "2024-10-28 09:33:50",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.331
    },
    {
        "id": 261350446,
        "title": "Opposition MPs stage walkout of Waqf Bill panel meeting",
        "text": "Opposition MPs on Monday staged a walkout from the the Waqf (Amendment) Bill, 2024 meeting chaired by joint parliamentary committee (JPC) chairman BJP MP Jagdambika Pal at the Parliament Annexe alleging biased proceedings. The opposition MPs alleged that the commissioner of Municipal Corporation of Delhi (MCD) and Delhi Waqf board CEO, Ashwini Kumar, completely altered the initial report of the Waqf Board and further alleged that the Chief Minister’s approval in the matter was not sought. Opposition MPs later returned and joined the meeting of the JPC.In today’s meeting, the committee had called representatives of the Delhi Waqf Board, Haryana Waqf Board, Punjab Waqf Board and Uttarakhand Waqf Board to record their oral evidence on the Waqf (Amendment) Bill, 2024.The committee has also called Call for Justice (Group led by Chander Wadhwa, Trustee), Waqf Tenant Welfare Association, Delhi and Harbans Dunkall, President, Residents Welfare Association (All Blocks), BK Dutt Colony, New Delhi to record their views and suggestions.The committee will also meet on October 29. In this meeting, committee will record oral evidence of the representatives of the Ministry of Minority Affairs on the ‘Waqf (Amendment) Bill, 2024’.The previous meeting of the committee held on October 22, witnessed a heated argument between BJP MP Abhijit Gangopadhyay and Triamool Congress MP Kalyan Banerjee.During argument with Abhijit Gangopadhyay at the meeting, Banerjee allegedly broke a glass bottle and reportedly threw it at the panel chairman, Jagdambika Pal. These allegations were made by members present.The joint parliamentary committee’s efforts are part of a larger national initiative to reform the Waqf Act and ensure that Waqf properties are used for the greater good of the community.The Waqf Act, 1995, which was created to regulate waqf properties, has long faced allegations of mismanagement, corruption and encroachments. The Waqf (Amendment) Bill, 2024, which was introduced in the Lok Sabha this August, seeks to bring sweeping reforms, introducing digitisation, stricter audits, transparency and legal mechanisms to reclaim illegally occupied properties.The JPC is holding a series of meetings to gather input from government officials, legal experts, Waqf Board members and community representatives from different states and Union Territories, aiming for the most comprehensive reform possible",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/opposition-mps-stage-walkout-of-waqf-bill-panel-meeting/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-28 08:19:02",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.335
    },
    {
        "id": 261346266,
        "title": "Madhya Pradesh CM announces to increases dearness allowance of state govt’s employees ahead of Diwali",
        "text": "Madhya Pradesh Chief Minister Mohan Yadav extended greetings to all the employees of the state government on the occasion of Diwali and announced to increase their Dearness Allowance (DA) ahead of the festival on Monday. CM Yadav said that it is the government’s responsibility to take care of the employees of the state. Dearness allowance would be increased by 4 percent from January 1, 2024 and would be given at the rate from 46 to 50 per cent to the employees of the state government. “I extend my wishes to all the employees of the state on the occasion of Diwali. The state government has made a decision to increase the dearness allowance of all the employees. I congratulate everyone. The congratulation gets doubled as there are two occasions Diwali as well as foundation day of Madhya Pradesh. On November 1, 1956 Madhya Pradesh was formed and we are working to take the state and country forward,” CM Yadav said. “I extended my congratulations to all our employees; they work with dedication, hard work and positive approach and with this they have made their identity among the employees across the country. Therefore, it is the responsibility of the state government to take care of the employees. 46% dearness allowance has been approved and has been made effective since July 1, 2023. Arrears have been given in instalments. Now from January 1, 2024, dearness allowance will be given at the rate of 50 per cent to all the employees of the state government,” the CM added. In a post on X, CM Yadav wrote, “I extend my greetings and best wishes to all the employees of Madhya Pradesh government on the occasion of Diwali. I am happy to inform you that we have decided to increase the DA by 4 percent, which will increase the current DA payable from 46 percent to 50 per cent. Dearness Allowance will be given to the government employees at the rate of 50 percent from January 1, 2024. Arrears will be paid in four equal instalments in this financial year. Earlier, the increased rate of dearness allowance was made effective from July 1, 2023, the arrears of which have also been paid in instalments.”“Your hard work and dedication has taken Madhya Pradesh towards a better future. Also, on November 1, we are preparing for Madhya Pradesh Foundation Day, which is going to add flavours in the Diwali festival. This day reminds us of the establishment of our state and our glorious past. I am grateful for your contribution to the progress and development of the state,” he further wrote",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/madhya-pradesh-cm-announces-to-increases-dearness-allowance-of-state-govts-employees-ahead-of-diwali/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/madhya-pradesh-cm-announces-to-increases-dearness-allowance-of-state-govts-employees-ahead-of-diwali.jpg",
        "video": null,
        "publish_date": "2024-10-28 07:03:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.506
    },
    {
        "id": 261335088,
        "title": "J-K: Army vehicle fired upon in Akhnoor",
        "text": "Jammu: An army vehicle was fired upon in the Battal area of Jammu and Kashmir's Akhnoor, said Army officials on Monday.No injury or causality was reported and a search operation has been launched, the Army officials added.A search operation was launched on Monday morning in the Akhnoor sector near the border with Pakistan following reports of the presence of three terrorists in the area, security officials said.The presence of the heavily armed terrorists was reported by the villagers near Assan temple in the Bhattal area of Khour, they said.Officials said that a few gunshots were heard in the forward village when an Army ambulance was passing through.Army troops along with the police have cordoned off the village and adjoining areas and an operation is underway to trace and neutralize the terrorists who are believed to have infiltrated from across the border, the officials said.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/j-k-army-vehicle-fired-upon-in-akhnoor",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/28/1856990-aa-3322350.webp",
        "video": null,
        "publish_date": "2024-10-28 05:18:49",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.308
    },
    {
        "id": 261335434,
        "title": "BJP releases second list of candidates, fields Gamliyel Hembrom against JMM chief Hemant Soren in Barhait",
        "text": "The Bharatiya Janata Party (BJP) released their second of candidates for the Jharkhand Assembly elections on Monday. The party has announced two candidates, Gamliyel Hembrom to contest from the Barhait constituency and Vikash Mahato to contest from the Tundi constituency. Hembrom will be in the electoral fray against Chief Minister and Jharkhand Mukti Morcha chief Hemant Soren, who is contesting from Barhait. Hemant Soren has retained the seat since 2014. In the Tundi constituency, the battle will be between Vikash Mahato and JMM candidate Mathura Prasad Mahato, who won the 2019 assembly election with more than 72 thousand votes. He beat BJP’s Vikram Pandey, who came second with 46 thousand votes.Earlier on October 19, the BJP had announced its list of 66 candidates.The party’s state chief Babulal Marandi is going to contest the election from Dhanwar, Lobin Hembrom from Borio and Sita Soren from Jamtara. Former CM Champai Soren is contesting from Saraikella.Earlier on Friday, it announced the list of 40-star campaigners for the upcoming Jharkhand assembly elections.The list includes the names of Prime Minister Narendra Modi, BJP national president JP Nadda, Union Ministers Rajnath Singh, Amit Shah, Nitin Gadkari Dharmendra Pradhan and Shivraj Singh Chouhan.BJP CMs such as Yogi Adityanath (Uttar Pradesh), Nayab Singh Saini (Haryana), Mohan Majhi Himanta Biswa Sarma and Vishnu Deo Sai (Chhattisgarh) are also among the star campaigners.The electoral battle is between two main alliances in the state, with the ruling Congress-JMM alliance, along with Rashtriya Janata Dal and Communist Party of India (Marxist-Leninist) already distributing most of the tickets to their candidates. Similarly, The BJP along with All Jharkhand Student Union (AJSU), Janata Dal (United) and Lok Janshakti Party (LJP) have also decided on most of their candidates. While BJP will contest 68 seats, AJSU will contest 10 seats, and JD(U) and LJP will contest two and one seat respectively.The 81 seat Jharkhand assembly will be held in two phases on November 13 and 20. Votes will be on November 23.A total of 2.60 crore voters are eligible to cast votes in Jharkhand and there are 1.31 crore male and 1.29 crore female voters. The state has 11.84 lakh first-time voters",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/bjp-releases-second-list-of-candidates-fields-gamliyel-hembrom-against-jmm-chief-hemant-soren-in-barhait/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/bjp-releases-second-list-of-candidates-fields-gamliyel-hembrom-against-jmm-chief-hemant-soren-in-barhait.jpg",
        "video": null,
        "publish_date": "2024-10-28 05:43:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.443
    },
    {
        "id": 261348596,
        "title": "Delhi Air Pollution Persists In 'Very Poor' Category, Thick Smog Engulfs Parts Of City; Visuals Surface",
        "text": "According to Central Pollution Control Board (CPCB), the AQI at Anand Vihar area was recorded at 357 at 7 AM, in the 'very poor' category, dropping down from 405, from the 'severe' category recorded on Sunday. AQI around the Akshardham temple was recorded at 357, being worse than yesterday's AQI of 261 at 7 am.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/delhi-air-pollution-persists-in-very-poor-category-thick-smog-engulfs-parts-of-city-visuals-surface",
        "image": "https://media.assettype.com/freepressjournal/2024-10-28/q5n9pzx8/Untitled-design-17.jpg",
        "video": null,
        "publish_date": "2024-10-28 08:11:43",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -1.0
    },
    {
        "id": 261327592,
        "title": "Delhi air pollution persists in ‘Very Poor’ category, thick smog engulfs parts of city",
        "text": "Certain areas of the national capital witnessed a layer of smog engulfing the area as the air quality remained in the ‘Very Poor’ category on Monday. Delhi’s Air Quality Index (AQI) was recorded at 328, according to System of Air Quality and Weather Forecasting And Research (SAFAR). This is only slightly better than Sunday’s average AQI recorded at 356. According to Central Pollution Control Board (CPCB), the AQI at Anand Vihar area was recorded at 357 at 7 AM, in the ‘very poor’ category, dropping down from 405, from the ‘severe’ category recorded on Sunday. AQI around the Akshardham temple was recorded at 357, being worse than yesterday’s AQI of 261 at 7 am.SAFAR has predicted that despite the ban on firecrackers till January 1 in Delhi, the additional emissions from the use of firecrackers and stubble burning, air quality in the capital is likely to remain in the ‘Very Poor’ category for the coming week. “The meteorological conditions are unfavourable for effective dispersion of pollutants,” read a notice by SAFAR.One of the students in Delhi, Vansh Aggarwal urged the government to use “new techniques and innovation” to control the pollution in the capital city. “There are many reasons for the increase in pollution including vehicle and industrial pollution. Even though it is said that it is increasing due to Diwali, but there are a lot of reasons for it, it would be wrong to attribute it to just Diwali. There should be a proper system to tackle the issue of pollution. There are a lot of engineering colleges here, some way we should use new techniques and innovation, the government should control it and take some steps instead of politicising it,” he told ANI.He further compared the air quality between greater Noida and Delhi, saying that he feels it is worse in the national capital. “Now as a student I travel, so if I compare to greater Noida and Delhi, I think the air quality here is worse,” he added.Another person, Sukhram said that he has had trouble breathing and been sick due to pollution for the past few days, which is forcing him to return to his village. “There is a lot of pollution here in Delhi, for the last 7 days I have been sick. I am returning to my village in Meerut (Uttar Pradesh), I came to Delhi to celebrate Diwali with my children who live here in Trilokpuri. I could not sleep properly due to pollution and was also facing difficulty in breathing, and there is a lot of heat too, so I am going home now,” he told ANI.Notably, the floating toxic foam on the Yamuna River in the Kalindi Kunj area persisted, as the water pollution remained high. The pollution in the river has become a widely debated between the ruling Aam Aadmi Party (AAP) and Bharatiya Janata Party (BJP). The Delhi BJP president Virendra Sachdeva was hospitalised on Saturday morning after taking a dip in the Yamuna river to protest against the “corruption” of the Delhi government, which he said deprived the city of the funds meant for the cleaning of the river.Delhi environment minister and AAP leader Gopal Rai criticised the BJP earlier, accusing it of contributing to the increasing pollution in the national capital.“The BJP is the party that creates pollution and seems to believe that only drama can solve it. I think all governments and parties need to work together. I wish them good health, but stopping these theatrics alone won’t reduce pollution. This reflects the BJP leaders’ level of understanding. When I was preparing the winter action plan, I had written to the BJP President, but no response or suggestions have come so far,” he told ANI on October 26",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/delhi-air-pollution-persists-in-very-poor-category-thick-smog-engulfs-parts-of-city/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/aniportalimages.s3.amazonaws.com/media/details/ANI-20241028025820.jpg",
        "video": null,
        "publish_date": "2024-10-28 03:08:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.384
    },
    {
        "id": 261346270,
        "title": "Ajit Pawar files nomination papers from Baramati assembly seat",
        "text": "Maharashtra Deputy Chief Minister and NCP chief Ajit Pawar on Monday filed his nomination papers from the Baramati assembly seat. Earlier in the day, exuding confidence, Ajit Pawar said, “Everyone has the right to contest. Whenever any candidate is fielded against me I take them as a strong candidate and campaign accordingly. This time too the people of Baramati will elect me and I have faith in them.”Notably, Ajit Pawar’s nephew and grandson of Sharad Pawar, Yugendra Pawar, is contesting from the same constituency as the NCP-SP candidate.Baramati will see another Pawar versus Pawar contest after Supriya Sule, daughter of Sharad Pawar, defeated Sunetra Pawar, wife of Ajit Pawar, during the Lok Sabha polls earlier this year.Speaking to ANI, when asked about contesting the election against his uncle, who has won this seat seven times, Yugendra Pawar said that he feels it is quite sad and quite unfortunate.”I feel it is quite sad, quite unfortunate that this had to come in the family. Not in Vidhan Sabha but it started in Lok Sabha and we were always together and even the incumbent MLA was always under the guidance of the founder of the party and family patriarch Sharad Pawar Sahab. What happened all of India has seen. The party split and the symbol was given to them by the election commission,” he told ANI.Yugendra Pawar added, “This was unfortunate but all of us in the family decided that we need to stay with Pawar Sahab because he is the founder of the NCP, he is the patriarch of the family and it is because of him that not only Baramati but everybody around also prospered.”Yugendra Pawar feels that the fight against his own uncle won’t be tough but won’t be easy either.He said, “I don’t think it will be tough but I don’t even think that it will be easy either. But initially Pawar Sahab was supporting Ajit Pawar, we fondly call him Dada but people of Baramati in large numbers are behind Pawar Sahab and that is what they showed in Lok Sabha. They will show this in the upcoming assembly as well as other elections also.The Maharashtra Assembly elections are scheduled for November 20, with counting for all 288 constituencies set for November 23.In the 2019 assembly elections, the BJP won 105 seats, the Shiv Sena 56, and the Congress 44. In 2014, the BJP secured 122 seats, the Shiv Sena 63, and the Congress 42",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/ajit-pawar-files-nomination-papers-from-baramati-assembly-seat/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/ajit-pawar-files-nomination-papers-from-baramati-assembly-seat.jpg",
        "video": null,
        "publish_date": "2024-10-28 07:13:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.089
    },
    {
        "id": 261344924,
        "title": "Maharashtra Assembly Elections 2024: Deputy CM Ajit Pawar Files Nomination Papers From Baramati Seat",
        "text": "Notably, Ajit Pawar's nephew and grandson of Sharad Pawar, Yugendra Pawar, is contesting from the same constituency as the NCP-SP candidate. Baramati will see another Pawar versus Pawar contest after Supriya Sule, daughter of Sharad Pawar, defeated Sunetra Pawar, wife of Ajit Pawar, during the Lok Sabha polls earlier this year.",
        "summary": "",
        "url": "https://www.freepressjournal.in/mumbai/maharashtra-assembly-elections-2024-deputy-cm-ajit-pawar-files-nomination-papers-from-baramati-seat",
        "image": "https://media.assettype.com/freepressjournal/2024-10-28/jr5iozja/Untitled-design-14.jpg",
        "video": null,
        "publish_date": "2024-10-28 07:36:47",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.441
    },
    {
        "id": 261236444,
        "title": "Delhi's air pollution worsens, people say feels suffocating",
        "text": "New Delhi: The air quality deteriorated in the national capital on Sunday, with the Air Quality Index (AQI) being recorded at 352, in the 'very poor' category, according to System of Air Quality and Weather Forecasting And Research (SAFAR). This is worse than the average AQI recorded at 255 on Saturday, categorized as 'poor'.Moreover, AQI in Anand Vihar area crossed the 400 mark, being recorded as 405 at 7 AM, categorized as 'severe', worse than the AQI of 367 recorded on Saturday.AQI at the Akshardham Temple deteriorated 261, whereas IGI airport recorded an AQI of 324, both categorized as 'very poor.'A layer of thick smog enveloped certain parts of the city.Himanshu, a visitor to the national capital said that the increasing pollution feels 'suffocating.'\"It feels suffocating due to pollution...The govt should look into what can be done to reduce pollution,\" he told ANI.Moreover, a cyclist in the city told ANI that they are facing a lot of problems with breathing.\"We are from Delhi and we (the cyclist group) cycle daily here, but this situation of air pollution since the last few days we are facing a lot of problems. We can't breathe properly, we get tired faster due to the pollution. We take precautions like wearing a bandana but nothing is working because the pollution is increasing a lot,\" he said.He further said that the measures taken by the government don't seem effective enough, and the government should encourage the people to use public transport more.\"The government did some work like stopping construction and implementing odd-even but it doesn't seem like it is working as this is increasing day by day. There should be constructive measures to encourage people to use public transport and carpooling,\" he added.As the festival of lights nears, the Delhi government has also banned firecrackers till January 1 amid efforts to curb pollution levels.Moreover, toxic foam on the Yamuna river in the Kalindi Kunj area persisted. Earlier the pollution in the river became a topic of hot political debate between the Bharatiya Janata Party (BJP) and Aam Aadmi Party (AAP), with BJP leader Shazia Ilmi criticizing the Delhi government for its handling of the city's worsening pollution crisis, highlighting the alarming presence of toxic foam in the River Yamuna and the resulting breathing difficulties for residents.\"BJP leader Virendraa Sachdeva has fallen ill. Two days ago he took a dip in the Yamuna river. Today he is admitted to the hospital...This is an issue connected to the health of the public of Delhi. Where have the Rs 3000 crore meant for the public of Delhi and Yamuna river?... The public of Delhi is not able to breathe...Toxic foam is floating on the Yamuna River,\" Ilmi told ANI.Notably, Delhi environment minister Gopal Rai criticsed the BJP, accusing it of contributing to the increasing pollution in the national capital.\"The BJP is the party that creates pollution and seems to believe that only drama can solve it. I think all governments and parties need to work together. I wish them good health, but stopping these theatrics alone won't reduce pollution. This reflects the BJP leaders' level of understanding. When I was preparing the winter action plan, I had written to the BJP President, but no response or suggestions have come so far,\" he told ANI.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/news/delhis-air-pollution-worsens-people-say-feels-suffocating-1833424",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/27/1856638-aa-3306609.webp",
        "video": null,
        "publish_date": "2024-10-27 04:21:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.397
    },
    {
        "id": 261260932,
        "title": "Former MP Shahabuddin’s wife Hena Sahab, son Osama join RJD",
        "text": "Wife and son of late former MP Shahabuddin, Hena Sahab and Osama, on Sunday joined Rashtriya Janata Dal (RJD).RJD chief Lalu Prasad Yadav and Bihar’s former deputy Chief Minister Tejashwi Yadav welcomed the mother-son duo into the party fold.Hena Sahab had previously contested the 2024 Lok Sabha elections from Siwan as an independent candidate. Later in the day, speaking to reporters, Lalu Yadav said, “It’s good. We welcome him.”RJD leader Tejashwi Yadav told reporters that the re-joining of the mother-son duo will strengthen the party in Siwan district.“Today in the presence of RJD’s chief (Lalu Yadav), our strong leader Hena Sahab has re-joined the party. Her son Osama has also joined the party. Many supporters have also taken the party membership. I believe that this will strengthen the party in Siwan as well as in the whole of Bihar. Through this medium, we will work to spread our ideology of secularism to the people.”Mohammad Shahabuddin served as the Siwan MP from 1996 to 2004. Known for his dominance in Siwan, he died in 2021 from COVID-19 infection while serving a life sentence in Delhi’s Tihar Jail for a double murder.Union Minister Rajiv Ranjan (Lalan) Singh said, “It is a good thing, whoever wants to join should join… This shows what they (RJD) are doing, who all are they bringing and blaming us but they are the ones doing the work.”The development came ahead of the by-polls in the state. The bypolls in Bihar will be held in Ramgarh, Tarari, Imamganj and Belaganj.The bypolls are spread over 15 states – Assam, Bihar, Chhattisgarh, Gujarat, Karnataka, Kerala, Madhya Pradesh, Maharashtra, Meghalaya, Punjab, Rajasthan, Sikkim, Uttar Pradesh, Uttarakhand and West Bengal.The assembly elections in Bihar are likely to be held in October-November 2025",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/former-mp-shahabuddins-wife-hena-sahab-son-osama-join-rjd/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/former-mp-shahabuddins-wife-hena-sahab-son-osama-join-rjd.jpg",
        "video": null,
        "publish_date": "2024-10-27 10:13:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.115
    }
]