[
    {
        "id": 260609378,
        "title": "“Restoring trust with China will take time”: Army Chief on India-China border patrolling agreement",
        "text": "Army Chief General Upendra Dwivedi on Tuesday emphasised the need to rebuild trust between India and China following the recent border patrolling agreement.Speaking at an event titled “Decade of Transformation: Indian Army in Stride with the Future” at the United Service Institution, Gen. Dwivedi made his first statement after the announcement of the India-China border patrolling agreement.Gen Dwivedi stressed that restoring trust along the Line of Actual Control (LAC) would be a gradual process, to return to the April 2020 status quo. “We are working to rebuild trust, and restoring that trust will take time,” he added, highlighting the steps of disengagement, de-escalation, and buffer zone management as crucial for easing tensions between the two nations.He further explained that the process will take place in phases, with each step aimed at reducing tensions. “This normal management of the LAC will not just stop there. There are phases in that as well,” he added.Referring to the buffer zones created along the LAC, Gen Dwivedi underscored that trust between the two countries will be rebuilt through mutual understanding. “We are trying to restore the trust. How will the trust be restored? It will get restored once we can see each other and convince each other. And we need to reassure each other that we are not creeping into buffer zones that are created,” he said.He also mentioned that ongoing patrolling activities provide a chance for both sides to reassure one another. “Patrolling gives you that kind of advantage, and as trust is rebuilt, other stages will also follow through,” he noted.The Ministry of External Affairs (MEA) announced on Monday that an agreement has been reached regarding patrolling arrangements along the Line of Actual Control (LAC) in the India-China border area.The announcement came ahead of Prime Minister Narendra Modi’s visit to Kazan, Russia, for the 16th BRICS summit scheduled from October 22 to October 24. Foreign Secretary Vikram Misri addressed the media, stating, “This agreement is the outcome of extensive discussions over the past several weeks with Chinese interlocutors at both diplomatic and military levels.” He noted that military commanders have been involved in negotiations aimed at addressing the tensions that have persisted since 2020. Misri explained that the agreement signifies a path toward disengagement and a potential resolution of the issues that arose during the significant confrontations in 2020.Misri recalled the clashes between the People’s Liberation Army of China and the Indian Army, particularly highlighting the violent encounters in June 2020, which resulted in casualties on both sides. He added that this agreement marks a critical step in stabilising relations between India and China as both nations seek to manage their border disputes and prevent further military confrontations.Misri said,” On several areas along the Line of Actual Control, we held discussions with Chinese interlocutors both at the diplomatic as well as military levels through meetings with military commanders at various levels. These discussions had in the past resulted in the resolution of standoffs at various locations. There are some locations and areas where stand-offs had not been resolved.”“Now, as a result of the discussions over the last several weeks, an agreement has been reached on patrolling arrangements along the Line of Actual Control (LAC) in the India-China border areas. This is leading to disengagement and eventually a resolution of the issues that arose in these areas in 2020,” he added.This agreement marks a crucial step in stabilising relations between India and China as both nations work to manage their border disputes and avoid further military confrontations.In early May 2020, troops from China’s People’s Liberation Army and the Indian Army clashed at locations along the LAC, the disputed boundary between China and India. The situation escalated on June 15-16, 2020, resulting in casualties on both sides",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/restoring-trust-with-china-will-take-time-army-chief-on-india-china-border-patrolling-agreement/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/restoring-trust-with-china-will-take-time-army-chief-on-india-china-border-patrolling-agreement.jpg",
        "video": null,
        "publish_date": "2024-10-22 07:58:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.142
    },
    {
        "id": 260597282,
        "title": "Maharashtra Assembly Elections 2024: Congress Leader Balasaheb Thorat Meets NCP-SP Chief Sharad Pawar Ahead Of MVA Seat-Sharing Meeting",
        "text": "Both the ruling Mahayuti alliance and the opposition Maha Vikas Aghadi (MVA) -- comprising the Shiv Sena (UBT), NCP (Sharad Pawar faction), and Congress -- have intensified their preparations for the upcoming elections to 288 Assembly seats in the State. Voting in Maharashtra will be held in a single phase on November 20. Counting will be held on November 23.",
        "summary": "",
        "url": "https://www.freepressjournal.in/mumbai/maharashtra-assembly-elections-2024-congress-leader-balasaheb-thorat-meets-ncp-sp-chief-sharad-pawar-ahead-of-mva-seat-sharing-meeting",
        "image": "https://media.assettype.com/freepressjournal/2024-10-22/4ksw91cs/Untitled-design-29.jpg",
        "video": null,
        "publish_date": "2024-10-22 06:11:19",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.03
    },
    {
        "id": 260596188,
        "title": "Maharashtra Assembly polls: Balasaheb Thorat meets Sharad Pawar ahead of MVA seat-sharing meeting",
        "text": "Congress state legislature party leader Balasaheb Thorat on Tuesday met with Sharad Pawar of the NCP (Sharadchandra Pawar) ahead of today’s meeting of the Maha Vikas Aghadi (MVA) constituents, which includes that two parties and Shiv Sena (UBT) on seat-sharing for the upcoming Maharashtra assembly polls.Shiv Sena (UBT) leader Sanjay Raut said “Congress’ senior leader Balasaheb Thorat who was in Delhi has come to meet Sharad Pawar today morning. Later, he will go to Matoshree and then we Uddhav Thackeray and other Shiv Sena leaders will have a meeting with Congress leaders and then we will see what to do, but everything is fine as of now…”Yesterday, the Central Election Committee (CEC) of the Congress chaired by Congress chief Mallikarjun Kharge had met in the national capital to finalise candidates for the assembly polls.Congress leader and Leader of the Opposition Vijay Wadettiwar said that the final decision on all 288 seats for MVA for the Maharashtra assembly election will be made by this evening. Speaking to reporters in Delhi, Wadettiwar said, “We will finalise the 17 seats. There are issues on six to seven seats in Vidarbha and that too will be resolved. We are going to contest as Aghadi…Since 3 parties are sharing 288 seats, it took a little time…The final decision on all 288 seats for Maha Vikas Aghadi will be made by tomorrow evening.”Congress election in-charge for Maharashtra assembly elections, Ramesh Chennithala refuted reports of differences among the INDIA alliance partners in the state.“There are no differences (in Maha Vikas Aghadi). We are united. Talks are going on regarding seats, it will be resolved soon,” Chennithala said.Both the ruling Mahayuti alliance and the opposition Maha Vikas Aghadi (MVA) — comprising the Shiv Sena (UBT), NCP (Sharad Pawar faction), and Congress — have intensified their preparations for the upcoming elections to 288 Assembly seats in the State.The BJP is part of the ruling Mahayuti alliance alongside the Shiv Sena (Eknath Shinde faction) and Ajit Pawar-led NCP. The BJP has announced its list of 99 candidates for the elections. Voting in Maharashtra will be held in a single phase on November 20. Counting will be held on November 23.In the 2019 Maharashtra assembly elections, the BJP won 105 seats, while Shiv Sena secured 56, and Congress won 44 seats. In 2014, the BJP won 122 seats, Shiv Sena secured 63, and Congress won 42 seats",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/maharashtra-assembly-polls-balasaheb-thorat-meets-sharad-pawar-ahead-of-mva-seat-sharing-meeting/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-22 05:35:30",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.114
    },
    {
        "id": 260596186,
        "title": "NIA chargesheets key associate of Khalistani terrorists in Punjab terror conspiracy case",
        "text": "The National Investigation Agency (NIA) announced on Tuesday that it has filed a chargesheet against a key associate of Khalistani terrorists Rinda and Landa in a Punjab terror conspiracy case.The chargesheet against Gurpreet Singh, also known as Gopi, from Tarn Taran (Punjab), was submitted to the NIA Special Court in Mohali. The NIA has identified him as an associate of internationally designated terrorists Harwinder Singh Sandhu, aka Rinda, and Lakhbir Singh, aka Landa, who are affiliated with the banned terrorist group Babbar Khalsa International (BKI).Investigations by the anti-terror agency have established his role in a conspiracy hatched by the BKI terrorists to unleash terror in Punjab and other parts of the country.\n\nThe accused was involved in the RPG attack on Police Station Sarhali in December 2022, as per NIA investigations, which have revealed that he had remained in contact with his foreign-based handlers from jail even after his release from jail in that case.\n\nNIA investigations have further found that Gurpreet had conspired to raise funds for BKI and its operatives in India through large-scale extortion from businessmen on the directions of Landa. “Landa had recruited vulnerable youth for the BKI terror module. He had additionally carried out recce of the targets identified by Landa and had made attempts to eliminate those targets,” said the NIA.\n\nNIA, which had seized an illegal weapon from the accused’s house during a search operation in January this year, has charged him under various sections of the Unlawful Activities (Prevention) Act, Indian Penal Code, and Arms Act",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/nia-chargesheets-key-associate-of-khalistani-terrorists-in-punjab-terror-conspiracy-case/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/nia-chargesheets-key-associate-of-khalistani-terrorists-in-punjab-terror-conspiracy-case.jpg",
        "video": null,
        "publish_date": "2024-10-22 05:43:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.41
    },
    {
        "id": 260628294,
        "title": "Bahraich violence: UP govt assures SC of not taking action on demolition till Oct 23",
        "text": "The Uttar Pradesh government on Tuesday assured the Supreme Court that authorities won’t take any action till tomorrow on demolition notices issued against the buildings belonging to persons allegedly involved in the October 13 Bahraich violence in the state.A bench of Justices BR Gavai and KV Viswanathan said it will hear the application tomorrow seeking protection against the proposed demolitions.Senior advocate CU Singh mentioned the application before the bench today for an early hearing.The bench said it will take up the application tomorrow for hearing and asked the Additional Solicitor General KM Nataraj to defer action, to which ASG said that no action will be taken till tomorrow.ASG also informed the top court that the Allahabad High Court is also seized of the matter. On urgent hearing, the High Court on Sunday granted 15 more days to the affected persons to respond to the notices issued by the UP authorities.“If they (UP authorities) want to take the risk of flouting our order, it’s their choice,” the bench also remarked.An application was filed in the apex court against the demolition notices issued by the Uttar Pradesh authorities to some people including the accused in the Bahraich violence case Abdul Hameed over the illegal construction of his residence.Three people have jointly filed the petition against the demolition notice and urged the top court to quash the notices issued on October 17, 2024, which was pasted on the night of October 18.The petitioners also sought interim relief for staying the proposed demolition and status quo as of the date of issuance of notice on October 17.Earlier on September 17 the apex court passed an interim order on similar petitions that no construction should be bulldozed without prior permission from it, except those that are encroachments on public spaces. The top court has recently reserved its judgement on a batch of petitions seeking directions against demolition actions by various state authorities, whereby houses of persons accused of crimes are demolished as a punitive action",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/bahraich-violence-up-govt-assures-sc-of-not-taking-action-on-demolition-till-oct-23/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-22 09:53:57",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.127
    },
    {
        "id": 260604592,
        "title": "No action will be taken on demolition notices related to Bahraich violence until tomorrow: Uttar Pradesh govt assures SC",
        "text": "Uttar Pradesh government has assured the Supreme Court that authorities won’t take any action till tomorrow on demolition notices issued against some buildings belonging to persons allegedly involved in the October 13 Bahraich violence in the state.Notably, violence erupted between two communities during the Durga idol immersion procession on October 13 in Bhraich, leading to the killing of one person identified as Ram Gopal Mishra.Of the five arrested in connection with the Bahraich violence, two were injured during the encounter, while the remaining three were taken into custody, according to Uttar Pradesh Director General of Police (DGP) Prashant Kumar, who also stated that the situation is now under control.On October 18, the Public Works Department (PWD) issued a demolition notice for the residence of Abdul Hameed, one of the accused in the Bahraich violence, over illegal construction in the area.Following this, a petition was moved in the Supreme Court against the demolition notices issued by the Uttar Pradesh authorities to several people, including Abdul Hameed, an accused in the Bahraich violence over alleged illegal construction.Three petitioners jointly filed the petition through advocate Mrigank Prabhakar, urging the SC to quash the demolition notices.The petitioners argue that the proposed demolition is punitive, saying, “The defence of “unauthorized construction” is being used as a ruse to carry out punitive demolition and also to illegally overcome the interim protective orders passed by this Court on 17-09-2024.”They had further submitted that the proposed demolition action is “punitive” and is ex-facie actuated by “malice” because of the undue haste with which the respondent authority has initiated the proposed action.“The trigger for the proposed demolition notices is the close proximity of the communal flare-up and violent incident and the impugned notice, based on the perception of OR the alleged involvement of the owners/ residents/occupants in that alleged criminal activity,” the petitioner said",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/no-action-will-be-taken-on-demolition-notices-related-to-bahraich-violence-until-tomorrow-uttar-pradesh-govt-assures-sc/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/no-action-will-be-taken-on-demolition-notices-related-to-bahraich-violence-until-tomorrow-uttar-pradesh-govt-assures-sc.jpg",
        "video": null,
        "publish_date": "2024-10-22 07:18:35",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.62
    },
    {
        "id": 260628296,
        "title": "TMC MP Kalyan Banerjee breaks glass bottle following heated exchanges during JPC meet",
        "text": "Heated exchanges between Trinamool Congress MP Kalyan Banerjee and BJP MP Abhijit Ganguly during a JPC meeting on Tuesday resulted in the former smashing a glass water bottle and hurting himself.During the JPC meeting held on Waqf Bill, many eminent personalities, including retired judges and Supreme Court lawyers, were present. According to the sources, Kalyan Banerjee wanted to speak out of turn. He had already spoken thrice and wanted to get a chance again during the presentation. But BJP MP Abhijit Gangopadhyay objected. This ensued a heated exchange between them, where sources said both used abusive language.Meanwhile, Kalyan Banerjee picked up a glass water bottle, hit it on the table and hurt himself. After this, he threw the broken bottle towards the chairman. Due to the incident, the meeting adjourned for some time. Soon after, Banerjee was taken for medical aid, wherein he received four stitches in his hand.In today’s meeting, the committee is hearing views and suggestions from representatives of Justice in Reality and Panchasakha Prachar, both based in Cuttack, Odisha.A delegation of five MPs from the Indian Union Muslim League (IUML) is also presenting their perspectives on the bill.The committee met on Monday, inviting officials from the Ministry of Minority Affairs to provide oral evidence regarding the bill. This meeting is part of a larger national initiative to address long-standing issues related to the management of waqf properties.On Monday, discussions during the Joint Parliamentary Committee (JPC) meeting became heated as opposition members questioned the consultative process behind the legislation.They accused the government of introducing the bill for political reasons, alleging it targeted the Muslim community. AIMIM leader Asaduddin Owaisi presented a nearly one-hour critique of the bill, raising concerns about its implications. Trinamool Congress leader Kalyan Banerjee even asked whether Waqf, which exists in the name of Allah, is legally recognized by the state. Despite the tensions, BJP members defended the bill, arguing that it is necessary for reforming Waqf property management and ensuring transparency. The Waqf (Amendment) Bill, 2024, aims to bring significant reforms, including digitization of records, stricter audits, increased transparency, and legal mechanisms to reclaim illegally occupied waqf properties",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/tmc-mp-kalyan-banerjee-breaks-glass-bottle-following-heated-exchanges-during-jpc-meet/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-22 10:03:36",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.209
    },
    {
        "id": 260600022,
        "title": "Uttar Pradesh: 6 Killed In Bulandshahr Cylinder Blast; Injuries Reported As Rescue Efforts Continue",
        "text": "Speaking to ANI, Chandra Prakash Paryadarshi, City Magistrate Bulandshahr said, \" Total six bodies have been brought here in the district hospital for post-mortem, three male bodies and three female bodies. These are the victims of the Sikandrabad tragedy. I can't exactly say the total number of casualties. I have my duty in the district hospital and six bodies were brought here.\"",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/uttar-pradesh-6-killed-in-bulandshahr-cylinder-blast-injuries-reported-as-rescue-efforts-continue",
        "image": "https://media.assettype.com/freepressjournal/2020-02/96da52d3-513e-4f5b-8f65-bc80683ffc11/Death_3.jpg",
        "video": null,
        "publish_date": "2024-10-22 06:31:56",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": -0.816
    },
    {
        "id": 260578886,
        "title": "Six killed in cylinder blast in UP’s Sikandrabad",
        "text": "At least six people were killed in a cylinder blast that occurred in a house in the Ashapuri Colony of Sikandrabad on Monday, said officials. Speaking to ANI, Chandra Prakash Paryadarshi, City Magistrate Bulandshahr said, ” Total six bodies have been brought here in the district hospital for post-mortem, three male bodies and three female bodies. These are the victims of the Sikandrabad tragedy. I can’t exactly say the total number of casualties. I have my duty in the district hospital and six bodies were brought here.” Earlier while speaking to ANI, Bulandshahr District Magistrate, Chandra Prakash Singh said that five people died in the incident.“A cylinder blast occurred at a house in Ashapuri colony between 8:30-9 pm. There were 18-19 people in the house, eight people were rescued from here whose condition were very critical. The Chief Medical Officer has confirmed the death of five people, three people are still injured, out of which one is in serious condition but his treatment is underway,” he said earlier. “Fire brigade team, police department team, municipal corporation team, medical team, NDRF team are at the spot,” Singh said.The District Magistrate said that taking cognizance of the incident Chief Minister Yogi Adityanath “instructed us to immediately reach the spot and carry out relief and rescue work… The reasons for the blast will be investigated.” (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/six-killed-in-cylinder-blast-in-ups-sikandrabad/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/six-killed-in-cylinder-blast-in-ups-sikandrabad.jpg",
        "video": null,
        "publish_date": "2024-10-22 00:58:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.748
    },
    {
        "id": 260635814,
        "title": "CPI releases first list of candidates for Jharkhand Assembly elections",
        "text": "CPI state secretary Mahendra Pathak released the list of candidates for the upcoming Jharkhand Assembly polls.This comes as the party expressed disappointment over the current seat-sharing arrangement of the INDIA bloc. Pathak said that the party would field candidates on a total of 15 seats for the Jharkhand Assembly polls.Mahendra Pathak said, “We have been a part of the INDIA alliance. We had contacted the big leaders of both JMM and Congress regarding seat sharing and were also given assurances but we were disappointed. That is why we have decided to field our candidates on 15 Assembly seats in Jharkhand. Today we are announcing our candidates for some seats.”According to the list, CPI has fielded Kanhai Chandramal Pahadiya from the Nala Assembly, Chhaya from Sarath Assembly, Mahadev Ram from Barkatha Assembly, Ruchir Tiwari from Daltonganj, Santosh Kumar Rajak from Kanke, Suresh Kumar Bhuiya from Simaria, Doman Bhuiya from Chatra, Mahendra Oraon will contest from Bishanpur, Ghanshyam Pathak is fighting from Bhawanathpur.He further said that candidates from the remaining seats — Ranchi, Mandu, Barkagaon Hazaribagh, and Poreyahat will be announced after two days.He also said that ahead of the elections, the Jharkhand government and BJP were trying to mislead the people by promising to distribute freebies. “The state government has disappointed the youth here for 5 years, we will contest elections outside the alliance,” Pathak said.The Assembly elections in Jharkhand will be held in two phases on November 13 and November 20 and votes will be counted on November 23, Chief Election Commissioner, Rajiv Kumar announced on Tuesday.Earlier, Jharkhand Chief Minister Hemant Soren, accompanied by Jharkhand Congress in-charge Ghulam Ahmad Mir announced that the JMM and the Congress would share 70 seats between them, and the RJD and Left parties would split the remaining 11.Rashtriya Janata Dal (RJD) MP Manoj Kumar Jha on Sunday criticized the “unilateral decision” of the Congress-JMM alliance.Meanwhile, the Bharatiya Janata Party (BJP) announced its first list of 66 candidates for the Jharkhand Assembly elections on Saturday.The party’s state chief, Babulal Marandi, will contest from Dhanwar, Lobin Hembrom from Borio, and Sita Soren from Jamtara. Former Chief Minister of Jharkhand Champai Soren has been nominated as the candidate from Saraikella, Geeta Balmuchu from Chaibasa, Geeta Koda from Jaganathpur, and Meera Munda, the wife of Union Minister Arjun Munda will contest from Potka.Voting for the 81 seats of the Jharkhand assembly will be held in two phases on November 13 and 20, with votes to be counted on November 23",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/cpi-releases-first-list-of-candidates-for-jharkhand-assembly-elections/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-22 11:13:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.412
    },
    {
        "id": 260594248,
        "title": "Congress Releases 1st List Of 21 Candidates For Jharkhand Assembly Elections 2024; Know About Them Here",
        "text": "Prominent names in the list include State Finance Minister Rameshwar Oraon, and senior party leader Ajoy Kumar and Jharkhand Health Minister Banna Gupta. Rameshwar Oraon will contest from Lohardaga (ST) seat reserved for Scheduled Tribes, Banna Gupta from Jamshedpur West, and Ajoy Kumar from Jamshedpur East.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/congress-releases-1st-list-of-21-candidates-for-jharkhand-assembly-elections-2024-know-about-them-here",
        "image": "https://media.assettype.com/freepressjournal/2024-10-08/qcis06li/Congress-rep.png",
        "video": null,
        "publish_date": "2024-10-22 05:30:49",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": 0.214
    },
    {
        "id": 260577974,
        "title": "Congress releases list of 21 candidates for Jharkhand assembly polls",
        "text": "Congress party has released the first list of 21 candidates for Jharkhand assembly polls. Prominent names in the list includes State Finance Minister Rameshwar Oraon and senior party leader Ajoy Kumar and Jharkhand Health Minister Banna Gupta. Rameshwar Oraon will contest from Lohardaga (ST) seat reserved for Scheduled Tribes, Banna Gupta from Jamshedpur West and Ajoy Kumar from Jamshedpur East. Voting in Jharkhand will be held in two phases – November 13 and 20. Votes will be counted on November 23. Jharkhand Chief Minister Hemant Soren on Saturday announced that the INDIA bloc will contest the Jharkhand Assembly polls together and Jharkhand Mukti Morcha (JMM) and the Congress will contest 70 of 81 seats in the state assembly.Hemant Soren said the remaining seats will be contested by other parties of the INDIA bloc and talks are underway with RJD and Left parties. The BJP announced the first list of 66 candidates for the Jharkhand Assembly elections earlier on Saturday. The party’s state chief Babulal Marandi will contest the elections from Dhanwar, Lobin Hembrom from Borio and Sita Soren from Jamtara. Former Chief Minister of Jharkhand Champai Soren has been nominated as the candidate from Saraikella, Geeta Balmuchu from Chaibasa, Geeta Koda from Jaganathpur and wife of Union Minister Arjun Munda, Meera Munda has been nominated from Potka.BJP will contest the elections in alliance with the All Jharkhand Students Union (AJSU), Janata Dal (United) and Lok Janshakti Party (LJP). BJP will contest 68 seats, AJSU 10 seats, JD-U two seats and LJP one seat. In the 2019 Assembly elections, the Jharkhand Mukti Morcha as part of the UPA (United Progressive Alliance) contested 43 seats, Congress contested 31 seats and the Rashtriya Janata Dal seven seats in the 81-member assembly. The UPA attained victory by winning 47 seats against BJP’s 25 seats",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/congress-releases-list-of-21-candidates-for-jharkhand-assembly-polls/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/congress-releases-list-of-21-candidates-for-jharkhand-assembly-polls.jpg",
        "video": null,
        "publish_date": "2024-10-22 00:38:31",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.045
    },
    {
        "id": 260586156,
        "title": "Kane Williamson ruled out of 2nd Test against India, continues rehab for groin strain",
        "text": "New Zealand batter Kane Williamson will miss the second Test against India, which will kickstart from Thursday in Pune as he continues his rehab from a groin strain. New Zealand Cricket (NZC) took to Instagram and issued a statement, saying, “Squad News | Kane Williamson will not be available for the BLACKCAPS second Test match against India, as he continues his rehabilitation from a groin strain.”Williamson suffered the injury during the recently-concluded two-match Test series against Sri Lanka and missed the first Test against India at Bengaluru, which the Kiwis won by eight wickets, securing their first win in India in 36 years. NZ head coach Gary Stead said that while Williamson was making progress, he was not yet ready to return to Test cricket.“We are monitoring Kane and he is tracking in the right direction, but is not yet 100 per cent fit,” said Stead.“We are hopeful to see further improvement over the coming days and have him available for the third Test,” added the coach. Against India in 37 Tests, Kane has scored 871 runs at an average of 37.86, with two centuries and five fifties in 24 innings, with his best score being 131. Contributions from Rachin Ravindra, Matt Henry and William O’Rourke shined in their eight-wicket win over India at Bengaluru’s M Chinnaswammy Stadium, their first on Indian soil since 1988.In the Test, fine spells from Henry (5/15) and O’Rourke (4/22) skittled out India for just 46 runs after they elected to bat first. Later. contributions from Rachin (134), Devon Conway (91) and Tim Southee (65) took the Kiwis to 402/10, giving them a 356-run lead. Fine knocks from skipper Rohit Sharma (52), Virat Kohli (70), Sarfaraz Khan (150) and Rishabh Pant (99) took India to 462/10, giving them a 106-run lead. A collapse after the introduction of the new ball prevented India from getting a much bigger lead. Kiwis chased down the total comprehensively with eight wickets in hand. Rachin won the ‘Player of the Match’ award. (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/kane-williamson-ruled-out-of-2nd-test-against-india-continues-rehab-for-groin-strain/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/kane-williamson-ruled-out-of-2nd-test-against-india-continues-rehab-for-groin-strain.jpg",
        "video": null,
        "publish_date": "2024-10-22 03:33:27",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.459
    },
    {
        "id": 260634626,
        "title": "Hoax bomb threats sent to multiple CRPF schools across country",
        "text": "New Delhi: Multiple Central Reserve Police Force (CRPF) schools nationwide received hoax bomb threats late on Monday night, sources said. The schools affected by the hoax threats include two in Delhi--one in Rohini and another in Dwarka--as well as one in Hyderabad. Sources indicate that the threats were communicated through email to the management of these institutions. Authorities are investigating the incident, with the matter being reviewed by higher officials from various organizations, including the CRPF, Intelligence Bureau, and Delhi Police. The threat email specified a potential bomb blast in the classrooms of these schools at 11 am on Tuesday. However, the threat has since been determined to be a hoax. The hoax threat was received a day after the blast outside a CRPF school in Delhi's Rohini on Sunday for which a pro-Khalistani group claimed responsibility that sent shockwaves through the national capital. Delhi Police reached out to social media platforms and the messaging app Telegram, requesting details about the channel where the post was made, and the matter is being investigated. The Sunday blast in the Prashant Vihar school was so powerful that it tore through the wall of the school. No injuries were reported in the incident however some of the nearby buildings and vehicles were damaged. Such hoax bomb threats on domestic and international flights have been received for several days. So far this week, more than 90 flights have received bomb threats and most of them have turned out to be hoaxes. Central Industrial Security Force (CISF) Director General RS Bhatti and Bureau of Civil Aviation Security (BCAS) Director General Zulfiqar Hasan on Monday met with Union Home Secretary Govind Mohan and apprised him about the recent hoax bomb threats in domestic and international flights. In the nearly half-an-hour meeting with the Home Ministry, both the DGs informed the Home Secretary about a series of recent hoax calls threatening domestic and international flights that has created panic situations on many occasions forcing the officials in the Indian aviation sector, intelligence wing, and other departments to go through rigorous security check process. Sources said that the officials discussed the potential implications for aviation security and measures being taken to address the situation, emphasizing the need for heightened vigilance and coordination among security agencies.",
        "summary": "The schools affected by the hoax threats include two in Delhi--one in Rohini and another in Dwarka--as well as one in Hyderabad",
        "url": "https://www.deccanchronicle.com/nation/crime/hoax-bomb-threats-sent-to-multiple-crpf-schools-across-country-1832077",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/22/1854897-untitleddesign22.webp",
        "video": null,
        "publish_date": "2024-10-22 11:06:20",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.087
    },
    {
        "id": 260623878,
        "title": "CRPF Schools In Delhi & Hyderabad Receive Hoax Bomb Threat Emails: Investigation Underway",
        "text": "The threats were communicated via email, warning of a potential blast at 11 am Tuesday. Authorities, including the CRPF and Intelligence Bureau, are investigating the incident, which follows a recent explosion at a CRPF school in Rohini.",
        "summary": "",
        "url": "https://www.freepressjournal.in/education/crpf-schools-in-delhi-hyderabad-receive-hoax-bomb-threat-emails-investigation-underway",
        "image": "https://media.assettype.com/freepressjournal/2023-01/faa58b9b-79a7-41b5-ab27-bc2397f1ac0b/bomb_threat.jpg",
        "video": null,
        "publish_date": "2024-10-22 09:43:22",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": 0.08
    },
    {
        "id": 260616534,
        "title": "Hoax bomb threats sent to multiple CRPF schools across country",
        "text": "Multiple Central Reserve Police Force (CRPF) schools nationwide received hoax bomb threats late on Monday night, sources said.The schools affected by the hoax threats include two in Delhi–one in Rohini and another in Dwarka–as well as one in Hyderabad. Sources indicate that the threats were communicated through email to the management of these institutions.Authorities are investigating the incident, with the matter being reviewed by higher officials from various organizations, including the CRPF, Intelligence Bureau, and Delhi Police. The threat email specified a potential bomb blast in the classrooms of these schools at 11 am on Tuesday. However, the threat has since been determined to be a hoax.The hoax threat was received a day after the blast outside a CRPF school in Delhi’s Rohini on Sunday for which a pro-Khalistani group claimed responsibility that sent shockwaves through the national capital. Delhi Police reached out to social media platforms and the messaging app Telegram, requesting details about the channel where the post was made, and the matter is being investigated. The Sunday blast in the Prashant Vihar school was so powerful that it tore through the wall of the school. No injuries were reported in the incident however some of the nearby buildings and vehicles were damaged.Such hoax bomb threats on domestic and international flights have been received for several days. So far this week, more than 90 flights have received bomb threats and most of them have turned out to be hoaxes. Central Industrial Security Force (CISF) Director General RS Bhatti and Bureau of Civil Aviation Security (BCAS) Director General Zulfiqar Hasan on Monday met with Union Home Secretary Govind Mohan and apprised him about the recent hoax bomb threats in domestic and international flights.In the nearly half-an-hour meeting with the Home Ministry, both the DGs informed the Home Secretary about a series of recent hoax calls threatening domestic and international flights that has created panic situations on many occasions forcing the officials in the Indian aviation sector, intelligence wing, and other departments to go through rigorous security check process.Sources said that the officials discussed the potential implications for aviation security and measures being taken to address the situation, emphasizing the need for heightened vigilance and coordination among security agencies",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/hoax-bomb-threats-sent-to-multiple-crpf-schools-across-country/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-22 08:35:36",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.045
    }
]