[
    {
        "id": 263244028,
        "title": "My husband can bring peace to J&K: Yasin Malik’s wife writes to Rahul Gandhi",
        "text": "New Delhi, Nov 7 (IANS) Mushaal Hussein Mullick, the wife of jailed Jammu Kashmir Liberation Front (JKLF) chief, Yasin Malik, wrote to Leader of Opposition (LoP) Rahul Gandhi, urging him to initiate a debate in Parliament for her husband, who she claims can bring peace to Jammu and Kashmir (J&K).\n\nMullick, a former assistant to the Prime Minister of Pakistan on human rights and women empowerment, believes that Yasin Malik’s role in the ongoing peace process in J&K is critical and that his plight must be addressed urgently.\n\n“Rahul Ji, Yasin Malik could be a force for peace in Jammu and Kashmir, if only he is given a fair chance,” Mullick wrote, urging the Congress leader to intervene before Malik’s deteriorating health leads to irreversible consequences.\n\n“The ongoing treatment of my husband is nothing short of torture, and I request you to help us secure justice for him,” she added.\n\nIn a letter to Gandhi, Mullick drew attention to the ongoing legal battles her husband faces, particularly a decades-old sedition case in which the National Investigation Agency (NIA) has now demanded the death penalty.\n\nMalik, who has been at the forefront of Kashmir’s separatist movement, is currently involved in challenging the NIA’s appeal for capital punishment in a terror funding case.\n\nThe NIA’s charges stem from a 2017 investigation into terror financing involving Malik along with several others. In 2022, Malik was sentenced to life imprisonment by a trial court after he pleaded guilty to the charges.\n\nHowever, according to Mullick, Malik’s detention and the demand for his death sentence are “part of a broader political vendetta.”\n\nShe claimed that since 2019, the BJP-led central government has subjected Malik to “inhumane” treatment, and his trials have been “politically motivated.”\n\n“Malik is being tried for waging war against India in a 35-year-old case, and now, fabricated charges are being used to demand his execution,” Mullick alleged in the letter.\n\nShe further stated that her husband, who once advocated for armed struggle, had renounced violence years ago, embracing the path of non-violence and peace.\n\n“Yasin Malik can become an instrument for real peace in J&K, not the cosmetic peace that has been promised,” she added.\n\nMullick also highlighted that since November 2, Malik has been on an indefinite hunger strike to protest his harsh treatment in jail. She expressed deep concern for his health, warning that the prolonged hunger strike could jeopardise his life.\n\n“This hunger strike is a desperate cry against the cruel conditions he has endured, and it is putting his life at severe risk,” she said.\n\nMalik, she emphasised, chose the path of non-violence after renouncing armed resistance, a change of heart that has been acknowledged by various authors and peace advocates over the years.",
        "summary": "New Delhi, Nov 7 (IANS) Mushaal Hussein Mullick, the wife of jailed Jammu Kashmir Liberation Front (JKLF) chief, Yasin Malik, wrote to Leader of Opposition (LoP) Rahul Gandhi, urging him to initiate a debate in Parliament for her husband, who she claims can bring peace to Jammu and Kashmir (J&#38;K). Mullick, a former assistant to [&#8230;]",
        "url": "https://bhaskarlive.in/my-husband-can-bring-peace-to-jk-yasin-maliks-wife-writes-to-rahul-gandhi/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073255936.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 06:42:17",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.168
    },
    {
        "id": 263280832,
        "title": "RG Kar hearing: SC orders NTF report to be made available to all\n states, UTs",
        "text": "New Delhi, Nov 7 (IANS) The Supreme Court on Thursday ordered that the report prepared by the National Task Force (NTF), set up by the Union government on its order in the aftermath of the ghastly rape and murder of a junior doctor of R.G. Kar Medical College & Hospital in West Bengal’s Kolkata, be made available to Chief Secretaries of all state and Union Territories and other stakeholders, including the doctors’ associations.\n\nA bench, headed by CJI D.Y. Chandrachud, noted that the NTF has formulated recommendations in two categories, first, prevention of violence against medical professionals and providing safe working conditions, and, second, prevention of sexual violence against doctors.\n\n“In order to enable this court to issue directions for compliance with the NTF recommendations, we consider it appropriate to direct that a copy of the report shall be made available to all the counsels appearing in the present batch of proceedings. The report shall also be supplied to the Chief Secretaries of all the states/UTs. In the event, any state/UT intends to make any submission with regard to the recommendations, a brief note of submissions may be filed through the standing counsel to the court master within a period of three weeks,” it said.\n\nThe Bench, also comprising Justices J.B. Pardiwala and Manoj Misra, pursued the 6th status report filed by the Central Bureau of Investigation (CBI) and said that it would refrain from making any observations since the investigation is underway.\n\nThe apex court noted that the trial will commence on November 11 at a special court in Kolkata after charges were framed against the “sole prime accused” in the case, Sanjay Roy. The process of the framing of charges was completed on Monday, exactly 87 days after the body of the junior doctor was discovered at a seminar hall within the state-run R.G. Kar premises on the morning of August 9 this year. Around a month ago, the CBI filed its first charge sheet against Roy, a civic volunteer with Kolkata Police, in the alleged rape and murder case.\n\nIn the charge sheet, the CBI did not rule out the possibilities of a larger conspiracy behind the macabre crime that prompted alleged events of tampering and altering of evidence during the initial phase of the investigation which was carried out by Kolkata Police.\n\nBesides Roy, two others arrested by the CBI officials in the matter are the RG Kar Medical College and Hospital’s former Principal Sandip Ghosh, and the former SHO of Tala Police Station, Abhijit Mondal. RG Kar comes under the jurisdiction of Tala Police Station. The main charges against Ghosh and Mondal are misleading the investigation when the Kolkata Police were carrying out the investigation before it was handed over to the CBI by the Calcutta High Court. Both have been accused of tampering with evidence in the case.\n\nThe top court asked the CBI to file a fresh status report before the next date of listing.\n\nIn a hearing held last month, the SC had stressed that the NTF should complete its task within a reasonable timeframe.\n\n“We are of the view that the Union government must take proactive measures to ensure that the work of the task force is completed within a reasonable period in the future. Accordingly, the meetings of the NTF shall be held at periodic intervals,” it ordered, asking the NTF to apprise the top court about its tentative recommendations by the next date of listing.\n\n“We will give three weeks to NTF to meet and complete all of its work,” the SC told Solicitor General Tushar Mehta.\n\nThe Supreme Court had ordered the formation of the NTF to suggest measures for the security of medical professionals across the country, observing that the safety of doctors is the “highest national concern”.\n\nTaking suo moto cognisance of the rape and murder case of a junior doctor, the Supreme Court had termed the incident “horrific,” which raises the “systemic issue of safety of doctors across the country”.\n\n“We are deeply concerned about the fact that there is an absence of safe conditions of work for young doctors across the country, particularly, public hospitals,” it had said.",
        "summary": "New Delhi, Nov 7 (IANS) The Supreme Court on Thursday ordered that the report prepared by the National Task Force (NTF), set up by the Union government on its order in the aftermath of the ghastly rape and murder of a junior doctor of R.G. Kar Medical College &#38; Hospital in West Bengal&#8217;s Kolkata, be [&#8230;]",
        "url": "https://bhaskarlive.in/rg-kar-hearing-sc-orders-ntf-report-to-be-made-available-to-all-states-uts/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/f813686a17381ccf87b0613637f18991.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 10:24:45",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.008
    },
    {
        "id": 263235482,
        "title": "TCS inks multi-year deal to make Air France-KLM leading data-driven airline",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Mumbai, Nov 7 (IANS) Tata Consultancy Services (TCS) on Thursday said it has signed a multi-year deal with Air France-KLM to help it become the leading data-centric airline group in the world. Over the next three years, TCS will modernise the airline group&#8217;s data by moving it to cloud, promoting the next generation of data-driven [&#8230;]",
        "url": "https://bhaskarlive.in/tcs-inks-multi-year-deal-to-make-air-france-klm-leading-data-driven-airline/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202401123104421.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 06:11:28",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 263266678,
        "title": "ED conducts raids on multiple sellers linked to e-com players\n including Amazon, Flipkart",
        "text": "New Delhi, Nov 7 (IANS) The Enforcement Directorate (ED) on Thursday conducted raids on multiple sellers across the country — linked to e-commerce platforms including Amazon and Flipkart — over alleged money laundering activities.\n\nAccording to reports, the ED was conducting a pan-India search against subsidiaries and sellers of leading e-commerce players. Nearly 24 such seller locations were being raided by the regulator in cities like Delhi, Mumbai, Hyderabad, and Bengaluru.\n\nAs per sources, the ED investigation was underway related to alleged Foreign Exchange Management Act (FEMA) regulations.\n\nThe ED raids aim to find evidence related to alleged money laundering activities that may have been facilitated through online e-commerce platforms.\n\nThe regulator or e-commerce players did not immediately comment.\n\nAmazon and Flipkart have previously faced scrutiny in the country regarding their business practices. In September, a probe by the Competition Commission of India (CCI) reportedly found that Amazon and Flipkart breached local competition laws by favouring specific sellers on their platforms.\n\nMeanwhile, the Central Consumer Protection Authority (CCPA), under the Ministry of Consumer Affairs, is also examining numerous complaints related to the use of “dark patterns” and planning a crackdown on online e-commerce companies violating consumer protection laws. The use of “dark patterns” by online platforms has created controversy in India. These deceptive techniques mislead people into doing something they do not wish to do, such as paying for items or services they did not intend to buy.\n\nThe Indian government recently released draft guidelines to curb “dark patterns” used by big online platforms. The Digital India Act is also equipped to regulate “dark patterns” on the internet through user safety provisions. Aiming to guard customers from fake online reviews of products, the government has also issued a comprehensive set of guidelines.",
        "summary": "New Delhi, Nov 7 (IANS) The Enforcement Directorate (ED) on Thursday conducted raids on multiple sellers across the country &#8212; linked to e-commerce platforms including Amazon and Flipkart &#8212; over alleged money laundering activities. According to reports, the ED was conducting a pan-India search against subsidiaries and sellers of leading e-commerce players. Nearly 24 such [&#8230;]",
        "url": "https://bhaskarlive.in/ed-conducts-raids-on-multiple-sellers-linked-to-e-com-players-including-amazon-flipkart/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073256052.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 09:02:04",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.382
    },
    {
        "id": 263282210,
        "title": "Hema Committee report: Kerala HC appoints amicus curiae to assist Govt in framing policies for women",
        "text": "Kochi: The Kerala High Court on Thursday appointed an amicus curiae to help the state government in drafting special legislation to address the issues faced by women, especially in their workplace, in the wake of the explosive revelations of the Justice Hema committee.\r\n\r\nThe special bench of Justices A.K. Jayasankaran Nambiar and C. S. Sudha, hearing the matters relating to the Justice Hema Committee report, decided to appoint advocate Mitha Sudhindran to assist the court.\r\n\r\nAfter the appointment was announced, the court orally directed to ensure all views must be collected from all relevant stakeholders allowing the state to review them so as to come up with the draft of a special law that incorporates a feminine perspective.\r\n\r\n\"Give us different perspectives so we that we can put all of that to the state to make the work of the state also easier… let's have as many perspectives and using all of these inputs, the state can embark upon this draft legislation... It will probably get a sort of nod from the Court to test its legality. It is not going to be like many of the legislations that come normally, maybe it is a radical approach that the legislators are actually seeking prior approval from the judiciary... It is always better to be cautious in these matters…..we are not drafting the legislation... what we are doing here is perspectives from different stakeholders,\" it said.\r\n\r\n\"This court is certainly is not going to be legislating… what we are doing here is trying to get different perspectives, and predominantly the feminine perspective, because that is something that we find is lacking in our laws now. So let us have a feminine perspective also,\" it added.\r\n\r\nEver since August 19 when the Justice Hema Committee report was made public and highlighted the pitiable conditions of women in the film industry including sexual exploitation, there was a huge hue and cry as there is no clear employer-employee relationship in the film industry.\r\n\r\nFollowing the report's publication, the High Court decided to form a separate bench to hear all the pleas arising from it. In the last hearing, the court was informed that 26 FIRs have been registered pursuant to its direction to the Special Investigating Team (SIT) to take necessary action.\r\n\r\nOn Thursday, the court was informed that in five FIRs, the victims are unwilling to cooperate with the investigation, while in three FIRs, the victims have refuted their own statements and declined to continue with the investigation. The court was further informed that more time is required to submit statements in the remaining 18 FIRs and posted the case for its next hearing on November 21.",
        "summary": "The special bench of Justices A.K. Jayasankaran Nambiar and C. S. Sudha, hearing the matters relating to the Justice Hema Committee report, decided to appoint advocate Mitha Sudhindran to assist the court.",
        "url": "https://telanganatoday.com/hema-committee-report-kerala-hc-appoints-amicus-curiae-to-assist-govt-in-framing-policies-for-women",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/k-1.jpg",
        "video": null,
        "publish_date": "2024-11-07 10:29:01",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.13
    },
    {
        "id": 263266180,
        "title": "Ananya Panday, Lakshya Lalwani to star in passionate love story ‘Chand Mera Dil’",
        "text": "Mumbai: Actress Ananya Panday and Lakshya Lalwani, who made his film debut with “Kill”, will be seen sharing screen space together in the upcoming romantic movie “Chand Mera Dil”.\r\n\r\nAnanya and Lakshya took to their respective Instagram handles, where they shared several posters from the upcoming movie, which hinted that the movie is all about “love”.\r\n\r\nThe two captioned the post: “Pyaar mein thoda paagal hona hi padta hai… Chand Mera Dil, directed by Vivek Soni. Coming to cinemas in 2025. @lakshya @karanjohar @adarpoonawalla @apoorva1972 @somenmishra @vivek.sonni @marijkedesouza @paranjapetushar @dharmamovies.”\r\n\r\nThe film, which will release in 2025, is directed by Vivek Soni, who has previously made\r\n\r\n“Meenakshi Sundareshwar”, starring Sanya Malhotra and Abhimanyu Dassani in 2021.\r\n\r\nSharing the same posters, Karan Johar, whose Dharma Productions is presenting the movie, took to Instagram, describing the film as a “passionate love story”.\r\n\r\nHe wrote: “We have two chands ready to bring an intense & passionate love story like no other!!!\r\n\r\nPyaar mein thoda paagal hona hi padta hai… Chand Mera Dil, starring Ananya Panday & Lakshya.\r\n\r\nDirected by Vivek Soni. Coming to cinemas in 2025.”\r\n\r\nThe film’s title seems to have been inspired by the song “Chand Mera Dil Chandni Ho Tum” from the 1977 film “Hum Kisise Kum Naheen”. The song was sung by Mohammed Rafi. The film\r\n\r\nfeatured Rishi Kapoor, Tariq, Kaajal Kiran, Amjad Khan and Zeenat Aman in a special appearance.\r\n\r\nTalking about Ananya, she was last seen in “CTRL”, a screenlife thriller film directed by Vikramaditya Motwane. It also has Vihaan Samat. The film was about a social media influencer couple. When the boyfriend cheats on her, she turns to an AI app to erase his digital existence on her computer and social media.\r\n\r\nMeanwhile, Lakshya rose to fame with his performance in “Kill”, directed by Nikhil Nagesh Bhat. The cast of the film also includes Tanya Maniktala and Raghav Juyal. “Kill” traced the story of a train ride to New Delhi becoming a combat battleground as a pair of commandos faces off against an army of invading bandits.",
        "summary": "Ananya and Lakshya took to their respective Instagram handles, where they shared several posters from the upcoming movie, which hinted that the movie is all about “love”.",
        "url": "https://telanganatoday.com/ananya-panday-lakshya-lalwani-to-star-in-passionate-love-story-chand-mera-dil",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/a.jpg",
        "video": null,
        "publish_date": "2024-11-07 09:27:41",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "entertainment",
        "source_country": "in",
        "sentiment": 0.566
    },
    {
        "id": 263226254,
        "title": "Tribute to courage, sacrifice of veterans: PM Modi on 10 years of OROP",
        "text": "New Delhi, Nov 7 (IANS) Prime Minister Narendra Modi reaffirmed the government’s commitment to honouring India’s armed forces, praising the ‘One Rank, One Pension’ (OROP) as a tribute to the courage and sacrifices of veterans and ex-service personnel, as the scheme marked its 10 years on Thursday.\n\nTaking to X, PM Modi posted, “On this day, ‘One Rank, One Pension’ (OROP) was implemented. This was a tribute to the courage and sacrifices of our veterans and ex-service personnel who dedicate their lives to protecting our nation. The decision to implement OROP was a significant step towards addressing this long-standing demand and reaffirming our nation’s gratitude to our heroes.”\n\n“It would make you all happy that over the decade, lakhs of pensioners and pensioner families have benefitted from this landmark initiative. Beyond the numbers, OROP represents the government’s commitment to the well-being of our armed forces,” he added.\n\nThe Prime Minister also reiterated the government’s commitment to do every possible thing to strengthen the armed forces and further the welfare of those who serve the nation.\n\nUnion Defence Minister Rajnath Singh also expressed appreciation for OROP, calling it a core aspect of PM Modi’s policy towards the armed forces.\n\n“The ‘One Rank, One Pension’ (OROP) has been an important pillar of Prime Minister Narendra Modi’s policy towards the Armed Forces. The Government under his leadership is committed to take care of the soldiers and their families,” Singh stated.\n\nSharing a video of the Indian armed forces, he noted, “More than 25 lakh veterans have been benefitted from the implementation of OROP. My gratitude to the Prime Minister for fulfilling the commitment given to the ex-servicemen of this country.”\n\nOROP, implemented in 2014, is a long-awaited scheme that ensures uniform pension payments for retired military personnel based on rank and service length, regardless of retirement date.\n\nThis reform addressed disparities in pension, where personnel with the same rank and service length but different retirement dates received unequal pensions.\n\nPreviously, a Lieutenant General who retired in 1995 could have received a lower pension than a colonel who retired after 2006 despite similar service tenure.\n\nUnder the revised system, all Defence pensioners retired, discharged, or invalided out of service as of July 1 — including Commissioned Officers, honorary commissioned officers, JCOs/ORs, and non-combatants — are eligible for the OROP pension.",
        "summary": "New Delhi, Nov 7 (IANS) Prime Minister Narendra Modi reaffirmed the government&#8217;s commitment to honouring India&#8217;s armed forces, praising the &#8216;One Rank, One Pension&#8217; (OROP) as a tribute to the courage and sacrifices of veterans and ex-service personnel, as the scheme marked its 10 years on Thursday. Taking to X, PM Modi posted, &#8220;On this [&#8230;]",
        "url": "https://bhaskarlive.in/tribute-to-courage-sacrifice-of-veterans-pm-modi-on-10-years-of-orop/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073255913.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 04:54:27",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.264
    },
    {
        "id": 263226486,
        "title": "Soni Razdan, Pooja Bhatt share glimpses of Raha’s jungle themed birthday party",
        "text": "Mumbai: As stars Ranbir Kapoor and Alia Bhatt’s daughter turned 2 on Wednesday, grandmother Soni Razdan and ‘masi’ Pooja Bhatt shared a glimpse of the toddlers' jungle-themed birthday party.\r\n\r\nPooja took to her Instagram stories, where she first shared a picture of the entrance, which had a monkey and a panda cut-out along with “Raha” written on it.\r\n\r\nShe then shared a picture of the stunning cake, which was decorated with leaves, animal figurines, and a message reading “Happy Birthday Raha 2.”\r\n\r\nA photograph of filmmaker and grandfather Mahesh Bhatt was seen, where he posed with Mickey and Minnie Mouse mascots. The lavish birthday party also had a tattoo booth for guests to enjoy.\r\n\r\nSoni shared a picture posing with Neena Gupta, Neetu Kapoor, Shalini Pradhan and Anu Ranjan. The picture was captioned: “When your gang shows up for you #birthdaycelebrations.”\r\n\r\nOther guests who were seen at the party were filmmaker Karan Johar, who was joined by his kids, Yash and Roohi. Ayan Mukerji, Kareena Kapoor Khan and her son Jehangir Ali Khan were also spotted at the birthday party.\r\n\r\nAlia and Ranbir, who got married on April 14, 2022, welcomed their first child, daughter Raha, on November 6 in the same year. The couple made their first public appearance with Raha in December 2023.\r\n\r\nNeetu on Wednesday shared an adorable and heartwarming moment of Ranbir with his daughter, Raha.\r\n\r\nIn the picture, the father is seen planting a sweet kiss on Raha’s cheek. Alongside the picture, Neetu wrote, “Our pyaar’s birthday, God bless.”\r\n\r\nSoni Razdan too had wished her “darling” granddaughter Raha on social media.\r\n\r\nAlongside this adorable picture, she wrote in the caption, “No feeling in the world beats being your grandma and having the privilege of capturing precious moments like these for posterity. A part of me wishes that you never grow up. Yet, I am delighted to see you do just that! Happy 2nd Birthday to our darling Raha. We love you sooooo much.”",
        "summary": "Pooja took to her Instagram stories, where she first shared a picture of the entrance, which had a monkey and a panda cut-out along with “Raha” written on it.",
        "url": "https://telanganatoday.com/soni-razdan-pooja-bhatt-share-glimpses-of-rahas-jungle-themed-birthday-party",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/raha.jpg",
        "video": null,
        "publish_date": "2024-11-07 05:40:18",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.557
    },
    {
        "id": 263235488,
        "title": "Baseless allegations: Former royals slam Rahul Gandhi over ‘plaint maharajas’ remarks",
        "text": "New Delhi, Nov 7 (IANS) Erstwhile royal families from across India have lambasted Congress MP Rahul Gandhi for describing the country’s former kings as “pliant maharajas” subjugated by the East India Company.\n\nHis words sparked a strong backlash, with royal descendants urging him to “look into the pages of history” and accusing him of attempting to “malign the erstwhile royal families of India” through an “inaccurate portrayal” in his recent editorial.\n\nRajasthan Deputy Chief Minister Diya Kumari, the granddaughter of Man Singh II, the last Maharaja of Jaipur, voiced her disapproval on X, saying, “I strongly condemn Mr Rahul Gandhi’s attempt to malign the erstwhile royal families of India in an editorial today. The dream of an integrated India was only possible because of the utmost sacrifice of the erstwhile royal families of India.”\n\n“Baseless allegations made on the basis of half-baked interpretation of historical facts are completely unacceptable,” she added.\n\nVikramaditya Singh, former Congress leader and grandson of Maharaja Sir Hari Singh, the last ruler of Kashmir, criticised Gandhi’s “superficial understanding of history.”\n\nHe stressed that the Maharajas’ contributions and roles were far from “pliant,” stating that many royal rulers began with humble origins as soldiers or farmers, fighting countless battles to establish their kingdoms.\n\n“The irony that Mr Rahul Gandhi, coming from such immense privilege himself, would repeatedly attempt to malign the Maharajas’ colossal contributions to the Republic of India is appalling,” Singh wrote.\n\nSingh cited Maharaja Gulab Singh, who rose from a foot soldier to command his own army and ultimately unified Jammu, Kashmir, and Ladakh as part of India.\n\nHe reminded Rahul Gandhi of Maharaja Hari Singh’s historic demand for Indian independence at the 1930 Round Table Conference in London, remarking that to draw parallels between today’s business climate and colonial India is “entirely unfounded and erroneous.”\n\nAdding to the outcry, Lakshyaraj Singh Mewar, scion of the 1,500-year-old House of Mewar in Udaipur, noted, “The royal families of India, throughout history, have consistently embodied a spirit of cooperation in governance rather than resorting to control and exploitation. Despite the divisions imposed by the colonial structure, the royal families have always been protectors of their people and have played an essential role in shaping India’s economic, cultural, and political landscape.”\n\nChaitanya Raj Singh, representing the former royal family of Jaisalmer, called the LoP’s claims “baseless and unacceptable,” remarking, “Perhaps Rahul Gandhi has forgotten who actually did the work of uniting India; he should look into the pages of history.”\n\nNathdwara MLA Vishvaraj Singh Mewar, grandson of the last Maharana of Mewar, also condemned Rahul Gandhi on X, questioning whether his statements stem from “ignorance or intentional misrepresentation” to “malign” the Maharajas.\n\nShrimant Gayatri Raje Puar, a BJP leader and member of Dewas’ former royal family, expressed her disapproval, stating, “I condemn Rahul Gandhi’s editorial defaming India’s Maharajas, who were pillars of Sanatan Sanskriti. These royals safeguarded our heritage, sovereignty, and culture at great personal cost, giving us ‘Akhand Bharat.’ Ignoring this legacy disrespects our heritage.”\n\nMysore MLA Yaduveer Wadiyar, a scion of the former Wadiyar dynasty, also weighed in, saying that Rahul Gandhi’s “lack of knowledge of true history is on constant display,” accusing him of “ignorance of the contributions made by erstwhile princely states towards today’s Bharat.”\n\nThis wave of condemnation follows Rahul Gandhi’s recent opinion piece, in which he contrasted present-day monopolistic pressures with the control exerted by the East India Company.\n\nOn X, Rahul Gandhi urged Indians to “Choose your India: Play-Fair or Monopoly? Jobs or Oligarchies? Competence or Connections? Innovation or Intimidation? Wealth for many or the few?”\n\nIn an opinion piece published in a leading daily newspaper, Rahul Gandhi wrote, “India was silenced by the East India Company, and it was silenced not by its business prowess, but by its chokehold. The Company choked India by partnering with, bribing, and threatening more pliant maharajas and nawabs.”\n\n“It controlled our banking, bureaucratic, and information networks. We didn’t lose our freedom to another nation; we lost it to a monopolistic corporation that ran a coercive apparatus,” he said.\n\n“The original East India Company wound up over 150 years ago, but the raw fear it then generated is back. A new breed of monopolists has taken its place. They have amassed colossal wealth, even as India has become far more unequal and unfair for everybody else. Our institutions no longer belong to our people, they do the bidding of monopolists. Lakhs of businesses have been decimated, and India is unable to generate jobs for her youth. Bharat Mata is mother to all her children. The monopolisation of her resources and power, this blatant denial of the many for the sake of a chosen few, has wounded her,” Rahul Gandhi wrote.\n\nThe opinion piece further read: “I know that hundreds of India’s brilliant and dynamic business leaders are scared of the monopolists. Are you one of them? Scared to talk on the phone? Scared of the monopolists colluding with the state to enter your sector and crush you? Scared of I-T, CBI or ED raids forcing you to sell your business to them? Scared of them starving you of capital when you need it the most? Scared of them changing the rules of the game mid-way to ambush you?”",
        "summary": "New Delhi, Nov 7 (IANS) Erstwhile royal families from across India have lambasted Congress MP Rahul Gandhi for describing the country&#8217;s former kings as &#8220;pliant maharajas&#8221; subjugated by the East India Company. His words sparked a strong backlash, with royal descendants urging him to &#8220;look into the pages of history&#8221; and accusing him of attempting [&#8230;]",
        "url": "https://bhaskarlive.in/baseless-allegations-former-royals-slam-rahul-gandhi-over-plaint-maharajas-remarks/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073255926.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 06:28:55",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.041
    },
    {
        "id": 263245524,
        "title": "Supreme Court says recruitment rules cannot be amended midway",
        "text": "New Delhi: The Supreme Court on Thursday said that recruitment rules cannot be amended midway after the selection process has commenced, unless provided otherwise in the extant rules or the recruitment advertisement.\r\n\r\nA Constitution Bench, headed by CJI, DY Chandrachud, said that an appointing authority, in absence of rules to the contrary, can devise a procedure for selection of a candidate suitable to the post and may set different benchmarks for different stages of the recruitment process.\r\n\r\n\"However, if any such benchmark is set, the same should be set before the commencement of the recruitment process. But, if the rules empower the competent authority to set benchmarks at different stages of the recruitment process, then such benchmarks may be set before that stage is reached so that neither candidates nor invigilators are taken by surprise,\" ruled the five-judge Constitution Bench.\r\n\r\nThe Bench, also comprising Justices Hrishikesh Roy, PS Narasimha, Pankaj Mithal and Manoj Misra, said that if change in eligibility criteria is permitted under rules or advertisement, the change will have to satisfy the test of non-arbitrariness.\r\n\r\nIt said, \"The object of any process of selection for entry into public service is to ensure that a person suitable for the post is selected. What is suitable for one post cannot be for another. Thus, a degree of discretion is necessary to be left to the employer to devise a method to select a candidate most suitable for the post.\"\r\n\r\nIn its judgment, the top court stressed the recruiting bodies, subject to the extant rules, may devise appropriate procedure for bringing the recruitment process to its logical end, provided that the procedure adopted is transparent, non-discriminatory, non-arbitrary and has a rational nexus to the objects sought to be achieved.\r\n\r\nThe Constitution Bench was hearing a reference after a three-judge Bench doubted the correctness of an earlier decision, where it was held that the selection criteria cannot be changed midway during the recruitment process.",
        "summary": "Says if change in eligibility criteria is permitted under rules or advertisement, the change will have to satisfy the test of non-arbitrariness",
        "url": "https://telanganatoday.com/supreme-court-says-recruitment-rules-cannot-be-amended-midway",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/SC1.jpg",
        "video": null,
        "publish_date": "2024-11-07 07:38:35",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.241
    },
    {
        "id": 263244022,
        "title": "Recruitment rules cannot be amended midway, rules SC",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "New Delhi, Nov 7 (IANS) The Supreme Court on Thursday said that recruitment rules cannot be amended midway after the selection process has commenced, unless provided otherwise in the extant rules or the recruitment advertisement. A Constitution Bench, headed by CJI, DY Chandrachud, said that an appointing authority, in absence of rules to the contrary, [&#8230;]",
        "url": "https://bhaskarlive.in/recruitment-rules-cannot-be-amended-midway-rules-sc/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411013252998.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 07:12:38",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 263209270,
        "title": "Biden calls Trump to congratulate him on election victory",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Washington, Nov 7 (IANS) US President Joe Biden has called President-elect Donald Trump to congratulate him on election victory, according to the White House. &#8220;President Biden expressed his commitment to ensuring a smooth transition and emphasised the importance of working to bring the country together,&#8221; the White House said on Wednesday in a statement, noting [&#8230;]",
        "url": "https://bhaskarlive.in/biden-calls-trump-to-congratulate-him-on-election-victory/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411073255897.JPG?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 01:31:12",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 263274046,
        "title": "‘Sikandar Ka Muqaddar’ to release on Netflix on this date",
        "text": "Mumbai: Neeraj Pandey’s upcoming directorial “Sikandar Ka Muqaddar” is set to premiere on Netflix on November 29.\r\n\r\nThe film stars Jimmy Shergill, Avinash Tiwary, Tamannaah Bhatia, and Rajiv Mehta in pivotal roles. Announcing the OTT release of the thriller, Netflix shared the poster on its Instagram handle with the caption, “Een aaropi, lekin kaun apradhi? Case jald hi khulega. Watch Sikandar Ka Muqaddar, out November 29, only on Netflix!”\r\n\r\nFans quickly flooded the comments section of the announcement post to express their excitement. One commented, “Can we skip directly to November 29?” Another fan wrote, “A masterpiece,” while a third user said, “Omg, can’t wait.”\r\n\r\n“Sikandar Ka Muqaddar” unfolds a gripping tale of a heist, a relentless police officer, and a pursuit that spans 15 years, offering a thrilling mix of high-stakes drama. The film also stars Divya Dutta and Zoya Afroz.\r\n\r\nNeeraj Pandey teased the upcoming film with an intriguing caption, “One Heist. Two Scenarios. Three Suspects. Presenting Sikandar Ka Muqaddar. Streaming on Netflix from November 29.” The poster sets a mysterious and suspenseful tone, offering a glimpse of the intricate narrative Pandey is known for. It also features Rajiv Mehta, who is best known for his roles as Praful Parekh in the television comedy “Khichdi” and as Arvind Thakkar in “Baa Bahoo Aur Baby.”\r\n\r\nDirected by Neeraj Pandey, who previously worked with Netflix on “Khakee: The Bihar Chapter”, this forthcoming thriller delves into crime, obsession, and the pursuit of justice.\r\n\r\nProduced by Shital Bhatia and Friday Storytel, “Sikandar Ka Muqaddar” is poised to be one of the most anticipated releases of the year. The project marks Jimmy Shergill’s first onscreen collaboration with Tamannaah Bhatia.\r\n\r\nMeanwhile, Neeraj’s most recent directorial venture was “Auron Mein Kahan Dum Tha”, starring Tabu and Ajay Devgn. Tamannaah Bhatia was last seen in a cameo role in the hit film “Stree 2.”\r\n\r\nJimmy Shergill was most recently seen in “Phir Aayi Hasseen Dillruba” on Netflix, while Avinash Tiwary appeared in Kunal Kemmu's “Madgaon Express.”",
        "summary": "“Sikandar Ka Muqaddar” unfolds a gripping tale of a heist, a relentless police officer, and a pursuit that spans 15 years, offering a thrilling mix of high-stakes drama. The film also stars Divya Dutta and Zoya Afroz.",
        "url": "https://telanganatoday.com/sikandar-ka-muqaddar-to-release-on-netflix-on-this-date",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/aa.jpg",
        "video": null,
        "publish_date": "2024-11-07 09:56:45",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.525
    },
    {
        "id": 263278654,
        "title": "'National Anti-Terror Policy & Strategy To Be Unveiled Soon,' Says Union Home Minister Amit Shah",
        "text": "The fight against terror would be incomplete without demolishing its financial system. Whether it is cryptocurrency, gold smuggling, drug smuggling, or hawala, the state-level security system needs to contribute towards dismantling the terror finance network.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/national-anti-terror-policy-strategy-to-be-unveiled-soon-says-union-home-minister-amit-shah",
        "image": "https://media.assettype.com/freepressjournal/2024-11-07/loharwlg/Untitled-design-2024-11-07T152558.031.jpg",
        "video": null,
        "publish_date": "2024-11-07 10:01:17",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.473
    },
    {
        "id": 263269948,
        "title": "National anti-terror policy, strategy to be unveiled soon, says Amit Shah",
        "text": "New Delhi: The Union government will soon release a national policy and strategy to counter terrorism, that will help demolish the entire terror ecosystem, said Home Minister Amit Shah on Thursday, reiterating Prime Minister Narendra Modi's slogan of 'zero tolerance for terrorism.'\r\n\r\nSpeaking at the 'Anti-Terror Conference-2024' organised here, HM Shah said the National Counter-terrorism Policy and Strategy will soon be ready for circulation among all states as they have to lead the fight against 'terrorism, terrorists and the terror ecosystem.'\r\n\r\n\u009dHighlighting the importance of infusing technology and training officers in using technology, HM Shah urged state police forces to join hands with Central agencies like the NIA and use federal forensic facilities to demolish the terror ecosystem.\r\n\r\nHe also paid tributes to 36,468 policemen who laid down their lives for national security and in the fight against terror, claiming that there has been a drop of 70 per cent in terror activities in the country since 2014.\r\n\r\nHe highlighted the new provisions in the three criminal laws that, for the first time in 76 years after Independence, define terrorism and allow security agencies to pursue trials in absentia against terrorists and financial criminals.\r\n\r\nTo become a developed nation, the country also needs to upgrade its security system and put in place a unified anti-terrorism ecosystem, he said.\"A strong ecosystem against terror can be built only if all states implement the ATS structure, STF structure and training module suggested by the Central agencies,\" he said.\r\n\r\nStressing on the need for information sharing in the battle against terror, HM Shah appreciated the progress made by the Multi-Agency Centre (MAC), under the Intelligence Bureau.\r\n\r\nHighlighting the important role that states need to play to fight terror, as security is a state subject, the Home Minister called upon police station-level staff not to suppress information but share it with other agencies.\r\n\r\n\"Suppressing information is not going to help the nation. Police station-level staff need to follow the evolving strategy which started with 'Need to know' to 'Need to share' and should now be seen as 'Duty to share', \"\u009d he said.\r\n\r\nHe said state police should join the NIA in building a database of illegal weapons seized across the country. HM Shah also highlighted the achievements of I4C - Indian Cyber Crime Coordination Centre (I4C) - established by the Ministry of Home Affairs to provide a framework and ecosystem for law enforcement against cybercrimes.\r\n\r\nThe fight against terror would be incomplete without demolishing its financial system. Whether it is cryptocurrency, gold smuggling, drug smuggling or hawala, the state-level security system needs to contribute towards dismantling the terror finance network.\r\n\r\n\"Unlawful Activities (Prevention) Act should be used freely against the financial network of the terror ecosystem,\"\u009d he said, urging states to coordinate with the NIA on this issue.\r\n\r\nThe Home Minister also urged the media to highlight recovery of explosives and weapons by the police forces to keep them motivated in the fight against terror.",
        "summary": "Highlighting the importance of infusing technology and training officers in using technology, HM Shah urged state police forces to join hands with Central agencies like the NIA and use federal forensic facilities to demolish the terror ecosystem",
        "url": "https://telanganatoday.com/national-anti-terror-policy-strategy-to-be-unveiled-soon-says-amit-shah",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/amit-shah.jpg",
        "video": null,
        "publish_date": "2024-11-07 09:36:43",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.241
    },
    {
        "id": 263266674,
        "title": "National anti-terror policy, strategy to be unveiled soon: HM Shah",
        "text": "New Delhi, Nov 7 (IANS) The Union government will soon release a national policy and strategy to counter terrorism, that will help demolish the entire terror ecosystem, said Home Minister Amit Shah on Thursday, reiterating Prime Minister Narendra Modi’s slogan of “zero tolerance for terrorism”.\n\nSpeaking at the ‘Anti-Terror Conference-2024’ organised here, HM Shah said the National Counter-terrorism Policy and Strategy will soon be ready for circulation among all states as they have to lead the fight against “terrorism, terrorists and the terror ecosystem.”\n\nHighlighting the importance of infusing technology and training officers in using technology, HM Shah urged state police forces to join hands with Central agencies like the NIA and use federal forensic facilities to demolish the terror ecosystem.\n\nHe also paid tributes to 36,468 policemen who laid down their lives for national security and in the fight against terror, claiming that there has been a drop of 70 per cent in terror activities in the country since 2014.\n\nHe highlighted the new provisions in the three criminal laws that, for the first time in 76 years after Independence, define terrorism and allow security agencies to pursue trials in absentia against terrorists and financial criminals.\n\nTo become a developed nation, the country also needs to upgrade its security system and put in place a unified anti-terrorism ecosystem, he said.\n\n“A strong ecosystem against terror can be built only if all states implement the ATS structure, STF structure and training module suggested by the Central agencies,” he said.\n\nStressing on the need for information sharing in the battle against terror, HM Shah appreciated the progress made by the Multi-Agency Centre (MAC), under the Intelligence Bureau. Highlighting the important role that states need to play to fight terror, as security is a state subject, the Home Minister called upon police station-level staff not to suppress information but share it with other agencies.\n\n“Suppressing information is not going to help the nation. Police station-level staff need to follow the evolving strategy which started with ‘Need to know’ to ‘Need to share’ and should now be seen as ‘Duty to share’,” he said.\n\nHe said state police should join the NIA in building a database of illegal weapons seized across the country.\n\nHM Shah also highlighted the achievements of I4C – Indian Cyber Crime Coordination Centre (I4C) – established by the Ministry of Home Affairs to provide a framework and ecosystem for law enforcement against cybercrimes.\n\nThe fight against terror would be incomplete without demolishing its financial system. Whether it is cryptocurrency, gold smuggling, drug smuggling or hawala, the state-level security system needs to contribute towards dismantling the terror finance network.\n\n“Unlawful Activities (Prevention) Act should be used freely against the financial network of the terror ecosystem,” he said, urging states to coordinate with the NIA on this issue.\n\nThe Home Minister also urged the media to highlight recovery of explosives and weapons by the police forces to keep them motivated in the fight against terror.",
        "summary": "New Delhi, Nov 7 (IANS) The Union government will soon release a national policy and strategy to counter terrorism, that will help demolish the entire terror ecosystem, said Home Minister Amit Shah on Thursday, reiterating Prime Minister Narendra Modi’s slogan of “zero tolerance for terrorism”. Speaking at the &#8216;Anti-Terror Conference-2024’ organised here, HM Shah said [&#8230;]",
        "url": "https://bhaskarlive.in/national-anti-terror-policy-strategy-to-be-unveiled-soon-hm-shah/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202409143222674.jpeg?ssl=1",
        "video": null,
        "publish_date": "2024-11-07 09:14:53",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.218
    }
]