[
    {
        "id": 261236444,
        "title": "Delhi's air pollution worsens, people say feels suffocating",
        "text": "New Delhi: The air quality deteriorated in the national capital on Sunday, with the Air Quality Index (AQI) being recorded at 352, in the 'very poor' category, according to System of Air Quality and Weather Forecasting And Research (SAFAR). This is worse than the average AQI recorded at 255 on Saturday, categorized as 'poor'.Moreover, AQI in Anand Vihar area crossed the 400 mark, being recorded as 405 at 7 AM, categorized as 'severe', worse than the AQI of 367 recorded on Saturday.AQI at the Akshardham Temple deteriorated 261, whereas IGI airport recorded an AQI of 324, both categorized as 'very poor.'A layer of thick smog enveloped certain parts of the city.Himanshu, a visitor to the national capital said that the increasing pollution feels 'suffocating.'\"It feels suffocating due to pollution...The govt should look into what can be done to reduce pollution,\" he told ANI.Moreover, a cyclist in the city told ANI that they are facing a lot of problems with breathing.\"We are from Delhi and we (the cyclist group) cycle daily here, but this situation of air pollution since the last few days we are facing a lot of problems. We can't breathe properly, we get tired faster due to the pollution. We take precautions like wearing a bandana but nothing is working because the pollution is increasing a lot,\" he said.He further said that the measures taken by the government don't seem effective enough, and the government should encourage the people to use public transport more.\"The government did some work like stopping construction and implementing odd-even but it doesn't seem like it is working as this is increasing day by day. There should be constructive measures to encourage people to use public transport and carpooling,\" he added.As the festival of lights nears, the Delhi government has also banned firecrackers till January 1 amid efforts to curb pollution levels.Moreover, toxic foam on the Yamuna river in the Kalindi Kunj area persisted. Earlier the pollution in the river became a topic of hot political debate between the Bharatiya Janata Party (BJP) and Aam Aadmi Party (AAP), with BJP leader Shazia Ilmi criticizing the Delhi government for its handling of the city's worsening pollution crisis, highlighting the alarming presence of toxic foam in the River Yamuna and the resulting breathing difficulties for residents.\"BJP leader Virendraa Sachdeva has fallen ill. Two days ago he took a dip in the Yamuna river. Today he is admitted to the hospital...This is an issue connected to the health of the public of Delhi. Where have the Rs 3000 crore meant for the public of Delhi and Yamuna river?... The public of Delhi is not able to breathe...Toxic foam is floating on the Yamuna River,\" Ilmi told ANI.Notably, Delhi environment minister Gopal Rai criticsed the BJP, accusing it of contributing to the increasing pollution in the national capital.\"The BJP is the party that creates pollution and seems to believe that only drama can solve it. I think all governments and parties need to work together. I wish them good health, but stopping these theatrics alone won't reduce pollution. This reflects the BJP leaders' level of understanding. When I was preparing the winter action plan, I had written to the BJP President, but no response or suggestions have come so far,\" he told ANI.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/news/delhis-air-pollution-worsens-people-say-feels-suffocating-1833424",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/27/1856638-aa-3306609.webp",
        "video": null,
        "publish_date": "2024-10-27 04:21:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.397
    },
    {
        "id": 261260932,
        "title": "Former MP Shahabuddin’s wife Hena Sahab, son Osama join RJD",
        "text": "Wife and son of late former MP Shahabuddin, Hena Sahab and Osama, on Sunday joined Rashtriya Janata Dal (RJD).RJD chief Lalu Prasad Yadav and Bihar’s former deputy Chief Minister Tejashwi Yadav welcomed the mother-son duo into the party fold.Hena Sahab had previously contested the 2024 Lok Sabha elections from Siwan as an independent candidate. Later in the day, speaking to reporters, Lalu Yadav said, “It’s good. We welcome him.”RJD leader Tejashwi Yadav told reporters that the re-joining of the mother-son duo will strengthen the party in Siwan district.“Today in the presence of RJD’s chief (Lalu Yadav), our strong leader Hena Sahab has re-joined the party. Her son Osama has also joined the party. Many supporters have also taken the party membership. I believe that this will strengthen the party in Siwan as well as in the whole of Bihar. Through this medium, we will work to spread our ideology of secularism to the people.”Mohammad Shahabuddin served as the Siwan MP from 1996 to 2004. Known for his dominance in Siwan, he died in 2021 from COVID-19 infection while serving a life sentence in Delhi’s Tihar Jail for a double murder.Union Minister Rajiv Ranjan (Lalan) Singh said, “It is a good thing, whoever wants to join should join… This shows what they (RJD) are doing, who all are they bringing and blaming us but they are the ones doing the work.”The development came ahead of the by-polls in the state. The bypolls in Bihar will be held in Ramgarh, Tarari, Imamganj and Belaganj.The bypolls are spread over 15 states – Assam, Bihar, Chhattisgarh, Gujarat, Karnataka, Kerala, Madhya Pradesh, Maharashtra, Meghalaya, Punjab, Rajasthan, Sikkim, Uttar Pradesh, Uttarakhand and West Bengal.The assembly elections in Bihar are likely to be held in October-November 2025",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/former-mp-shahabuddins-wife-hena-sahab-son-osama-join-rjd/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/former-mp-shahabuddins-wife-hena-sahab-son-osama-join-rjd.jpg",
        "video": null,
        "publish_date": "2024-10-27 10:13:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.115
    },
    {
        "id": 261255328,
        "title": "NCP releases third list of candidates for upcoming Maharashtra elections",
        "text": "The Nationalist Congress Party (Ajit Pawar faction) on Sunday released their third list of candidates for the upcoming Maharashtra elections. As per the list released, the new candidates are VijaySingh Pandit from the Gevrai constituency, Sachin Sudhakar Patil from the Phaltan, Dilipkaka Bankar from Niphad and Kashinath Daante from the Parner constituency. On October 25, NCP had announced it’s second list for the upcoming elections. Notably, Sana Malik, daughter of NCP leader Nawab Malik, will contest from the Anushakti Nagar constituency.Zeeshan Siddiqui, who joined the NCP earlier in the day, has also been selected to run from Bandra East. After joining the party, Siddiqui said, “This is an emotional day for me and my family. I am thankful to Ajit Pawar, Praful Patel, and Sunil Tatkare for believing in me in these tough times. I have got the nomination from Vandre East; I am sure that with the love and support of all the people, I will definitely win Vandre East yet again.”The NCP’s second list also includes former BJP leaders Nishikant Patil for Islampur and Sanjaykaka Ramchandra Patil for Tasgaon-Kavathe Mahankal, who joined the party in the presence of Deputy Chief Minister Ajit Pawar.Former BJP leader Nishikant Bhosale Patil, who joined the NCP, said, “I have joined NCP on the direction of our leader Devendra Fadnavis. I had to shift to NCP from the BJP as the Islampur assembly seat went to the NCP. I will win the election from the Islampur seat on the NCP ticket.”Former MP Sanjaykaka Patil said, “NCP is a part of Mahayuti. Two of the seats (assembly), including Tasgaon and the other is Islampur, in our district went to the NCP (for Maharashtra Elections). I had to contest the election (Maharashtra Assembly Election) and hence I joined the NCP.”The Maharashtra Assembly elections are scheduled for November 20, with counting for all 288 constituencies set for November 23. In the 2019 assembly elections, the BJP won 105 seats, the Shiv Sena 56, and the Congress 44. In 2014, the BJP secured 122 seats, the Shiv Sena 63, and the Congress 42",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/ncp-releases-third-list-of-candidates-for-upcoming-maharashtra-elections/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/ncp-releases-third-list-of-candidates-for-upcoming-maharashtra-elections.jpg",
        "video": null,
        "publish_date": "2024-10-27 09:08:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.378
    },
    {
        "id": 261246968,
        "title": "UP: Gym trainer arrested for murdering woman in Kanpur",
        "text": "A gym trainer in Uttar Pradesh’s Kanpur has been arrested for allegedly killing a woman and burying her body near the residence of the Kanpur District Magistrate, the police said on Saturday night. Police said that the accused and the deceased had a heated argument before the incident, which, as per the officials, occurred on June 24.DCP East, Shravan Kumar Singh, said, “The incident occurred on 24 June. The victim used to go to the accused’s gym to train… The victim was particularly displeased about something and had a heated argument with the accused, after which the latter murdered her and buried her here… He dug a pit here and buried her body.”DCP Singh noted that the accused tried to mislead the case but, when interrogated strictly, revealed the truth.Further details awaited",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/up-gym-trainer-arrested-for-murdering-woman-in-kanpur/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-27 07:18:35",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.369
    },
    {
        "id": 261260930,
        "title": "Mann Ki Baat:  PM Modi warns about ‘digital arrest’",
        "text": "Prime Minister Narendra Modi warned the nation on Sunday about the ‘digital arrest’ scam, clarifying that no government agency threatens individuals over the phone or demands money.In his address during the 115th episode of ‘Mann Ki Baat,’ Prime Minister Modi detailed the modus operandi of the ‘digital arrest’ scam.“Under digital arrest fraud, callers pose as officials from the police, CBI, RBI, or narcotics departments, speaking with great confidence. People asked me to address this in Mann Ki Baat, as everyone needs to understand. The first step involves collecting your personal information. Step two is creating an atmosphere of fear, instilling so much anxiety that you can’t think clearly. Step three is applying time pressure… Victims of digital arrest come from all backgrounds and ages. Many have lost substantial sums of their hard-earned money. If you ever receive such a call, don’t be afraid. Be aware that no investigative agency conducts such interrogations over the phone or video call. The three steps to digital security are: stop, think, and act. If possible, take a screenshot or record the call. No government agency issues threats over the phone or demands money,” PM Modi said in his Mann Ki Baat address.He further stated that investigative agencies are working in partnership with state governments to combat the scam being carried out in the name of digital arrest.“There is no legal system called digital arrest; it’s purely fraud, deceit, a criminal enterprise by those who are enemies of society. Various investigative agencies, in collaboration with state governments, are actively working to address this scam. The National Cyber Coordination Centre has been established to foster coordination among these agencies,” he said.PM Modi also encouraged schools and colleges to engage students in the campaign against cyber scams. “We can only fight this challenge through collective efforts in society,” he added",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/mann-ki-baat-pm-modi-warns-about-digital-arrest/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-27 10:19:26",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.111
    },
    {
        "id": 261230650,
        "title": "J-K: Terrorist hideout busted in Poonch; two grenades, three Pakistani mines recovered",
        "text": "Indian Army’s Romeo Force, in a joint operation with Special Operations Group (SOG) police, busted a terror hideout in the Balnoi sector in Poonch, officials said.According to the Poonch police, the operation that took place on Saturday led to the recovery of two grenades and three Pakistani Mines from the hideout.Meanwhile, a search operation was carried out in Tangmarg and several parts of Jammu and Kashmir as the Indian Army and police intensified their searches to trace the accused in terror attacks in Gulmarg, Baramulla in north Kashmir and Gagangir in the Ganderbal district of the Union Territory.On October 24, two Army soldiers and two civilian porters were killed after terrorists attacked a military vehicle in Baramulla.Earlier on October 20, a doctor and six construction workers were killed when terrorists attacked a tunnel construction site on the Srinagar-Leh national highway in Ganderbal district.The terrorists struck as the labourers and other staff returned to their camp in Gund, Ganderbal. The incident raised serious concern as this was a targeted killing by the terrorists. The terrorists believed to be at least two, opened fire indiscriminately on a group of labourers, which included both local and non-local people.On Wednesday, Jammu and Kashmir Lieutenant Governor Manoj Sinha directed the police to tighten security measures around key infrastructure projects and construction camps in the union territories. He further directed a security audit of infrastructure projects, round-the-clock nakas at the strategic points, night patrolling and area domination.The Counter-Intelligence Kashmir (CIK) carried out a major operation in six districts of the Valley and caught recruiters linked to a terror outfit. The counterintelligence unit informed that the raids were conducted in districts including Srinagar, Ganderbal, Pulwama, Anantnag, Budgam, and Kulgam.The officials said that they were able to dismantle a recruitment module of the newly formed terrorist organisation called “Tehreek Labaik Ya Muslim” (TLM), which is said to be an offshoot of Lashkar-e-Taiba (LeT) that was being operated by a Pakistani terrorist handler known as Baba Hamas",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/j-k-terrorist-hideout-busted-in-poonch-two-grenades-three-pakistani-mines-recovered/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-27 01:08:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.067
    },
    {
        "id": 261262432,
        "title": "“There was an attack on this city and there was no response”: Jaishankar on 26/11 Mumbai attack",
        "text": "External Affairs Minister, S Jaishankar on Sunday said that Mumbai has become a powerful symbol of counter-terrorism globally. He further stressed that the country must not repeat the mistakes of the past and India should take a stance against terrorism.The remarks by Jaishankar came while addressing a press conference in Mumbai.Addressing the reporters, Jaishankar said, “Mumbai is a symbol of counter-terrorism for India and the world. When we were a member of the UNSC, we were president of the counter-terrorism committee. We held the security council meeting for the first time in the hotel where a terrorist attack took place, in Mumbai. When the world sees – who is standing firm in front of this challenge of terrorism, people say – India.”He further said that Mumbai faced a terrorist attack and there was no response from the Indian side. He said, “Today, we are leaders in fighting terrorism… We should not have a repeat of what happened in Mumbai. There was an attack on this city and there was no response. That is not good for us…”He added, “When we talk of zero tolerance against terror, it is clear that when somebody does something, there will be a response. We also have to expose. It is not acceptable that you are doing business during the daytime and indulging in terror during the night and I have to pretend that everything is okay. This India will not accept it. This is what has changed. We are very clear, we need to expose terrorism.” Jaishankar has been vocal about India’s stance on terrorism, emphasising the need for zero tolerance. At the 16th BRICS summit in Kazan, Russia, he reaffirmed India’s commitment to combating terrorism.He had said, “Addressing conflicts and tensions effectively is a particular need of the day. Prime Minister Modi has emphasised that this is not an era of war. Disputes and differences must be settled by dialogue and diplomacy. Agreements, once reached, must be scrupulously respected. International law should be adhered to, without exception. And there should be zero tolerance for terrorism.”Notably, at least 174 people, including 20 security force personnel and 26 foreigners, were killed and more than 300 injured in the 26/11 Mumbai terror attacks in 2008.Ten Lashkar-e-Taiba terrorists came to Mumbai via the sea route from Pakistan and carried out a series of coordinated attacks on India’s financial capital.",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/there-was-an-attack-on-this-city-and-there-was-no-response-jaishankar-on-26-11-mumbai-attack/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-27 11:33:28",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.26
    },
    {
        "id": 261238234,
        "title": "Mumbai: Nine injured in stampede at Bandra Terminus station",
        "text": "At least nine people were injured following a stampede at Mumbai’s Bandra railway station on Sunday morning, Brihanmumbai Municipal Corporation (BMC) said. The stampede occurred due to a rush on platform number 1, where a crowd gathered for Bandra-Gorakhpur Express at Bandra Terminus station. Following the incident, the injured passengers have been shifted to the hospital, the BMC further said.Further details are awaited",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/mumbai-nine-injured-in-stampede-at-bandra-terminus-station/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/mumbai-nine-injured-in-stampede-at-bandra-terminus-station.jpg",
        "video": null,
        "publish_date": "2024-10-27 04:58:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.275
    },
    {
        "id": 261135956,
        "title": "Israeli military launches strikes on military targets in Iran",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Dubai, Oct 26 (IANS) Israel launched airstrikes early Saturday targeting what it described as military targets in Iran in retaliation for a ballistic missile assault on October 1, officials said. There was no immediate information on damage in Iran. Israel&#8217;s military described the attack as &#8220;precise strikes on military targets in Iran,&#8221; without immediately elaborating. [&#8230;]",
        "url": "https://bhaskarlive.in/israeli-military-launches-strikes-on-military-targets-in-iran/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410263249734.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-10-26 00:12:01",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 260889102,
        "title": "Jharkhand: JMM’s Kalpana Soren files nomination from Gandey Assembly constituency",
        "text": "Kalpana Soren, the JMM leader and wife of Jharkhand Chief Minister Hemant Soren, filed her nomination as her party candidate from Gandey Assembly constituency on Thursday. Kalpana Soren is currently representing the Gandey constituency. She had won the constituency in a bypoll held in May this year by beating BJP’s Dilip Kumar Verma by a margin of 27,149 votes. The seat became vacant following the resignation of JMM MLA Sarfaraz Ahmad.Jharkhand Mukti Morcha has released its first list of 35 candidates for the upcoming assembly polls in the state which are to be held in two phases on November 13 and 20.As per the list, Chief Minister Hemant Soren will contest from the Barhait Assembly constituency.Other candidates include MT Raja from Rajmahal seat, Dhananjay Soren from Boriyo, Basant Soren from Dumka, Hafizul Hasan from Madhupur, Bebi Devi from Damuri, Baidhnath Ram from Latehar and Kedar Hazra from Jamua seat.Meanwhile, Rashtriya Janata Dal (RJD) released a list of six candidates for the Jharkhand Assembly polls on Tuesday after former Bihar Deputy Chief Minister and RJD leader Tejashwi Yadav stated that talks for seat sharing have been completed and the deadlock has been resolved.Tejashwi Yadav said that the INDIA alliance is united and the people of Jharkhand want Hemant Sorent to become the CM of Jharkhand again. CPI state secretary Mahendra Pathak released the list of candidates for the upcoming Jharkhand Assembly polls.This comes as the party expressed disappointment over the current seat-sharing arrangement of the INDIA bloc. Pathak said that the party would field candidates on a total of 15 seats for the Jharkhand Assembly polls.Earlier, Jharkhand Chief Minister Hemant Soren, accompanied by Jharkhand Congress in-charge Ghulam Ahmad Mir announced that the JMM and the Congress would share 70 seats between them, and the RJD and Left parties would split the remaining 11.Meanwhile, the Bharatiya Janata Party (BJP) announced its first list of 66 candidates for the Jharkhand Assembly elections on Saturday.The party’s state chief, Babulal Marandi, will contest from Dhanwar, Lobin Hembrom from Borio, and Sita Soren from Jamtara. Former Chief Minister of Jharkhand Champai Soren has been nominated as the candidate from Saraikella, Geeta Balmuchu from Chaibasa, Geeta Koda from Jaganathpur, and Meera Munda, the wife of Union Minister Arjun Munda will contest from Potka.The Assembly elections in Jharkhand will be held in two phases on November 13 and November 20 and votes will be counted on November 23",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/jharkhand-jmms-kalpana-soren-files-nomination-from-gandey-assembly-constituency/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/jharkhand-jmms-kalpana-soren-files-nomination-from-gandey-assembly-constituency.jpg",
        "video": null,
        "publish_date": "2024-10-24 07:03:36",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.124
    },
    {
        "id": 260898216,
        "title": "Delhi HC issues notice to Centre on plea seeking norms to regulate re-sale of concert tickets, banning of illegal sites",
        "text": "The Delhi High Court on Thursday issued a notice to the Centre and three private entities regarding a plea that seeks the establishment of norms to regulate the resale of concert tickets and to block illegal ticket-selling websites. The division bench, led by Chief Justice Manmohan, while seeking the response of all respondents, including Union ministries of information and broadcasting and electronics and information technology, tagged the matter with ongoing PIL and recently moved against ticket scalping, which is listed for hearing on February 18, 2025.The plea, prompted by recent concerts featuring Coldplay, Diljit Dosanjh, etc.The petition stated that the resellers have also acted in violation of the Consumer Protection Rules, 2020, as the resellers do not carry out any verification of the tickets being sold on their platform, nor they require any undertaking from the sellers, as is also evident from their terms and conditions. Thus, an individual with no ticket can also advertise via Resellers and secure unjust and unlawful benefits. Moreover, the resellers have no effective grievance redressal mechanism in place which may protect the interests of the purchasers if the seller fails to abide by its contractual obligations. Moreover, in the absence of a ticket or non-delivery of a legal ticket, it is the resellers who are to gain, as they further charge 25 euros per issue from the seller as ‘administrative fees’ for resolution of any issue raised by the purchaser. Such fees are independent of any successful resolution, and no compensation is provided to the buyer.It is further stated that Section 112 of BNS was also introduced with a similar aim to curb the practice of black-marketing and unauthorised dealing of tickets. The legislature intended to safeguard the public interest by outlawing any transactions for the sale of tickets that were without the express authority of the authorised ticketing platform or organiser. Prior to BNS, the state legislatures had prohibited such black-marketing activities via state legislation, as it deprived the state of a substantial amount of tax revenue and also resulted in the innocent public being cheated by the criminal elements. Thus, Section 112 of Bharatiya Nagarik Sanhita, 2023 [‘BNS’] aimed to protect the public by curbing the said acts of black-marketing with a severe punishment of imprisonment extending up to 7 years and imposition of fine. On October 9, the Delhi High Court sought the response of all respondents authorities against the practice of “ticket scalping,” which involves reselling event tickets at inflated prices.The plea filed in the Delhi High Court challenges the illegal practice of ticket scalping, where event tickets are resold at inflated prices for profit, harming the general public.The petition also claims that scalping contributes to a black market for counterfeit tickets, further victimising consumers. Additionally, it argued that these transactions, often unregulated, evade the official tax system, resulting in lost government revenue. This situation fosters a shadow economy that deprives the state of funds that could support public services and infrastructure.The petitioner called for a comprehensive legal framework, effective enforcement, and technological solutions to mitigate the negative impacts of ticket scalping. The goal is to promote fair ticketing practices, ensure consumer protection, and integrate revenue from ticket sales into the formal economy",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/delhi-hc-issues-notice-to-centre-on-plea-seeking-norms-to-regulate-re-sale-of-concert-tickets-banning-of-illegal-sites/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/delhi-hc-issues-notice-to-centre-on-plea-seeking-norms-to-regulate-re-sale-of-concert-tickets-banning-of-illegal-sites.jpg",
        "video": null,
        "publish_date": "2024-10-24 07:53:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.191
    },
    {
        "id": 260898206,
        "title": "BJP’s Wayanad LS candidate Navya Haridas files nomination",
        "text": "BJP candidate from Wayanad Lok Sabha constituency, Navya Haridas on Thursday filed her nomination papers. Former Mizoram Governor Kummanam Rajasekharan was among the leaders who accompanied her during the filing of the nomination. Earlier in the day, Navya Haridas said that the people of the constituency require a change in the way the politics is being conducted and exuded confidence that this time they will favour the BJP.“We started the election work a couple of days back. People require a change in the politics. So I think this time they are going to favour the BJP,” Navya Haridas told ANI.She alleged that the MPs who represented the constituency never raised the real issues of the constituency.“I know Wayanad very well and as a state general secretary of Mahila Morcha, I have visited Wayanad many times. I have been involved with the problems of Wayanad many times. I worked with the people of Wayanad. None of the issues of Wayanad were raised in the parliament. They have never cared about the real needs of Waynad. 10 per cent of the Wayanad consists of tribal population. Their upliftment has never been the consideration of the MPs,” she said.Meanwhile, Left Democratic Front (LDF) candidate from Wayanad Lok Sabha constituency Satyan Mokeri on Thursday slammed Congress leader Rahul Gandhi for imposing bye-elections on the people by vacating the Wayanad seat which he won in the 2024 general election.Mokeri also said that Congress leaders’ talk of a 5-6 lakh majority for its candidate Priyanka Gandhi comes out of the fear they have in the election.“The Congress is saying they will win by 5-6 lakh majority. this is coming out of fear. The bye-elections were imposed by them. Congress is not speaking politics here,” Mokeri told reporters after filing his nomination papers.“Are they ready for political debate? Rahul Gandhi contested like he was the PM candidate. Right after he won, he gave up this seat and declared another candidate soon,” she added.Congress candidate Priyanka Gandhi filed her nomination on Wednesday in the presence of top leaders of the party as she embarks on her electoral debut.She held a massive roadshow before the filing of her nomination. Congress leader Rahul Gandhi and other top leaders of the UDF participated in the roadshow.The Wayanad seat was vacated by Congress leader Rahul Gandhi after he was also elected to Lok Sabha from Raebareli in Uttar Pradesh in the general elections held earlier this year.Congress party approved Priyanka Gandhi’s candidature on October 15, after the bypoll schedule was announced by the Election Commission of India.Wayanad will go to the polls on November 13 along with voting for bye-elections in 47 assembly seats across 15 states. The first phase of assembly polls in Jharkhand will also be held on November 13",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/bjps-wayanad-ls-candidate-navya-haridas-files-nomination/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/bjps-wayanad-ls-candidate-navya-haridas-files-nomination.jpg",
        "video": null,
        "publish_date": "2024-10-24 08:03:51",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.064
    },
    {
        "id": 260883002,
        "title": "Arvind Kejriwal to campaign for INDIA bloc candidates in Maharashtra, Jharkhand, sources",
        "text": "Aam Aadmi Party Convenor Arvind Kejriwal will campaign for INDIA bloc candidates in Maharashtra and Jharkhand said sources. As per the sources Arvind Kejriwal is likely to campaign on assembly seats where AAP has a volunteer base and where the MVA candidates don’t have a controversial background.“Shiv Sena-UBT and NCP-SP have approached Aam Aadmi Party for Arvind Kejriwal to campaign in Maharashtra. Kejriwal is likely to campaign on assembly seats where AAP has a volunteer base and where the MVA candidates don’t have a controversial background. In addition to Kejriwal, other senior AAP leaders will also campaign for MVA candidates,” sources said. Kejriwal is also likely to campaign for JMM candidates in Jharkhand.“Arvind Kejriwal will campaign on the seats, where his appeal would translate into votes for INDIA Bloc, especially on urban seats,” as per sources. Kejriwal, who was arrested by the Enforcement Directorate in March this year, in connection with the Delhi excise policy case, came out of Tihar Jail last month, after being granted bail by the Supreme Court.After coming out, in a surprising move, the AAP national convenor announced his resignation from the CM post, and said he won’t take the position, till the public gives him the “certificate of honesty” by making AAP victorious again in the assembly elections next year.The Maharashtra assembly elections are scheduled for November 20, with counting for all 288 constituencies set for November 23.The main electoral contest will be between two alliances, namely the Mahayuti – comprising of BJP, Nationalist Congress Party (Ajit Pawar) and Shive Sena (Eknath Shinde). The other alliance is the MVA – comprising of Congress, Shiv Sena (UBT), and NCP (Sharad Pawar).The Assembly elections in Jharkhand will be held in two phases on November 13 and November 20 and votes will be counted on November 23.In Jharkhand, the BJP will be contesting the upcoming assembly elections in alliance with the All Jharkhand Students Union (AJSU), Janata Dal (United) (JD-U), and the Lok Janshakti Party (LJP). On the other hand, the Jharkhand Mukti Morcha (JMM), Rashtriya Janata Dal, and the Congress are contesting the election together",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/arvind-kejriwal-to-campaign-for-india-bloc-candidates-in-maharashtra-jharkhand-sources/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/arvind-kejriwal-to-campaign-for-india-bloc-candidates-in-maharashtra-jharkhand-sources.jpg",
        "video": null,
        "publish_date": "2024-10-24 05:58:59",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.144
    },
    {
        "id": 260902604,
        "title": "Centre notifies appointment of three advocates as Andhra Pradesh High Court judges",
        "text": "The Centre Government, through the Ministry of Law and Justice on Thursday notified the appointment of three advocates–Maheswara Rao Kuncheam (also known as Kuncham), Thoota Chandra Dhana Sekar (alias T.C.D. Sekhar), and Challa Gunaranjan–as judges of the Andhra Pradesh High Court.The notification issued in this regard stated that, in accordance with the powers conferred by the Constitution of India, the President, after consulting the Chief Justice of India, has appointed these advocates as Judges/Additional Judges of the Andhra Pradesh High Court.Recently, the Supreme Court Collegium, led by Chief Justice D Y Chandrachud, recommended the names of three advocates to the Centre for appointment as judges of the Andhra Pradesh High Court. The Collegium resolved to recommend the appointment of the following advocates as Judges of the Andhra Pradesh High Court: (i) Maheswara Rao Kuncheam (also known as Kuncham), (ii) Thoota Chandra Dhana Sekar (alias T.C.D. Sekhar), and (iii) Challa Gunaranjan. Their seniority will be determined according to existing practices, as stated in the resolution dated October 15. All three have been currently practising lawyers in the Andhra Pradesh High Court",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/centre-notifies-appointment-of-three-advocates-as-andhra-pradesh-high-court-judges/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/centre-notifies-appointment-of-three-advocates-as-andhra-pradesh-high-court-judges.jpg",
        "video": null,
        "publish_date": "2024-10-24 08:34:47",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.091
    },
    {
        "id": 260921404,
        "title": "Bengaluru: 5-yr-old drowns after falling into pit",
        "text": "Bengaluru (Karnataka): A five-year-old boy died after falling into a shaft opened for the installation of a lift in an under-construction building in Kadugodi on Thursday, according to the Bengaluru police. Police have registered a First Information Report (FIR) against Sunil, who was the owner and caretaker of the building, following the complaint filed by the minor's mother. The five-year-old deceased, identified as Suhas Gowad, died after he fell into the open pit around 9 am. The child was playing with his friends near the under-construction building. A five-foot-deep pit was dug to accommodate a lift shaft that caused the death of the minor. The boy while playing with his friends fell in the five-foot-deep shaft that was filled with water after heavy rains battered the city and drowned. It was alleged that the owner was negligent in following safety measures around the pit. After the incident, friends of the deceased rushed to inform the locals, where people rushed to rescue the boy and took him to the hospital. However, the boy was pronounced dead, the police said. The police further said that when the locals protested, a barrier was made so that proper safety measures were followed. A local stated that if precautionary measures had been taken earlier, the death would not have happened. According to the Bengaluru police, a case of negligence has been registered against Sunil, the owner and caretaker of the under-construction building. Earlier, Karnataka Chief Minister Siddaramaiah inspected the site of the building collapse at Huramavu Agara area of Bengaluru. According to official sources, the collapse on Tuesday had claimed the lives of 8 people, and injured 6 others. The Karnakata CM further announced Rs 5 lakh ex-gratia to the kin of the deceased, while ex-gratia for the injured will be given after seeing them in the hospital. \"Those hospitalized, expenditure will be taken care by the govt. Moreover, 5 Lakh ex-gratia is to be given by the government, ex-gratia for injured will be announced after seeing them at the hospital,\" he said while speaking to reporters at the site. He also said that Bruhat Bengaluru Mahanagar Palike (BBMP) has been directed to stop all illegal constructions in the city. (",
        "summary": "He fell into a shaft opened for the installation of a lift in an under-construction building in Kadugodi on Thursday",
        "url": "https://www.deccanchronicle.com/southern-states/karnataka/bengaluru-5-yr-old-drowns-after-falling-into-pit-1832669",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/25/1845200-accident.webp",
        "video": null,
        "publish_date": "2024-10-24 11:07:00",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.791
    }
]