[
    {
        "id": 263522422,
        "title": "Class 12 Student Dies By Suicide in MP After Objection Over His Taking Selfies at School",
        "text": "A Class 12 student jumped to death from Jam Gate, a historical site in Madhya Pradesh’s Khargone, after the authorities of his school objected to his use of a mobile phone and attempts to click selfies on its premises, police said.\nThe 17-year-old tribal student, Raj Osari, who studied in a government higher secondary school at Gulwad in Mandleshwar area and stayed in a government-run hostel, ended his life before Thursday noon despite attempts by his relatives and a guard to dissuade him from taking the extreme step, a police official said.\n“Raj jumped from the Jam Gate and was then found in a ditch. While he was trying to jump, his relatives and the security guard posted at the site asked him not to do so, but he did not listen to them and took the extreme step,” Khargone district Superintendent of Police Dharamraj Meena said.\nHe was rushed to a government hospital in Mandleshwar where doctors declared him dead, the official said, adding that he was a resident of Kakad Khodri village in Mandleshwar area.\nThe deceased’s uncle Jitendra Osari told the police in a statement that hostel superintendent Prakash Girwal had called him to complain about Raj using mobile phones at the school, the police official said.\n“School principal K C Saand had also objected to Raj taking selfies at the school on Wednesday. But he threatened to commit suicide or run away from the school,” he said, the principal then asked the hostel superintendent to call Raj’s family members and sort out the matter.\nBut when his relatives, Krishna and his son Ganesh, came to meet him at the school, Raj ran away. They all went looking for him, but could not find him. Raj came to the school later and the hostel superintendent immediately informed his relatives. They again reached the hostel at 9.30 pm, but Raj escaped by scaling the boundary wall of the hostel, the official said.\n“He came to the school again late at night and ran away from the hostel after having breakfast on Thursday morning. The principal asked the staff to catch him but they were unable to do so,” he said.\nHis mobile phone has also been recovered from the spot. On the basis of the investigation conducted so far, there is a possibility that he has taken this step due to fear of being scolded by his family members, the SP added.\nThe police are probing the case thoroughly as there could be some other motive as well behind the incident, he said.\nDISCLAIMER: If you or someone you know needs help, call any of these helplines: Aasra (Mumbai) 022-27546669, Sneha (Chennai) 044-24640050, Sumaitri (Delhi) 011-23389090, Cooj (Goa) 0832- 2252525, Jeevan (Jamshedpur) 065-76453841, Pratheeksha (Kochi) 048-42448830, Maithri (Kochi) 0484-2540530, Roshni (Hyderabad) 040-66202000, Lifeline 033-64643267 (Kolkata)",
        "summary": "The student was rushed to a government hospital in Mandleshwar where doctors declared him dead, an official said, adding that he was a resident of Kakad Khodri village in Mandleshwar area.",
        "url": "https://www.news18.com/education-career/class-12-student-dies-by-suicide-in-mp-after-objection-over-his-taking-selfies-at-school-9113587.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/09/death-2024-09-d5be96dd52ce961484ead485b4ef7125-16x9.jpeg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 11:00:22",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.458
    },
    {
        "id": 263525026,
        "title": "‘Don’t See My Future In US’: Elon Musk’s Estranged Trans Daughter After Trump's Win",
        "text": "Billionaire Elon Musk’s estranged transgender daughter, Vivian Jenna Wilson, announced that she would leave the United States (US) citing that she doesn’t see a future in the country following Donald Trump’s victory in 2024 Presidential elections.\nIn a post on Threads, Wilson said, “I’ve thought this for a while, but yesterday confirmed it for me. I don’t see my future being in the United States.”\nShe cited concerns over anti-trans regulations and the unwavering support for Trump among voters.\n“Even if he’s only in office for 4 years, even if the anti-trans regulations magically don’t happen, the people who willingly voted this in are not going anywhere anytime soon,” she added.\n\nView on Threads\n\nAfter her post, the Tesla CEO weighed in saying, “The woke mind killed my son,” in a post on X. Wilson responded her father’s reaction with sharp criticism. She took to Threads with a scathing message, “So, you’re still going with the sob-story about how “woe is me, my child was infected by something-or-other and that’s totally the only reason why they hate me. Just don’t… please don’t look into it, god forbid I’m anything but the victim in every scenario imaginable.”\n\nThe woke mind virus killed my son\n— Elon Musk (@elonmusk) November 7, 2024\n\n“Did anyone ever actually believe this? It’s just tired, it’s overdone. I’m just bored honestly, like is this really the best you could come up with?” she added.\nShe further suggested that Musk’s frustration may stem from his lack of control over her decision to leave. She said, “If I’m correct, the reason why this particular post is the one that got to you is that you’re mad that you finally don’t have power over someone.”\nWilson recognises herself as a transgender and has been estranged from her billionaire father since 2022 after she filed a petition to legally change her name and gender, seeking to distance herself from Musk.\nIn interviews, Musk expressed deep pain over the rift, describing it as worse than the death of his firstborn son, Nevada. He also accused Wilson of adopting extreme ideologies, saying, “She went beyond socialism to being a full communist and thinking that anyone rich is evil.”\nThe SpaceX CEO during an interview had said, “I lost my son, essentially.… My son Xavier is dead, killed by the woke mind virus … so I vowed to destroy the woke mind virus after that.”\nOn the other hand, Wilson had described Musk as a cold and narcissistic father, claiming he was an absent parent who did not support her transition. She claimed that the billionaire harassed her as a young child over her effeminate traits.",
        "summary": "Vivian Jenna Wilson cited concerns over anti-trans regulations and the unwavering support for Trump among voters.",
        "url": "https://www.news18.com/world/dont-see-my-future-in-us-elon-musks-estranged-trans-daughter-after-trumps-win-9113565.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/untitled-design-35-2024-11-79debba7418b9047293aad56efa873cc-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 11:07:02",
        "author": "News18,Shobhit Gupta",
        "authors": [
            "News18",
            "Shobhit Gupta"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.7
    },
    {
        "id": 263513180,
        "title": "Maruti Suzuki Dzire Achieves 5-Star Safety Rating in Latest Global NCAP Crash Test",
        "text": "The new Maruti Suzuki Dzire, launched in India this week, has set a new safety benchmark by earning a 5-star rating for adult occupant protection and 4 stars for child safety in Global NCAP crash tests.\nThis makes the Dzire the first Maruti Suzuki model to achieve a top 5-star safety rating.\nEquipped with six airbags, Electronic Stability Control (ESC), and pedestrian protection as standard, the Dzire offers impressive safety features. The Global NCAP tests evaluate frontal and side impacts, as well as the vehicle’s stability and pedestrian safety.\nDavid Ward, Executive President of the Towards Zero Foundation, praised the new Dzire, stating, “The new Dzire’s five star rating sets a significant safety benchmark for Maruti Suzuki compared to the previous version of this model and others from Maruti we have tested. Global NCAP warmly welcomes this milestone voluntary test result.”\nThe new Dzire, voluntarily submitted by Maruti Suzuki for testing, scored high in stability, with a solid structure and footwell area that can handle further impact. The frontal crash test showed marginal protection for the driver’s chest, but side and pole impact tests demonstrated excellent protection for adult occupants.\nFor child safety, the 18-month-old dummy received full protection, and the 3-year-old dummy showed good head and chest protection, though neck safety could be improved with a rearward-facing child restraint system (CRS).\nWith its standard six airbags, ESC, and pedestrian safety features, the Dzire sets a new standard for safety in its segment, paving the way for safer cars for Indian consumers.",
        "summary": "Global NCAP's crash tests evaluate frontal and side impact protection, ESC, and pedestrian safety, all of which are crucial for top star ratings.",
        "url": "https://www.news18.com/auto/maruti-suzuki-dzire-achieves-5-star-safety-rating-in-latest-global-ncap-crash-test-9113431.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/new-project-1-2-2024-11-08t150858.510-2024-11-e9d6a341de5150767fdc0ce5d096b044-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 10:16:04",
        "author": "News18,Samreen Pall",
        "authors": [
            "News18",
            "Samreen Pall"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.021
    },
    {
        "id": 263454186,
        "title": "Virat Kohli Holds Anushka Sharma Close, Couple Enjoys Dosa Date In Mumbai | See Viral Photo",
        "text": "Virat Kohli recently played the test series against New Zealand in India and turns out, Anushka Sharma is also in the country! The actress and her cricketer husband recently went out to a restaurant in Mumbai and posed with the staff. The fan-favourite couple enjoyed a dosa date and Virat held Anushka close as they posed with the restaurant’s staff.\nAnushka Sharma and Virat Kohli were seen dressed in chic casuals. They smiled as they posed with the staff. Virat held closely to his actress wife in the viral photo. They also signed a cap for the restaurant. Have a look at the photos here:\n\nView this post on Instagram\n\nA post shared by Benne (@benne.bombay)\n\nOn Thursday, Anushka Sharma hinted that she’s in Mumbai after she posted a photo of Juhu Beach on her Instagram Story to greet her followers on Chhath Puja. Anushka Sharma and Virat Kohli have been living in London since the actress was pregnant with their son, Akaay. It was reported that Akaay was born in London. Even after Akaay’s birth, Anushka is rarely seen in India. This led to buzz that Anushka and Virat are slowly moving to London permanently.\nAnushka Sharma’s absence from Bollywood events and films also has led to this speculation. Last year, the actress said that she didn’t want to do too many films anymore and spend time with her family instead. Virat Kohli has often expressed that he loves spending time with his family in London where they are not recognised. “We were not in the country. Just to feel normal for two months – for me, my family – it was a surreal experience. Couldn’t have been more grateful to God for the opportunity to spend time with the family. It’s an amazing experience to just be another person on the road and not be recognised,” Virat Kohli said in March this year.\nAs per a Hindustan Times report, Anushka and Virat are also directors of a UK-based company. The report mentions that as per the UK government’s Find and Update company information service, the couple are two of the three directors of Magik Lamp. It is a management consultancy incorporated on August 1, 2022. The company’s official office address is in West Yorkshire, UK.",
        "summary": "Anushka Sharma has joined Virat Kohli in Mumbai and the couple enjoyed dosas together.",
        "url": "https://www.news18.com/movies/virat-kohli-holds-anushka-sharma-close-couple-enjoys-dosa-date-in-mumbai-see-viral-photo-9112976.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/anushka-virat-2024-11-36b27d8ecd5ac048e96a3f8f847840a3-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 03:30:47",
        "author": "Kashvi Raj Singh,News18",
        "authors": [
            "Kashvi Raj Singh",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.215
    },
    {
        "id": 263559912,
        "title": "Ian Botham Suffers Bruises After Falling Into Crocodile-Infested River, Ex-Australia Pacer Saves Him",
        "text": "England legend Sir Ian Botham recently shared a breathtaking incident where he survived a fall into crocodile-infested waters during a fishing trip in Northern Australia. He was on a fishing trip when his flip-flops tangled in a rope while boarding a boat and fell into the Moyle River. Botham’s old friend and on-field rival, former Australia pacer Merve Huges, came to his rescue.\nBotham, who was pulled out of the water by Huges, suffered bruises along his torso. Most importantly, the England legend narrowly survived after falling into a river which is also home to bull sharks that feed on the scraps left behind by crocodiles.\nAccording to The Guardian, Botham and Huges were crossing a stretch of water to join other members of the expedition when the former English cricketer fell in the water. Revealing his story, Botham called himself the English version of Crocodile Dundee.\n“At the end of the day Crocodile Beefy survived,” Botham was quoted as saying by the Guardian.\n“I was out of the water quicker than I went in it. Quite a few sets of eyes were having a peep at me. Luckily I had no time to think about what was in the water.”\n“The guys were brilliant,” he said. “It was just one of those accidents. It was all very quick and I’m OK now,” he added.\nAs per English daily, Metro, Botham was in the water for a brief amount of time and didn’t have to think how disastrous it could have been.\n“I was out of the water quicker than I went in it. Quite a few sets of eyes were having a peep at me,” Botham said.\n“Luckily I had no time to think about what was in the water,” he added.\nTaking to his official Instagram account, Botham shared a picture with the fish that caught during the expedition.\n\nView this post on Instagram\n\nA post shared by IanBotham (@sirianbotham)\n\n“My catch of the day was the barra while I was nearly catch of the day for all the crocs and bull sharks thanks boys for getting me out,” Ian Botham wrote on his Instagram.",
        "summary": "Sir Ian Botham, who was pulled out of the water by former Australia cricketer Merve Huges, suffered bruises along his torso.",
        "url": "https://www.news18.com/cricket/ian-botham-suffers-bruises-after-falling-into-crocodile-infested-river-ex-australia-pacer-saves-him-9113908.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/sir-ian-bothams-narrow-escape-during-fishing-trip-2024-11-d82599326c2c1a0ff919b988f8299a27-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 13:50:23",
        "author": "Aakash Biswas,News18",
        "authors": [
            "Aakash Biswas",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.091
    },
    {
        "id": 263454746,
        "title": "Meet Anita Verma-Lallian, Indian-Origin Woman Who Purchased Matthew Perry's LA Home",
        "text": "Matthew Perry’s Los Angeles home, the same place where the F.R.I.E.N.D.S. actor took his last breath, was sold in an off-market deal for $8.5 million (Rs 72.04 crore approx). The property has been purchased by Anita Verma-Lallian, a real estate developer and film producer who looks forward to honouring the positive aspects of the late actor’s life and his joyful contribution towards society. In an Instagram post, Anita shared pictures from the property, showing glimpses of a puja that she performed at the house.\n“As a real estate developer myself, I believe every property has a history that we may or may not know about, and every home carries the energy that the current owner brings to it. I am Hindu, and it’s customary to do a blessing and prayer anytime you buy a new home. We were so lucky to have our Panditji from Arizona come to the house to do the blessing. We chose to honor the positive aspects of the previous owner’s life, his immense talent, and all the joy he brought to so many people. The decision to purchase the home had nothing to do with the previous owner, just our love of the home,” a part of her post read.\n\nView this post on Instagram\n\nA post shared by Anita Lallian (@anitavermalallian)\n\nAfter Perry, let’s get to know more about the owner of the luxurious property, which was originally purchased in 2020. \nWho Is Anita-Verma Lallian?\nAs per a Forbes report, Anita Lallian is the founder of Camelback Productions, which mainly represents South Asians in films. She is also a well-known real estate consultant in Arizona, where she has invested most of her career in helping investors find their ideal space, only to build a portfolio worth over $1 billion. \nShe began her consulting firm, Arizona Land Consulting, in 2020 after leaving her family business. “We have been instrumental in large businesses coming to Arizona and the development of Phoenix, focusing on attracting companies that will positively affect the landscape,” she told Canvas Rebel, as quoted by the South China Morning Post. \nOn her personal front, Anita’s parents immigrated from India to the US and created Vermaland, a land banking company in Arizona. She earned her MBA at the University of Southern California.",
        "summary": "Anita Lallian bought the late actor's LA home for a whopping Rs 72.04 crore in an off-market deal.",
        "url": "https://www.news18.com/viral/meet-anita-verma-lallian-indian-origin-woman-who-purchased-matthew-perrys-la-home-9113006.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/news18-2024-11-2a7dd952ffcb932d8ee4069b4ccba7cb-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 03:40:59",
        "author": "News18,Sahas",
        "authors": [
            "News18",
            "Sahas"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.344
    },
    {
        "id": 263520880,
        "title": "Tata Motors Q2 Results: Net Profit Declines 9.9% YoY to Rs 3,450 Crore, Revenue Falls",
        "text": "Tata Motors on Friday reported a 9.9 per cent decline in its net profit to Rs 3,450 crore for the second quarter ended September 2024 (Q2 FY25). Its revenue during July-September 2024 also fell to Rs 1,00,534 crore.\n(The story will be updated)",
        "summary": "Tata Motors Q2 Results: Its revenue during July-September 2024 also fell to Rs 1,00,534 crore.",
        "url": "https://www.news18.com/business/tata-motors-q2-results-net-profit-declines-9-9-yoy-to-rs-3450-crore-revenue-falls-9113581.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/08/tata-motors-2024-08-34c0df441a05ef53b31677d1d09452ca-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 10:51:08",
        "author": "Mohammad Haris,News18",
        "authors": [
            "Mohammad Haris",
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -1.0
    },
    {
        "id": 263507116,
        "title": "CCI Probe Finds Zomato, Swiggy Breached Antitrust Laws: Report",
        "text": "An investigation by India’s antitrust body found food delivery giants Zomato and SoftBank-backed Swiggy breached competition laws, with their business practices favouring restaurant chains listed on their platforms, documents show.\nZomato entered into “exclusivity contracts” with partners in return for lower commissions, while Swiggy guaranteed business growth to certain players if they listed exclusively on its platform, according to non-public documents prepared by the Competition Commission of India (CCI).\nExclusivity arrangements between Swiggy, Zomato and their respective restaurant partners “prevent the market from becoming more competitive,” the CCI’s investigation arm noted in its findings reviewed by Reuters on Friday.\nThe CCI documents are not public, in line with its confidentiality rules, and were shared with Swiggy, Zomato and the complainant restaurant groups in March 2024. Their findings have not been previously reported.\nZomato declined to comment, while Swiggy and the CCI did not respond to Reuters queries.\nThe antitrust investigation against Swiggy and its top rival Zomato began in 2022 after a complaint by National Restaurant Association of India about the impact on food outlets due to anti-competitive practices of the platforms.\nFood delivery giants Swiggy and Zomato have in recent years reshaped how Indians order food, as hundreds of thousands of outlets listed on their apps just when smartphone use, and online ordering, both grew rapidly.\nSwiggy, which on Friday is closing bids for its $1.4 billion IPO – India’s second biggest this year, and Zomato both in recent years also pushed restaurants to maintain a parity on prices, directly reducing competition in the market.\nThat practice affects restaurants as they cannot offer lower prices on other online platforms, the CCI documents stated.\nThe next, and final phase, of the CCI case is a decision by the CCI leadership which is still reviewing the investigation findings to decide on any penalty or order changes to Swiggy’s and Zomato’s business practices.\nA final decision could take several weeks, and the companies still have the option of contesting the investigation findings with the CCI.",
        "summary": "The antitrust investigation against Swiggy and its top rival Zomato began in 2022 after a complaint by National Restaurant Association of India",
        "url": "https://www.news18.com/business/cci-probe-finds-zomato-swiggy-breached-antitrust-laws-report-9113469.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/09/untitled-design-2024-09-26t163218.921-2024-09-d4d495a965f41ab3e79b8e97e170b73b-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 09:44:41",
        "author": "Aparna Deb,News18",
        "authors": [
            "Aparna Deb",
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.004
    },
    {
        "id": 263475210,
        "title": "Turkish Boss Rejects Indian Employee's Wedding Leave Request, Couple Marries Over Video Call",
        "text": "A couple was forced to solemnise their wedding over a video call after the groom’s boss did not approve his leave for the ceremony. The groom, based in Turkey, and the bride, residing in Himachal Pradesh, said “Qubool Hai” through a video call. \nAdnan Muhammad, who is a native of Bilaspur, had originally planned to travel to India for his wedding. However, his Turkish boss denied his leave request, complicating the situation. Adding to the urgency was the bride’s ailing grandfather’s heartfelt wish to witness his granddaughter’s marriage. This prompted the couple and their families to seek alternative solutions, ultimately agreeing to hold the wedding ceremony via video call.\nRead| ‘We Are Disappointed’: Manali Woman’s Rant About Tourists From Delhi, Punjab And Haryana Goes Viral\nThe groom’s family travelled with the baraat from Bilaspur, Chhattisgarh to Mandi, Himachal Pradesh. Under the guidance of a qazi, the marriage rituals were performed via video call, as per a report by PTI. \nThis, however, is not the first instance of a couple marrying over a video call. In July 2023, another couple in Himachal Pradesh exchanged vows online after flash floods, incessant rainfall, and landslides brought life in the mountainous region to a standstill. Ashish Singha and Shivani Thakur had planned for the groom to bring the baraat from Kotgarh, a village in Shimla, to Bhuntar, the bride’s hometown in Kullu. However, the harsh weather conditions forced the families to have them marry over a video call.\nAlso Read| Himachal Pradesh: Teacher Booked for Sexually Harassing Teen Schoolgirl\nDuring the COVID-19 pandemic, when the world came to a standstill, numerous weddings were conducted over video calls. One such example was a couple in Kerala, Vignesh KM and Anjali Ranjith, who exchanged vows via Zoom. They created an e-invitation featuring a Zoom ID and password, enabling guests to join the virtual celebration. The ceremony took place at the groom’s residence, with Vignesh’s roommates assisting in performing the wedding rituals. The groom’s parents sent the mangalsutra and wedding attire through speed post.",
        "summary": "The groom, who was based in Turkey, married his bride in Himachal Pradesh over a video call after his boss denied his leave request.",
        "url": "https://www.news18.com/viral/turkish-boss-rejects-indian-employees-wedding-leave-request-couple-marries-over-video-call-9113201.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-16-2024-10-65c7de363cfc321ff5c851a167851536-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 06:40:40",
        "author": "Arfa Javaid,News18",
        "authors": [
            "Arfa Javaid",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.164
    },
    {
        "id": 263533054,
        "title": "SC Refuses to Examine Plea to Appoint 'Yoga Mitra' Instructors in Schools",
        "text": "The Supreme Court on Friday refused to examine a plea seeking directions to all states to appoint ”yoga mitra” instructors for school children.\nA bench of Chief Justice of India D Y Chandrachud and Justices J B Pardiwala and Manoj Misra told petitioner advocate Ashwini Kumar Upadhyay that it was a policy matter.\n“As a person who practices yoga, I can say its important for the development, but this purely lies in the policy domain of the government,” remarked the CJI.\nWhen Upadhyay sought the permission to withdraw his plea, the bench allowed it.\nThe plea contended that integrating yoga in education not only upheld the children’s right to health under Article 21, but also complemented their right to education under Article 21A.\n“Right to health includes prevention and protection of health and is a minimum requirement to enable children to live with dignity. So, the state not only has a constitutional obligation to appoint ’yoga mitra’ in schools but to also ensure the creation and sustaining of conditions congenial to good health.” The plea said Article 21 read with Articles 39 and 47, put onus on the state on improving the health of its citizens, especially children, and provide necessary information, instruction, training and supervision on the same.",
        "summary": "A bench of Chief Justice of India D Y Chandrachud and Justices J B Pardiwala and Manoj Misra told petitioner advocate Ashwini Kumar Upadhyay that it was a policy matter.",
        "url": "https://www.news18.com/education-career/sc-refuses-to-examine-plea-to-appoint-yoga-mitra-instructors-in-schools-9113588.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/08/supreme-court-2024-08-1c5f510b32b18ba59842bcb24c99ffd1-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 11:43:24",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.158
    },
    {
        "id": 263490518,
        "title": "'Men Shouldn't Tailor Women's Clothes Or Cut Their Hair': UP Panel’s Proposal For Safety",
        "text": "Men should not tailor clothes for women or cut a woman’s hair either, the Uttar Pradesh State Women Commission has proposed to protect women from “bad touch” and stymie the ill intentions of men.\nThe radical raft of suggestions, which includes men not being allowed to take women’s measurements and installing CCTV cameras, followed a meeting held on October 28.\n“On October 28, at the meeting of the women commission, a proposal was floated that only female tailors should take the measurement of stitched clothes worn by women and that CCTVs should be installed in these areas,” Himani Agarwal, a member of the women’s body, told PTI on Friday.\nShe said the proposal was floated by the state women’s commission chairperson Babita Chauhan and it was supported by the members who were present at the meeting.\n“We have also said that in salons, it should only be female barbers who should attend to female customers,” Agarwal said.\nAgarwal added “We are of the view that because of men involved in this type of profession, women are molested. They (men) try to indulge in bad touch.\n“The intention of some of the men is also not good,” she said, before adding, “not that all the men have bad intentions.” Agarwal said this is just a proposal as of now and the women’s commission will subsequently request the state government to make laws in this regard.",
        "summary": "The radical raft of suggestions, which includes men not being allowed to take women’s measurements and installing CCTV cameras, followed a meeting held on October 28",
        "url": "https://www.news18.com/india/men-shouldnt-tailor-womens-clothes-or-cut-their-hair-up-panels-proposal-for-safety-9113341.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/screenshot-2024-11-08-134757-2024-11-ebc131e4dcdd642f1e9fb2bce580d20d-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 08:20:00",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.387
    },
    {
        "id": 263533240,
        "title": "Hansal Mehta Reacts To A Fan Saying The Buckingham Murders Hindi Dubbing On OTT Bad: 'It Can Be...'",
        "text": "Kareena Kapoor Khan starrer The Buckingham Murders has finally been released on the digital platform. The actress has recently announced that the mystery thriller is releasing on November 8, i.e. today. But looks like netizens are facing some issues in watching the film online. A fan has shared his disappointment with the X handle. He called the Hindi dubbing bad. Hansal Mehta also reacted and apologised.\nThe fan wrote, “I started watching #TheBukinghamMurders but the hindi dubbing is so bad. I couldn’t go beyond a few mins. Dear @mehtahansal was the movie shot in English? Why isn’t @NetflixIndia showing us the original version? Watching all the Brits speak in Hindi makes it sound so artificial.” Immediately Hansal Mehta replied, “Due to a technical error on the service @NetflixIndia will be uploading the original language version in a few hours. Thank you for your patience. And yes it can be quite irritating to watch a dubbed version of the film. Apologies.”\nTake a look here:\n\nDue to a technical error on the service @NetflixIndia will be uploading the original language version in a few hours. Thank you for your patience. And yes it can be quite irritating to watch a dubbed version of the film. Apologies. https://t.co/bX6nkhIHf9 pic.twitter.com/HX2enRWksY\n— Hansal Mehta (@mehtahansal) November 8, 2024\n\nTaking to her Instagram handle, Kareena shared the poster and wrote, “Here’s a tip-off: The Buckingham Murders is coming to Netflix on 8 November.” Released exclusively in cinemas on September 13, 2024, the film boasts a stellar cast, including Kareena Kapoor Khan, Ash Tandon, Ranveer Brar, and Keith Allen. Directed by Hansal Mehta and written by Aseem Arrora, Kashyap Kapoor, and Raghav Raj Kakker, The Buckingham Murders is produced by Mahana Films and TBM Films, presented by Balaji Telefilms. The production is helmed by Shobha Kapoor, Ektaa R Kapoor, and marks Kareena Kapoor Khan’s debut as a producer.\nNews18 gave the film 4 out of 5 stars for its powerful performances, intention and brilliant cinematography. Our review read, “The Buckingham Murders is a slow-burn police procedural, mounted on the able shoulders of Kareena Kapoor Khan. It is a two-hour testament to Kareena’s brilliance as an actor. Mehta brings out the best in her. The actress, who once called herself ‘the most commercial heroine’, impresses with her unglamorous, nuanced expression of unresolved grief and devastation. Her silent desolation and subtle ways of rebellion become the film’s driving force.”",
        "summary": "Kareena Kapoor has recently announced that the mystery thriller is releasing on November 8.",
        "url": "https://www.news18.com/movies/hansal-mehta-reacts-to-a-fan-saying-the-buckingham-murders-hindi-dubbing-on-ott-bad-it-can-be-9113655.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/hansal-buckingham-2024-11-ae084221ffbbe874c9dedee72ec1cf8b-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 11:48:12",
        "author": "Akriti Anand,News18",
        "authors": [
            "Akriti Anand",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.088
    },
    {
        "id": 263491446,
        "title": "SBI Q2 Results: Net Profit Jumps 28% to Rs 18,331 Crore, Surpasses Expectations",
        "text": "State Bank of India (SBI) on Friday reported a 28 per cent surge in its net profit to Rs 18,331 crore for the second quarter ended September 2024. It is above market expectations.\nGovernment-owned SBI is the country’s largest lender.\n(The story will be updated)",
        "summary": "SBI Q2 Results: Its net profit surges 28 per cent to Rs 18,331 crore for the second quarter ended September 2024. It is above market expectations.",
        "url": "https://www.news18.com/business/sbi-q2-results-net-profit-jumps-28-to-rs-18331-crore-surpasses-expectations-9113335.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/06/untitled-design-2024-06-01t101403.459-2024-06-fa543e599fbae8a910c3b64500b1ad0d-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 08:23:45",
        "author": "Mohammad Haris,News18",
        "authors": [
            "Mohammad Haris",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -1.0
    },
    {
        "id": 263555252,
        "title": "Prabhas Signs Three-Film Deal With Hombale Films, Salaar 2 To Kick Off The Partnership",
        "text": "With the success of Baahubali, Prabhas has cemented his position as a pan-Indian superstar. His latest film, Kalki 2898 AD, broke records at the box office upon its release. As the director gears up for his next projects, he has signed a three-movie deal with Hombale Films. The production house has backed superhit movies like the KGF franchise, Kantara, and Salaar.\nIn a post shared by Hombale Films on X (formerly known as Twitter), the production house announced that they have signed a three-movie deal with Prabhas. They wrote, “",
        "summary": "Prabhas has signed a three-film contract with Hombale Films. The partnership will kickstart with Salaar 2 which will be followed by movies releasing in 2027 and 2028.",
        "url": "https://www.news18.com/movies/prabhas-signs-three-film-deal-with-hombale-films-salaar-2-to-kick-off-the-partnership-9113868.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/05/img-2-2024-05-14t181608.585-2024-05-1e37075dd18e128c2268ee7b224d0af0-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 13:28:48",
        "author": "News18,Snigdha Oreya",
        "authors": [
            "News18",
            "Snigdha Oreya"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.137
    },
    {
        "id": 263540950,
        "title": "Prabhas Signs A Three-Movie Deal With Hombale Films; Deets Inside",
        "text": "Prabhas is all set to once again join forces with Hombale Films for a three-film deal. Previously collaborated on Salaar: Part 1 – Ceasefire, the actor will work on three upcoming films, including Salaar Part 2, in the pipeline. On Friday, Hombale Films issued a statement to confirm the collaboration and also unveiled the release windows for the projects. While Salaar 2 is expected to hit theatres in 2026, the other two will come out in 2027 and 2028, respectively. However, the financial details of the deal remain undisclosed.\nIt is worth mentioning that the pact will strengthen Hombale Films’ growing portfolio, which already features highly anticipated sequels like Kantara 2 and K.G.F: Chapter 3. “We are proud to unite with the Rebel Star, #Prabhas, in a groundbreaking three-film partnership that celebrates the essence of Indian cinema and aims to take it to the world. This is a declaration of our commitment to creating cinematic experiences that will be unforgettable. We will carry this partnership forward with the utmost respect for cinema fans and fans of the Rebel Star. Get ready, as the journey begins with #Salaar2,” the statement reads.\n\nView this post on Instagram\n\nA post shared by Hombale Films (@hombalefilms)\n\nThe first project under this new partnership comes with Salaar Part 2, directed by Prashanth Neel. “We will carry this partnership forward with the utmost respect for cinema fans and fans of the Rebel Star,” Hombale Films’ founder Vijay Kiragandur said. The first film, which featured Prabhas alongside Prithviraj Sukumaran and Shruti Haasan, collected over Rs 400 crores at the Indian box office. Set in the fictional city of Khansaar, it tells the story of two close friends, Deva and Varadha, who end up becoming enemies and how their rivalry affects Khansaar. The sequel is expected to explore the growing tension and conflict between their characters. It was released theatrically in December 2023 and on OTT in January 2024.\n\nWe will carry this partnership forward with the utmost respect for cinema fans and fans of the Rebel Star ❤️\nBest known internationally for his role in SS Rajamouli’s Baahubali series, Prabhas already has a busy slate ahead with projects like The Raja Saab, Spirit, Kalki 2, and Fauji.",
        "summary": "As per Hombale Films' statement, Prabhas will collaborate with the house for three movies including the much-awaited Salaar 2.",
        "url": "https://www.news18.com/movies/prabhas-signs-a-three-movie-deal-with-hombale-films-deets-inside-9113731.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/img-2-2024-11-08t140124.728-2024-11-108c82ea6529823515a469579999f83a-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 12:22:39",
        "author": "News18,Sahas,Yatamanyu Narain",
        "authors": [
            "News18",
            "Sahas",
            "Yatamanyu Narain"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.685
    },
    {
        "id": 263523868,
        "title": "Neeraj Chopra To Fly To South Africa For Off-Season Training And Early Preparations",
        "text": "Star javelin thrower Neeraj Chopra will travel to Potchefstroom, South Africa later this month for an off-season training stint to start early preparation for next year’s competitions.\nThe 26-year-old double Olympic medallist, who last competed in Brussels in the Diamond League Final in September, will spend 31 days in the South African city.\nChopra’s training stint will be funded by the Sports Ministry.\n“(He) will start his training early and will be in Potchefstroom for 31 days,” the ministry said in a statement on Friday.\n“Neeraj’s training session will be funded by the Ministry of Youth Affairs and Sports (MYAS) and the expenditure will cover his and his Physiotherapist’s lodging, boarding and training cost for the period of his stay in South Africa.”\nIn the past, Chopra has trained in Potchefstroom many times, including ahead of Tokyo and Paris Olympics.\nHe also took part in a competition there in January 2020, just before the COVID-19 pandemic struck the world. He had finished on top with a throw of 87.86m at the ACNW League Meeting 1 at McArthur Stadium.\nChopra battled an adductor muscle niggle throughout the year and it also affected his performance at both the Paris Olympics and the Diamond League Final, where he competed with a fractured left hand.\nHe had earlier spoken about consulting doctors at the end of the season to decide whether to go for surgery to fix the problem.\nBut talking to PTI on September 27, he had played down injury concerns and also stated that he would look to improve his technique.\n“It was an injury-plagued year but injury is fine now, I will be 100 per cent fit for the new season,” he had said.\nChopra, who added a silver medal at the Paris Olympics to his gold won in the Tokyo Games three years back, recently parted ways with his German coach Klaus Bartonietz, ending a hugely successful five-year partnership.\nIndian athletics chief coach Radhakrishnan Nair had told PTI that a new coach for Chopra is likely to be appointed before the end of the year.\nChopra’s main aim next year will be to defend the World Championships gold in Tokyo besides also working hard to hit the 90m mark.\nHe had won gold in the 2023 World Championships in Budapest, Hungary with a throw of 88.17m. He has a personal best of 89.94m, just 6cm short of the 90m mark.\nIn the Paris Olympics, his silver-winning throw was 89.45m and he was bested by Pakistan’s Arshad Nadeem, who broke the Games record with a 92.97m effort.",
        "summary": "The 26-year-old double Olympic medallist, who last competed in Brussels in the Diamond League Final.",
        "url": "https://www.news18.com/sports/neeraj-chopra-training-south-africa-preparations-new-season-9113601.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/07/neeraj-chopra_paris-olympics-2024-2024-07-cbb13b54d7bdd9018f7d56d82f29cb97-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-08 11:05:33",
        "author": "Amar Sunil Panicker,News18",
        "authors": [
            "Amar Sunil Panicker",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.112
    }
]