[
    {
        "id": 264279716,
        "title": "Sukesh Chandrashekhar Plans $135-Million Studio In Hollywood For 'Lady Love' Jacqueline Fernandez",
        "text": "Conman Sukesh Chandrashekhar, who is imprisoned over allegations of extorting ₹200 crore from an industrialist, recently sent a handwritten letter congratulating Donald Trump on his US Presidential election victory. Sukesh, who asserts he is in a relationship with Bollywood actress Jacqueline Fernandez, also expressed plans to dedicate a $135 million (₹1130 crore) investment in a Los Angeles studio to his “lady love.”\nAddressing Trump as “big bro,” Sukesh warmly congratulates him on his win against Kamala Harris in the election. He writes, “I remember during our last meet, a decade ago, you had given me an advice, ‘Accept the World the way it is or see it the way you want it to be’. Those words ring loud in my ears once again today, love you Bro for always motivating me and not judging me during our meets.”\nSukesh’s letter also mentions that his companies, LS Holdings and LS Gaming LLC, plan to expand their investments in the United States, with a projected increase of $500 million (₹4200 crore) over the next two years.\nNotably, Sukesh refers to Jacqueline Fernandez in the letter, claiming their relationship as he elaborates on his grand gesture inspired by advice he recalls from Trump. “I remember your other advice to me, ‘Treat your women always with dignity and make her always feel special’. On that note, LS Holdings is buying stakes of 135 million USD in a large studio producing shows and movies in Los Angeles. I have finalized this buy for my lady love Jacqueline, just like the advice you gave me, to ‘make your women feel special’,” he writes.\nSukesh was originally arrested in 2015 in connection with a multi-crore fraud case and has been held in Mandoli Jail. During the Enforcement Directorate’s (ED) ongoing investigation into his alleged crimes, Jacqueline Fernandez’s name surfaced due to her connection with him. Sukesh claims they are romantically involved, with leaked photos suggesting they were close. Jacqueline, however, states she was deceived by Sukesh into believing he was a legitimate businessman and now feels threatened by his intimidation tactics.",
        "summary": "In the letter, Sukesh claims a relationship with actress Jacqueline Fernandez and announces plans to dedicate a $135 million Los Angeles studio investment to her.",
        "url": "https://www.news18.com/movies/sukesh-chandrashekhar-plans-135-million-studio-in-hollywood-for-lady-love-jacqueline-fernandez-9117890.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/sukesh-chandrashekar-jacqueline-fernandez-2024-11-39bb94a44868aa4aa8b9a78f33484073-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 11:41:37",
        "author": "News18,Yatamanyu Narain",
        "authors": [
            "News18",
            "Yatamanyu Narain"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.242
    },
    {
        "id": 264207470,
        "title": "Actress Kasthuri Shankar Goes Missing After Case Filed Against Her Controversial Remarks: Report",
        "text": "South actress Kasthuri Shankar, known for her performances in films like Indian and Annamayya, has sparked public outrage after making offensive remarks regarding the Telugu community. Recently, speaking at a public event in Tamil Nadu, she stated that Telugu people were descendants of the courtesans who had served kings in ancient times, which has sparked anger in the community. Due to her remarks, several legal cases have been lodged against the actress in Chennai and Madurai, stating that the actress has allegedly hurt the sentiments of the Telugu community. The authorities took immediate action against the complaints and legal notices were sent to the actress. However, when local police reached her house, they found it locked and several reports suggest that Kasthuri is currently missing. Furthermore, her phone has been turned off, leaving her location unknown.\nAccording to a report, the Egmore police in Chennai filed a complaint against the GodFather actress under four provisions of the Bharat Nagrik Suraksha Samhita.\nFollowing her statement, the actress faced a massive backlash on social media. Taking to X, Kasthuri shared her official statement which read, “I never intended to insult or disrespect my Telugu extended relatives. I apologise for any unintentional ill feelings.”\n\nMy statement. Jai Hind. pic.twitter.com/KSz0BRxz6D\n— Kasturi (@KasthuriShankar) November 5, 2024\n\nAlso while talking to a media channel, she defended her words, claiming that the protest “exposed” the DMK’s (Dravida Munnetra Kazhagam) “hypocrisy and double standards.” She clarified that her remarks were targeting a specific historical group, not the entire Telugu community in Tamil Nadu. Kasthuri added that her remarks were directed at subset workers who, she believed, accompanied Telugu kings to Tamil Nadu decades ago.\nFurthermore, she expressed her affection for the Telugu people, describing them as family and accused the ruling DMK party of propagating false information about her among the citizens.\nMeanwhile, on the film front, Kasthuri has worked in several big-budgeted South films including Kamal Haasan’s Indian, Parampara, Habba, Velvet Nagaram, GodFather, Vadacurry, Krishna, Annamayya, Sneham and others.",
        "summary": "Due to her remarks, several legal cases have been lodged against the actress in Chennai and Madurai.",
        "url": "https://www.news18.com/movies/actress-kasthuri-shankar-goes-missing-after-case-filed-against-her-controversial-remarks-report-9117158.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/untitled-design-2024-11-12t103915.446-2024-11-5010befcabcac259a5a403f28ec3643b-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 05:09:49",
        "author": "Entertainment Bureau,News18,Sahas",
        "authors": [
            "Entertainment Bureau",
            "News18",
            "Sahas"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.382
    },
    {
        "id": 264307062,
        "title": "‘Kharge's Mother, Sister Had Died in Razakar Attack But…’: Yogi",
        "text": "Uttar Pradesh CM Yogi Adityanath on Tuesday claimed Congress president Mallikarjun Kharge purposely keeps mum on the tragic death of his mother and sister in an attack by Razakars as he feared losing Muslim votes.\nDays after Kharge criticised the seer-turned-politician on his saffron attire and “Batenge to Katenge” slogan, Adityanath launched a strong counterattack at a poll rally in Maharashtra’s Amravati.\nHe accused the Congress veteran of suppressing these painful personal memories for political expediency.\nAdityanath alleged Congress ignores historical atrocities for the sake of vote bank politics.\nKharge has conveniently forgotten the history of the Razakars under the Nizam of Hyderabad despite the personal loss he had suffered, Adityanath said.\n“(Mallikarjun) Kharge’s village, Varawatti, was also burned down by Razakars, and his mother, aunt, and sister died in the attacks,” Adityanath claimed.\nHe alleged Kharge was suppressing this truth fearing he might lose Muslim votes if he spoke about atrocities committed by the Nizam’s forces.\n“Congress is trying to reject history and Kharge has conveniently forgotten what happened to his family, just for vote bank politics,” said the Uttar Pradesh chief minister.\nThe Razakars was a paramilitary force that operated in the erstwhile princely state of Hyderabad with a primary objective to maintain the rule of the Muslim Nizams of Hyderabad and prevent the accession of Hyderabad to India.\nThe UP CM further alleged that the historical leadership of Congress compromised with the Muslim League in 1946, resulting in the division of India and the killing of Hindus.\n“When the Nizam realised during the Independence movement that he could not remain independent, he resorted to killing Hindus,” said Adityanath.\nHe claimed B R Ambedkar had advised Hindus and Scheduled Castes to move to Maharashtra for their safety (from the Nizam-ruled territory).\nAdityanath also warned against divisions within the nation.\n“If you are divided, your daughters will become unsafe, temples will be attacked, and communities targeted. This is the reality of what happens when you are not united,” Adityanath said while drawing a parallel with the “rise of instances of love jihad and land jihad in Maharashtra” and blaming the erstwhile Congress governments.\nDuring a poll rally, Kharge had said, “Many leaders live in the guise of sadhus and have now become politicians” in a veiled attack on Adityanath.\n“On the one hand, you wear ‘gerua’ (saffron) clothes, and on the other hand, you say ‘batoge to katoge’. I would say to the BJP, either wear white clothes or if you are a sanyasi, wear ‘gerua’ clothes, but then get out of politics,” Kharge had said.",
        "summary": "Days after Kharge criticised the seer-turned-politician on his saffron attire and \"Batenge to Katenge\" slogan, Adityanath launched a strong counterattack at a poll rally in Maharashtra's Amravati",
        "url": "https://www.news18.com/elections/kharges-mother-sister-had-died-in-razakar-attack-but-yogi-9118155.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/untitled-design-40-2024-11-7de8a6d3bccddac9e313ef45c0cee5d9-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 13:36:10",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.223
    },
    {
        "id": 264236166,
        "title": "'BR Ambedkar Was To Convert To Islam': Karnataka Congress Leader Stirs Controversy",
        "text": "Karnataka Congress leader and former MLA Sayed Azeem Peer Khadri stirred controversy on Tuesday after he claimed BR Ambedkar was all set to convert to Islam, and that if this had happened, state Home Minister Dr G Parameshwara and many Dalits today would be Muslims.\nKhadri’s remarks came while he was addressing a political rally in Karnataka’s Shiggaon.\n“Babasaheb Ambedkar, in those days, was all set to accept and join Islam, but he then eventually became a Buddhist,” the Congress leader claimed.\n“(Karnataka Congress leader) Nagaraj Yadav Sir may know about this. Had Babasaheb Ambedkar joined Islam, then Ramappa (Timmapur) would have been Rahim, Dr G Parameshwara would have been ‘Peer Saheb’, Hanumantha Gowda would have been Hassan and Manjunath Timmapur would be ‘Mehboob’,” he added, at a convention of Madiga community ahead of the by-election in Shiggaon on November 13.\nLater, lashing out at the Congress leader, the Bharatiya Janata Party (BJP) said that Khadri’s statement reflects his and his party’s ignorance.\n“There were attempts by Hyderabad Nizam to get Ambedkar to join Islam and they attempted to bribe him by offering him crores of rupees. Ambedkar clearly said Islam doesn’t have equality and it has intolerance” said BJP leader CT Ravi.\nSayed Azeem Peer Khadri had rebelled against the party after being denied a ticket and filed his nomination as an Independent in the byelection to Shiggaon Assembly Constituency.\nEarlier, on November 8, the Congress alleged that the BJP and the Rashtriya Swayamsevak Sangh (RSS) “want to get rid” of BR Ambedkar’s Constitution and replace it with one based on the ideology of the Manusmriti.\nThe party also said that is why Prime Minister Narendra Modi has “called the caste census an attempt to divide the nation”.\nCongress general secretary in-charge communications Jairam Ramesh claimed that the BJP and its ideological mentor, RSS have many grouses with the Constitution, and reservations for Dalits, Adivasis and Other Backward Classes (OBC) are among the primary ones.\nRamesh’s attack came after Modi accused the Congress of playing a dangerous game of dividing castes and communities.\nIf the Scheduled Castes (SCs), Scheduled Tribes (STs) and Other Backward Classes stay united, the Congress’s politics will be over, the Prime Minister said in Dhule, addressing his first rally in Maharashtra for the November 20 assembly polls in the state.",
        "summary": "Congress leader Sayed Azeem Peer Khadri, while addressing a gathering, has claimed Dr BR Ambedkar nearly converted to Islam.",
        "url": "https://www.news18.com/india/sayed-azeem-peer-khadri-controversial-claim-br-ambedkar-islam-peer-saheb-9117410.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/mixcollage-12-nov-2024-01-46-pm-9109-2024-11-0e67cad31ce2bef5c3fb16ebd28c4a79-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 08:18:08",
        "author": "Harish Upadhya,News18,Vani Mehrotra",
        "authors": [
            "Harish Upadhya",
            "News18",
            "Vani Mehrotra"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.141
    },
    {
        "id": 264203922,
        "title": "'Pakistan Kyu Nahi Aa Rahe Aap?': Suryakumar Yadav Confronted By Fan About 2025 Champions Trophy Fiasco",
        "text": "There is no culling the saga of India’s refusal to compete in Pakistan for the upcoming ICC Champions Trophy in 2025, as the situation has left fans puzzled.\nThe confusion has now spilled over to the players as well, as recently a fan was recorded asking India’s T20I skipper Suryakumar Yadav about the same, rendering him unable to expound on the issue.\nThe BCCI has informed the International Cricket Council (ICC) about the Indian government’s denial of permission to travel to Pakistan for the showpiece event, leaving the PCB in a daze.\nIn retaliation, Pakistan might reportedly ‘withdraw’ from the global event, with PCB chief Mohsin Naqvi stating that Pakistan will not come up with a hybrid model for the Champions Trophy to specifically accomodate the Indian team’s wishes.\nThe drama has left many puzzled over the potential outcome, and one fan confronted Suryakumar Yadav about the same.\n“Mujhe ek baat bata saktein hai ke Pakistan kyu nahi aa rahe aap (Tell me why are you not coming to Pakistan)?”, the fan asked Suryakumar.\n\nPakistan Fans asking India’s T20I Captain @surya_14kumar – Why won’t he come to Pakistan ?\nAnswer–He won’t be selected.\nHow will he go to Pakistan ?#ChampionsTrophy2025 pic.twitter.com/BgPlCcbROy\n— alekhaNikun (@nikun28) November 11, 2024\n\nSurya gave an honest reply, ensuring the fan that it is not the players’ call to make.\n“Arrey bhaiya, hamare hath mein thodi hai (Brother, it is not in our hands),” Surya replied.\nThe ICC has assured the PCB that, under the current arrangement, they would receive full hosting fees and a majority of the matches.\n“The ICC has told the PCB that if it decides to go ahead with the hosting of the mega event on a Hybrid Model it would get its full hosting fees and majority of the matches,” PTI quoted a source as saying.\nHowever, according to reports, if the PCB decides to pull out of hosting the tournament due to India’s refusal, the ICC could possibly consider moving the entire event to South Africa.",
        "summary": "The confusion over the ICC Champions Trophy fiasco has now spilled over to the players as well, as recently a fan was recorded asking India's T20I skipper Suryakumar Yadav about the same",
        "url": "https://www.news18.com/cricket/pakistan-kyu-nahi-aa-rahe-aap-suryakumar-yadav-confronted-by-fan-about-2025-champions-trophy-fiasco-9117125.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/mixcollage-12-nov-2024-10-06-am-6659-fotor-2024111210657-2024-11-890c3d9116cd6af95da22ac2018d1f45-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 04:37:38",
        "author": "News18,Siddarth Sriram",
        "authors": [
            "News18",
            "Siddarth Sriram"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.461
    },
    {
        "id": 264193292,
        "title": "Student Found Hanging in Hostel Room of Telangana Varsity, Family Alleges Foul Play",
        "text": "A 17-year-old girl student of Rajiv Gandhi University of Knowledge Technologies (RGUKT) in Nirmal district of Telangana allegedly died by suicide on Monday, police said.\nThe student’s family members raised suspicion over her death and alleged that the hostel staff members were responsible for the incident.\nThe girl, a student of Pre-University Course-II, was found hanging in her hostel room at the institute’s campus in Basar town by her roommates, a police official said.\nThe girl is suspected to have taken her own life due to “family issues”, according to a preliminary investigation.\nA suicide note, purportedly written by the student and addressed to her parents and brother, has been found, police said, adding she was a native of Nizamabad district.\nMeanwhile, the girl’s family members questioned why her body was shifted to the hospital for postmortem without showing it to them first. They argued that the ”suicide note” was also not shown to them and alleged the hostel staff was responsible for the girl’s death.\nFurther investigation is on, police said.\nDISCLAIMER: If you or someone you know needs help, call any of these helplines: Aasra (Mumbai) 022-27546669, Sneha (Chennai) 044-24640050, Sumaitri (Delhi) 011-23389090, Cooj (Goa) 0832- 2252525, Jeevan (Jamshedpur) 065-76453841, Pratheeksha (Kochi) 048-42448830, Maithri (Kochi) 0484-2540530, Roshni (Hyderabad) 040-66202000, Lifeline 033-64643267 (Kolkata)",
        "summary": "The girl, a student of Pre-University Course-II, was found hanging in her hostel room at the institute’s campus in Basar town by her roommates, a police official said.",
        "url": "https://www.news18.com/education-career/student-found-hanging-in-hostel-room-of-telangana-varsity-family-alleges-foul-play-9117014.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/09/student-suicide-1-2024-09-2cc5846205c4437a4baba0b4e498c5d5-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 02:27:10",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.833
    },
    {
        "id": 264233292,
        "title": "Rohan Bopanna, Matthew Ebden Dealt With Straight Sets Loss in ATP Finals Opener",
        "text": "Ace Indian tennis player Rohan Bopanna and his Australian men’s doubles partner Matthew Ebden started their ATP Finals campaign on a losing note, suffering a straight-set defeat in a group stage match.\nBopanna and Ebden were defeated by the Italian duo of Simone Bolelli and Andrea Vavassori 2-6, 3-6 in just 56 minutes here on Monday. The Indo-Australian pair had defeated their opponents in this year’s Australian Open final.\nBolelli and Vavassori, the fourth seeds, dominated from the outset, breaking their rivals in the second game.\nA double fault by the Indo-Australian pair in the eighth game allowed the Italians to secure another break of serve, further thwarting any hopes of a comeback.\nBuoyed by the local support, Bolelli and Vavassori continued their domination in the second set as well, taking the crucial break in the fourth game.\nBopanna, who is appearing in the tournament for the fourth time, and Ebden, struggled to match their Italian opponents, failing to earn even a single break point throughout the match.\nThe serving woes added to their difficulties, as they won only 58% of points (19 out of 33) on their first serve and 47% (7 out of 15) on their second.\nIn contrast, the Italians were far more efficient, winning 89% of points on their first serve (31 out of 35) and 83% on their second (5 out of 6).\nAdditionally, Bopanna and Ebden committed two double faults, both of which led to breaks of serve.\nThe defeat marked Bopanna and Ebden’s third consecutive defeat to the Italians this year.\nBopanna and Ebden lie fourth in the Bob Bryan Group. They will take on top seeds Marcelo Arevalo of El Salvador and Croatian Mate Pavic in their next group game on Wednesday.\nThey had reached the semifinals in the last edition.",
        "summary": "Bolelli and Vavassori, the fourth seeds, dominated from the outset, breaking their rivals in the second game to clinch the 6-2, 6-3 win over Bopanna-Ebden.",
        "url": "https://www.news18.com/sports/rohan-bopanna-matthew-ebden-dealt-with-straight-sets-loss-in-atp-finals-opener-9117285.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/e4zxsmaw-fotor-2024111212947-2024-11-2ab1fd1f06223eac390b6332f49bfc83-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 08:04:34",
        "author": "News18,Siddarth Sriram",
        "authors": [
            "News18",
            "Siddarth Sriram"
        ],
        "language": "en",
        "category": "sports",
        "source_country": "in",
        "sentiment": -0.249
    },
    {
        "id": 264283868,
        "title": "Drunk Man Drives SUV Thar On Railway Track In Jaipur, Gets Stuck As Train Approaches | Video",
        "text": "A man was arrested on Monday for driving a Mahindra Thar on a railway track in Rajasthan’s Jaipur. The man, who was reportedly drunk, took his SUV onto railway tracks to shoot a reel for social media.\nAccording to the video going viral on social media, the man can be seen trying to remove the vehicle from the railway tracks as police officials along with several people were standing next to the car.\n\nइस गाड़ी को तुरंत प्रभाव से जब्त करना चाहिए,स्टंट दिखाने के चक्कर में कईयों की जान ले लेता।@RailMinIndia @RailwaySeva @Central_Railway @AshwiniVaishnaw@WesternRly @PoliceRajasthan @jaipur_police pic.twitter.com/44ztKg3aLo\n— Sangram Singh ??? (@sangramsingh_95) November 12, 2024\n\nHowever, trouble began for a man after his car got stuck when he tried to take it off the tracks on seeing an approaching goods train. Fortunately, the loco pilot was managed to stop the train in time. No one was injured in the incident.\nAccording to NDTV, some people helped the driver pull out his car from the tracks, following which he quickly reversed it for about 20-30 metres to get it on the road and fled. In the process, the driver hit and injured three people.\nFollowing this, the police chased and arrested the driver. The police has also seized the car.\nNotably, this is not the first time when a person risked his life to shoot a reel on railway tracks. Several people in the past have been killed or sustained serious injuries after being hit by a train while recording videos for social media.",
        "summary": "The car got stuck when the man tried to move it off the tracks after seeing an approaching goods train",
        "url": "https://www.news18.com/india/drunk-man-drives-suv-thar-on-railway-track-in-rajasthan-jaipur-gets-stuck-as-goods-train-approaches-video-viral-9117882.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/fotojet-97-2024-11-a303bff1c7a8faa414118ec1b1dd6ab3-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 11:59:43",
        "author": "Mahima Joshi,News18",
        "authors": [
            "Mahima Joshi",
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.277
    },
    {
        "id": 264222910,
        "title": "Ali Fazal Joins Fleabag Star Phoebe Waller-Bridge In Hollywood Film Rule Breakers: ‘I Am Thrilled’",
        "text": "Actor Ali Fazal is on a roll! Not only has the actor carved a niche for himself in Bollywood, but he has also been a part of several Hollywood projects such as ‘Kandahar’, alongside Gerard Butler, ‘Death on the Nile’ with Gal Gadot, among others. The actor continues making huge waves in Hollywood, and is all set to share screen space with the iconic ‘Fleabag’ actress Phoebe Waller-Bridge in the upcoming film Rule Breakers. The project, produced by Angel Studios, marks yet another milestone in Fazal’s burgeoning international career.\nRule Breakers, directed by two-time Oscar winner Bill Guttentag, explores themes of resilience and defiance in Afghanistan. Known for his previous work in ‘Victoria & Abdul’, and the acclaimed series ‘Furious 7’, Fazal’s collaboration with Waller-Bridge is highly anticipated by fans and industry insiders alike. The film will release in March 2025.\nSpeaking about Rule Breakers, Ali Fazal said, “I am thrilled to be a part of Rule Breakers and to share the screen with such a talented actress as Phoebe Waller-Bridge. This project resonates with me deeply, and I believe it’s crucial to tell stories that highlight the strength and resilience of individuals in challenging circumstances. I look forward to bringing this narrative to life and reaching audiences globally.”\nOn working with Pheobe, Ali said, “I am so thrilled to be able to support a film that we think every parent should take their daughter to watch in the theatres. And the story being so inspiring, it was no surprise that Phoebe Waller also stepped in. Of course, she is a powerhouse of talent so her addition am sure has lifted the film to greater heights. We play key roles at different stages in Roya Mehboob’s life and journey along with the Afghani robotics team for girls”.\nFazal’s journey from Bollywood to Hollywood has been nothing short of remarkable, and this collaboration with Phoebe Waller-Bridge will only further solidifies his presence in Hollywood! As for his Bollywood projects, Ali Fazal will next be seen in Anurag Basu’s directorial ‘Metro In Dino’, Rajkumar Santoshi’s ‘Lahore1947,’ among others.",
        "summary": "Ali Fazal is all set to share screen space with Phoebe Waller-Bridge in Rule Breakers, marking yet another milestone in Fazal’s international career. The film will release in March 2025.",
        "url": "https://www.news18.com/movies/ali-fazal-joins-fleabag-star-phoebe-waller-bridge-in-hollywood-film-rule-breakers-i-am-thrilled-9117373.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/ali-fazal-joins-fleabag-star-phoebe-waller-bridge-in-hollywood-film-rule-breakers_-i-am-thrilled-2024-11-c1e1b21bb546bc20f0f08cb3b0676b97-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 07:01:33",
        "author": "Lubna Khan,News18",
        "authors": [
            "Lubna Khan",
            "News18"
        ],
        "language": "en",
        "category": "entertainment",
        "source_country": "in",
        "sentiment": 0.566
    },
    {
        "id": 264215150,
        "title": "Video: Vistara's Ground Staff, Crew Members Get Emotional While Seeing Off Last Flights",
        "text": "Vistara’s ground staff and crew members at Odisha’s Biju Patnaik International Airport bid an emotional farewell to the last Vistara flight on Monday, marking the end of an era as the airline has been merged into Air India. This Delhi-bound flight represented Vistara’s final standalone service before its integration with Air India.\ndocument.createElement('video');\nhttps://cms.ibnlive.com/wp-content/uploads/2024/11/vistara-2024-11-f9b2a4f73005f87275a98d58744f9be1.mp4\nMeanwhile, the newly unified Air India-Vistara entity took off for the first time from Doha to Mumbai in the last evening on Monday. The flight, operating under the code “AI2286”, departed from Doha around 10:07 pm local time and arrived in Mumbai early Tuesday morning. This journey also holds the distinction of being the merged entity’s first international flight.\nVistara on Monday operated its last-ever domestic flight at 10:50 pm IST from Mumbai to Delhi (flight number UK986) and its last international flight at 11:45 pm from Delhi to Singapore (UK115). The full-service carrier provided special desserts to all passengers flying today and making a special announcement informing about Vistara’s closure on November 11.\nFrom Tuesday, November 12, all Vistara aircraft will be operated by Air India with a special code ‘AI 2’ as Vistara has been merged with Air India as part of the Tata group’s efforts to consolidate all its aviation businesses under one brand — Air India.",
        "summary": "The newly unified Air India-Vistara entity took off for the first time from Doha to Mumbai in the last evening on Monday.",
        "url": "https://www.news18.com/business/video-vistaras-ground-staff-crew-members-get-emotional-while-seeing-off-last-flights-9117243.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/vistara-2024-11-ff9eaa4d1b2e23e86044cb794633da6b-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 06:10:53",
        "author": "Mohammad Haris,News18",
        "authors": [
            "Mohammad Haris",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.416
    },
    {
        "id": 264228928,
        "title": "Bollywood Actor Shahid Kapoor Leases Out Luxury Apartment At Over Rs 20 Lakh Per Month",
        "text": "Bollywood actor Shahid Kapoor has recently rented out his luxurious apartment in Mumbai’s prestigious Three Sixty West, Worli. According to Square Yards, the property spans 5,395 sqft (nearly 501.21 sqm) of carpet area and 573.78 sqm (about 6,175.42 sqft) of built-up area, with three dedicated car parking spaces.\nThe apartment, originally purchased in May 2024 for Rs 58.6 crore was jointly acquired by Shahid and Mira Kapoor. Three Sixty West, developed by Oberoi Realty, is a high-end residential project spread over 1.58 acres, offering 4 and 5 BHK ready-to-move-in apartments.\nThe lease agreement, registered in November 2024, is for a tenure of 60 months with an initial security deposit of Rs 1.23 crore. As per Square Yards, the property will generate an average gross rental yield of 4-5 per cent. The lease follows a tiered rental structure, starting at Rs 20.5 lakh per month and gradually increasing to Rs 23.98 lakh by the end of the term in five years. Additionally, the agreement includes a rent-free period for the first 10 months.\nBollywood actor Shahid Kapoor has joined the league of celebrities who have recently rented out their luxury properties in Mumbai. Some other notable celebrities who have rented out their properties in recent period include Kartik Aaryan, Ranveer Singh, and producer Sajid Nadiadwala\nBollywood star Shahid Kapoor continues to shine as one of the industry’s most versatile actors. His recent performance in Farzi, his debut web series, received critical acclaim, marking a successful foray into digital entertainment. Kapoor also garnered widespread praise for his role in Jersey, earning nominations for major awards. His portrayal of intense characters in films like Kabir Singh and Haider has solidified his reputation as a powerhouse performer, while his ability to excel across genres keeps him at the forefront of Indian cinema.",
        "summary": "The property, jointly acquired by Shahid and Mira Kapoor, spans 5,395 sqft (nearly 501.21 sqm) of carpet area and 573.78 sqm (about 6,175.42 sqft) of built-up area, with three dedicated car parking spaces.",
        "url": "https://www.news18.com/business/real-estate/bollywood-actor-shahid-kapoor-leases-out-luxury-apartment-at-over-rs-20-lakh-per-month-9117413.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-2024-10-23t180734.684-2024-10-1a6295c7cabc4c00c7eed1ddcaa64d41-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 07:36:11",
        "author": "Mohammad Haris,News18",
        "authors": [
            "Mohammad Haris",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.575
    },
    {
        "id": 264244942,
        "title": "Elon Musk's Starlink Has to Comply with All Rules for Licence in India: Jyotiraditya Scindia",
        "text": "Elon Musk-owned Starlink will have to comply with all norms to get licence for services in India, Union telecom minister Jyotiraditya Scindia said on Tuesday. The minister said the satellite internet services provider is in process of completing all the requirements and they will get licence once they complete the process.\n“They (Starlink) have to comply with all rules to get the licence. You have to look at it from security perspective as well. They are in process of doing it. Once all requirements are met they will get the licence,” Scindia told reporters.\nHe was replying to a question on status of licence for Starlink.\nAt present, the government has issued licence to Bharti Group-backed OneWeb and Jio-SES joint venture, Jio Satellite Communications.",
        "summary": "Union Telecom Minister Jyotiraditya Scindia says the satellite internet services provider is in process of completing all the requirements and they will get licence once they complete the process.",
        "url": "https://www.news18.com/business/elon-musks-starlink-has-to-comply-with-all-rules-for-licence-in-india-jyotiraditya-scindia-9117570.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/06/jyotiraditya-scindia-2024-06-c5bfd854da1e8d352938cb7a0271fe40-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 09:03:44",
        "author": "Mohammad Haris,News18",
        "authors": [
            "Mohammad Haris",
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.177
    },
    {
        "id": 264316500,
        "title": "North Korea Ratifies Defence Treaty With Russia, Kim Sent ‘Storm Corps' Soldiers but Not His A-team?",
        "text": "North Korea has ratified a landmark defence pact with Russia on November 12, sealing a deepening security cooperation with Moscow. The deal \"was ratified as a decree\" of Kim Jong Un, the Korean Central News Agency (KCNA) reported. \"The treaty will take effect from the day when both sides exchanged the ratification instruments,\" KCNA said. This came after Russian lawmakers voted unanimously last week to ratify the deal, which President Vladimir Putin later signed.",
        "summary": "North Korea has ratified a landmark defence pact with Russia on November 12, sealing a deepening security cooperation with Moscow. The deal \"was ratified as a decree\" of Kim Jong Un, the Korean Central News Agency (KCNA) reported. \"The treaty will take effect from the day when both sides exchanged the ratification instruments,\" KCNA said. This came after Russian lawmakers voted unanimously last week to ratify the deal, which President Vladimir Putin later signed.",
        "url": "https://www.news18.com/videos/world/north-korea-ratifies-defence-treaty-with-russia-kim-sent-storm-corps-soldiers-but-not-his-a-team-9118198.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/1731421203_260859aa-5484-443d-b544-ca7e527f6180-16x9.jpeg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 14:15:02",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.124
    },
    {
        "id": 264316496,
        "title": "North Korea Ratifies Landmark Defence Pact With Russia To Counter Armed Attacks",
        "text": "Giant Meteorite\n\nShalini Passi\n\nBoney Kapoor\n\nShahid Kapoor\n\nGurpatwant Singh Pannun\n\nChampions Trophy\n\nNews / Videos /North Korea Ratifies Landmark Defence Pact With Russia To Counter Armed Attacks\n\nNorth Korea Ratifies Landmark Defence Pact With Russia To Counter Armed Attacks\n\nBy: Sameer Khan\n\nLast Updated: November 12, 2024, 19:42 IST\n\nBreaking News\n\nNorth Korea ratifies landmark defence pact with Russia to counter armed attacks",
        "summary": "North Korea ratifies landmark defence pact with Russia to counter armed attacks",
        "url": "https://www.news18.com/videos/breaking-news/russia-north-korea-defence-deal-9118191.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/twitter-card-vod-thumb-19-2024-11-da3d97a1d3e7dcf73639a290fc14f80f-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 14:12:37",
        "author": "News18,Sameer Khan",
        "authors": [
            "News18",
            "Sameer Khan"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.764
    },
    {
        "id": 264195640,
        "title": "Elon Musk’s X Is Testing Grok AI Chatbot With Free Users? Here’s What We Know",
        "text": "Elon Musk-owned X, earlier known as Twitter, has an AI chatbot called Grok that is available with the X Premium plan. But the platform could soon offer it for more users, even those who don’t pay for X. \nThat’s right, Grok AI chatbot is being tested with free users in select regions, and this has been mentioned in multiple reports quoting different X users this week. Many users have seen the feature work for them on their free X account, who get some basic tools of the AI chatbot working for their free account on the platform. \nNeed Of The Hour\nMusk is really gearing up for the AI battle with OpenAI, Google and Microsoft, and he needs Grok AI to mature and grow at a faster clip, which could easily happen with free users able to access the AI chatbot. The report from TechCrunch also mentions that a user on X named Swak has made a post explaining the conditions that are being put for the free Grok AI access. \nThe platform requires the free users to have been using the app for a minimum of 7 days and link their phone number to the account. The free aspect of Grok AI shows its true colours, as mentioned by the X users, who claim they can ask 10 questions to the Grok 2 AI model, while the same is limited to 20 questions for the Grok 2 mini model. You can also seek three image analysis requests per day. \nThe Grok 2 model is fairly new in terms of its adoption, and X is clearly looking to push its reach and training methods faster. X users in India are yet to get this benefit, but it is likely that more people would be eager to try it out in its free avatar. \nIn other X news, Elon Musk doesn’t like people blocking him on his social platform X, which is why billions of the users will now have a different meaning when they block someone. any account that you have blocked will be able to see your posts. The post says, “If your posts are set to public, accounts you have blocked will be able to view them, but they will not be able to engage.”\nThankfully, these accounts still cannot interact with these users but even then X is clearly changing the dynamics of blocking an account and most users have shared their concerns for these new rules.",
        "summary": "The platform has its AI chatbot available for the premium users but looks like Musk is ready to go big.",
        "url": "https://www.news18.com/tech/elon-musks-x-is-testing-grok-ai-chatbot-with-free-users-heres-what-we-know-9116922.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/grok-ai-chatbot-images-2024-10-745bd1f45e9445ec0cb2cddf8e9e4b4b-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 03:00:09",
        "author": "News18,S Aadeetya",
        "authors": [
            "News18",
            "S Aadeetya"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.232
    },
    {
        "id": 264200164,
        "title": "Air India and Vistara’s First Joint Flight Takes Off From Doha To Mumbai",
        "text": "The first flight of the integrated Air India-Vistara entity took off for Mumbai from Doha on Monday night.\nThe flight operating with the code ‘AI2286’ departed Doha at around 10.07 pm local time and is expected to land in Mumbai early on Tuesday morning.\nIt is also the first international flight of the merged entity.\nOn the domestic sector, the entity’s first scheduled flight AI2984 took off from Mumbai to Delhi at around 1.30 am on Tuesday morning. It is being operated with an A320 plane.\nThe code ‘AI2XXX’ is being used for Vistara flights that are being operated by Air India post the merger to help passengers identify the Vistara flight at the time of booking.\nEarlier, a source said AI2286 from Doha to Mumbai will be the first flight to be operated by the merged entity.\nAccording to information from flight tracking website Flightradar24.com, the flight, being operated with an A321 aircraft, departed from Doha at around 10.07 pm local time.\nThe duration of the flight is nearly three hours.\nThe integration of Vistara with Air India, both part of Tata Group, marks a major consolidation in the country’s civil aviation space.\nVistara is a joint venture between Tatas and Singapore Airlines. Post-merger, Singapore Airlines will have a 25.1 per cent stake in the enlarged Air India.",
        "summary": "The merger of Vistara, a Tata-Singapore Airlines joint venture, with Air India brings significant changes to the aviation industry.",
        "url": "https://www.news18.com/auto/air-india-and-vistaras-first-joint-flight-takes-off-from-doha-to-mumbai-9117102.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/news18-1-2024-10-2761d3c43d0267fc53c40848cc1f4763-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-12 03:56:20",
        "author": "News18,Samreen Pall",
        "authors": [
            "News18",
            "Samreen Pall"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.079
    }
]