[
    {
        "id": 264989822,
        "title": "‘Disheartening’: Oscar Winner Sound Designer Resul Pookutty On Criticism Over Kanguva's Loud Background Score",
        "text": "After much anticipation, Suriya’s fantasy drama Kanguva was finally released in theatres on November 14. The movie has received a mixed reaction from both fans and critics. While some were impressed, others expressed concerns about the film’s sound design. Many found the background score too overwhelming, describing it as excessively loud, with some even complaining that it left them with headaches. In response to the criticism, sound designer Resul Pookutty, who has won an Oscar and a BAFTA for sound mixing, spoke out on Instagram.\nHe shared a screenshot of a review from India Today, which labelled Kanguva as “one of the loudest films currently in theatres.” Along with the post, Pookutty expressed his disappointment over how sound in popular films is often criticised. He pointed out that sound mixing is caught in the “loudness war.”\n“A friend of mine, a re-recording mixer sent me this clip… It is disheartening to see a review about sound in our popular films like this. Our craft and artistry caught up in the loudness war… who is to blame?! The sound guy?! Or the innumerable fixes come at the last moment to satiate all insecurities,” he wrote.\n“High time our fraternity to put your foot down and say things loud and clear. No film will have a repeat value if the audience walks out with a headache!” he added.\nTake a look at the post here:\n\nView this post on Instagram\n\nA post shared by Resul Pookutty (@resulpookutty)\n\nPookutty is known for being open and candid on social media. In 2022, he criticised Alia Bhatt’s role in RRR. He called her character more of a prop in the story overshadowed by the performances of Ram Charan and Jr NTR.\nDirected by Siva, Kanguva stars Suriya in the lead role, marking his return to the big screen after nearly two years. The film also features Bollywood stars Bobby Deol and Disha Patani, along with popular Tamil actors like Natarajan Subramaniam, Jagapathi Babu, Yogi Babu, Redin Kingsley, Kovai Sarala, and Ananda. Kanguva has been released in five languages: Tamil, Telugu, Hindi, Kannada, and Malayalam.\nDespite facing tough competition from Bhool Bhulaiyaa 3 starring Karthik Aaryan and Singham Again with Ajay Devgn, Kanguva had a solid start on its opening day. Reports suggest the film made Rs 22 crore on its first day with about Rs 13.65 crore coming from Tamil Nadu alone.",
        "summary": "Sound designer Resul Pookutty recently addressed the criticism of Suriya’s Kanguva being loud.",
        "url": "https://www.news18.com/movies/disheartening-oscar-winner-sound-designer-resul-pookutty-on-criticism-over-kanguvas-loud-background-score-9121675.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/news18-31-2024-11-8d867a7d3a6201d9ed7e9cb7e515258f-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 11:26:41",
        "author": "News18,Sahas,Yatamanyu Narain",
        "authors": [
            "News18",
            "Sahas",
            "Yatamanyu Narain"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.082
    },
    {
        "id": 264902436,
        "title": "Stock Market Holiday: Will BSE, NSE Remain Closed Today For Guru Nanak Jayanti?",
        "text": "Amid Guru Nanak Jayanti 2024 celebrations across the nation, some stock market investors are confused about whether the Indian stock market will remain closed.\nIndian stock exchanges BSE and NSE will be closed for trading on Friday, November 15 on account of Guru Nanak Jayanti. India’s largest non-agri commodity exchange Multi Commodity Exchange (MCX) of India will remain shut in the first session between 9 am and 5 pm while resuming trade in the evening session between 5 pm and 11:30/11:55 pm.\nThe National Commodity & Derivatives Exchange (NCDEX), an agri-exchange, will remain closed in both morning and evening sessions.\nStock market holidays in 2024\nTo avoid such confusion, people are advised to go to the BSE website — bseindia.com and click on the ‘Trading Holidays’ option on the top. After clicking the ‘Trading Holidays’ option, the complete list of stock market holidays in 2024 is opened. There are three stock market holidays in November 2024 in this list of stock market holidays. Out of these three stock market holidays in November 2024, one has gone on 1st November 2024 on Laxmi Pooja. The following two stock market holidays fall on 15th November 2024 for Guru Nanak Jayanti 2024 and 20th November 2024 for Maharashtra Assembly General Elections.\nEarlier, there were only two stock market holidays in November 2024. Still, due to the announcement of the Maharashtra Assembly General Elections on 20 November 2024, the BSE and the NSE declared stock market holidays on 20 November 2024.\nAccording to the BSE holiday calendar, trading holidays have been announced for 16 days in 2024. So far this year, they have been closed on 13 occasions. The last time they were closed was on Friday, November 1, for Laxmi Pujan.\nNext, markets will remain closed on December 25, Wednesday on account of Christmas.\nOn Thursday, Nifty was trading at 23,522.30 around 2 pm, down by 37 points of 0.16%. If the market ends in the red today, it will be its six straight loss. During this period, it has fallen by 954 points or over 4 per cent.\nThe current weakness is on account of relentless selling by foreign institutional investors (FIIs) and market experts see further correction from current levels.\nNifty has already fallen 10 per cent from its September 27 record high of 26,277 and now analysts are giving out targets as low as 21,300 for India’s headline index. Typically, a fall of 10 per cent is considered a correction zone and a drop of 20% from the peak would place Dalal Street officially in the bear market zone.\nIn the previous trading session, Nifty had breached its 200-DMA in intraday trading and hit a 5-month low near the 23,500 mark.\nFIIs have pulled out a record Rs 1.2 lakh crore from Dalal Street since Nifty’s September peak as weak Q2 earnings are leading to downgrades.",
        "summary": "After Guru Nanak Jayanti, the next stock market holiday will fall on 20th November 2024 for the Maharashtra Assembly General Elections",
        "url": "https://www.news18.com/business/markets/stock-market-holiday-will-bse-nse-remain-closed-today-for-guru-nanak-jayanti-9120963.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/07/untitled-design-1-2024-07-b83589102906df46f2256933e487a1f2-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 01:00:14",
        "author": "Aparna Deb,News18",
        "authors": [
            "Aparna Deb",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.495
    },
    {
        "id": 265012710,
        "title": "Jay Shah Urges ICC To Take 'Strong Action' Against PCB For Champions Trophy Tour In PoK Plan",
        "text": "The Board of Control for Cricket in India (BCCI) secretary Jay Shah on Friday raised objections with the International Cricket Council (ICC) on Pakistan Cricket Board’s (PCB) plans regarding the trophy tour of the 2025 Champions Trophy in cities of ‘Pakistan-occupied Kashmir’.\nIt is learnt that BCCI secretary Jay Shah on Friday spoke to the top brass of the ICC and condemned this move by Pakistan and has urged the global body to take strong note.\n“The BCCI secretary, after it came to his notice, called up the ICC and was extremely critical of PCB’s move to conduct a Trophy tour of multiple cities which fall under Pakistan Occupied Kashmir,” a senior BCCI official privy to the development told PTI on conditions of anonymity.\n“He has urged the ICC to take strong action. As far as Islamabad is concerned, there is no issue but there can’t be any Trophy tour to POK.”\nALSO READ | ICC Denies PCB To Conduct Champions Trophy Tour In PoK Territory: Reports\nThe Trophy Tour is part of the global body’s promotional campaign, involving visits to multiple cities as per discussions between the international body and the host country.\nHowever, the Pakistan Cricket Board (PCB), without prior consultation with all stakeholders, announced on its official social media that the Trophy would be taken to Skardu, Murree, and Hunza — areas that fall under the disputed territory.\n“Get ready, Pakistan! The ICC Champions Trophy 2025 trophy tour kicks off in Islamabad on 16 November, also visiting scenic travel destinations like Skardu, Murree, Hunza and Muzaffarabad. Catch a glimpse of the trophy which Sarfaraz Ahmed lifted in 2017 at The Oval, from 16-24 November,” PCB had tweeted.\nALSO READ | ICC Champions Trophy Row: Pakistan Provokes India, Cricket Board Announces Trophy Tour In PoK\nWhen an ICC Board Member was contacted, he told PTI: “The discussions on Trophy tour is still on. I am not aware if PCB had kept everyone in loop about the four cities mentioned but if not then it was certainly not the right thing to do. I don’t think ICC will allow PCB to take the trophy to any disputed region.”\nThe tournament, last played in 2017, is already in limbo after the BCCI officially intimated ICC about Indian cricket team’s inability to travel to Pakistan.\nThe PCB in return, as of now, has rejected the proposed ‘Hybrid Model’ with India playing its matches in Dubai. The schedule has also been put on hold.\n(With inputs from Agencies)",
        "summary": "The BCCI strongly objected to PCB's plan to take the Champions Trophy for a tour of the disputed 'Pakistan Occupied Kashmir', prompting the global body ICC to put the promotional event on hold.",
        "url": "https://www.news18.com/cricket/jay-shah-urges-icc-to-take-strong-action-against-pcb-for-champions-trophy-tour-in-pok-plan-9121844.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/05/bcci-secretary-jay-shah-2024-05-f29e58079f5af038fb13572ca1fa015b-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 13:12:13",
        "author": "News18,Ritayan Basu",
        "authors": [
            "News18",
            "Ritayan Basu"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.221
    },
    {
        "id": 265040974,
        "title": "'Ensure Level Playing Field': Congress Writes To EC After Rahul Gandhi’s Chopper Delay",
        "text": "The Congress on Friday complained to the Election Commission against the alleged grounding of party leader Rahul Gandhi’s helicopter in poll-bound Jharkhand and sought its urgent intervention in ensuring a level playing field in poll campaigning.\nIn a letter to the EC, Congress general secretary in-charge communications Jairam Ramesh alleged that Leader of the Opposition in Lok Sabha Rahul Gandhi’s chopper was not allowed to take off due to restrictions leading to his public meetings getting either delayed or cancelled.\nAll India Congress Committee general secretary K C Venugopal hit out at the BJP government at the Centre, accusing it of denying the Congress a level playing field in elections.\n“There should be a level-playing field in campaigning. The PM’s campaign cannot take precedence over that of all others. Today Rahul Gandhi got delayed in Jharkhand on this account,” Ramesh said in a post on X.\nIn his complaint to the Chief Election Commissioner, Ramesh sought his urgent intervention, saying a level playing field should be maintained.\nHe said Gandhi was in Jharkhand for an election rally of the Congress and had secured all the requisite permissions for travelling across the state and attending all the pre-scheduled poll events.\nAccording to the approved schedule and permissions in place, Gandhi and his team were to take off from Godda to fly to other locations across the state at 1.15 pm, he said.\n“However, their mode of travel, which was permitted to fly at 1.15 pm IST, has not been allowed to take flight. They have been informed that due to the protocol of other leaders in the vicinity, a no-fly zone restriction had been put in place. In fact, due to the said delay all subsequent programmes of Shri Rahul Gandhi (for which prior permission had been secured) is now either being delayed or cancelled,” Ramesh said in his complaint.\n“We request your Commission to urgently intervene in this situation and ensure that the level playing field is not disrupted in such a manner.\n“If such a situation is allowed to prevail, then the ruling regime and its leaders can always take undue advantage of such protocols and limit the election campaign of opposition leaders,” Ramesh said in his complaint.\nIn a post on X, Venugopal accused the Modi government of being “brazen” and resorting to “petty tactics” to stop Gandhi from campaigning.\n“The delay of nearly 2 hours in LOP Shri Rahul Gandhi Ji’s helicopter taking off (caused by the Air Traffic Control) reeks of the BJP’s intention to deny the Congress a level playing field in these elections,” Venugopal said, adding that the Congress has approached the ECI and will demand an explanation.\n“This mistreatment took place on Dharti Aaba Birsa Munda Ji’s jayanti, when Rahul Ji is in his birthplace Jharkhand to commemorate his contributions towards Adivasi rights.\n“The Modi government is so brazen that it will resort to such petty tactics to stop Rahul Ji, who has for decades spoken for Adivasi empowerment and protecting the Constitution at all costs. The people of Jharkhand know very well the BJP’s shameless attitude and will punish them on voting day,” Venugopal said.\nCongress leader and former Youth Congress chief B V Srinivas said, “BJP’s brazen tactics exposed! 2-hr delay in Rahul Gandhi’s helicopter takeoff on Birsa Munda’s birthday due to ATC clearance is nothing but an attempt to stop him from campaigning.” “Rahul Ji’s long-standing fight for Adivasi rights & Constitution won’t be silenced. Jharkhand, vote for justice,” Srinivas said.",
        "summary": "Congress alleged that Rahul Gandhi's chopper was not allowed to take off due to restrictions leading to his public meetings getting either delayed or cancelled",
        "url": "https://www.news18.com/elections/ensure-level-playing-field-congress-writes-to-ec-after-rahul-gandhis-chopper-delay-9121981.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/untitled-2024-11-d463d9977bf38af82be06d3077232764-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 15:21:54",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.263
    },
    {
        "id": 264933250,
        "title": "Maori MPs Stage Haka Protest In New Zealand Parliament Against Indigenous Treaty Bill",
        "text": "Maori MPs Stage Haka Protest In New Zealand Parlia...\n\nWatch | Mike Tyson Slaps Jake Paul In Final Face-o...\n\nRaashii Khanna Dazzles In Stunning Green Ensemble ...\n\nSonam Kapoor Flaunts Her Beauty In A Gorgeous Long...\n\nBollywood Actress Tamannaah Bhatia Brings Her Fash...\n\nHandsome Vihaan Samat Spotted At TIRA Store Launch...\n\nUorfi Javed Stuns Paps With Her Wonderful Cinderel...\n\nJab Kabir And Preeti Met Mira Rajput At An Event |...\n\nForever Cutie Shraddha Kapoor Flaunts Her Natural ...\n\nMasked Kiara Spotted In Her Casual White Look! | B...\n\nRepublicans ‘Ready To Govern,’ House Speaker Says ...\n\n\"Hugs, Not Bullets' Strategy Didn't Work\", US Envo...\n\nAmsterdam Police Detains Pro-Palestinian Protester...\n\nUS Missile Base in Poland ‘Attempt To Contain Russ...\n\nDonald Trump Returns to The White House For Oval M...\n\nRussia Stages First Missile Attack on Ukraine Since August\n\nJoe Biden's Remark to Israeli Reporter About Hosta...\n\nHouthis Attack US Warships With Drones, Missiles, ...\n\n35 Killed as ‘Upset’ Driver Rams Car Into Crowd at...\n\nRupali Ganguly Demands Rs 50 Crore Compensation Fr...",
        "summary": "New Zealand’s parliament was briefly suspended on Thursday after Maori members staged a haka to disrupt the vote on a contentious bill that would reinterpret a 184-year-old treaty between the British and Indigenous Maori.",
        "url": "https://www.news18.com/short-videos/world/maori-mps-stage-haka-protest-in-new-zealand-parliament-against-indigenous-treaty-bill-9121278.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/1731652275_95697dc5-f7ed-407c-b2c4-07753e1a58ef-16x9.jpeg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 06:31:46",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.635
    },
    {
        "id": 264969308,
        "title": "Aircraft Carrying PM Modi To Delhi Faces Technical Snag At Deoghar Airport",
        "text": "Maheep Kapoor\n\nSafest Banks\n\nChampions Trophy\n\nNavjot Singh Sidhu\n\nAmitabh Bachchan\n\nRupali Ganguly\n\nAircraft Carrying PM Modi To Delhi Faces Technical Snag At Deoghar Airport\n\nLast Updated:November 15, 2024, 15:21 IST\n\nFollow us on Google News\n\nFirst Published:\n\nNovember 15, 2024, 15:21 IST\n\nNews india Aircraft Carrying PM Modi To Delhi Faces Technical Snag At Deoghar Airport\n\nPreviousNext",
        "summary": "",
        "url": "https://www.news18.com/india/jharkhand-poll-pm-modi-deoghar-airport-aircraft-technical-snag-delhi-delay-latest-news-9121543.html",
        "image": "https://images.news18.com/ibnlive/uploads/2021/07/1627642197_news18_breaking_news-1600x900.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 09:51:34",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.459
    },
    {
        "id": 264992910,
        "title": "Why New Zealand’s Youngest MP, Other Māori Leaders Protested In Parliament With A ‘War Dance’",
        "text": "Something unprecedented happened in the New Zealand Parliament on Thursday. Opposition MPs from the Māori indigenous community performed a traditional war dance to demonstrate their anger and fear over a bill that will redefine their rights.\nWhen the speaker asked Hana-Rawhiti Maipi-Clarke, how her party would vote on the Principles of the Treaty of Waitangi Bill, the 22-year-old MP stood up, tore the copy of the bill and started performing the traditional Haka dance in Parliament.\nShe was joined in the Haka by other opposition leaders on the floor. Speaker Gerry Brownlee temporarily stopped the session. Maipi-Clarke, who was elected last year, was suspended for her protest, which Brownlee described as disrespectful.\nWho Are The Māori In New Zealand?\nThe Māori belong to the indigenous tribe of New Zealand for centuries. The Māori arrived on large ocean-faring canoes and settled throughout Polynesia and New Zealand. Their culture reflects a deep connection to the land and ancestral spirits.\nThe Māori language, known as Te Reo Maori, is an important part of their identity and is still spoken by many Maori people today.\nThe Māori have a deep spiritual connection with nature and the land. They call themselves ‘kaitiaki’ (guardians) of the natural resources. They believe in the concept of ‘whakapapa’, which means everything in the world is interconnected and has a genealogical link. Ancestors play a significant role in Māori culture, and their stories and traditions are passed down through generations.\nMāori make up roughly 20% of New Zealand’s 5.3 million people. They experience material hardship, have worse health indicators and are incarcerated at much higher rates than the population at large.\nThere are six major ethnic groups in New Zealand: European, Māori, Pacific peoples, Asian, MELAA (Middle Eastern / Latin American / African), and ‘Other ethnicity’, according to a 2018 census.\nWhat Is The Iconic Haka Dance?\nThe war dance holds immense cultural significance. The haka is performed with powerful synchronised movements, vocal chants, and intense facial expressions, and it is used to express emotions, convey messages, and welcome visitors, according to tribes.world.\nThe dance is a symbol of unity, strength, and resilience for the Maori tribe.\nDespite facing challenges throughout history including colonization and cultural assimilation, the Maori are an integral part of New Zealand’s society.\nWhat Is Treaty Of Waitangi That Maori Are Fighting For?\nThe treaty was signed in 1840 between the British Crown and more than 500 Māori chiefs, and is considered the founding document of New Zealand. It set out the terms of governance between the two parties. Its clauses continue to influence New Zealand’s laws and policies today.\nThe bill, introduced last week by a political party known as ‘Act’, a junior partner in the centre-right coalition government, said it wanted equal rights for all, thus, undermining the Treaty’s principles. The party argues that non-Māori citizens are being disadvantaged by policies designed to promote Māori rights and governance. This has already stoked racial tension in the country.\nAlthough the bill passed its first reading with support from the National Party and New Zealand First, both coalition partners have said they will not back it in subsequent readings, making it unlikely to become law.\nProtests Over The Bill\nAround 10,000 protesters marched through Rotorua, about 450 km north of the capital, with some wearing traditional attire as part of a nine-day hikoi (march). They were met by crowds waving the Māori flag and chanting in support.\nThousands of people participated in the hikoi moving towards Wellington this week to protest against a controversial bill that seeks to reinterpret the country’s 184-year-old founding document.\nThe Treaty Principles Bill, which passed its first reading in parliament, will now proceed to a public submission process before the next vote. Its author, David Seymour, leader of the ACT party, argues that the proposal seeks to provide clarity on the principles of the Treaty of Waitangi.\nWho is Hana-Rawhiti Maipi-Clarke?\nMaipi-Clarke sees herself as the protector of the Maori people and represents the voice of younger generation of voters in New Zealand.\nShe first gained attention after her election in 2023, where she performed the traditional Haka dance during her maiden parliamentary speech.\nBoth Maipi-Clarke and her father were considered candidates to represent Te Pati Maori in the elections. Eventually, she was chosen for her “youthful perspective.”\nNotably, Maipi-Clarke has been quite vocal in her criticism of New Zealand Prime Minister Christopher Luxon and his conservative government, which has faced allegations of ripping apart Maori rights.\nMaipi-Clarke also supports incorporating Indigenous knowledge and practices in tackling climate change. Her activism is inspired by her grandfather, Taitimu Maipi, a member of the Maori activist group Nga Tamatoa.\nMaipi-Clarke is from Huntly, a small town located between Auckland and Hamilton.",
        "summary": "Hana-Rawhiti Maipi-Clarke, 22, performed Māori tribe’s traditional war dance called Haka in the New Zealand Parliament over a controversial bill that seeks to redefine their rights",
        "url": "https://www.news18.com/explainers/why-new-zealands-youngest-mp-other-maori-leaders-protested-in-parliament-with-a-war-dance-9121676.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/fotojet-2024-11-14t231005.576-2024-11-2afb00d84035168231c1d5fd605d30de-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 11:39:57",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.599
    },
    {
        "id": 264970984,
        "title": "Youngest New Zealand MP Performs Haka Dance In Parliament, Tears Bill",
        "text": "Maheep Kapoor\n\nSafest Banks\n\nChampions Trophy\n\nNavjot Singh Sidhu\n\nAmitabh Bachchan\n\nRupali Ganguly\n\nNews / Videos /Youngest New Zealand MP Performs Haka Dance In Parliament, Tears Bill\n\nYoungest New Zealand MP Performs Haka Dance In Parliament, Tears Bill\n\nLast Updated: November 15, 2024, 15:27 IST\n\nBreaking News\n\nNew Zealands youngest MP leads traditional Maori Haka dance in protest over the controversial Indigenous Treaty Bill in parliament, rips apart copy of the legislation",
        "summary": "New Zealands youngest MP leads traditional Maori Haka dance in protest over the controversial Indigenous Treaty Bill in parliament, rips apart copy of the legislation",
        "url": "https://www.news18.com/videos/breaking-news/new-zealand-mp-leads-traditional-haka-dance-in-parliament-9121565.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/nz-2024-11-48a0b9c3847798fa01d952b1a055cc1a.webp?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 09:57:28",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.76
    },
    {
        "id": 264963180,
        "title": "Mumbai: Fire Breaks Out Near BKC Metro Station, Passenger Services Suspended",
        "text": "The Mumbai Metro Rail Corporation Limited (MMRCL) on Friday temporarily suspended the passenger services at Kotak Bandra-Kurla Complex (BKC) Metro Station after fire broke out outside the entry gate, which caused smoke to enter the station.\nAccording to Mumbai Metro, after the incident was reported, fire brigade was alerted and was rushed to the spot. It said that the passenger services were closed as a precautionary measure.\n“Passenger services at BKC station are temporarily closed due to a fire outside Entry/Exit A4, which caused smoke to enter the station. Fire Brigade is on the job. For passenger safety, we have paused services. Senior Officers of MMRC & DMRC are at site. Please proceed to Bandra Colony station for alternative boarding. Thank you for your understanding,” it said in a post on X.\n\n? Notice: Passenger services at BKC station are temporarily closed due to a fire outside Entry/Exit A4, which caused smoke to enter the station. Fire Brigade is on the job. For passenger safety, we have paused services. Senior Officers of MMRC & DMRC are at site. Please proceed…\n— MumbaiMetro3 (@MumbaiMetro3) November 15, 2024\n\nAccording to preliminary information, the fire broke out at a wooden furniture storage in basement below the BKC metro station in Bandra.\nThe BKC metro station is a part of Mumbai’s first underground Metro or aqua line between Aarey Colony and Bandra-Kurla Complex. The 12.69-kilometre stretch between Aarey Colony and BKC is part of the 33.5-kilometre Colaba-Seepz-Aarey Metro line 3, which received the final clearance from the Commissioner of Metro Railway Safety (CMRS)\nThe Aarey-BKC stretch has ten stations, providing connectivity to both Terminal 1 and 2 of the Chhatrapati Shivaji Maharaj International Airport and the Ghatkopar-Andheri-Versova Metro Line 1 at Marol Naka station.\nMumbai’s first underground metro, 33.5 km long Colaba-Bandra-SEEPZ Metro-3 Corridor has 26 underground stations. It will integrate with the suburban railway, other Mumbai Metro lines, and existing transport modes at approximately eight locations, including major rail terminals like Mumbai CSMT and Churchgate.\nThe metro line will also link six major employment and business hubs: Nariman Point, Cuffe Parade, Fort, Lower Parel, BKC, and SEEPZ/MIDC. According to authorities, the line will provide easy access to more than 30 educational institutes, 13 hospitals, 14 religious places and 30 recreational facilities as well as to areas which are not connected with the suburban rail network, such as Kalbadevi, Girgoan, Worli, and the international and domestic airports.",
        "summary": "The BKC metro station is a part of Mumbai’s first underground Metro or aqua line between Aarey Colony and Bandra-Kurla Complex.",
        "url": "https://www.news18.com/india/mumbai-fire-breaks-out-near-bkc-metro-station-passenger-services-suspended-9121483.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/untitled-design-28-2024-11-7f499936339f688b51964eeaa0c92690-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 09:21:10",
        "author": "News18,Shobhit Gupta",
        "authors": [
            "News18",
            "Shobhit Gupta"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.269
    },
    {
        "id": 264920094,
        "title": "ICC Champions Trophy Row: Pakistan Provokes India, Cricket Board Announces Trophy Tour In PoK",
        "text": "Amid the uncertainty over the final schedule of the ICC Champions Trophy 2025, the Pakistan Cricket Board (PCB) in a provocative move against India, announced that it will conduct a tour with the Champions Trophy across the country. The announcement has raised eyebrows for the inclusion of areas in Pakistan-occupied Kashmir (PoK) on the list of destinations.\nThe announcement came in the backdrop of a big controversy, with BCCI making it clear that the Indian team will not travel to the neighbouring country due to strained ties and security concerns. Pakistan hold the hosting rights for the ICC Champions Trophy 2025\n“Get ready, Pakistan. The ICC Champions Trophy 2025 trophy tour kicks off in Islamabad on 16 November, also visiting scenic travel destinations like Skardu, Murree, Hunza and Muzaffarabad”, a post by PCB said on Thursday.\nWhy This Is Provocation From Pakistan\nWhat stood out in its social media messaging was the specific mention of Skardu, Hunza and Muzaffarabad, all of which are in PoK, a disputed region India claims as its own.\nThe Board of Control for Cricket in India (BCCI)’s refusal to play in Pakistan has irked PCB, which is currently run by Mohsin Raza Naqvi, who is also a federal minister.\nThe cold war has roiled the International Cricket Council (ICC)—and there have been reports that it is considering several formulas for avoiding a situation where the tournament is played without world cricket powerhouse India. A hybrid model where India play matches in the United Arab Emirates (UAE) has been in the news. So, have speculations over a complete change of venue and an indefinite postponement of the tournament. PCB, however, wants to go ahead without India. ICC, the world cricket governing, have yet to speak on the final venue.\nThe glittering trophy, meanwhile, has reached Islamabad from Dubai. The move to use PoK for provocation is from an old Pakistan playbook. It routinely invites foreign dignitaries for trips to PoK, a ploy that has drawn sharp Indian rebuttals time and again.\nEarlier, the global cricketing body cancelled a major event marking the 100-day countdown to the Champions Trophy, that was supposed to be announced on November 11 in Lahore, owing to the hiccups they have encountered in scheduling, especially India games.\nIndia Won’t Travel To Pakistan\nThe ICC has conveyed to the Pakistan Cricket Board (PCB) about India’s inability to travel to Pakistan for the Champions Trophy. The global cricketing body sent an email to PCB, mentioning that India has decided against travelling to their neighbouring country for the 8-team tournament.\n“The Pakistan Cricket Board has received an email from the ICC (International Cricket Council), stating that the Indian board has informed them that their team will not travel to Pakistan for the Champions Trophy 2025,” PCB spokesman Sami Ul Hasan was quoted as saying by AFP.\nThe BCCI has reportedly informed the global cricket body about the Indian government’s denial of permission to travel to Pakistan for the showpiece event.\nICC Champions Trophy Controversy\nPakistan is due to host the eight-nation event in three cities – Lahore, Rawalpindi and Karachi – from February 19 to March 9 next year but the final schedule was hanging in the balance with India yet to confirm its participation.\nEver since the ICC announced the 2025 Champions Trophy in Pakistan, there have been concerns over India’s participation in the marquee event given the diplomatic tensions between the two neighbouring countries. However, Pakistan travelled to India to play in the 2016 T20 World Cup and 2023 50-over World Cup.\nIndia and Pakistan have only faced off in ICC multi-nation events since their last bilateral series in the 2012-13 season. Pakistan did not host any international cricket between 2009 and 2015 after gunmen attacked the Sri Lanka team 15 years ago.",
        "summary": "The announcement came in the backdrop of a big controversy, with BCCI making it clear that the Indian team will not travel to the neighbouring country due to strained ties",
        "url": "https://www.news18.com/cricket/icc-champions-trophy-row-pakistan-provokes-india-cricket-board-announces-trophy-tour-in-pok-9121059.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/icc-champions-trophy-2024-10-97e29db092dc48a3ea83d5a433b7edee-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 04:45:45",
        "author": "News18,Shobhit Gupta",
        "authors": [
            "News18",
            "Shobhit Gupta"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.165
    },
    {
        "id": 265002116,
        "title": "Maharashtra Polls: Amit Shah Dares Rahul Gandhi to Laud Savarkar, Bal Thackeray",
        "text": "Union minister Amit Shah on Friday dared Congress leader Rahul Gandhi to speak “nicely” about Veer Savarkar and Shiv Sena founder Bal Thackeray.\n“Uddhav ji, if you have the courage, get Rahul Baba to speak two good words about Veer Savarkar and Balasaheb,” Shah said, addressing a rally at Hingoli in Maharashtra ahead of the November 20 assembly elections.\n“Rahul Baba’s Congress party has passed a resolution in Kashmir to bring back Article 370. Rahul Baba, listen carefully, not only you but even your fourth generation cannot bring back Article 370,” he said.\nShah said in the Haryana assembly elections, Rahul Gandhi had said with confidence that his party had won. “So much arrogance in a democracy. Look at the results, Congress was wiped out in Haryana and BJP formed the government,” he said.\nHe said Sonia Gandhi tried to launch her son 20 times. Her “Rahul plane” is going to crash for the 21st time in Maharashtra elections, he added.\nThe senior BJP leader said the Maharashtra polls will decide whether the state follows the path of Chhatrapati Shivaji Maharaj and Veer Savarkar or the path of Aurangzeb. The BJP-led Mahayuti has chosen the path of Shivaji Maharaj and Veer Savarkar, while the Maha Vikas Aghadi people are the Aurangzeb fan club, he said.\n“For 70 years, Congress obstructed the construction of Ram temple at Ayodhya, but Modi ji built it,” he said. “In Karnataka, the Wakf Board has declared villages, temples, farmers’ lands and people’s houses as wakf properties. We have brought a bill to amend the Waqf Act, but Sharad Pawar and Company is opposing this bill. You can oppose it as much as you want, but the Modi government will change the Waqf Act with full force.”",
        "summary": "Union minister Amit Shah said the Maharashtra polls will decide whether the state follows the path of Chhatrapati Shivaji Maharaj and Veer Savarkar or the path of Aurangzeb",
        "url": "https://www.news18.com/elections/maharashtra-polls-amit-shah-dares-rahul-gandhi-to-laud-savarkar-bal-thackeray-9121719.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/amit-shah-2024-11-7d694dff3982d7805a628ddd43e3a63e-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 12:23:12",
        "author": "News18,Oindrila Mukherjee",
        "authors": [
            "News18",
            "Oindrila Mukherjee"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.258
    },
    {
        "id": 265024632,
        "title": "Metro's First Train For Phase-IV Operation Reaches Delhi: DMRC",
        "text": "The first six-coach train for Delhi Metro’s Phase-IV expansion arrived here on Friday, a statement said.\nThe train set, manufactured by Alstom at its facility in Sricity near Chennai, was inaugurated on September 23 in the presence of Delhi Metro Railway Cooperation (DMRC) and Alstom delegates, the statement said.\nIt has now been stationed at Delhi Metro’s Mukundpur depot, where it will undergo a number of tests required for its statutory certification for revenue service as a part of established rules and protocols, it said.\nUnder the RS-17 contract, DMRC will be receive a total of 312 metro coaches (52 trains) for the Phase-IV priority corridors, i.e. Majlis Park to Maujpur, Janakpuri West to R K Ashram Marg and Tughlakabad to Delhi Aerocity. These trains will arrive in Delhi in phases over the coming days, it said.\nOut of the 312 coaches, 234 coaches are allocated for the extended sections of Pink and Magenta Lines, i.e. Majlis Park to Maujpur and Janakpuri West to R K Ashram Marg, while 78 coaches are for the Tughlakabad to Delhi Aerocity corridor, the statement said.\nAll these trains are designed for driverless operations, boosting the Delhi Metro’s efforts for providing world-class services to its commuters, and will give a fillip to the Make in India initiative of the government of India. These made-in-India trains are designed for a safe speed of up to 95 kmph and operational speed of up to 85 kmph, with GOA 4 driverless features, according to the statement. The Janakpuri West to RK Ashram Marg extension of the Magenta Line will get 144 new coaches (24 trains), the Mukundpur to Maujpur extension of the Pink Line will get 90 new coaches (15 trains), while the new Golden line corridor from Aerocity to Tughlakabad, will be provided with 78 new coaches (13 trains), it said.\nAs part of the Phase-IV expansion, DMRC is constructing 86 kilometres of new lines across five different corridors in the national capital. Three corridors — Janakpuri West to RK Ashram Marg, Majlis Park to Maujpur and Aerocity to Tughlakabad — are under construction, the other two new corridors, Lajpat Nagar to Saket-G Block and Indraprastha to Inderlok are in the pre-tendering stages, the statement said.\nCurrently, the Delhi Metro operates on a network of 392.4 kilometres with 288 metro stations (including the NOIDA – Greater NOIDA corridor and the Rapid Metro, Gurugram) with a fleet of about 350 Metro trains with four, six and eight coach combinations on both, broad gauge as well as standard gauge tracks, it said.\nThe first ever driverless operations in India, were commenced on the Delhi Metro network on Magenta Line in December 2020. Subsequently, driverless services were also extended on the Pink Line in November 2021, the statement added.",
        "summary": "The train set, manufactured by Alstom at its facility in Sricity near Chennai, was inaugurated on September 23 in the presence of Delhi Metro Railway Cooperation (DMRC) and Alstom delegates",
        "url": "https://www.news18.com/india/metros-first-train-for-phase-iv-operation-reaches-delhi-dmrc-9121928.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/09/whatsapp-image-2024-09-16-at-11.46.42-am-2024-09-33a099c0760f52c1b608268a00868253-16x9.jpeg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 14:05:57",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.041
    },
    {
        "id": 264996544,
        "title": "SC Directs Centre To Respond On Rehabilitation Framework Of Sex Trafficking Victims",
        "text": "The Supreme Court has said there is a legislative vacuum with regard to the establishment of a comprehensive rehabilitation framework for victims of sex trafficking.\nThe top court directed the Centre to consider the issue and file an affidavit regarding it.\n“Human and sex trafficking are crimes that dehumanises the victim and violates the victim’s right to life, freedom and personal security. Vulnerable sections of society, especially women and children, are disproportionately affected in such crimes,” said a bench of Justices J B Pardiwala and Pankaj Mithal.\nThe apex court said the victims of such crimes are often mistreated by their traffickers and have to endure physical and mental forms of violence that are inflicted upon them.\n“They stand at a greater risk of sustaining several life-threatening injuries and contracting infections and illnesses, including sexually transmitted diseases.\n“Additionally, the mental health consequences can range from anxiety disorders, Post Traumatic Stress Disorder (PTSD), depression and substance abuse as well,” the bench said.\nA majority of such victims may require continuous access to doctors and other mental health professionals who can tend to their specific needs, it added.\n“Alienation and ostracism by the larger society is also inherently associated with such crimes. Individuals who are trafficked are often abruptly alienated from their immediate family and other social groups due to the attribution of sentiments like guilt and shame on the victims,” the bench said.\n“This has the unfortunate consequence of them being further isolated, secluded and withdrawn from society. The crime is also of such nature that it seriously hampers the pursuit of further education and learning,” the bench added.\nThe top court was hearing a plea seeking compliance of a 2015 judgement on victims of sexual assault.",
        "summary": "The apex court said the victims of such crimes are often mistreated by their traffickers and have to endure physical and mental forms of violence that are inflicted upon them",
        "url": "https://www.news18.com/india/sc-directs-centre-to-respond-on-rehabilitation-framework-of-sex-trafficking-victims-9121735.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/supreme-court-of-india-2024-10-87de5457c9b22f0594adc9967fd84445-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 11:59:14",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.237
    },
    {
        "id": 264906228,
        "title": "Elon Musk Meets Iran UN Ambassador To Defuse Tension Under Trump: Report",
        "text": "Elon Musk, the tech billionaire closely allied with US President-elect Donald Trump, met Iran’s ambassador to the United Nations in a bid to defuse tensions between Tehran and Washington, The New York Times reported Thursday.\nThe newspaper quoted anonymous Iranian sources as describing the meeting between the world’s richest person and Ambassador Amir Saeid Iravani as “positive.”\nThe two met for more than an hour at a secret location on Monday, the newspaper said.\nNeither the Trump transition team nor Iran’s mission to the United Nations immediately confirmed the encounter, with the Iranian mission saying it had no comment.\nThe meeting, if confirmed, could offer an early indication that Trump is serious about diplomacy with Iran and not choosing the more hawkish approach favored by many conservatives in his Republican Party as well as Israel.\nIt would also show again the extraordinary influence of Musk, the owner of Tesla and X who has been a near constant presence at Trump’s side, reportedly joining him on telephone calls with world leaders.\nTrump in his last term in office tore up a deal on Iran’s nuclear program negotiated under his predecessor Barack Obama, instead pursuing a policy of “maximum pressure” that included working to force other nations not to buy Iran’s oil.\nBut Trump has cast himself as a great dealmaker and during his latest campaign has voiced an openness to diplomacy, despite his avowed support for Israeli Prime Minister Benjamin Netanyahu, who has ordered military strikes on Iran in tandem with Israel’s war on Hamas.\nIranian President Masoud Pezeshkian, considered a moderate within the clerical state, on Thursday told the visiting head of the UN nuclear watchdog that Tehran wanted to clear up doubts about the country’s “peaceful” nuclear program.\nIran’s ambassador also urged Musk in their meeting to seek US sanctions exemptions and conduct business in Tehran, the Times said, citing an Iranian Foreign Ministry official.\nAlong with foreign policy, Trump has put Musk and another wealthy entrepreneur, former Republican presidential candidate Vivek Ramaswamy, in charge of a new “Department of Government Efficiency” tasked with overhauling the federal bureaucracy.\nThe new initiative has raised questions about conflicts of interest given the extensive interactions between Musk’s businesses and the government.\nAn account for the program has been created on X, formerly Twitter, where it asked applicants to apply through a direct message.\n“We need super high-IQ small-government revolutionaries willing to work 80+ hours per week on unglamorous cost-cutting,” said a post on X, adding that “Elon & Vivek will review the top 1% of applicants.”",
        "summary": "Neither the Trump transition team nor Iran's mission to the United Nations immediately confirmed the encounter",
        "url": "https://www.news18.com/world/elon-musk-meets-iran-un-ambassador-to-defuse-tension-under-trump-report-9120979.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/07/untitled-design-11-2024-07-44440e66a731037a1e621107d2da1960-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 01:56:34",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.048
    },
    {
        "id": 264995294,
        "title": "UK PM Starmer's Office Apologises For 'Mistake' After Meat, Alcohol Served At Diwali Reception",
        "text": "Prime Minister Keir Starmer’s office on Friday apologised for a “mistake” in the organisation of its Diwali reception at 10 Downing Street after some British Hindus objected to non-vegetarian food and alcohol being served at the gathering.\nWhile the statement did not make a direct reference to the menu, a spokesperson for Starmer’s office said the team acknowledged the strength of feeling on the issue and assured the community that it would not be repeated in future.\n“The Prime Minister was pleased to welcome a range of communities celebrating Diwali to a reception in Downing Street,” a Downing Street spokesperson said.\n“He paid tribute to the huge contribution the British Hindu, Sikh and Jain communities make to our country and how the government is driven by the shared values of hard work, ambition and aspiration. A mistake was made in the organisation of the event,” the spokesperson said.\n“We understand the strength of feeling on this issue and so would apologise to the community and assure them it will not happen again,” the spokesperson added.\nBritish-Indian MP Expresses ‘Disappointment’\nThe statement came a day after British Indian Conservative Party MP Shivani Raja issued a formal letter to Starmer expressing concerns over the reception not being “in keeping with the customs of many Hindus”.\n“I feel it speaks poorly against the organisation of this year’s event – with a disappointing lack of knowledge of the customs and traditions that many British citizens hold dear,” reads her letter posted on social media.\n“As a practising Hindu representing thousands of Hindus within my own constituency of Leicester East, I have been deeply saddened to hear that this year’s festivities were overshadowed in the greatest Office of State by negativity, as a result of this oversight,” said the first-time Tory member of Parliament elected in July from the city of Leicester.\nThe Opposition MP went on to offer her “assistance and guidance” to the Labour Party government for all future Hindu celebrations to ensure they are celebrated in a “respectful manner”.\nThe Downing Street event held on October 29 marked the first Diwali reception since Labour was elected to government in the general election four months ago. It brought together British Indian community leaders, professionals and parliamentarians. However, community organisation Insight UK questioned the “appalling lack of understanding” of the spiritual aspect of the Hindu festival and a few others pointed out that greater consultation is required ahead of such religious events after reports emerged of meat and alcohol being served at the gathering.\nThe reception has been held regularly over the years at Downing Street and insiders indicated Starmer was keen to follow in the footsteps of Rishi Sunak as the first British Hindu Prime Minister of Britain and light candles on the doorstep of 10 Downing Street to mark Diwali.\n“We value and respect your heritage and traditions, and recognise the strength of our shared values and the celebration of Diwali – a time of coming together, of abundance, and welcome,” read excerpts released from Starmer’s address at the event.",
        "summary": "The Diwali Party hosted by PM Keir Starmer at 10 Downing Street served lamb kebabs and wine, sparking uproar from British Indian Hindus.",
        "url": "https://www.news18.com/world/uk-pm-starmers-office-apologises-for-mistake-after-meat-alcohol-served-at-diwali-reception-9121715.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/keir-starmer-2024-11-12db0a09800cca14a809674e10506cf7-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 11:52:04",
        "author": "Aveek Banerjee,News18",
        "authors": [
            "Aveek Banerjee",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.211
    },
    {
        "id": 265000728,
        "title": "News18 Evening Digest: ICC Denies PCB To Conduct Champions Trophy Tour In PoK Territory & Other Top Stories",
        "text": "In today’s evening digest, News18 brings you the latest updates on the Jharkhand and Maharashtra assembly elections, the ICC’s decision on the 2025 Champions Trophy, and more top stories.\nICC Denies PCB To Conduct Champions Trophy Tour In PoK Territory: Reports\nAfter the Pakistan Cricket Board (PCB) announced a trophy tour of the 2025 Champions Trophy, covering the three cities of ‘Pakistan occupied Kashmir’, the International Cricket Council (ICC) has reportedly denied the hosts to conduct a tour in the disputed PoK region. READ MORE \nAjit Pawar Objects To ‘Batenge Toh Katenge’ Slogan, Fadnavis Sends Him A Rejoinder\nAhead of the Maharashtra assembly elections, “Batenge toh katenge,” a slogan coined by Uttar Pradesh Chief Minister Yogi Adityanath, has become a major point of contention among Mahayuti partners, with the NCP opposing it. READ MORE \nPM Modi’s Aircraft Faces Technical Snag in Jharkhand, Return To Delhi Delayed\nA Delhi-bound aircraft carrying Prime Minister Narendra Modi faced a technical snag at Jharkhand’s Deoghar Airport on Friday, causing a delay in his return to the national capital, said officials aware of the matter. READ MORE \n‘BJP Believes In Fair Elections…’: Amit Shah’s Chopper Inspected By Poll Officials In Maharashtra\nAmid allegations that only opposition members are thoroughly checked in view of the assembly elections in Maharashtra, Union Home Minister Amit Shah on Friday said his helicopter and bags were inspected at Hingoli. READ MORE \nDonald Trump Cabinet Appointments So Far: Loyalists, Firebrands, Stalwarts\nDonald Trump, who is now the President-elect of the United States, is handing top roles for his future White House to a mix of political allies, firebrands and a few relatively conventional figures. Following his election victory over Vice President Kamala Harris, Trump, each day is making a flurry of picks for his cabinet and other high-ranking administration positions. READ MORE \nSalman Khan Talks About Aishwarya’s Marriage With Abhishek In Viral Video: ‘Itne Saal Beet Gaye…’\nAishwarya Rai, who is currently married to Abhishek Bachchan, was reportedly previously in a romantic relationship with Salman Khan. It is said that Aishwarya and Salman ended their relationship in 2002. While the two have never very openly spoken about their dating life, Salman once appeared on Aap Ki Adalat when he talked about Aishwarya’s marriage with Abhishek. READ MORE",
        "summary": "We are also covering: PM Modi’s Aircraft Faces Technical Snag in Jharkhand; Ajit Pawar Objects To 'Batenge Toh Katenge' Slogan, among other stories",
        "url": "https://www.news18.com/india/news18-evening-digest-icc-denies-pcb-to-conduct-champions-trophy-tour-in-pok-territory-9121749.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/icc-champions-trophy-2024-10-97e29db092dc48a3ea83d5a433b7edee-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-15 12:14:38",
        "author": "News18,Yimkumla Longkumer",
        "authors": [
            "News18",
            "Yimkumla Longkumer"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.147
    }
]