[
    {
        "id": 263978752,
        "title": "'Hopefully He Will Be...': Gautam Gambhir On Rohit Sharma's Availability For 1st Test Against Australia",
        "text": "Indian men’s cricket team head coach Gautam Gambhir has said he is hopeful about Indian captain Rohit Sharma’s availability for the first Test against Australia, which is set to take place at Optus Stadium in Perth from November 22.\nWhile speaking to reporters in the pre-departure press conference for the Border-Gavaskar Trophy in Mumbai on Monday (November 11), Gambhir said as of now there is no confirmation, but he is hoping that he will be available.\n“At present there is no confirmation on Rohit; hopefully he will be available. We will get to know before the start of the first Test,” Gambhir said.\nAccording to Gambhir, if Rohit misses the series opener, then KL Rahul or Abhimanyu Easwaran could open the innings for the visitors.",
        "summary": "India's head coach, Gautam Gambhir, has provided a big update about Indian captain Rohit Sharma's availability for the first Test against Australia.",
        "url": "https://www.news18.com/cricket/hopefully-he-will-be-gautam-gambhir-on-rohit-sharmas-availability-for-1st-test-against-australia-9115821.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/gautam-gambhir-rohit-sharma-2024-11-d853e3621ce7edece18b3c630ba7e417-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 03:59:42",
        "author": "Harshit Bisht,News18",
        "authors": [
            "Harshit Bisht",
            "News18"
        ],
        "language": "en",
        "category": "sports",
        "source_country": "in",
        "sentiment": -0.386
    },
    {
        "id": 264019048,
        "title": "Zomato Launches Food Rescue Feature; How To Book Cancelled Orders At A Discount",
        "text": "Zomato has rolled out a new feature for users in India which aims to minimise food wastage caused by cancelled orders. This feature, announced by Zomato CEO Deepinder Goyal on Twitter, allows customers near a cancelled order’s original delivery route to claim the food at a significant discount, provided it’s still in its untampered, original packaging.\n“We don’t encourage order cancellation at Zomato, because it leads to a tremendous amount of food wastage. In spite of stringent policies, and a no-refund policy for cancellations, more than 4 lakh perfectly good orders get canceled on Zomato, for various reasons by customers,” he Goyal on X.\nThe cancelled orders will be made available for a short time period (to ensure freshness) in their original untampered packaging. Customers will now be able to grab the order at an ‘unbeatable price’ and receive it within minutes. Food Rescue will automatically show up on the app home page if there is indeed a canceled order available.\nGoyal said most restaurants affiliated with the food aggregator platform had agreed to the change. Restaurant partners will now receive compensation for the original canceled order as well as a portion of the amount paid by the new customer if the order gets claimed. The eateries will also be able to easily opt out of the initiative if they wished to make a change.\n“Zomato will not keep any proceeds (except the required government taxes). The amount paid by the new customer will be shared with the original customer (if they made payment online), and with the restaurant partner. Orders containing items sensitive to distances or temperature such as ice creams, shakes, smoothies, and certain perishable items, will not be eligible for Food Rescue,” Goyal clarified.\n\nWe don’t encourage order cancellation at Zomato, because it leads to a tremendous amount of food wastage.\nInspite of stringent policies, and and a no-refund policy for cancellations, more than 4 lakh perfectly good orders get canceled on Zomato, for various reasons by customers.… pic.twitter.com/fGFQQNgzGJ\n— Deepinder Goyal (@deepigoyal) November 10, 2024\n\nHow Does It Work?\nWith Food Rescue, customers within a 3km radius of a delivery partner carrying a cancelled order will see it appear on their app’s home screen, available to “rescue” at a reduced price. This listing will remain visible for only a few minutes to ensure the order’s freshness. Orders with temperature-sensitive items such as ice creams, smoothies, or items that could degrade in quality during transit will be excluded from this program.\nTo assure that the initiative supports those impacted financially by cancellations, Zomato has arranged that any payment from new customers claiming a rescued order will be divided between the original customer (if prepaid) and the restaurant, while Zomato itself takes no proceeds beyond necessary taxes.\nRestaurants, compensated for the original order, will additionally receive a portion of the resale amount. Delivery partners are fully paid for both the initial pickup and any redelivery required, ensuring no loss in their earnings.\nAddressing why the food isn’t simply donated, Goyal noted logistical and legal obstacles: “Most places where we can distribute them are away from urban centers, and distributing free food to the needy is fraught with liability challenges.” Thus, Zomato has limited the initiative to orders that were already en route.\nThe Food Rescue feature is now being gradually rolled out across the Zomato app, allowing users to refresh their home page and view any nearby cancelled orders that are available to claim.",
        "summary": "Zomato has rolled out a new feature for users in India which aims to minimise food wastage caused by cancelled orders",
        "url": "https://www.news18.com/business/zomato-launches-food-rescue-feature-how-to-book-cancelled-orders-at-a-discount-9116250.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-2024-10-24t173711.739-2024-10-ee3c9b9a715b605db87833983dfb98c1-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 09:00:55",
        "author": "Aparna Deb,News18",
        "authors": [
            "Aparna Deb",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.072
    },
    {
        "id": 263985980,
        "title": "What Is Sanjiv Khanna's New Salary As CJI? Full Text Of Oath And Other Details",
        "text": "Justice Sanjiv Khanna took oath as the new Chief Justice of India (CJI) on Monday. Justice Khanna succeeds Justice DY Chandrachud, who retired on Sunday, and his term will last until May 13, 2025. Justice Khanna will serve as the 51st CJI of the country for the next six months, after which he will retire.\nThe Centre officially notified Justice Khanna’s appointment on October 24 following Chief Justice Chandrachud’s recommendation on October 16. Friday was the last working day of Justice Chandrachud as the CJI and he was given a rousing farewell by judges, lawyers and staff of the apex court and the high courts.\nJustice Khanna, who served as a Supreme Court judge since January 2019, has been part of several landmark judgements such as upholding the sanctity of EVMs, scrapping the electoral bonds scheme, upholding the abrogation of Article 370 and the grant of interim bail to former Delhi CM Arvind Kejriwal.\nHailing from an illustrious Delhi-based family, Justice Khanna is the son of former Delhi High Court judge Justice Dev Raj Khanna and the nephew of prominent former apex court judge HR Khanna.\nJustice Sanjiv Khanna, who was elevated as a judge of the Supreme Court on January 18, 2019, was a third-generation lawyer before being appointed as judge of the High Court.\nThe new CJI was administered the oath of office as mentioned in the Constitution mentioned under Part 4 of the Third Schedule. President Droupadi Murmu administered the oath of office at Rashtrapati Bhavan in a ceremony at 10am.\nThis is the oath of office of the CJI:\n“I, (Name), having been appointed Chief Justice (or a Judge) of the Supreme Court of India (or Comptroller and Auditor-General of India) do swear in the name of God/solemnly affirm that I will bear true faith and faith and allegiance to the Constitution of India as by law established, 1 [that I will uphold the sovereignty and integrity of India, that I will duly and faithfully and to the best of my ability, knowledge and judgment perform the duties of my office without fear or favour, affection or ill-will and that I will uphold the Constitution and the laws.”\nWhat is the retirement age of the CJI?\nThere are a total of 33 judges in the Supreme Court, including the Chief Justice of India. All these judges hold their posts till the age of 65 following which they retire.\nWhat is the salary of the Chief Justice of India?\nThe Chief Justice of India is paid a salary of Rs 2.8 lakh per month. Other judges of the Supreme Court are paid Rs 2.5 lakh. Judges of all the High Courts of the country are also paid Rs 2.5 lakh per month. Apart from this, other judges of the High Court are paid Rs 2.25 lakh per month as salary.",
        "summary": "Justice Khanna who has been a Supreme Court judge since January 2019, has contributed to several key rulings including EVM integrity, electoral bonds, abrogation of Article 370, and interim bail for Delhi's former Chief Minister Arvind Kejriwal",
        "url": "https://www.news18.com/india/what-is-sanjiv-khannas-new-salary-as-cji-full-text-of-oath-and-other-details-9115909.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/justice-sanjeev-khanna-2024-11-9141a0e88c755c0686628418c25f925c-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 05:12:45",
        "author": "News18,Satyaki Baidya",
        "authors": [
            "News18",
            "Satyaki Baidya"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.061
    },
    {
        "id": 263983466,
        "title": "CJI Sanjiv Khanna Takes Oath: Electoral Bonds To Article 370, Key Cases He Ruled On As SC Judge",
        "text": "Justice Sanjiv Khanna took oath as the 51st Chief Justice of India (CJI) on Monday, succeeding CJI DY Chandrachud. President Droupadi Murmu administered the oath of office to Justice Khanna at the Rashtrapati Bhavan today.\nJustice Khanna, 64, will serve a six-month tenure as the Chief Justice of India and will retire on May 13, 2025.\nAs Supreme Court judge, Justice Khanna has been part of several landmark judgments including the ones of electoral bonds, abrogation of Article 370 in Jammu and Kashmir and Electronic Voting Machines (EVMs).\nEarly Life And Career\nBorn on May 14, 1960 to late Justice Dev Raj Khanna, former Judge of Delhi High Court, 64-year-old Justice Khanna completed his schooling at Delhi’s Modern School, Barakhamba Road. He later studied law at the Campus Law Centre of Delhi University and enrolled as an advocate with the Bar Council of Delhi in 1983. He initially practiced in the district courts at the Tis Hazari complex in the national capital and, later, in the Delhi High Court.\nJustice Khanna has served on tribunals in diverse fields like constitutional law, direct taxation, arbitration, commercial law, company law, land law, environmental law and medical negligence. He has held a long tenure as the senior standing counsel for the income tax department.\nJustice Khanna was appointed as the standing counsel (civil) for the National Capital Territory (NCT) of Delhi in 2004.\nIn 2005, he was elevated as an additional judge of the Delhi HC and made permanent in 2006. As a judge in that high court, he has held the position of chairman/judge-in-charge of the Delhi Judicial Academy, Delhi International Arbitration Centre and the District Court Mediation Centres.\nJustice Khanna is reportedly among the few judges elevated to the SC even before becoming a Chief Justice of any high court. He was elevated to the Supreme Court on January 18, 2019.\nCases as Supreme Court judge\nAs Supreme Court judge, Justice Khanna has been part of landmark cases.\nArticle 370: In 2023, Justice Sanjiv Khanna was part of the five-judge bench that upheld the abrogation of Article 370 in Jammu and Kashmir. Justice Khanna in his ruling said that Article 370 was an element of asymmetric federalism, not sovereignty, and its removal does not compromise India’s federal structure.\nElectoral Bonds: In 2024, Justice Khanna was on the five-judge bench that declared electoral bonds unconstitutional. Justice Khanna in his ruling said donor privacy does not extend to donations made through banking channels, highlighting that donor identities are “asymmetrically known” to the bank officers handling the bonds.\nVerification of VVPAT: In 2024, Justice Khanna led a Division Bench that dismissed the plea that sought 100 per cent VVPAT verification of Electronic Voting Machine (EVM) votes. In his ruling, he noted the current system provided “michief-free” counting of votes.\nInterim bail to Delhi CM Arvind Kejriwal: Earlier this year, Justice Khanna was on the bench that granted interim bail to former Delhi Chief Minister Arvind Kejriwal, following which he could campaign for the 2024 Lok Sabha elections.",
        "summary": "As Supreme Court judge, Justice Khanna has been part of several landmark judgments including the ones of electoral bonds, abrogation of Article 370 in Jammu and Kashmir and more.",
        "url": "https://www.news18.com/india/cji-sanjiv-khanna-takes-oath-electoral-bonds-to-article-370-key-cases-he-ruled-on-as-sc-judge-9115892.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/mixcollage-11-nov-2024-07-42-am-4617-2024-11-6d55d51834fcaec7c867e2ba64e9467d-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 04:46:57",
        "author": "News18,Pragati Ratti",
        "authors": [
            "News18",
            "Pragati Ratti"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.295
    },
    {
        "id": 264055914,
        "title": "Yogendra Yadav Criticises Air India Over ‘Very Sad Experience’, Airline Responds",
        "text": "Political activist Yogendra Yadav has recounted his ‘sad experience’ with Air India. In his post on X, Yadav opened up about what he and his wife had to go through. Yadav mentioned that he typically avoids posting about personal grievances on public platforms but felt compelled to share this particular experience as “it may be of use to others.”\nYadav detailed several issues that occurred during his flight beginning with a last-minute change to the flight’s timing which was about a four-hour delay and that was only communicated four days in advance. He also mentioned the downgrade in their class of travel without any advance notice and no offer of a refund. Furthermore, despite repeated attempts, he was unable to complete the web check-in as his booking was flagged as “ineligible.”\nYadav added that he and his wife had to visit three different counters at the airport for check-in. The situation worsened when a customer service executive was particularly rude and refused to arrange seats for them together. A counter supervisor finally rearranged their seating.\n“When I wanted to complain, I was first told that there is no complaints book (which they found when I insisted) and could not give an email ID for complaints,” Yadav added.\n“I am not listing minor issues like discrepancy between Gate announced and actual gate of boarding, poor management of lines, faulty announcements etc. I should mention that the floor supervisor did offer a polite apology. All in all a very sad experience,” he concluded.\nTake a look at the post here:\n\nI hate to put my personal travails on a public platform. But today’s experience with @airindia is worth recording, for it may be of use to others. Do others have similar recent experience with Air India?\nThis is what my wife and I went through (flight AI 213):Change in time of…\n— Yogendra Yadav (@_YogendraYadav) November 11, 2024\n\nAir India responded to Yadav’s post with an apology: “Dear Mr. Yadav, we sincerely apologise for the inconvenience caused. We’re addressing this on priority and will get back to you at the earliest.”\n\nDear Mr. Yadav, we sincerely apologize for the inconvenience caused. We're addressing this on priority and will get back to you at the earliest.\n— Air India (@airindia) November 11, 2024\n\nYadav’s post sparked a heated debate among social media users, many of whom also criticised the airline.\nOne user commented, “Customer Care in India doesn’t exist, forget customer delight.”\n\nCustomer Care in India doesn't exist, forget customer delight.\n— Manoj Arora (@manoj_216) November 11, 2024\n\n“This is unfortunate and terrible! There is no concept of customer service in India. Whether it is airlines, banks, or anywhere. Shameful!” someone remarked.\n\nThis is unfortunate and terrible! There is no concept of customer service in India. Whether it is airlines, banks, or anywhere. Shameful! https://t.co/gXbBy8XuFv\n— Firoza Daruwala (@firozadaruwala) November 11, 2024\n\nAnother comment read, “It’s sad that Air India has become synonymous with horrible service, employees who are bored and disinterested and frustrated with their travel experience,” another said.\n\nIt’s sad that Air India has become synonymous with horrible service, employees who are bored and disinterested and frustrated travel experience\n— Monica Jasuja (@jasuja) November 11, 2024\n\nLastly, one user pointed out, “Poor customer service and lack of communication isn’t new. Customer satisfaction rarely gets taken care of in our country.”\n\nPoor customer service and lack of communication isn't new. Customer satisfaction rarely gets taken care of in our country.\n— CA Akhil Agarwal (@InvestWithAkhil) November 11, 2024\n\nThe post has received over 2.5 lakh views so far.",
        "summary": "Political activist Yogendra Yadav recently shared his frustrating experience with Air India on social media.",
        "url": "https://www.news18.com/viral/yogendra-yadav-criticises-air-india-over-very-sad-experience-airline-responds-9116557.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/untitled-design-2024-11-11t172913.849-2024-11-6aefe1b77827094d16ce84fab999e146-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 11:59:45",
        "author": "News18,Sahas",
        "authors": [
            "News18",
            "Sahas"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.769
    },
    {
        "id": 263980812,
        "title": "What Does Ponting Has To Do With Indian Cricket? Gambhir Slams Ex-AUS Captain Over Comments On Virat Kohli",
        "text": "Indian men’s cricket team head coach Gautam Gambhir slammed former Australian captain Ricky Ponting for his recent comments on star Indian batter Virat Kohli. Ponting, who is Australia’s leading run scorer in Tests and ODIs, commented on Kohli’s form saying that any other player wouldn’t have survived in the team had he scored just two hundreds in five years.\nWhen asked about Ponting’s comments during India’s pre-departure press conference for Border-Gavaskar Trophy in Mumbai on Monday (November 11), Gambhir said, “What does Ponting to has to do with Indian cricket? I think he should think about Australian cricket and more importantly have got no concerns whatsoever for Virat and Rohit. I think they are incredibly tough men. They’ve achieved a lot for Indian cricket and they will continue to achieve a lot in future as well. I think for me, the most important thing is that they still work really hard and they still passionate, they still want to achieve a lot more and that is something which is very important. The hunger in that dressing room is incredibly important for me. And for the entire group of people as well in that dressing in dressing rooms. And I feel there is a lot of hunger and especially after what has happened in the last series.”",
        "summary": "Ponting recently commented on Kohli's form saying that any other player wouldn't have survived in the team had he scored just two hundreds in five years.",
        "url": "https://www.news18.com/cricket/what-does-ponting-has-to-do-with-indian-cricket-gambhir-slams-ex-aus-captain-over-comments-on-virat-kohli-9115867.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/rohit-sharma-virat-kohli-gautam-gambhir-ajit-agarkar-2024-11-05a34f183f23cce41a5b889e52c692bd-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 04:23:24",
        "author": "Harshit Bisht,News18",
        "authors": [
            "Harshit Bisht",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.178
    },
    {
        "id": 263996750,
        "title": "Swiggy IPO Allotment Today: A Step-by-Step Guide to Check Allotment Status Online, Know Latest GMP",
        "text": "Swiggy IPO Allotment Today, Listing Date: The Swiggy IPO allotment is set to be finalised on Monday, probably in the evening. Once allotted, investors will received bank debit messages. They can also check the IPO allotment status online on the websites of BSE and NSE, as well as on Link Intime India’s portal. However, its GMP remains below 1 per cent, indicating a subdued listing on November 13.\nThe initial public offering, which was opened for public subscription between November 6 and November 8, received a 3.59 times subscription garnering bids for 57.53 crore shares as against the 16.01 crore shares on offer.\nThe shares of Swiggy are scheduled to be listed on both BSE and NSE on November 13.\nThe allotment status can be checked online on the websites of BSE and NSE, as well as on the registrar Link Intime India’s portal.\nSwiggy IPO: How to Check Allotment Status?\nOnce the IPO allotment is finalised, the status can be checked by following these steps:\n1) Go to the official BSE website via the URL —https://www.bseindia.com/investors/appli_check.aspx.\n2) Under ‘Issue Type’, select ‘Equity’.\n3) Under ‘Issue Name’, select ‘Swiggy Ltd’ in the dropbox.\n4) Enter your application number, or the Permanent Account Number (PAN).\n5) Then, click on the ‘I am not a robot’ to verify yourself and hit ‘Search’ option.\nYour share application status will appear on your screen.\nYou can also visit direct Link Intime India Pvt Ltd’s portal — https://linkintime.co.in/initial_offer/public-issues.html and check the Swiggy IPO allotment status.\nSwiggy IPO GMP Today\nAccording to market observers, unlisted shares of Swiggy Ltd continue to trade at just Rs 1 higher in the grey market than its issue price. The Rs 1 grey market premium or GMP means the grey market is expecting a muted listing or discount listing.\nThe GMP is based on market sentiments and keeps changing. ‘Grey market premium’ indicates investors’ readiness to pay more than the issue price.\n“On October 29, the GMP stood at Rs 25 (6.4 per cent), but it has since dropped significantly to 0.26 per cent. This decline can be attributed to the recent correction in benchmark indices and the prevailing negative market sentiment. However, Swiggy’s CFO has noted that the October volatility was factored into their pricing strategy,” said Gaurav Garg, research analyst at Lemonn Markets Desk.\nSwiggy IPO: More Details\n“Generally, pure-play companies in the market are awarded a premium. Until now, Zomato was the sole listed player in the quick commerce and food delivery space. With Swiggy’s listing, this premium may diminish, potentially leading to an overall valuation correction across the industry,” Garg added.\nThe Swiggy IPO is a combination of a fresh issue of shares worth Rs 4,500 crore and an offer for sale (OFS) of Rs 6,800 crore, they added.\nThose selling shares in the OFS route are — Accel India IV (Mauritius) Ltd, Apoletto Asia Ltd, Alpha Wave Ventures, LP, Coatue PE Asia XI LLC, DST EuroAsia V B.V, Elevation Capital V Ltd, Inspired Elite Investments Ltd, MIH India Food Holdings B.V, Norwest Venture Partners VII-A Mauritius and Tencent Cloud Europe B.V.\nEarly investors like Accel, Elevation Capital and Norwest Ventures are making up to 35 times in returns on the portion they decided to sell. On the other hand, SoftBank continues to stay invested.\nBig investors including Norway’s sovereign wealth fund Norges and Fidelity have placed bids worth more than $15 billion in the Swiggy IPO, 25 times the $605 million portion reserved for such investors, according to Reuters.\nGoing by the IPO papers, proceeds from the fresh issue to the tune of Rs 137.41 crore will be used for debt payment of subsidiary Scootsy.\nAdditionally, Rs 982.40 crore will be invested in Scootsy for expanding the Dark Store network in the quick commerce segment, with Rs 559.10 crore allocated for setting up dark stores and Rs 423.30 crore for lease or licence payments.\nThe company will also invest Rs 586.20 crore in technology and cloud infrastructure, Rs 929.50 crore for brand marketing and business promotion, and funds will be allocated for inorganic growth and general corporate purposes.\nFounded in 2014, Swiggy had a valuation of nearly USD 13 billion in April. The company’s annual revenue stood at USD 1.09 billion as on March 31, 2023, and has more than 4,700 employees, according to Tracxn, a global startup data platform.\nSwiggy’s confidential offer document was approved by Sebi in September and following this updated draft papers were filed.",
        "summary": "Unlisted shares of Swiggy Ltd continue to trade at just Rs 1 higher in the grey market than, indicating a muted listing or discount listing.",
        "url": "https://www.news18.com/business/ipo/swiggy-ipo-allotment-today-a-step-by-step-guide-to-check-allotment-status-online-know-latest-gmp-9116075.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/10/swiggy-2024-10-00f862cf775f740761fe4bdcfd7811d0-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 06:44:26",
        "author": "Mohammad Haris,News18",
        "authors": [
            "Mohammad Haris",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.114
    },
    {
        "id": 264022348,
        "title": "'Completely Untrue': Russia Denies Trump's Conversation With Putin",
        "text": "The Kremlin on Monday denied a US media report about a conversation between US President-elect Donald Trump and Russian President Vladimir Putin on Ukraine, calling it “completely untrue” and “false information”.\nThis is a breaking story. More details awaited.",
        "summary": "",
        "url": "https://www.news18.com/world/completely-untrue-russia-denies-trumps-conversation-with-putin-9116299.html",
        "image": "https://images.news18.com/ibnlive/uploads/2021/07/1627642197_news18_breaking_news-1600x900.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 09:18:03",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.929
    },
    {
        "id": 263979496,
        "title": "Gautam Gambhir Confirms Bumrah Will Lead India If Rohit Misses 1st Test Against Australia",
        "text": "Indian men’s cricket team head coach Gautam Gambhir has confirmed that star pacer Jasprit Bumrah will lead the Indian team in the first Test against Australia if Rohit Sharma misses it due to personal reasons.\nWhile speaking to reporters in the pre-departure press conference for the Border-Gavaskar Trophy in Mumbai on Monday (November 11), Gambhir said, “Bumrah is vice captain; if Rohit is not available, he is going to be lead in Perth.”\nThe first Test between India and Australia is scheduled to take place at Optus Stadium in Perth from November 22 onwards.",
        "summary": "The first Test of the 2024-25 edition of the Border-Gavaskar Trophy is scheduled to take place at Optus Stadium in Perth from November 22.",
        "url": "https://www.news18.com/cricket/gautam-gambhir-confirms-bumrah-will-lead-india-if-rohit-misses-1st-test-against-australia-9115866.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/jasprit-bumrah-2024-11-09daf51eaa13fa73920887114ea65899-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 04:07:15",
        "author": "Harshit Bisht,News18",
        "authors": [
            "Harshit Bisht",
            "News18"
        ],
        "language": "en",
        "category": "sports",
        "source_country": "in",
        "sentiment": -0.207
    },
    {
        "id": 263986630,
        "title": "One Dead, Many Injured In Tuskegee University Shooting",
        "text": "Champions Trophy\n\nNavjot Singh Sidhu\n\nAishwarya Rai\n\nCJI Chandrachud\n\nGautam Gambhir\n\nNews / Videos /One Dead, Many Injured In Tuskegee University Shooting\n\nOne Dead, Many Injured In Tuskegee University Shooting\n\nLast Updated: November 11, 2024, 10:48 IST\n\nBreaking News\n\nOne dead, several injured in a shooting at Tuskegee University in Alabama, no arrests made yet",
        "summary": "One dead, several injured in a shooting at Tuskegee University in Alabama, no arrests made yet",
        "url": "https://www.news18.com/videos/breaking-news/tuskegee-university-shooting-kills-one-9115978.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/whatsapp-image-2024-11-11-at-10.45.11-2024-11-52442e9e2730dcb5ca5b816841bcfb7a.jpeg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 05:18:02",
        "author": "News18",
        "authors": [
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.118
    },
    {
        "id": 264001152,
        "title": "National Education Day: Need For Sports To Be Given Importance In Academic Curriculum",
        "text": "All work and no play seems like a dreadful proposition, right? Regardless of our age, what we do, and where we are, we cannot deny the importance of staying physically active and striving toward a state of optimal health. The proclivity towards fitness however should be developed early. This is why sports must complement academics so that the former takes care of physical development while the latter offers mental and intellectual replenishment. Together they make a learner balanced, well-rounded, and more capable of handling the challenges that life may throw.\nBy integrating sports with regular, conventional curricula, a school can introduce a plethora of multifaceted skills to learners. By participating in sports, young learners can understand the importance of discipline, the criticalities of teamwork, and the importance of working in collaboration to achieve specific goals. It is through sports that they imbibe the essence of leadership where they have specific and tangible goals to aspire to and specific results to obtain. Time management is another invaluable skill that is learned through sports where learners develop and enhance their productivity within a stipulated time frame. Needless to say, all these qualities are extremely pertinent for the personal and professional success of individuals.\nThe combination of sports and academics is also very fruitful for the achievement of not just physical but mental health. Challenges faced by young people today are myriad and mental health problems have become a far too common malaise. Resilience is a skill that is non-negotiable today and indulging in sports allows young people to tap into their inner reservoir of strength, allowing them to resurface with renewed vigor after a setback.\nSchools are where young learners spend the most part of their formative years. It is in schools that they should get the opportunity to explore the innumerable benefits of dabbling in sports. In addition to this, the schools also have the responsibility to nurture innate sports talent that could potentially bring laurels and glory to the nation.\nIndian athletes and sportspersons have brought great plaudits to the nation and over the decades, sports infrastructure has grown exponentially. It is imperative to offer a variety of sports to students so that they can make organic choices about what resonates most with them. The inclusion of sports in educational philosophy enriches the holistic, well-rounded development of individuals and empowers them to be capable and confident.\n— Authored by Abhishek Mohan Gupta, Founder and President of the Board of Management at Shrewsbury International School India.",
        "summary": "Sports must complement academics so that the former takes care of physical development while the latter offers mental and intellectual replenishment",
        "url": "https://www.news18.com/education-career/national-education-day-need-for-sports-to-be-given-importance-in-academic-curriculum-9116037.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/09/school-holidays-2024-09-6adf0841f35220007f47757e9a3e6a3a-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 07:16:11",
        "author": "News18,Sukanya Nandy",
        "authors": [
            "News18",
            "Sukanya Nandy"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.378
    },
    {
        "id": 263995148,
        "title": "Beware! Typing These 6 Words On Google Could Leave You Vulnerable To Hackers",
        "text": "There is a major warning for people using the internet regularly and searching for information via platforms like Google. UK-based cybersecurity firm SOPHOS has warned about a new hacking tactic targeting users who enter certain words into their computer’s search engine. \nAccording to a report by The New York Times, SOPHOS advises against searching for six specific terms, as doing so could heighten the risk of cyberattacks. One example cited is users who search “Are Bengal Cats legal in Australia?”—allegedly had their personal information exposed online after clicking on a top search result link.“Victims are often enticed into clicking on malicious adware or links disguised as legitimate marketing, or in this case a legitimate Google search,” the firm explained in a post. \nIn addition, the alert stated that hackers appear to target users who include the word “Australia” in their searches, indicating that citizens of the country are more vulnerable to these cyberattacks.\nSOPHOS noted that customers’ bank account information and personal information are taken by a program called Gootloader when they click on the search result that comes at the top and appears to be authentic. Moreover, this application has the capacity to lock the user out of their computer.\nThe cybersecurity firm asserted that although the word “Bengal cats” may seem rather specialised, users don’t need to enter any malicious information to be vulnerable to these attacks and have their private data taken and shared online.\nThese days, cybercriminals use programs to snoop on clean and innocent Google searches employing a technique known as “SEO poisoning.” The Daily Mail has described this practice as an “insidious technique in which criminals manipulate search engine results to push websites they control to the top of the page.” SOPHOS advised anyone who may have been a victim of SEO poisoning to change their password as soon as possible and enhance their security systems.\nReportedly, Hackers steal people’s data and even take over their devices by using malware, which is software created expressly to damage computers, networks and gadgets. Malware comes in a variety of types, such as trojan horses, bots, viruses, worms, ransomware (which prevents users from accessing their computers unless they pay) and more.",
        "summary": "Hackers are using new and innovative ways to exploit and steal your data, which now includes a Google search result.",
        "url": "https://www.news18.com/tech/beware-typing-these-6-words-on-google-could-leave-you-vulnerable-to-hackers-9116001.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/05/untitled-design-2024-05-22t131632.901-2024-05-c616946892981ff3ef3952830a12e8e4-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 06:30:30",
        "author": "News18,S Aadeetya",
        "authors": [
            "News18",
            "S Aadeetya"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.109
    },
    {
        "id": 264040988,
        "title": "Vijay Deverakonda Has This To Say About His Viral Fall Incident",
        "text": "Vijay Deverakonda left his fans worried when he slipped down the stairs just days ago. The actor was spotted in Mumbai for the promotion of his upcoming music video Sahiba with Radhikka Madan, when the incident happened. Recently, Vijay reacted to the viral moment with a hilarious video, sportingly taking his “fall” and using it as a clever marketing strategy.\nOn Sunday, November 10, Vijay dropped a reel on his Instagram account, which opened with the clip where he slipped down the stairs. The very next moment, he popped up in the frame wearing a green-coloured tee from his clothing brand RWDY. He paired it with beige trousers and a yellow cap. As the video played further, Vijay winked at the camera while “Fall, Falling, Falling in Looove with my RWDY boys and girls” was displayed on the screen. \nHe posted the video with the caption: “I fell & it went crazy ? That is the RWDY life. RWDYs go all out always. Irrespective of highs and lows. & RWDY essentials sell out always. Lots of love. Stay RWDY,” followed by a red heart emoji.\n\nView this post on Instagram\n\nA post shared by Vijay Deverakonda (@thedeverakonda)\n\nSoon, Vijay’s fans flooded the comment section of the post, appreciating the actor’s marketing strategy. One fan wrote, “That was savage!!!!” Another said, “Hahaha, love this. Nobody could have done this any better or thought about using the fall video and use it for own advantage.” A third fan penned, “That’s my boy, fallen hard but came back harder, lessggoooooo.”\nOn November 8, Vijay Deverakonda was seen in Mumbai with Radhikka Madan and singer Stebin Ben to promote their upcoming song Sahiba. In a video shared by a paparazzo page, they were exiting a venue when the 35-year-old lost his control, and as he was walking close to the wall without holding the railing, he slipped down the stairs. His team immediately rushed to help him out and the actor got up with grace while maintaining his composure. Meanwhile, the singer and other people rushed to cover the cameras of the paparazzi stationed outside the venue.\n\nView this post on Instagram\n\nA post shared by Instant Bollywood (@instantbollywood)\n\nSpeaking about Vijay’s work front, he had two releases in 2024: The Family Star, co-starring Mrunal Thakur, and the multi-starrer sci-fi film Kalki 2898 AD, in which he had a cameo appearance as Arjuna. At present, Vijay is busy with the shoot of his upcoming action drama VD12, scheduled to be released in the first half of 2025.",
        "summary": "Vijay Deverakonda has shared a hilarious video in response to his viral fall incident.",
        "url": "https://www.news18.com/movies/vijay-deverakonda-has-this-to-say-about-his-viral-fall-incident-9116445.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/news18-25-2024-11-67a94535b54898545eb19eec79050732-16x9.png?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 10:53:17",
        "author": "Dishya Sharma,News18,Sahas",
        "authors": [
            "Dishya Sharma",
            "News18",
            "Sahas"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.163
    },
    {
        "id": 263977910,
        "title": "'Legal Immigration System Broken In US': Vivek Ramaswamy Supports Trump's Deportation Plans",
        "text": "Vivek Ramaswamy, the top Indian-American aide to President-elect Donald Trump, expressed his support for the mass deportation plan of illegal immigrants and said that the legal immigration system in the country is “broken”.\nHe said that those who broke the law while entering the United States have no right to stay here and they need to go.\n“Do we have a broken legal immigration system? Yes, we do. But I think the first step is going to be to restore the rule of law, to do it in a very pragmatic way,” entrepreneur turned-politician told ABC News in an interview.\n“Those who have entered in the last couple of years, they haven’t established roots in the country. Those who have committed a crime, should be out of this country. That is by the millions. That alone would be the largest mass deportation. Combine that with ending government aid for all illegals. You see self-deportations,” he said.\nRamaswamy appeared on multiple Sunday talk shows, the first after the stunning win of Donald Trump in the November 5 presidential elections. He told ABC News that he is having some “high impact” discussions on his future role in the administration, Congress of the party.\nFrom being a rival of Trump during the Republican primaries, Ramaswamy has emerged as a staunch supporter and confidant of Trump.\n‘Trump Cares About Uniting The Country’\n“I think he cares about uniting the country. I think that is Donald Trump’s number one focus. I do think we have to get back to a place after this election after that decisive victory, which I do think was a gift to the country, get back to a place where ordinary Americans who might have voted differently amongst their family members or their colleagues or their neighbours, to be able to get together at the dinner table and say, we’re still Americans at the end of this, that’s very much Donald Trump’s headspace,” he said.\n“He’s also learned a lot from that first term, and I think he’s going into this second term even to take to new heights some of the things he wasn’t able to accomplish in the first term, which I think is going to be a good thing,” Ramaswamy said.\nThe Republican Party, he said, is now a multi-ethnic working-class coalition. “You saw black voters, Hispanic voters, young voters. That was a big one. A much younger composition of the Republican primary base came together on basic principles that really weren’t as beholden to older Republican orthodoxies, but principles like free speech, anti-censorship, meritocracy, and staying out of World War III. These are some of the common threads that bring together what is a pretty diverse and broad tent coalition to restore those basic constitutional principles,” he said.\n“Here’s a big one. And Donald Trump talked for a long time about the deep state. But this idea of restoring self-governance is big in this new coalition. The idea that the people we elect to run the government, they haven’t been the ones actually running the government for a very long time,” Ramaswamy said.\n“Donald Trump is going to be the president of the United States in the real sense of that word. Capital P president where he is actually making the decisions with the democratic will of the people behind him, not the unelected bureaucratic class underneath him,” the Indian American said.\n“That’s something that unites a common thread of even former Democrats to independents, to libertarians, to, of course, traditional Republicans as well. I think that that’s a common thread that unites us,” he said.\nTrump, he said, is focused on what makes people’s lives better. “And actually, my message to Democrats out there, even those who didn’t vote for Donald Trump, is to give them a chance to actually make your life better. A lot of people across the country, even those who have bought into some false narratives about Donald Trump, are going to be pleasantly surprised to find more money in their paychecks, prices coming down in the country, and a secure border. Those are things most Americans actually care about,” Ramaswamy said.",
        "summary": "Vivek Ramaswamy praised Donald Trump's policies and said those who broke the law while entering the US have no right to stay.",
        "url": "https://www.news18.com/world/legal-immigration-system-broken-in-us-vivek-ramaswamy-supports-trumps-deportation-plans-9115862.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/vivek-ramaswamy-2024-11-67c9e2833a65e66ba80bec8fa6a8f85b-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 03:52:06",
        "author": "Aveek Banerjee,News18",
        "authors": [
            "Aveek Banerjee",
            "News18"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.016
    },
    {
        "id": 264017050,
        "title": "Sanjay Manjrekar Slams Gautam Gambhir, Wants BCCI To Keep Him Away From Press Conferences",
        "text": "Former Indian batter Sanjay Manjrekar, who has now donned the hat of an expert and commentator, wants the Board of Control for Cricket in India (BCCI) to keep head coach Gautam Gambhir away from press conferences. According to Manjrekar, Gambhir, who was appointed as India’s head coach in July 2024, does not have the right demeanour nor the words to face the media.\n“Just watched Gambhir in the press conference. May be wise for @BCCI to keep him away from such duties, let him work behind the scenes. He does not have the right demeanour nor the words when interacting with them. Rohit & Agarkar, much better guys to front up for the media,” Manjrekar tweeted.\n\nJust watched Gambhir in the press conference.\nMay be wise for @BCCI to keep him away from such duties, let him work behind the scenes. He does not have the right demeanour nor the words when interacting with them. Rohit & Agarkar, much better guys to front up for the media.\n— Sanjay Manjrekar (@sanjaymanjrekar) November 11, 2024\n\nManjrekar’s tweet came a couple of hours after Gambhir attended India’s pre-departure press conference in Mumbai on Monday (November 11) and spoke on length about various topics without mincing words.\nDuring the presser, Gambhir defended Rohit Sharma and Virat Kohli and said they are still very hungry to do well for the Indian team.\n“For me, they are still very hungry. I am sure they have got a lot of fire to achieve a lot of success for the nation, and you should never doubt their passion for the country.”\nHe also confirmed that star pacer Jasprit Bumrah, who is the designated vice captain of the Indian Test team, will lead the side in the opening Test if regular skipper Rohit Sharma is unavailable for the game due to personal reasons.\nThe first Test of the Border-Gavaskar Trophy is scheduled to take place at Optus Stadium in Perth from November 22.\n“At the moment, there is no confirmation. We will let you know exactly what the situation will be. Hopefully, he is going to be available, but everything you want to know, you will get to know before the start of the series,” Gambhir said. “Bumrah is the vice captain, so obviously if Rohit is not available, he is going to lead in Perth,” the coach added.\nThe straight-talking former opener also indicated that KL Rahul could be asked to open the innings in place of Rohit.\n“Obviously, there is Easwaran; there is KL there. We will take a call closer to the first Test match if Rohit is not available. There are options. There are quite a lot of options in this spot. Once it gets closer to the first Test match, we will try and play the best playing XI who is going to do the job for us,” he added.",
        "summary": "After Gambhir attended India's pre-departure press conference in Mumbai on Monday morning, Manjrekar tweeted and said it may be wise for BCCI to keep Gambhir away from such duties.",
        "url": "https://www.news18.com/cricket/sanjay-manjrekar-slams-gautam-gambhir-wants-bcci-to-keep-him-away-from-press-conferences-9116186.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/sanjay-manjrekar-gautam-gambhir-bcci-india-vs-australia-2024-25-2024-11-16e7706688cadbdfc0a9d84db12744f3-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 08:46:06",
        "author": "Harshit Bisht,News18",
        "authors": [
            "Harshit Bisht",
            "News18"
        ],
        "language": "en",
        "category": "sports",
        "source_country": "in",
        "sentiment": 0.197
    },
    {
        "id": 263971112,
        "title": "Navjot Singh Sidhu Is Back On Kapil Sharma's Show 5 Years After Exit, Archana Puran Singh REACTS",
        "text": "Former cricketer and ex-judge of Kapil Sharma’s show, Navjot Singh Sidhu has reunited with Kapil after five years. The new promo of The Great Indian Kapil Show has revealed that Navjot Singh Sidhu will be seen on the show in the upcoming episode. The promo revealed that Navjot was seated in the judge’s seat while Archana Puran Singh looked lost. \nIn the promo, Kapil pretended that Archana Puran Singh got a makeover that made her look like Navjot. The former judge clarified that it was indeed him. Archana then walked on stage and asked Kapil to intervene. “Kapil, tell Sardar sahab to get off my seat. He’s taken over my spot,” she said. Harbhajan Singh, who will be seen in the episode as well, jumped in to side with Navjot. He said that no matter who takes over the seat, they cannot replace Sidhu. \nThe makers then revealed that he is not returning as the judge but appearing on the show as a guest with his wife, Navjot. They will be joined by Harbhajan and his wife, actress Geeta Basra. Watch the trailer below: \n\nView this post on Instagram\n\nA post shared by Riddhi Bansal (@bollyxxholly)\n\nNavjot reunited with Kapil six years after Navjot was asked to leave The Kapil Sharma Show in 2019. At the time, a source told The Indian Express that the channel asked him to leave the show after his controversial comments on Pulwama attack. He was replaced by Archana Puran Singh. While the channel airing the show did not shed light on his exit, Navjot had commented on being replaced from the show at the time on X. \n“I had to attend Vidhan Sabha’s session due to which I couldn’t go for the shoots of The Kapil Sharma Show and they got somebody else in my replacement for two episodes. I have no intimation about my termination from the channel. If it is regarding my statement, I will stick to what I have been saying yesterday, today and ever tomorrow,” he said at the time.",
        "summary": "Navjot Singh Sidhu reunited with Kapil Sharma five years after he left the comedian's old show in 2019.",
        "url": "https://www.news18.com/movies/navjot-singh-sidhu-is-back-on-kapil-sharmas-show-5-years-after-exit-archana-puran-singh-reacts-9115755.html",
        "image": "https://images.news18.com/ibnlive/uploads/2024/11/navjot-singh-sindhu-back-on-kapil-show-2024-11-b2bc0c6b4fb6511487de2ed24a8cf4b3-16x9.jpg?impolicy=website&width=1200&height=900",
        "video": null,
        "publish_date": "2024-11-11 01:52:37",
        "author": "Dishya Sharma,News18",
        "authors": [
            "Dishya Sharma",
            "News18"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.066
    }
]