[
    {
        "id": 260458176,
        "title": "Air quality poor in Delhi",
        "text": "New Delhi: A layer of smog enveloped several parts of the city on Monday as the air quality index slipped into the very poor category for the first time in the season. The Air Quality Index (AQI) stood at 307 at 9 am with Anand Vihar remaining the worst hit with a reading of 361, according to data from the Central Pollution Control Board (CPCB).An AQI between zero and 50 is considered good, 51 to 100 satisfactory, 101 to 200 moderate, 201 to 300 poor, 301 to 400 very poor, and 401 to 500 severe. The minimum temperature settled at 20.4 degrees Celsius, two notches above the season's average. The maximum temperature is expected to touch 35.8 degrees Celsius. At 8:30 am, humidity levels were recorded at 86 per cent.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/air-quality-poor-in-delhi",
        "image": "https://images.deccanchronicle.com/fe2498feb9309798d8ce9c7f61c75d040ea4a59c-tc-img-preview.jpg",
        "video": null,
        "publish_date": "2024-10-21 06:10:28",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "environment",
        "source_country": "in",
        "sentiment": -0.663
    },
    {
        "id": 260483714,
        "title": "Remarks on PM's degree: SC upholds summons against Arvind Kejriwal in Gujarat",
        "text": "New Delhi: The Supreme Court on Monday dismissed a plea filed by former Delhi Chief Minister and AAP supremo Arvind Kejriwal challenging an order of the Gujarat High Court refusing to quash summons in a defamation case over his alleged remarks over Prime Minister Narendra Modi's educational qualification.A bench of Justices Hrishikesh Roy and S V N Bhatti noted that a separate bench of the apex court had junked the plea filed by AAP leader Sanjay Singh on April 8 in the same case.\"We must have a consistent approach,\" said the bench.The Gujarat High Court had on February 16 dismissed the pleas of Singh and Kejriwal seeking quashing of the summons issued against them in the case.Both politicians had challenged in the high court the summons issued by a trial court in the case filed by the Gujarat University and the subsequent order of the sessions court dismissing their revision pleas against the summons.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/remarks-on-pms-degree-sc-upholds-summons-against-arvind-kejriwal-in-gujarat-1831731",
        "image": "https://www.deccanchronicle.com/h-upload/2024/05/06/1090701-delhichiefministerarvindkejriwal.webp",
        "video": null,
        "publish_date": "2024-10-21 09:47:43",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.074
    },
    {
        "id": 260481376,
        "title": "EC appoints Ajay Kumar Singh as new DGP of poll-bound Jharkhand",
        "text": "New Delhi: The Election Commission on Monday appointed Jharkhand cadre senior-most IPS officer Ajay Kumar Singh as the state DGP, sources said, days after the poll panel removed Anurag Gupta as the the acting police chief.An officer of the 1989-batch of the Indian Police Service, Singh was selected from a panel of three IPS officers whose names were sent by the state government.The names were sent after the poll authority on Saturday ordered the removal of acting DGP Anurag Gupta due to his \"history\" of election-related misconduct in previous polls. The state goes to polls in two phases on November 13 and 20.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/ec-appoints-ajay-kumar-singh-as-new-dgp-of-poll-bound-jharkhand-1831726",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/04/1837930-electioncommissionofindia.webp",
        "video": null,
        "publish_date": "2024-10-21 09:36:37",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.797
    },
    {
        "id": 260459996,
        "title": "SC junks PIL seeking to replace term 'Hindutva' with 'Indian constitutionalism'",
        "text": "New Delhi: The Supreme Court on Monday refused to entertain a PIL seeking to replace the term 'Hindutva' with Bharatiya Samidhaanitva' (Indian constitutionalism).\"This is complete abuse of the process,\" said the bench comprising Chief Justice D.Y. Chandrachud and justices J.B. Pardiwala and Manoj Misra while junking the PIL on the issue. The PIL was filed by S.N. Kundra, a resident of Vikaspuri in Delhi. \"No sir, we will not entertain this,\" the CJI said.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/news/sc-junks-pil-seeking-to-replace-term-hindutva-with-indian-constitutionalism-1831681",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/17/1848207-supremecourt.webp",
        "video": null,
        "publish_date": "2024-10-21 06:30:32",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.188
    },
    {
        "id": 260472490,
        "title": "Archery World Cup: Deepika Kumari Returns To The Final After Three Years' Win Her Fifth Silver Medal",
        "text": "HomeSportsArchery World Cup: Deepika Kumari Returns To The Final After Three Years' Win Her Fifth Silver Medal\n\nArchery World Cup: Deepika Kumari Returns To The Final After Three Years' Win Her Fifth Silver Medal\n\nDeepika lost the summit clash 0-6 to China's Li Jiaman in the eight-archer field\n\nPTIUpdated: Monday, October 21, 2024, 01:57 PM IST\n\nIndia's premier recurve archer Deepika Kumari won her fifth silver medal at the World Cup Final after losing the summit clash 0-6 to China's Li Jiaman. Returning to the World Cup Final after three years following the birth of her daughter in December 2022, four-time Olympian Deepika was seeded third in the eight-archer field.\n\nShe had a smooth run through the semifinals but probably the pressure of gold medal match got to her against fourth-seed Li Jiaman, a team silver medalist from the Paris Olympics. It was Deepika's ninth appearance at the World Cup Final where she has also bagged a bronze. Dola Banerjee is the only Indian archer to have won a gold in the World Cup Final, having topped the podium in Dubai 2007.\n\nLet us know! 👂\n\nWhat type of content would you like to see from us this year?\n— HubSpot (@HubSpot)\n\nThe five-member Indian contingent, comprising three compound and two recurve archers, thus concluded their season-ending World Cup Final campaign with just one medal.\n\nAfter a stellar semifinal win against Mexico's Alejandra Valencia, Deepika couldn’t maintain momentum. She dropped the first set by a single point (26-27). Despite improving in the second set, Li's flawless 30, including an X-ring shot, gave the Chinese archer a commanding a 2-0 lead (30-28).\n\n'Why Is OLA a Public Issue': Comedian Kunal Kamra’s Feud With Bhavish Aggarwal Heats Up Again - Accusations, Bouncers, & Netizens React\n\n'No Rest, No relaxation In The Path We Have Chosen For Developed India,' Says PM Modi\n\nRajasthan: Man Gets Beaten Up With Rod By Wife & Daughter Over Domestic Dispute In Bikaner; Shocking Video Surfaces\n\nDiwali 2024 Calendar: Know When Is Deepavali, Choti Diwali, Dhanteras, Lakshmi Puja & Other Key Dates\n\nThe third set proved decisive as Deepika's second arrow landed in the red 7-ring, allowing Li to claim victory with three solid 9s, taking the set 27-25 and sealing the gold on her debut World Cup Final appearance.\n\nIn the semifinals, Deepika triumphed over home favourite and Paris Olympics bronze medalist Valencia, edging her out 6-4 (29-28, 26-26, 26-29, 28-28, 28-27). It also avenged Deepika's bronze medal loss to Valencia from the Yecheon World Cup earlier this year. Deepika's campaign had begun with a dominant 6-0 victory over China's Yang Xiaolei (27-23, 29-22, 29-27).\n\nOther results\n\nIn the men's recurve section, Dhiraj Bommadevara, despite leading 4-2, could not hold off the challenge from South Korea’s Paris Olympics bronze medallist, Lee Woo Seok in the opening round and made an early exit .\n\nIn the men’s recurve, third-seeded Dhiraj was India’s sole qualifier.Facing second seed Lee Woo Seok, Dhiraj started strongly, drawing the first set and winning the second.\n\nHowever, he missed the opportunity to close out the match in the third by just one point with the South Korean drawing level before delivering flawless performances in the fourth and fifth sets. Dhiraj eventually lost 4-6 (28-28, 29-26, 28-28, 26-30, 28-29).\n\n(Except for the headline, this article has not been edited by FPJ's editorial team and is auto-generated from an agency feed.)\n\nFollow us on\n\nRECENT STORIES\n\nMilestone Alert! Abdul Samad Becomes First Jammu & Kashmir Batter To Record Centuries In Both...\n\nStones, Shoes & Bottles: Kerala Blasters Launch Complaint After Mohammedan SC Fans Attack Their...\n\nClashes Erupt Outside Mirpur Stadium Between Pro And Anti Shakib Groups Ahead Of BAN vs SA 1st Test:...\n\nUS Grand Prix Organisers Fined ₹45 Crore After Premature Track Invasion By 200 F1 Fans\n\nWomen's T20 World Cup Final: New Zealand Lift Maiden Title After South Africa Falter On The Final...",
        "summary": "",
        "url": "https://www.freepressjournal.in/sports/archery-world-cup-deepika-kumari-returns-to-the-final-after-three-years-win-her-fifth-silver-medal",
        "image": "https://media.assettype.com/freepressjournal/2024-10-21/96l2y7jb/Untitled-design-2024-10-21T135629.831.png",
        "video": null,
        "publish_date": "2024-10-21 08:27:26",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "sports",
        "source_country": "IN",
        "sentiment": -0.141
    },
    {
        "id": 260457290,
        "title": "Deepika Kumari wins Silver at Archery World Cup",
        "text": "Tlaxcala: India's premier recurve archer Deepika Kumari won her fifth silver medal at the World Cup Final after losing the summit clash 0-6 to China's Li Jiaman, here. Returning to the World Cup Final after three years following the birth of her daughter in December 2022, four-time Olympian Deepika was seeded third in the eight-archer field.She had a smooth run through the semifinals but probably the pressure of gold medal match got to her against fourth-seed Li Jiaman, a team silver medalist from the Paris Olympics.It was Deepika's ninth appearance at the World Cup Final where she has also bagged a bronze. Dola Banerjee is the only Indian archer to have won a gold in the World Cup Final, having topped the podium in Dubai 2007.In the men's recurve section, Dhiraj Bommadevara, despite leading 4-2, could not hold off the challenge from South Korea's Paris Olympics bronze medallist, Lee Woo Seok in the opening round and made an early exit .The pressure once again seemed to affect the Indian archers, who have often struggled in high-stakes matches.The five-member Indian contingent, comprising three compound and two recurve archers, thus concluded their season-ending World Cup Final campaign with just one medal.After a stellar semifinal win against Mexico's Alejandra Valencia, Deepika couldn't maintain momentum.She dropped the first set by a single point (26-27). Despite improving in the second set, Li's flawless 30, including an X-ring shot, gave the Chinese archer a commanding a 2-0 lead (30-28).The third set proved decisive as Deepika's second arrow landed in the red 7-ring, allowing Li to claim victory with three solid 9s, taking the set 27-25 and sealing the gold on her debut World Cup Final appearance.In the semifinals, Deepika triumphed over home favourite and Paris Olympics bronze medalist Valencia, edging her out 6-4 (29-28, 26-26, 26-29, 28-28, 28-27). It also avenged Deepika's bronze medal loss to Valencia from the Yecheon World Cup earlier this year.Deepika's campaign had begun with a dominant 6-0 victory over China's Yang Xiaolei (27-23, 29-22, 29-27).In the men's recurve, third-seeded Dhiraj was India's sole qualifier.Facing second seed Lee Woo Seok, Dhiraj started strongly, drawing the first set and winning the second.However, he missed the opportunity to close out the match in the third by just one point with the South Korean drawing level before delivering flawless performances in the fourth and fifth sets.Dhiraj eventually lost 4-6 (28-28, 29-26, 28-28, 26-30, 28-29).On the compound side, the three-member Indian contingent returned empty-handed ending their campaign on Saturday.Prathamesh Fuge finished fourth after a tense semifinal loss, while Priyansh and Jyothi Surekha Vennam failed to reach the medal rounds.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/sports/deepika-bags-her-fifth-silver-at-archery-world-cup-final-1831668",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854396-untitleddesign-2024-10-21t112504390.webp",
        "video": null,
        "publish_date": "2024-10-21 05:55:45",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "sports",
        "source_country": "in",
        "sentiment": -0.136
    },
    {
        "id": 260481382,
        "title": "Cyclone threat looms over Bay of Bengal",
        "text": "Amaravati: The India Meteorological Department on Monday said a new low-pressure area has formed over the Bay of Bengal, and is likely to intensify into a cyclonic storm by October 23.According to the weather department, the low pressure formed over east-central Bay of Bengal and adjoining north Andaman Sea around 5:30 am on Monday, influenced by Sunday's upper air cyclonic circulation over north Andaman Sea and adjoining east-central and southeast part of the sea. “It is very likely to move west-northwestwards and intensify into a depression by 22nd October morning and into a cyclonic storm by 23rd October over east-central Bay of Bengal,” it said in a press release. The weather system is likely to move northwestwards to reach northwest Bay of Bengal off Odisha – West Bengal coasts by October 24 morning, it added.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/cyclone-threat-looms-over-bay-of-bengal-1831724",
        "image": "https://www.deccanchronicle.com/h-upload/2024/05/26/1092783-cyclone.webp",
        "video": null,
        "publish_date": "2024-10-21 09:30:46",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.047
    },
    {
        "id": 260483222,
        "title": "Supreme Court Grants 2 Weeks More To 7-Member Expert Panel To File Report On NEET-UG Reforms",
        "text": "The top court on August 2 had passed its formal order and expanded the remit of the seven-member expert panel, headed by former ISRO chief K Radhakrishnan, to review the functioning of the National Testing Agency (NTA) and recommend exam reforms to make the controversy-ridden NEET-UG (National Eligibility cum Entrance Test Undergraduate), transparent and free from malpractices.",
        "summary": "",
        "url": "https://www.freepressjournal.in/education/supreme-court-grants-2-weeks-more-to-7-member-expert-panel-to-file-report-on-neet-ug-reforms",
        "image": "https://media.assettype.com/freepressjournal/2023-03/7fd339fd-c1b5-4c70-8dd7-c0deed956b76/Hero_Image__19_.jpg",
        "video": null,
        "publish_date": "2024-10-21 09:48:58",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.391
    },
    {
        "id": 260469618,
        "title": "SC grants 2 more weeks to expert panel to file report on NEET-UG reforms",
        "text": "New Delhi: The Supreme Court on Monday extended by two weeks the time granted to the Centre-appointed seven-member expert panel to file its report on exam reforms after reviewing the National Testing Agency's functioning in holding the NEET-UG. The top court on August 2 had passed its formal order and expanded the remit of the seven-member expert panel, headed by former Indian Space Research Organisation (ISRO) chief K Radhakrishnan, to review the functioning of the National Testing Agency (NTA) and recommend exam reforms to make the controversy-ridden NEET-UG (National Eligibility cum Entrance Test Undergraduate), transparent and free from malpractices.The NEET-UG is conducted by the NTA for admission in undergraduate medical programs.The top court had also refused to annul the NEET-UG of 2024, saying there was no sufficient material on record at present to indicate a systemic leak or malpractice compromising the integrity of the examination.On Monday, Solicitor General Tushar Mehta, appearing for the Centre, told a bench headed by Chief Justice D Y Chandrachud that the deadline for filing the report of the expert committee was ending and sought two-week extension.The bench, also comprising Justices JB Pardiwala and Manoj Misra, took note of the fact that the report of the panel was almost complete and granted two more weeks for filing the same.While expanding the scope of the expert panel, the top court had flagged multiple lapses on the part of NTA like the security breach at an examination centre in Jharkhand's Hazaribagh where the rear door of the strongroom was opened and unauthorised people were permitted to access question papers, transportation of question papers by e-rickshaws and distribution of wrong set of question papers among the candidates.Besides Radhakrishnan, other members of the expert committee are Randeep Guleria, B J Rao, Ramamurthy K, Pankaj Bansal, Aditya Mittal and Govind Jaiswal.The bench said the remit of the committee, in addition to the tasks that it has been entrusted with by the union government and the NTA, shall encompass examination security and administration, data security and technological enhancements.Its responsibilities will also include policy and stakeholder engagement, collaboration and international cooperation, and recommendations for providing mental health support to students and training of NTA staff, it had said.Over 23 lakh students took up the NEET-UG in 2024 for admissions to MBBS, BDS, AYUSH and other related courses.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/sc-grants-2-more-weeks-to-expert-panel-to-file-report-on-neet-ug-reforms-1831711",
        "image": "https://www.deccanchronicle.com/h-upload/2024/04/15/1084142-supremecourt.webp",
        "video": null,
        "publish_date": "2024-10-21 07:54:49",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.056
    },
    {
        "id": 260466478,
        "title": "NEET-UG reforms: SC grants more time to expert panel to file report",
        "text": "New Delhi: The Supreme Court on Monday extended by two weeks the time granted to the Centre-appointed seven-member expert panel to file its report on exam reforms after reviewing the National Testing Agency's functioning in holding the NEET-UG.\r\n\r\nThe top court on August 2 had passed its formal order and expanded the remit of the seven-member expert panel, headed by former Indian Space Research Organisation (ISRO) chief K Radhakrishnan, to review the functioning of the National Testing Agency (NTA) and recommend exam reforms to make the controversy-ridden NEET-UG (National Eligibility cum Entrance Test Undergraduate), transparent and free from malpractices.\r\n\r\nThe NEET-UG is conducted by the NTA for admission in undergraduate medical programs. The top court had also refused to annul the NEET-UG of 2024, saying there was no sufficient material on record at present to indicate a systemic leak or malpractice compromising the integrity of the examination.\r\n\r\nOn Monday, Solicitor General Tushar Mehta, appearing for the Centre, told a Bench headed by Chief Justice DY Chandrachud that the deadline for filing the report of the expert committee was ending and sought two-week extension.\r\n\r\nThe bench, also comprising Justices JB Pardiwala and Manoj Misra, took note of the fact that the report of the panel was almost complete and granted two more weeks for filing the same.\r\n\r\nWhile expanding the scope of the expert panel, the top court had flagged multiple lapses on the part of NTA like the security breach at an examination centre in Jharkhand's Hazaribagh where the rear door of the strongroom was opened and unauthorised people were permitted to access question papers, transportation of question papers by e-rickshaws and distribution of wrong set of question papers among the candidates.\r\n\r\nBesides Radhakrishnan, other members of the expert committee are Randeep Guleria, B J Rao, Ramamurthy K, Pankaj Bansal, Aditya Mittal and Govind Jaiswal. The bench said the remit of the committee, in addition to the tasks that it has been entrusted with by the union government and the NTA, shall encompass examination security and administration, data security and technological enhancements.\r\n\r\nIts responsibilities will also include policy and stakeholder engagement, collaboration and international cooperation, and recommendations for providing mental health support to students and training of NTA staff, it had said. Over 23 lakh students took up the NEET-UG in 2024 for admissions to MBBS, BDS, AYUSH and other related courses.",
        "summary": "The bench took note of the fact that the report of the panel was almost complete and granted two more weeks for filing the same",
        "url": "https://telanganatoday.com/neet-ug-reforms-sc-grants-more-time-to-expert-panel-to-file-report",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/10/SC1-1.jpg",
        "video": null,
        "publish_date": "2024-10-21 07:19:15",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.003
    },
    {
        "id": 260444704,
        "title": "Haryana: CM Saini retains home, finance portfolios",
        "text": "Chandigarh: Haryana Chief Minister Nayab Singh Saini kept key departments, including home and finance, while Anil Vij got energy and transport as portfolios were allocated to the Council of Ministers on Sunday, three days after the swearing-in of a new government in the state.Saini will handle 12 portfolios. Besides home and finance, he is also in charge of planning, excise and taxation, town and country planning and urban estates, information, public relations, language and culture, criminal investigation, law and legislative, and housing for all departments.Vij, who held the home portfolio when Manohar Lal Khattar was the chief minister, has now also been given the charge of the labour department, in addition to energy and transport.The health department, which Vij handled during the Khattar government, has now been allotted to Arti Singh Rao, who will also take care of the medical education and research and Ayush departments, said a government order issued late in the night here.Saini (54) took oath as the chief minister of Haryana at a grand ceremony in Panchkula on Thursday that was attended by a galaxy of NDA leaders, including Prime Minister Narendra Modi, and thousands of people from across the state.Apart from him, 13 MLAs, including two women, took oath.Rao Narbir Singh has been allotted industries and commerce, environment, forests and wildlife departments while Mahipal Dhanda got the school education department.Vipul Goel has been allotted revenue and disaster management, urban local bodies and the civil aviation departments while Arvind Sharma will handle jails and cooperation portfolios.Shyam Singh Rana will take care of the agriculture and farmers welfare department while Ranbir Gangwa will handle public health engineering. Krishan Kumar Bedi has social justice, empowerment, and SCs and BCs welfare departments while the women and child development portfolio will be handled by Shruti Choudhry.Among other Ministers, Krishan Lal Panwar has been allocated development and panchayats, and mines and geology departments.Minister of State (Independent Charge) Rajesh Nagar has been allocated food, civil supplies and consumer affairs while Minister of State Gaurav Gautam (Independent Charge) will handle youth empowerment and entrepreneurship, and sports departments.The Governor of Haryana, on the advice of the chief minister, has allocated portfolios to the members of the Council of Ministers, the order said.The BJP has won 48 out of 90 seats in the October 5 Haryana Assembly polls.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/current-affairs/haryana-portfolios-allocated-cm-saini-keeps-home-finance-1831656",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854370-aa-3268556.webp",
        "video": null,
        "publish_date": "2024-10-21 02:21:42",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.176
    },
    {
        "id": 260442368,
        "title": "Doctor, 6 workers killed in terror attack in J&K",
        "text": "Srinagar: A doctor and six labourers were killed when terrorists struck a tunnel-construction site on the Srinagar-Leh national highway in Jammu and Kashmir's Ganderbal district on Sunday, officials said.The unidentified terrorists carried out the attack when the labourers and other staff working on the tunnel project at Gund in Ganderbal had returned to their camp late in the evening, the officials said.They said the terrorists -- believed to be at least two -- opened indiscriminate fire on the group of labourers that included both locals and non-locals.While two labourers died on the spot, four others and the doctor succumbed to their injuries subsequently, the officials said, adding that five people are undergoing treatment for injuries.The deceased have been identified as Dr Shahnawaz, Faheem Nazir, Kaleem, Mohammad Hanif, Shashi Abrol, Anil Shukla and Gurmeet Singh.Security forces have cordoned off the area and launched a search operation to track down the attackers, the officials said.Top security officials, including Inspector General of Police (IGP), Kashmir, V K Birdi, have reached the spot to assess the situation.Condemning the terror attack, Union Home Minister Amit Shah said those involved in the heinous act will not be spared.\"The dastardly terror attack on civilians in Gagangir, J&K, is a despicable act of cowardice. Those involved in this heinous act will not be spared and will face the harshest response from our security forces,\" Shah said in a post on X.Meanwhile, Chief Minister Omar Abdullah said the number of casualties in the attack may go up.\"The casualty figure from the Gagangir attack is not final as there are a number of injured labourers, both local and non-local. Praying that the injured make a full recovery as the more seriously injured are being referred to SKIMS, Srinagar,\" he said in a post on X.Abdullah condemned the attack, which came barely four days after he was sworn in as the chief minister of the Union Territory.\"Very sad news of a dastardly and cowardly attack on non-local labourers at Gagangir in Sonamarg region. These people were working on a key infrastructure project in the area. 2 have been killed and 2-3 more have been injured in this militant attack. I strongly condemn this attack on unarmed innocent people and send my condolences to their loved ones,\" he said in another post on the microblogging platform.Jammu and Kashmir Lieutenant Governor Manoj Sinha strongly condemned the heinous terror attack on civilians. \"I assure the people that those behind this despicable act will not go unpunished. We have given full freedom to J&K Police, Army and security forces,\" Sinha said in a post on X.Former Jammu and Kashmir chief minister and People's Democratic Party (PDP) president Mehbooba Mufti also condemned the attack.\"Unequivocally condemn this senseless act of violence against two labourers in Ganderbal. Deepest condolences to their families,\" she said in a post on X before the officials revised the death toll in the incident.In a post on X, People's Conference leader Sajad Gani Lone said: \"Strongly condemn the dastardly act of terror wherein two persons have lost their lives in Sonamarg. This is an insane act of madness. My thoughts with these two families. May the perpetrators be brought to justice.\"Jammu and Kashmir Pradesh Congress Committee (JKPCC) president Tariq Hameed Karra expressed grave concern over the attack and said such incidents will vitiate the atmosphere in the Union Territory. He urged the government to take immediate measures to prevent such brutal attacks on innocent labourers.On Friday, the bullet-riddled body of a labourer from Bihar was found in Shopian district, officials said.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/doctor-6-workers-killed-in-terror-attack-in-jk",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854364-aa-3287465.webp",
        "video": null,
        "publish_date": "2024-10-21 01:19:42",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.557
    },
    {
        "id": 260467718,
        "title": "Delhi Police writes to Telegram to probe Khalistan link in CRPF school blast",
        "text": "New Delhi: Delhi Police probing a possible Khalistani link in the blast near a CRPF school here on Monday wrote to messaging app Telegram to know the details of a group that claimed responsibility of the explosion, police sources said on Monday.A strong blast ripped through a wall of the CRPF school in Rohini's Prashant Vihar area on Sunday morning. No one was hurt in the blast but a signboard, hoardings of nearby shops and window panes of vehicles parked near the spot were damaged in the incident.In its FIR filed on the incident, a copy of which has been accessed by PTI, police has mentioned a \"white powder found scattered\" at the site and said the explosion was caused by \"unknown explosive substance\".Meanwhile, police sources also said they have recovered CCTV footage of a suspect from the night before the incident.A purported Telegram post circulated on social media, which claimed that the blast was carried out in retaliation to the \"targeting\" of pro-Khalistan separatists allegedly by Indian agents.The post surfaced on social media late on Sunday evening pointing to the possible involvement of pro-Khalistani separatists behind the blast.\"The police has written to Telegram to the know details of the creator of the group - Justice League Indian - in which the CCTV of the blast was shared with a Khalistan Zindabad watermark on it,\" a police source said.A Telegram post by \"Justice League India\" read, \"If Indian coward agency and their master think they can hire filthy goons to target our members to silence our voice then they live in fools world. They can't imagine how close we are to them and how capable we are to strike anytime #KhalistanZindabad #JLI.\"A team of Central Reserve Police Force (CRPF) visited the spot on Monday morning.Sources said police has recovered a CCTV in which a suspect in white T-shirt is spotted on the spot, a night before the blast.It is suspected that an Improvised Explosive Device (IED), wrapped in a plastic bag, was hid in a one-feet-deep pit near the CRPF school wall, they said.The teams of Delhi Police Special Cell, Crime Branch and local police are investigating the case.An FIR under Sections 326(g) (mischief with severe consequences to public safety) of Bharatiya Nyaya Sanhita, Prevention of Damage to Public Property Act and Explosives Act was registered at Prashant Vihar police station.The FIR stated that there had been a \"loud noise accompanied by white fumes of smoke\" near the outer boundary wall of the CRPF Public School on Lancer Road.A hole, caused by the blast, in the boundary wall of the school is evident, the FIR said.Window panes and signboards of shops opposite the CRPF school were damaged due to the blast's impact, it said.During the inspection, white powder was found scattered near the site, the FIR said. Samples of \"white powder\" and soil collected from the spot were sent to the laboratory to ascertain the bomb's composition.The explosion was caused by an unknown explosive substance, it added.On Sunday, the Forensic Science Laboratory (FSL) and National Security Guard (NSG) teams inspected the spot and collected samples.NSG commandos also deployed robots to scour the area for more explosive materials. \"The white powder could be a mixture of ammonium nitrate and chloride,\" a senior police officer said.The officer said the perpetrator \"intentionally\" selected the spot to not harm the people but to send a message.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/news/crime/delhi-police-writes-to-telegram-to-probe-khalistan-link-in-crpf-school-blast-1831704",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854428-aa-3293276.webp",
        "video": null,
        "publish_date": "2024-10-21 07:37:14",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.292
    },
    {
        "id": 260460964,
        "title": "Delhi police writes to Telegram to probe Khalistan angle in blast, suspect spotted in CCTV",
        "text": "New Delhi: Delhi police probing a possible Khalistani link in the blast near a CRPF school here on Monday wrote to messaging app Telegram to know the details of a group that claimed responsibility of the explosion, police sources said on Monday. A strong blast ripped through a wall of the CRPF school in Rohini's Prashant Vihar area on Sunday morning. No one was hurt in the blast but a signboard, hoardings of nearby shops and window panes of vehicles parked near the spot were damaged in the incident.In its FIR filed on the incident, a copy of which has been accessed by PTI, police has mentioned a \"white powder found scattered\" at the site and said the explosion was caused by \"unknown explosive substance\".Meanwhile, police sources also said they have recovered CCTV footage of a suspect from the night before the incident. A purported Telegram post circulated on social media, which claimed that the blast was carried out in retaliation to the \"targeting\" of pro-Khalistan separatists allegedly by Indian agents.The post surfaced on social media late on Sunday evening pointing to the possible involvement of pro-Khalistani separatists behind the blast. \"The police has written to Telegram to the know details of the creator of the group - Justice League Indian - in which the CCTV of the blast was shared with a Khalistan Zindabad watermark on it,\" a police source said.A Telegram post by \"Justice League India\" read, \"If Indian coward agency and their master think they can hire filthy goons to target our members to silence our voice then they live in fools world. They can't imagine how close we are to them and how capable we are to strike anytime #KhalistanZindabad #JLI.\"A team of Central Reserve Police Force (CRPF) visited the spot on Monday morning. Sources said police has recovered a CCTV in which a suspect in white T-shirt is spotted on the spot, a night before the blast.It is suspected that an Improvised Explosive Device (IED), wrapped in a plastic bag, was hid in a one-feet-deep pit near the CRPF school wall, they said. The teams of Delhi Police Special Cell, Crime Branch and local police are investigating the case.An FIR under Sections 326(g) (mischief with severe consequences to public safety) of Bharatiya Nyaya Sanhita, Prevention of Damage to Public Property Act and Explosives Act was registered at Prashant Vihar police station.The FIR stated that there had been a \"loud noise accompanied by white fumes of smoke\" near the outer boundary wall of the CRPF Public School on Lancer Road. A hole, caused by the blast, in the boundary wall of the school is evident, the FIR said.Window panes and signboards of shops opposite the CRPF school were damaged due to the blast's impact, it said. During the inspection, white powder was found scattered near the site, the FIR said. Samples of \"white powder\" and soil collected from the spot were sent to the laboratory to ascertain the bomb's composition.The explosion was caused by an unknown explosive substance, it added. On Sunday, the Forensic Science Laboratory (FSL) and National Security Guard (NSG) teams inspected the spot and collected samples.NSG commandos also deployed robots to scour the area for more explosive materials. \"The white powder could be a mixture of ammonium nitrate and chloride,\" a senior police officer said. The officer said the perpetrator \"intentionally\" selected the spot to not harm the people but to send a message.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/delhi-police-writes-to-telegram-to-probe-khalistan-angle-in-blast-suspect-spotted-in-cctv-1831682",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854404-untitleddesign.webp",
        "video": null,
        "publish_date": "2024-10-21 06:36:03",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.324
    },
    {
        "id": 260484996,
        "title": "Adar Poonawalla-led Serene to invest Rs 1,000 cr in Karan Johar's production company",
        "text": "New Delhi: Vaccine maker Serum Institute of India CEO Adar Poonawalla-led Serene Productions on Monday said it will pick 50 per cent stake in Karan Johar's Dharma Productions and Dharmatic Entertainment for Rs 1,000 crore.Serene Productions has entered into a binding agreement to invest Rs 1,000 crore in production house Dharma Productions and Dharmatic Entertainment (Dharma), the company said in a statement.Subsequently, Serene Productions will hold a 50 per cent stake in Dharma, with Johar retaining the remaining 50 per cent ownership, it added.“Poonawalla's investment values Dharma at Rs 2,000 crore,” the statement said.“We hope to build and grow Dharma and scale even greater heights in the years to come,” Poonawalla said on the investment.On the investment by Serene Productions, Johar said, “This partnership represents a perfect blend of our emotional storytelling prowess and forward-thinking business strategies. It's about honouring our roots while embracing the future of global entertainment.”Under the new structure, Johar as the Executive Chairman will spearhead the company's creative vision, while Apoorva Mehta, in his role as the Chief Executive Officer, will work with Johar in steering the strategic direction and overseeing the operations, the statement said.The collaboration aims to further transform content creation, distribution, and audience engagement by integrating advanced technologies and pioneering production methods, it added.The development comes at a time when India's entertainment industry has experienced significant expansion, driven by surging digital penetration and a diverse audience seeking high-quality content across multiple platforms, with growing global relevance, the company said.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/adar-poonawalla-led-serene-to-invest-rs-1000-cr-in-karan-johars-production-company-1831736",
        "image": "https://www.deccanchronicle.com/h-upload/2024/10/21/1854454-21adar.webp",
        "video": null,
        "publish_date": "2024-10-21 09:58:23",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.275
    },
    {
        "id": 260459290,
        "title": "Adar Poonawalla-led Serene Productions to pick 50% stake in KJo’s Dharma",
        "text": "New Delhi: Vaccine maker Serum Institute of India CEO Adar Poonawalla-led Serene Productions on Monday said it will pick 50 per cent stake in Karan Johar's Dharma Productions and Dharmatic Entertainment for Rs 1,000 crore.\r\n\r\nSerene Productions has entered into a binding agreement to invest Rs 1,000 crore in production house Dharma Productions and Dharmatic Entertainment (Dharma), the company said in a statement.\r\n\r\nSubsequently, Serene Productions will hold a 50 per cent stake in Dharma, with Johar retaining the remaining 50 per cent ownership, it added.\r\n\r\n\"Poonawalla's investment values Dharma at Rs 2,000 crore,\" the statement said. \"We hope to build and grow Dharma and scale even greater heights in the years to come,\" Poonawalla said on the investment.\r\n\r\nOn the investment by Serene Productions, Johar said, \"This partnership represents a perfect blend of our emotional storytelling prowess and forward-thinking business strategies. It's about honouring our roots while embracing the future of global entertainment.\"\r\n\r\nUnder the new structure, Johar as the executive chairman will spearhead the company's creative vision, while Apoorva Mehta, in his role as the chief executive officer, will work with Johar in steering the strategic direction and overseeing the operations, the statement said.\r\n\r\nThe collaboration aims to further transform content creation, distribution and audience engagement by integrating advanced technologies and pioneering production methods, it added.\r\n\r\nThe development comes at a time when India's entertainment industry has experienced significant expansion, driven by surging digital penetration and a diverse audience seeking high-quality content across multiple platforms, with growing global relevance, the company said.",
        "summary": "Enters into binding agreement to invest Rs 1,000 crore in Dharma Productions and Dharmatic Entertainment",
        "url": "https://telanganatoday.com/adar-poonawalla-led-serene-productions-to-pick-50-stake-in-kjos-dharma",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/10/Adar-Poonawalla-led-Serene-.jpg",
        "video": null,
        "publish_date": "2024-10-21 06:17:00",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.243
    }
]