[
    {
        "id": 262183726,
        "title": "PM Modi to address two election rallies in Jharkhand today",
        "text": "Ranchi: Prime Minister Narendra Modi is scheduled to address two rallies in poll-bound Jharkhand on Monday.He will address the election rallies in Chaibasa and Garhwa.\"Prime Minister Modi is scheduled to arrive at Gaya airport in Bihar around 11 am and fly to Garhwa via helicopter to address a rally there,\" a senior BJP leader told PTI.After addressing the rally in Garhwa, the PM is scheduled to come to Ranchi and from there, he will travel to Chaibasa where he is scheduled to address another rally around 2.30 pm, he said.Last week, Union Agriculture Minister Shivraj Singh Chouhan, who is also the election-in-charge of Jharkhand, said that all arrangements have been made for the PM's visit.Polling for the Jharkhand assembly elections will be held on November 13 and November 20. The counting of votes will be held on November 23.Union Home Minister Amit Shah addressed three political rallies here on Sunday and released the BJP's election manifesto.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/current-affairs/pm-modi-to-address-two-election-rallies-in-jharkhand-today-1835319",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/04/1858971-modi.webp",
        "video": null,
        "publish_date": "2024-11-04 02:41:36",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.332
    },
    {
        "id": 262198622,
        "title": "Mumbai police release woman held for sending threat message about UP CM Adityanath",
        "text": "Mumbai: The Mumbai police have released the 24-year-old woman apprehended for allegedly giving a death threat to Uttar Pradesh Chief Minister Yogi Adityanath after interrogating her, an official said on Monday.Fatima Khan, an IT graduate living with her family in Ulhasnagar, Thane district, was nabbed in a joint operation by the Maharashtra Anti-Terrorism Squad and police. The official said she was brought to Mumbai for interrogation, served a notice, and later released on Sunday.According to the police, Khan is well-qualified but mentally unstable. Her father works in the timber business. The Mumbai traffic police on Saturday received a WhatsApp message from an unknown number threatening that if Adityanath did not resign as Uttar Pradesh chief minister in 10 days, he would be killed like NCP leader Baba Siddique, who was gunned down last month.During the probe, it was found that Khan had sent the message, and she was apprehended from Ulhasnagar in a joint operation by the ATS and police. The police are on alert as Adityanath is expected to visit Maharashtra to campaign for the November 20 assembly elections.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/mumbai-police-release-woman-held-for-sending-threat-message-about-up-cm-adityanath-1835350",
        "image": "https://www.deccanchronicle.com/h-upload/2024/07/05/1101814-yogi.webp",
        "video": null,
        "publish_date": "2024-11-04 06:51:39",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.531
    },
    {
        "id": 262192964,
        "title": "Violence at Hindu temple in Canada is unacceptable: Justin Trudeau",
        "text": "Ottawa: Prime Minister Justin Trudeau on Monday condemned the attack on a Hindu temple in Brampton by alleged Khalistani extremists and said that every Canadian has the right to practice their faith freely and safely.On Sunday, Peel Regional Police said that a protest occurred at a Hindu temple in Brampton and unverified videos circulating on social media appeared to show demonstrators holding banners in support of Khalistan, Canadian Broadcasting Corporation reported.The videos appear to show fist fights and people striking each other with poles on what appears to be the grounds surrounding the Hindu Sabha Mandir temple, the report added.Taking to X, Trudeau thanked the local authorities for the swift response to protect the community and probe this incident.\"The acts of violence at the Hindu Sabha Mandir in Brampton today are unacceptable. Every Canadian has the right to practice their faith freely and safely. Thank you to the Peel Regional Police for swiftly responding to protect the community and investigate this incident,\" Trudeau said in a post on X on Monday.Peel Regional Police said on X Sunday afternoon that they were aware of the protest taking place at the Hindu Sabha Mandir, and had increased its presence at the temple to maintain public order and safety.\"We respect the right to protest in a peaceful and safe manner but will not tolerate violence and criminal acts,\" Chief Nishan Duraiappah posted on X Sunday after the videos began circulating.\"Those that do participate in this activity will be pursued, arrested and charged.\"Brampton Mayor Patrick Brown condemned the violence in a post on X Sunday afternoon, saying those responsible should be punished to the greatest extent of the law.\"I am disappointed to hear about acts of violence outside of the Hindu Sabha,\" he said. \"Religious freedom is a foundational value in Canada. Everyone should feel safe in their place of worship.\"The recent attack on the Hindu Sabha temple in Brampton witnessed widespread condemnation by Canadian politicians, including opposition leader Pierre Poilievre.\"Completely unacceptable to see violence targeting worshippers at the Hindu Sabha Mandir in Brampton today. All Canadians should be free to practice their faith in peace. Conservatives condemn this violence unequivocally. I will unite our people and end the chaos,\" Poilievre said on X.Meanwhile, the High Commission of India in Ottawa also issued a strong statement on Monday condemning the recent attack on Brampton's Hindu Sabha temple by \"anti-India\" elements.This incident disrupted a consular event co-organised by the Hindu Sabha Mandir and the Indian consulate.In its statement, the High Commission remarked, \"We have seen violent disruption today (November 3), orchestrated by anti-India elements outside the consular camp co-organised with the Hindu Sabha Mandir in Brampton, near Toronto.\"The statement further added, \"We also remain very concerned for the safety of applicants, including Indian nationals, on whose demand such events are organised in the first place. Despite these efforts by anti-India elements, our Consulate was able to issue more than 1000 life certificates to the Indian and Canadian applicants...\"The relations between India and Canada came under severe strain following Prime Minister Justin Trudeau's allegations in September last year of a \"potential\" involvement of Indian agents in Khalistan extremist Hardeep Singh Nijjar's killing.New Delhi rejected Trudeau's charges as \"absurd\".India has been maintaining that the main issue between the two countries is that of Canada giving space to pro-Khalistan elements operating from Canadian soil with impunity.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/world/violence-at-hindu-temple-in-canada-is-unacceptable-justin-trudeau-1835333",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/04/1859005-aa-336335711zon.webp",
        "video": null,
        "publish_date": "2024-11-04 05:43:53",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.059
    },
    {
        "id": 262195244,
        "title": "National Conference MLA Abdul Rahim Rather elected J-K Assembly speaker",
        "text": "Srinagar: Veteran National Conference leader and seven-time MLA from Charar-e-Sharief Abdul Rahim Rather was on Monday elected the first speaker of the legislative assembly of the Union Territory of Jammu and Kashmir.Rather (80) was elected the speaker with a voice vote after the opposition parties decided against contesting for the post. Protem Speaker Mubarak Gul conducted the election.Minister for Agriculture Javed Ahmad Dar moved a motion to name Rather for the post of speaker, while NC's MLA Ramban Arjun Singh Raju seconded the motion on the first day of the five-day session.After his election, Rather was escorted to the chair by the Leader of the House Omar Abdullah, and Leader of Opposition, BJP's Sunil Sharma.Rather had earlier held the post of the speaker in the legislative assembly of the erstwhile state of Jammu and Kashmir. He was also the leader of the opposition from 2002 to 2008 when the PDP-Congress coalition government ruled the state.The House met after a gap of more than six years, with the last session held in early 2018, a year before the reorganisation of Jammu and Kashmir into two union territories.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/national-conference-mla-abdul-rahim-rather-elected-j-k-assembly-speaker-1835342",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/04/1859014-speaker.webp",
        "video": null,
        "publish_date": "2024-11-04 06:08:50",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.119
    },
    {
        "id": 262195980,
        "title": "Jaishankar inaugurates new Indian consulate in Brisbane, pays homage to Gandhi",
        "text": "Brisbane: External Affairs Minister S Jaishankar on Monday inaugurated the new Consulate General of India in Brisbane, underlining that this will contribute to strengthening India's ties with the Queensland state, promoting trade and serving the diaspora. Jaishankar, arrived in Australia on Sunday on the first leg of his two-nation tour which will also take him to Singapore.\"Delighted to formally inaugurate the new Consulate General of India in Brisbane today. It will contribute to strengthening India's ties with Queensland state, promoting trade, fostering educational linkages and serving the diaspora. Thank H.E Dr. Jeannette Young, Governor of Queensland and Ministers @Ros_Bates_MP and @FionaSimpsonMP for joining the inauguration ceremony,\" Jaishankar posted on X.This is India's fourth consulate in Australia in Brisbane. The rest are in Sydney, Melbourne and Perth. The External Affairs Minister also paid his tributes to Mahatma Gandhi at Roma Street Parklands in Brisbane on Monday. \"His message of peace and harmony resonates through the world,\" Jaishankar said in a post on X.Jaishankar also met the Governor of Queensland, in Brisbane on Monday. \"Pleased to meet H.E Dr Jeannette Young, Governor of Queensland, in Brisbane today. Discussed opportunities and ways to strengthen economic, trade and investment cooperation with the Queensland state,\" he posted on X.During the visit, Jaishankar will co-chair the 15th Foreign Ministers' Framework Dialogue (FMFD) with his Australian counterpart Penny Wong in Canberra.He will deliver the keynote address at the inaugural session of the 2nd Raisina Down Under in the Australian Parliament House. He is scheduled to interact with Australian leaders, parliamentarians, the business community, media and think tanks.From Australia, Jaishankar will travel to Singapore, where he will address the 8th Roundtable of the ASEAN-India Network of Think Tanks. He will also meet the leadership of Singapore to review the close partnership between the two countries.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/world/australia-and-new-zealand/jaishankar-inaugurates-new-indian-consulate-in-brisbane-pays-homage-to-gandhi-1835345",
        "image": "https://www.deccanchronicle.com/h-upload/2024/07/17/1824817-foreignministersjaishankar.webp",
        "video": null,
        "publish_date": "2024-11-04 06:15:59",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.725
    },
    {
        "id": 262188414,
        "title": "Naidu will not support any Bill that harms Muslims, says TDP leader",
        "text": "New Delhi: Amid opposition to the Waqf (Amendment) Bill from several Muslim bodies, senior leader of key NDA constituent TDP, Nawab Jan, on Sunday said Andhra Pradesh Chief Minister N Chandrababu Naidu will not let any Bill that harms the interests of the Muslims be implemented.\r\n\r\nAddressing the 'Samvidhan Bachao Sammelan' organised by Jamiat Ulema-e-Hind at the Indira Gandhi Indoor Stadium here, Jan urged everyone to come together to stop the Waqf (Amendment) Bill 2024 from being passed in Parliament. Chandrababu Naidu has always said he has two eyes -- one Hindu and one Muslim, Jan said.\r\n\r\n\"He (Naidu) says any harm done to one eye affects the whole body and we must keep this in mind as we move forward on the path of development,\" Jan said. The benefits that Muslims got under Naidu's rule are unprecedented since the Independence of the country, Jan, a senior leader of the Telugu Desam Party, said.\r\n\r\n\"Chandrababu is a person of a secular mindset -- such a person is our Chief Minister, (he) will not let a Bill that harms Muslims be implemented,\" he said. The TDP leader claimed that sending the Waqf (Amendment) Bill to Parliament's Joint Committee (JPC) could only be made possible because of Naidu.\r\n\r\nJan also claimed that Naidu a few days ago said that whether it is a Muslim institution or a Hindu institution or a Christian institution, it should have people of the same religion. \"We will tolerate everything, but will not tolerate any attempt to harm the unity of the country,\" Jan said.\r\n\r\nThe BJP does not have a majority in the Lok Sabha and its government at the Centre is reliant on the support of other parties such as the TDP and the Janata Dal (U). Stepping up its campaign against the Waqf (Amendment) Bill, the Jamiat Ulema-e-Hind on Sunday urged Chandrababu Naidu and JD(U)'s Nitish Kumar to heed the sentiments of the Muslims on the matter.\r\n\r\nThe Jamiat said the parties within the NDA that claim to be secular must distance themselves from supporting this \"dangerous\" legislation. A Joint Committee of Parliament is examining the contentious Waqf (Amendment) Bill, 2024.\r\n\r\nThe Bill was introduced in the Lok Sabha in August and referred to a Joint Parliamentary panel after a heated debate, with the government asserting the proposed law, did not intend to interfere with the functioning of mosques and the Opposition calling it a targeting of Muslims and an attack on the Constitution.",
        "summary": "Nawab Jan urges everyone to come together to stop the Waqf (Amendment) Bill 2024 from being passed in Parliament",
        "url": "https://telanganatoday.com/naidu-will-not-support-any-bill-that-harms-muslims-says-tdp-leader",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Chandrababu-Naidu.jpg",
        "video": null,
        "publish_date": "2024-11-04 04:20:44",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.412
    },
    {
        "id": 262183026,
        "title": "Naidu will not let any bill that harms Muslims' interests be implemented: TDP leader",
        "text": "New Delhi: Amid opposition to the Waqf (Amendment) Bill from several Muslim bodies, senior leader of key NDA ally TDP, Nawab Jan, on Sunday said Andhra Pradesh Chief Minister N Chandrababu Naidu will not let any bill that harms the interests of Muslims be implemented. Addressing the 'Samvidhan Bachao Sammelan' organised by Jamiat Ulema-e-Hind at the Indira Gandhi Indoor Stadium here, Jan said everyone should come together unitedly to stop the Waqf (Amendment) Bill 2024 from being passed in Parliament.Chandrababu Naidu has always said he has two eyes -- one Hindu and one Muslim, Jan said.\"He (Naidu) says any harm done to one eye affects the whole body and we must keep this in mind as we move forward on the path of development,\" Jan said.The benefits that Muslims got under Naidu's rule are unprecedented since the independence of the country, Jan, a senior leader of the Telegu Desam Party, said.\"Chandrababu is a person of a secular mindset -- such a person is our chief minister, (he) will not let a bill that harms Muslims be implemented,\" he said.The TDP leader claimed that sending the Waqf (Amendment) Bill to Parliament's Joint Committee (JPC) was also possible because of Naidu and he had stalled this bill from being passed for the time being by doing so.Jan also claimed that Naidu had given a statement a few days ago that whether it is a Muslim institution or a Hindu institution or a Christian institution, it should have people of the same religion.\"We will tolerate everything, but will not tolerate any attempt to harm the unity of the country,\" Jan said.The Bharatiya Janata Party (BJP) does not have a majority in the Lok Sabha and its government at the Centre is reliant on the support of other parties such as the TDP and the Janata Dal (U).A Joint Committee of Parliament is examining the contentious Waqf (Amendment) Bill, 2024.The bill was introduced in the Lok Sabha in August and referred to a Joint Parliamentary panel after a heated debate, with the government asserting the proposed law, did not intend to interfere with the functioning of mosques and the Opposition calling it a targeting of Muslims and an attack on the Constitution.The committee's meetings have often seen tempers fly with opposition members accusing the Chair of inviting different organisations, including those working for Hindu causes, that have no stake in the waqf issues and the BJP members charging their political rivals with deliberately disturbing the proceedings.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/naidu-will-not-let-any-bill-that-harms-muslims-interests-be-implemented-tdp-leader-1835318",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/04/1858968-naidu.webp",
        "video": null,
        "publish_date": "2024-11-04 02:12:43",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.484
    },
    {
        "id": 262212044,
        "title": "PM Modi terms JMM-led coalition 'Gushpaithiya Bandhan', 'Mafia ka Ghulam'",
        "text": "Ranchi: Prime Minister Narendra Modi on Monday launched a scathing attack on the JMM-led coalition in Jharkhand, labeling it a \"Ghuspaithiya Bandhan\" (infiltrators' alliance) and \"Mafia Ka Ghulam\" (mafia's slave) for allegedly supporting Bangladeshi infiltrators.Scams by coalition leaders in Jharkhand have become an industry and corruption has devoured Jharkhand like termites, the Prime Minister said.\"Appeasement politics has reached its pinnacle in Jharkhand where the JMM-led coalition is busy supporting Bangladeshi infiltrators. If this continues, tribal population in Jharkhand will shrink. This is a threat to tribal society and the country. This coalition has become a 'Gushpaithiya Bandhan' and a 'Mafia ka Gulam'\", Modi said addressing a rally in Jharkhand's Garhwa.This is the first visit of the PM to Jharkhand post announcement of assembly elections here which are scheduled on November 13 and November 20 with counting of votes on November 23.JMM, Congress, RJD are using Bangladeshi infiltrators for 'vote bank politics', facilitating them to settle in Jharkhand which is a threat to social structure, making the situation serious in Jharkhand, Modi said.\"If Sarastwati Vandana is prevented in schools, you can understand the level of threat. There is curfew during festivals...Durga Puja and all major festivals are being impacted,\" he said. Thousands of crores sent by Centre for various schemes are being devoured by JMM-led coalition's corrupt leaders in Jharkhand, he said.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/pm-modi-terms-jmm-led-coalition-gushpaithiya-bandhan-mafia-ka-ghulam-1835370",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/04/1858971-modi.webp",
        "video": null,
        "publish_date": "2024-11-04 08:55:27",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.077
    },
    {
        "id": 262199230,
        "title": "EC orders immediate transfer of Maharashtra DGP",
        "text": "New Delhi: Ahead of the Maharashtra Assembly polls, the Election Commission on Monday directed the state government to transfer DGP Rashmi Shukla with immediate effect following complaints from political parties, including the Congress, sources said.The poll body directed the Maharashtra chief secretary to hand over Shukla's charge to the next senior-most IPS officer in the cadre. The chief secretary was also directed to send a panel of three IPS officers by Tuesday afternoon for appointment as DGP, the sources said.Maharashtra goes to polls on November 20. During a recent review meeting, Chief Election Commissioner (CEC) Rajiv Kumar warned officials to not only be impartial and fair but also ensure that they are perceived as non-partisan in their conduct while carrying out their duties.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/ec-orders-immediate-transfer-of-maharashtra-dgp-1835352",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/04/1859028-untitleddesign2.webp",
        "video": null,
        "publish_date": "2024-11-04 06:58:27",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.029
    },
    {
        "id": 262235070,
        "title": "IPL auction set to be held in Riyadh at end of November",
        "text": "New Delhi: The Indian Premier League's high-profile auction will be held in the Saudi Arabian capital city of Riyadh in the last week of this month, sources in the BCCI confirmed on Monday.\"The IPL auctions will be held in Riyadh and it has been notified to the franchises. The likely dates are November 24 and 25,\" a BCCI source told PTI on conditions of anonymity.This year's auction is a mega one with high profile India stars like Rishabh Pant, KL Rahul, Shreyas Iyer and Arshdeep Singh are going to go under the hammer.The 10 franchises will collectively have around Rs 641.5 crore to spend for 204 slots that are available. Out of those 204 slots, 70 are earmarked for overseas players.As of now, 46 players have been retained by the 10 franchises with cumulative expenditure of Rs 558.5 crore.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/sports/ipl-auction-set-to-be-held-in-riyadh-at-end-of-november-1835397",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/04/1859111-untitleddesign43.webp",
        "video": null,
        "publish_date": "2024-11-04 11:54:11",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.364
    },
    {
        "id": 262217338,
        "title": "EC reschedules UP, Punjab, Kerala bypolls from Nov 13 to Nov 20",
        "text": "New Delhi: The Election Commission on Monday rescheduled assembly bypolls in Uttar Pradesh, Punjab and Kerala from November 13 to November 20 in view of festivals, an official statement said.Nine seats are going to polls in Uttar Pradesh, four in Punjab and one in Kerala.Parties including Congress, BJP, BSP and RLD had urged the poll body to reschedule the polls in view of various festivals, saying that it could impact voter turnout.According to the Congress, a significant portion of the electorate in the Palakkad assembly seat in Kerala will celebrate the festival of Kalpathi Rastholsavam from November 13 to 15.In Punjab, the party had said, the 555th Prakash Parv of Sri Guru Nanak Dev will be celebrated on November 15 and an 'akhand path' will be organised from November 13 onwards.BJP, BSP and RLD had said that in Uttar Pradesh, people travel for three-four days ahead of Kartik Purnima, which will be celebrated on November 15.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/ec-reschedules-up-punjab-kerala-bypolls-from-nov-13-to-nov-20-1835378",
        "image": "https://www.deccanchronicle.com/h-upload/2024/09/04/1837930-electioncommissionofindia.webp",
        "video": null,
        "publish_date": "2024-11-04 09:34:28",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.194
    },
    {
        "id": 262215878,
        "title": "SC relaxes Kerala journalistSiddiqu Kappan’s bail rider, says no need to report to UP police",
        "text": "New Delhi: The Supreme Court on Monday relaxed the bail condition imposed on Kerala journalist Siddique Kappan of reporting to a Uttar Pradesh police station every week in a UAPA case against him.\r\n\r\nA bench of Justices P S Narasimhan and Sandeep Mehta relaxed the condition imposed by the top court on Kappan at the time of his bail in September, 2022.\r\n\r\n\"The order dated September 9, 2022, is modified and it shall not be necessary for the petitioner to report to the local police station. The other prayers made in the present application can be agitated independently,\" said the bench.\r\n\r\nKappan was arrested in October, 2020 while on his way to UP's Hathras, where a Dalit woman had died after allegedly being sexually assaulted by a group of men.\r\n\r\nWhile granting bail to Kappan, the court had directed him to report to the police station concerned every week.\r\n\r\nThe top court had on September 17 asked the state government to file its reply on Kappan's plea. The top court granted him bail after he had spent almost two years in prison and observed every person had the right to free expression.\r\n\r\nKappan was then saddled with several bail conditions, including the one directing him to remain in Delhi for the following six weeks after his release from prison and reporting to the Nizamuddin police station every Monday.\r\n\r\n\"The appellant shall be taken to the trial court within three days and shall be released on bail on conditions as deemed fit by the trial court,\" the bench had said.\r\n\r\nThe court had, however, allowed him to travel to Malappuram in Kerala, his home state, after six months maintaining that he would have to report to the local police station and mark his presence there every Monday.\r\n\r\nKappan was directed not to leave Delhi's jurisdiction without the permission of the court besides being ordered to attend the trial court every day either personally or through his lawyer.\r\n\r\n\"The appellant shall deposit his passport with the investigative machinery,\" added the top court.\r\n\r\nThe case was registered against Kappan and three others under various provisions of the Indian Penal Code and the Unlawful Activities (Prevention) Act for allegedly having links with the Popular Front of India (PFI). The PFI had been accused in the past of funding protests against the Citizenship Amendment Act across the country and the police claimed that the accused persons had attempted to vitiate the law and order situation in Hathras. The woman in question had died at a Delhi hospital a fortnight after her alleged rape by four men from her village on September 14, 2020.\r\n\r\nShe was cremated in the middle of the night at her village but the family claimed that her last rites were performed without their consent and they were not allowed to being her mortal remains home one last time.",
        "summary": "A bench of Justices P S Narasimhan and Sandeep Mehta relaxed the condition imposed by the top court on Kappan at the time of his bail in September, 2022.",
        "url": "https://telanganatoday.com/sc-relaxes-kerala-journalistsiddiqu-kappans-bail-rider-says-no-need-to-report-to-up-police",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Siddique-Kappan.jpg",
        "video": null,
        "publish_date": "2024-11-04 09:31:00",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.493
    },
    {
        "id": 262205216,
        "title": "SC relaxes bail condition on Kerala-based journalist Siddique Kappan in UAPA case",
        "text": "New Delhi: The Supreme Court on Monday allowed a plea by Kerala-based journalist Siddique Kappan seeking relaxation of a bail condition of reporting to police every week in a UAPA case registered against him. A bench of Justices P S Narasimhan and Sandeep Mehta relaxed the bail condition imposed by the top court on Kappan while granting bail in September 2022.\"The order dated September 9, 2022, is modified and it shall not be necessary for the petitioner to report to the local police station. The other prayers made in the present application can be agitated independently,\" the bench said.The top court had on September 17 asked the state government to file its reply on the plea of Kappan, who was arrested in October 2020 while on his way to Hathras in Uttar Pradesh after a Dalit woman from there died following gangrape.On September 9, 2022, the top court granted bail to Kappan, who was in jail for almost two years, while observing that every person has the right to free expression.It had laid down several conditions for bail, including that he would have to remain in Delhi for the next six weeks after release from prison and report to the Nizamuddin police station here on Monday every week.\"The appellant shall be taken to the trial court within three days and shall be released on bail on conditions as deemed fit by the trial court,\" the bench had said in the order.\"It shall be the condition of bail that the appellant shall stay within the jurisdiction of Nizamuddin area here in Delhi,\" it added.Elaborating further, the court had said, that after six months, he may travel to his native place Malappuram in Kerala and there also he will have to report to the local police station similarly, that is every Monday, and mark his presence in the register kept on that behalf.\"The appellant (Kappan) shall not leave the jurisdiction of Delhi without the express consent of the trial court,\" it had said, adding, \"The appellant shall either in person or through lawyer shall attend the trial court on every single day. The appellant shall deposit his passport with the investigative machinery.\"The FIR was filed under various provisions of the Indian Penal Code and the Unlawful Activities (Prevention) Act against four people, including Kappan, for having alleged links with the Popular Front of India (PFI).The PFI had been accused in the past of funding protests against the Citizenship Amendment Act across the country.The police had earlier claimed the accused were trying to disturb law and order in Hathras.The woman had died at a Delhi hospital a fortnight after her alleged rape by four men from her village on September 14, 2020. She was cremated in the middle of the night in her village.Her family had claimed the cremation was held without their consent and that they were not allowed to bring home the body one last time.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/nation/sc-relaxes-bail-condition-on-kerala-based-journalist-siddique-kappan-in-uapa-case-1835362",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/04/1859044-untitleddesign36.webp",
        "video": null,
        "publish_date": "2024-11-04 08:03:19",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.574
    },
    {
        "id": 262196286,
        "title": "Wriddhiman Saha announces retirement, Ranji Trophy to be his last",
        "text": "New Delhi: Veteran India wicketkeeper-batter Wriddhiman Saha has announced his retirement from cricket, saying that the ongoing Ranji Trophy season will be his last.\r\n\r\nThe 40-year-old Bengal stumper has featured in 40 Tests and nine ODIs since making his international debut in 2010. \"After a cherished journey in cricket, this season will be my last. I am honoured to represent Bengal one final time, playing only in the Ranji Trophy before I retire,\" Saha said in a social media post.\r\n\r\n\r\n\r\nAfter a cherished journey in cricket, this season will be my last. I’m honored to represent Bengal one final time, playing only in the Ranji Trophy before I retire. Let’s make this season one to remember! pic.twitter.com/sGElgZuqfP\r\n— Wriddhiman Saha (@Wriddhipops) November 3, 2024\r\n\r\n\r\n\"Let's make this season one to remember,\" he added in a post that went up late on Sunday night. Saha was a part of India's red-ball set-up for a long time before he was informed by then head coach Rahul Dravid that the selectors and the team management were looking beyond him.\r\n\r\nHe was released from BCCI's central contracts' list last year. One of his most memorable knocks for India came during New Zealand's 2016 tour where he scored unbeaten fifties on a seaming track against a quality bowling attack comprising the likes of Trent Boult, Matt Henry, Neil Wagner and Mitchell Santner at the Eden Gardens.\r\n\r\nHe was adjudged player of the match for his exploits in that Test. A middle-order floater in the national line-up, his overall Test career yielded 1353 runs, including three hundreds. A stalwart of domestic cricket, he made his First Class debut for Bengal way back in 2007, amassing 7013 runs in 138 games.\r\n\r\nHe briefly served as Tripura's player-cum-mentor after a rift with some Cricket Association of Bengal officials in 2022. However, following a meeting with former India captain Sourav Ganguly, Saha returned to Bengal this season.\r\n\r\nHe also played 170 Indian Premier League matches, representing various teams including Kolkata Knight Riders, Sunrisers Hyderabad and Gujarat Titans. His lone hundred in the tournament came in the 2014 final for Punjab Kings against KKR.",
        "summary": "The 40-year-old Bengal stumper has featured in 40 Tests and nine ODIs since making his international debut in 2010",
        "url": "https://telanganatoday.com/wriddhiman-saha-announces-retirement-ranji-trophy-to-be-his-last",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Wriddhaman-Saha.jpg",
        "video": null,
        "publish_date": "2024-11-04 06:10:58",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.376
    },
    {
        "id": 262192544,
        "title": "Wriddhiman Saha announces retirement from cricket",
        "text": "New Delhi: Veteran India wicketkeeper-batter Wriddhiman Saha has announced his retirement from cricket, saying that the ongoing Ranji Trophy season will be his last.The 40-year-old Bengal stumper has featured in 40 Tests and nine ODIs since making his international debut in 2010.\"After a cherished journey in cricket, this season will be my last. I am honoured to represent Bengal one final time, playing only in the Ranji Trophy before I retire,\" Saha said in a social media post.\"Let's make this season one to remember,\" he added in a post that went up late on Sunday night.Saha was a part of India's red-ball set-up for a long time before being released from the central contracts' list last year.",
        "summary": "",
        "url": "https://www.deccanchronicle.com/sports/wriddhiman-saha-announces-retirement-from-cricket-1835327",
        "image": "https://www.deccanchronicle.com/h-upload/2024/11/04/1858991-untitleddesign29.webp",
        "video": null,
        "publish_date": "2024-11-04 05:21:00",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "category": "sports",
        "source_country": "in",
        "sentiment": 0.103
    },
    {
        "id": 262213732,
        "title": "Death toll in Uttarakhand bus accident rises to 36; CM announces Rs 4 lakh ex-gratia",
        "text": "Dehradun: A privately operated bus fell into a deep gorge in Uttarakhand's Almora district on Monday, killing at least 36 of the about 60 people on board and injuring 24.\r\n\r\nChief Minister Pushkar Singh Dhami announced a compensation of Rs 4 lakh for the next of those killed in the accident and a financial assistance of Rs one lakh for the injured, according to an official statement.\r\n\r\nOfficials said the chief minister is on his way to the accident spot.\r\n\r\nFour of the injured are serious out of which three were airlifted to AIIMS, Rishikesh and one was taken to Sushila Tiwari Hospital, Haldwani, Almora District Disaster Management Officer Vineet Pal said.\r\n\r\nThere were around 60 people on board the 43-seater bus when the accident took place, he said, adding that overloading of the vehicle could have led to the accident, he said.\r\n\r\nDistrict Magistrate Alok Kumar Pandey said the bus, operated by the Garhwal Motor Owner Association, was on its way from Pauri in Garhwal region to Ramnagar in Kumaon about 250 km away when the accident took place around 8 am. It is an overnight journey.\r\n\r\nThe 43-seater bus plunged into a 200-metre gorge and landed close to a rivulet in Almora's Marchula area just 35 km before its destination Ramnagar, he said.\r\n\r\nPolice and personnel of the National and State Disaster Response Forces rushed to the spot to launch a search and rescue operation, he added.\r\n\r\nAssistant Regional Transport Officers of Pauri and Almora were suspended following the accident in which a magisterial probe has been ordered.\r\n\r\nVisuals from the area pointed to the magnitude of the accident, the vehicle reduced to a mangled mess as it rolled down the forested, rocky slope and stopped just short of a stream. Rescuers could be seen working to pull out the passengers.\r\n\r\nPal said 36 people were killed in the accident and 24 injured.\r\n\r\nThe Garhwal Motor Owners Association bus was carrying people returning after spending the long weekend at home to work.\r\n\r\nUnion Home Minister Amit Shah condoled the loss of lives in the bus accident.\r\n\r\n\"The bus accident in Almora, Uttarakhand is extremely sad. I express my condolences to the families of those who lost their lives in this accident. The local administration is providing immediate treatment to the injured. I pray to God for the speedy recovery of the injured,\" Shah wrote on 'X' in Hindi.\r\n\r\nExpressing grief over the incident, Chief Minister Dhami said on X, \"Received very sad news of casualties of passengers in the unfortunate bus accident that took place in Marchula of Almora district. The district administration has been instructed to conduct relief and rescue operations swiftly.\"\r\n\r\n\"The local administration and SDRF teams are working swiftly to evacuate the injured and take them to the nearest health centre for treatment. Instructions have also been given to airlift the seriously injured passengers, if required,\" he said.",
        "summary": "Chief Minister Pushkar Singh Dhami announced a compensation of Rs 4 lakh for the next of those killed in the accident and a financial assistance of Rs one lakh for the injured",
        "url": "https://telanganatoday.com/death-toll-in-uttarakhand-bus-accident-rises-to-36-cm-announces-rs-4-lakh-ex-gratia",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Uttarakhan-Accident-1.jpg",
        "video": null,
        "publish_date": "2024-11-04 09:11:11",
        "author": "PTI",
        "authors": [
            "PTI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.636
    }
]