[
    {
        "id": 263065310,
        "title": "Ayushmann Khurrana calls “Thama” the first love story in horror comedy universe",
        "text": "Mumbai: Actor Ayushmann Khurrana, who will be seen in “Thama”, says it is the first love story of the horror comedy universe.\r\n\r\n“I’m excited that Dinesh Vijan feels this is the best time for me to enter his blockbuster horror-comedy universe in and as Thama,” Ayushmann told variety.com.\r\n\r\nThe film marks Ayushmann’s first venture into the genre. It is scheduled to release on Diwali 2025. The film marks a departure for the universe by incorporating a love story element. It also stars Rashmika Mandanna, Paresh Rawal, and Nawazuddin Siddiqui.\r\n\r\nAditya Sarpotdar directs from a screenplay by Niren Bhatt, Suresh Mathew, and Arun Fulara, with Dinesh Vijan and Amar Kaushik producing.\r\n\r\nThe actor emphasised the unique positioning of “Thama” within the horror-comedy universe.\r\n\r\n“The fact that ‘Thama’ is the first love story of the horror comedy universe is all the more exciting,” he said.\r\n\r\n“The promise of it being a ‘bloody’ love story is also a supremely unique and a compelling pitch for today’s audience who want clutter-breaking theatrical experiences. ‘Thama’ is that project, a total wildcard, a film that no one has seen in India. I’m really pumped to join the sets of this film and create a huge big screen experience with Dinesh and his entire team of fellow visionaries like Amar Kaushik, my director Aditya Sarpotdar and the writing genius Niren Bhatt.”\r\n\r\nThe actor is thrilled to be part of this universe’s legacy as it moves forward and also feels responsible to give audiences a theatrical experience that they will remember for years to come.\r\n\r\nKhurrana, who previously collaborated with Vijan on “Bala,” sees “Thama” as another opportunity for innovation.\r\n\r\n“Dinesh and I have a similar passion for disruption. ‘Thama’ is our second collaboration and it is so new that I can’t wait for the reaction of people when they see it in theaters next Diwali.”\r\n\r\n“The manner in which Dinesh is crafting this universe’s every beat is truly commendable and he deserves all the love and adulation that he is receiving. As a friend, collaborator and admirer of his work, I can only see this universe growing from strength to strength given the grand ideas of expansion that he has.”\r\n\r\nThe film follows Maddock’s recent successes with “Stree 2” and “Munjya,” further cementing the production house’s reputation for blending horror and comedy elements.\r\n\r\nFor the actor, this represents an addition to his diverse filmography, reports variety.com.\r\n\r\n“‘Thama’ is a project of a lifetime for me and I know that I will give my heart and soul for people to hopefully shower it with unanimous love,” he added.",
        "summary": "The film marks Ayushmann Khurrana's debut in the genre and is set to release during Diwali 2025. It introduces a love story element, marking a departure for the universe. The film also stars Rashmika Mandanna, Paresh Rawal, and Nawazuddin Siddiqui.",
        "url": "https://telanganatoday.com/ayushmann-khurrana-calls-thama-the-first-love-story-in-horror-comedy-universe",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Ayushmann-Khurrana-Thama-is-the-first-love-story-of-the-horror-comedy-universe.jpg",
        "video": null,
        "publish_date": "2024-11-06 11:30:53",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.842
    },
    {
        "id": 262972488,
        "title": "NYT ‘Needle’ points to Trump win with projection of 285 electoral college votes",
        "text": "New York: The famous election prognosticator, New York Times's 'Needle', was projecting an 84 per cent chance of a Donald Trump victory with about 295 electoral college votes based on its data at 10:30 p.m. Tuesday (9 a.m. Wednesday in India).\r\n\r\nThe 'Needle' swings as the data that comes in is analysed in real-time and makes the projection it considers valid at that time. A little before 10 p.m., it showed Trump at nearly 290 seats before swinging down five to 285 at 10 p.m. and rising 30 minutes later to 295.\r\n\r\nThe 'Needle' makes longer-range projections beyond those made by The Associated Press and networks like NBC and Fox News by combining the incoming polling trends with demographic and historical data.\r\n\r\nAt 10 p.m., the electoral college votes that have been called by the media were 198 for Trump to 112 for Kamala Harris. The New York Times was struggling with its computer systems because its union of technology workers was on strike over pay and working conditions.\r\n\r\nThe newspaper acknowledged the problem and wrote, \"Publishing the Needle live on election night relies on computer systems maintained by engineers across the company, including some who are currently on strike\u009d.\"\r\n\r\n\"How we display our election forecast will depend on those systems, as well as incoming data feeds, and we will only publish a live version of the 'Needle' if we are confident those systems are stable\u009d, it said.It is confident of the system's ability to handle the projections.\r\n\r\nOn the eve of the election, the newspaper's poll had given Harris a 3 per cent lead over Trump. The RealClear Polling's aggregation had Trump with a 0.6 per cent lead, which is a virtual tie.",
        "summary": "The 'Needle' swings as the data that comes in is analysed in real-time and makes the projection it considers valid at that time",
        "url": "https://telanganatoday.com/nyt-needle-points-to-trump-win-with-projection-of-285-electoral-college-votes",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/elections.jpg",
        "video": null,
        "publish_date": "2024-11-06 04:43:21",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.005
    },
    {
        "id": 263018808,
        "title": "Prabhas launches ‘The Script Craft’ to support writers",
        "text": "Mumbai: Actor Prabhas, whose movie 'Kalki 2898 AD' registered a solid success at the box-office, is moving up to the top of Maslow's hierarchy. The actor has launched The Script Craft, a platform dedicated to promoting and encouraging writers.\r\n\r\nThe initiative gives writers a platform where they can share their story ideas with a broad audience, showcase their creativity, and gain visibility. Writers can submit a 250-word synopsis of their story ideas. Audiences can then read and rate these submissions, with the highest-rated stories rising to the top.\r\n\r\nThe feedback system focuses on ratings rather than comments, creating a constructive environment that helps writers build confidence and receive positive support for their ideas.\r\n\r\nTo mark its launch, The Script Craft has introduced a special contest titled 'Imagine Your Favourite Hero with Superpowers.'\r\n\r\nWriters are invited to submit a maximum 3,500-word story reimagining a hero with superhuman abilities. The writer, selected based on audience engagement, will earn the opportunity to work as either an assistant writer or assistant director on a real project.\r\n\r\nIn addition, The Script Craft plans to expand with an audiobooks feature, allowing writers to turn their stories into immersive audio experiences.\r\n\r\nPrabhas's involvement in The Script Craft highlights his commitment to fostering a positive space for writers and encouraging unique storytelling.\r\n\r\nMeanwhile, on the work front, Prabhas has a string of projects in the pipeline including 'The Raja Saab', 'Salaar: Part 2' 'Shouryanga Parvam' for which he is set to reunite with Prashanth Neel, 'Kalki 2', and an untitled project with Hanu Raghavpudi.",
        "summary": "The initiative gives writers a platform where they can share their story ideas with a broad audience, showcase their creativity, and gain visibility",
        "url": "https://telanganatoday.com/prabhas-launches-the-script-craft-to-support-writers",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/prabhas.jpg",
        "video": null,
        "publish_date": "2024-11-06 08:57:54",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.765
    },
    {
        "id": 262969280,
        "title": "Maharashtra Assembly Elections 2024: Congress Leader Rahul Gandhi To Begin Poll Campaign Today From Nagpur",
        "text": "Of the 76 constituencies where the BJP and the Congress are engaged in a direct contest, 36 are in Vidarbha, which is the state's cotton belt. Of all the regions in the state, the BJP has fielded the most in Vidarbha (47), and dealing it a blow here will go a long way in paving the way for the MVA's return to power in the state.",
        "summary": "",
        "url": "https://www.freepressjournal.in/mumbai/maharashtra-assembly-elections-2024-congress-leader-rahul-gandhi-to-begin-poll-campaign-today-from-nagpur",
        "image": "https://media.assettype.com/freepressjournal/2024-08-12/4gp9cyth/Rahul Gandhi.jpg",
        "video": null,
        "publish_date": "2024-11-06 04:16:59",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": 0.398
    },
    {
        "id": 262957806,
        "title": "Rahul Gandhi to begin Maharashtra poll campaign today from Nagpur",
        "text": "Nagpur, Nov 6 (IANS) Congress leader Rahul Gandhi, the Leader of the Opposition in the Lok Sabha, will begin his poll campaign for the Maharashtra Assembly elections on Wednesday in Nagpur, where he will attend a “Samvidhan Sammelan” (Conference on Constitution). \n\nLater in the day, Rahul Gandhi will attend a public meeting in Mumbai where the Maha Vikas Aghadi’s (MVA) poll guarantees are expected to be announced.\n\nThe symbolism of choosing Nagpur is crucial as it is not just the headquarters of the RSS, the ideological parent of the BJP, but also the place where B.R. Ambedkar converted to Buddhism in 1956.\n\nNagpur is in the larger Vidarbha region which is of strategic importance in the battle for Maharashtra.\n\nOf the 76 constituencies where the BJP and the Congress are engaged in a direct contest, 36 are in Vidarbha, which is the state’s cotton belt. Of all the regions in the state, the BJP has fielded the most in Vidarbha (47), and dealing it a blow here will go a long way in paving the way for the MVA’s return to power in the state.\n\nVidarbha used to be a traditional Congress stronghold but the party lost its grip on it as the BJP won 44 of the 62 Assembly constituencies and the party was reduced to 10. Five years ago, the BJP’s tally fell to 29 but the Congress’s seat count rose to only 15. The party’s performance in the Lok Sabha elections, in which it won four of the 10 parliamentary seats in the region, has also given it a reason to hope.\n\nThe INDIA alliance bagged seven Lok Sabha constituencies, with only three going to the MahaYuti.\n\nOne of the major reasons attributed to the Congress and the MVA’s success was its campaign on the issues of the Constitution, reservation, and caste census. The Opposition had alleged that the BJP would pose a threat to the Constitution and the quota system if it returned to power with a bigger mandate than in 2019 when it won 303 seats overall. This resonated in Vidarbha, which has a vibrant and powerful Dalit movement and a sizable population of Other Backward Classes (OBCs).\n\nTwo of the Congress’s top leaders, including its State party President Nana Patole, and the Leader of the Opposition in the Assembly, Vijay Wadettiwar, are from Vidarbha. Apart from them, the party has several powerful second-rank leaders.\n\nOn Wednesday, Gandhi will visit the Deekshabhoomi, the site where Ambedkar converted to Buddhism, and then head to the Constitution conference organised by a non-political outfit called the OBC Yuva Manch.\n\n“The Maharashtra government was planning to introduce chapters of Manusmriti in the school curriculum. It is a bigger threat to Indian democracy. Safeguarding the Constitution, which has given rights to every Indian citizen, is our duty and the conference is organised for this aim,” said Anil Jaihind, the organiser of the programme.\n\n“It is an apolitical event. Several organisations across the state are going to join it and the Model Code of Conduct will be observed,” said Wadettiwar.\n\nOn Wednesday evening, Gandhi, Congress President Mallikarjun Kharge, Shiv Sena (UBT) Chief Uddhav Thackeray, and Nationalist Congress Party (SP) President Sharad Pawar will address a “Swabhiman Sabha” in Mumbai. At the event, MVA’s poll guarantees are expected to be announced.\n\nFarm loan waiver and caste census are likely to be among the major guarantees. The alliance could also announce a Universal Basic Income scheme to counter the Eknath Shinde government’s Majhi Ladki Bahin scheme under which Rs 1,500 is deposited in the accounts of women below the poverty line.",
        "summary": "Nagpur, Nov 6 (IANS) Congress leader Rahul Gandhi, the Leader of the Opposition in the Lok Sabha, will begin his poll campaign for the Maharashtra Assembly elections on Wednesday in Nagpur, where he will attend a &#8220;Samvidhan Sammelan&#8221; (Conference on Constitution). Later in the day, Rahul Gandhi will attend a public meeting in Mumbai where [&#8230;]",
        "url": "https://bhaskarlive.in/rahul-gandhi-to-begin-maharashtra-poll-campaign-today-from-nagpur/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/20241103111.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-11-06 01:50:43",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.096
    },
    {
        "id": 263043176,
        "title": "SC Asks Maharashtra Deputy CM Ajit Pawar's NCP Faction To Publish Disclaimer On 'Clock' Symbol In Party Advertisements Within 36 Hours",
        "text": "The apex court was dealing with an application filed by the Sharad Pawar faction demanding that the Ajit Pawar camp be temporarily allotted a new symbol for the Maharashtra Assembly elections instead of the clock.",
        "summary": "",
        "url": "https://www.freepressjournal.in/mumbai/sc-asks-maharashtra-deputy-cm-ajit-pawars-ncp-faction-to-publish-disclaimer-on-clock-symbol-in-party-advertisements-within-36-hours",
        "image": "https://media.assettype.com/freepressjournal/2024-11-06/78c5yqfi/Untitled-design-2024-11-06T162552.036.jpg",
        "video": null,
        "publish_date": "2024-11-06 11:01:43",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.4
    },
    {
        "id": 262978302,
        "title": "Ahead of Maha Assembly polls, BJP expels 40 rebels for ‘indiscipline’ (Ld)",
        "text": "Mumbai, Nov 6 (IANS) The Maharashtra BJP has expelled 40 of its leaders and workers from 37 Assembly constituencies for non-compliance of party discipline.\n\nThe move comes ahead of the November 20 Maharashtra Assembly polls.\n\nThe BJP, which has fielded its nominees in 148 constituencies projecting itself as a big brother in the Mahayuti, had earlier warned that it would not tolerate rebellion or indiscipline that can cost the party heavily in the crucial elections.\n\nState BJP chief Chandrashekhar Bawankule had sent a stern signal to the rebels, party workers and leaders, who had violated the party rules and its discipline, to fall in the party line or face expulsion.\n\nMost of the rebels and those, who had crossed the party line, were expelled late Tuesday night.\n\nState BJP office secretary Mukund Kulkarni had issued the expulsion orders.\n\n“Despite being the party office bearers, you have flouted the party discipline. Your action is against the party discipline and therefore you have been expelled with immediate effect, reads the expulsion order sent to the rebels.\n\nThe last date for filing nominations was November 4.\n\nThe BJP’s move comes after the growing chorus among the party cadres and leaders to take action against rebels amid the ongoing election process.\n\nA senior party functionary said: “It was brought to the notice of the state leaders that if the action is not taken against those crossing the party line, it will send a wrong message not just in the BJP but also in the Mahayuti alliance. The presence of rebels not just in constituencies where the BJP has fielded its candidates but also in the constituencies of Shiv Sena and NCP would have harmed the poll prospects of those nominees. Therefore, the party has swung into action and expelled those rebels.”\n\nThe list of expelled party functionaries included Shrikant Karle, Sopan Patil (Dhule rural), Mayur Kanse and Ashwani Sonawane (Jalgaon City), Gajanan Mahale (Akot), Nagesh Ghope (Washim), Tushar Bhartiya, who is the brother party legislator Shrikant Bhartiya (Badnera), former minister Jagdish Gupta (Amravati), Pramod Sinh Gadre (Achalpur), Somdutt Karanjikar (Sakoli), Shankar Madavi (Aamgaon), Brijbhushan Pazare (Chandrapur), Vasant Varjukar and Atesham Ali (Warora), Bhavik Bhagat and Natwarlal Untval (Umarkhed).\n\nBesides, Vaishali Deshmukh and Milind Deshmukh (Nanded North), Dilip Kandkurte and Sunil More (Nanded South), Satish Ghatge (Ghansavangi), Ashok Pangarkar (Jalna), Suresh Sonawane (Gangapur), Eknath Jadhav (Vaijapur), Kunal Suryavanshi (Maregaon Outer), Akash Salunkhe and Jayashree Garud (Baglan), Harish Bhagat (Nallasopara), Sneha Patil (Bhiwandi Rural), Varun Patil (Kalyan West), Gopal Zaveri (Magathane), Dharmendra Thakur (Jogeshwari East), Dilip Bhoir (Alibaug), Balasaheb Murkute (Nevasa), Shobha Banshetti (Solapur City North), Sunil Bandgar (Akkalkot), Suvarna Pachpute (Shrigonda) and Vishal Parab (Sawantwadi) were also expelled.\n\nAs the BJP has expelled the rebels in the party, the ball is in the court of allies Shiv Sena and NCP to take similar action.\n\nOn Tuesday, the BJP had ousted 30 leaders from the party in Jharkhand.\n\n(Sanjay Jog can be contacted at sanjay.j@ians.in)",
        "summary": "Mumbai, Nov 6 (IANS) The Maharashtra BJP has expelled 40 of its leaders and workers from 37 Assembly constituencies for non-compliance of party discipline. The move comes ahead of the November 20 Maharashtra Assembly polls. The BJP, which has fielded its nominees in 148 constituencies projecting itself as a big brother in the Mahayuti, had [&#8230;]",
        "url": "https://bhaskarlive.in/ahead-of-maha-assembly-polls-bjp-expels-40-rebels-for-indiscipline-ld/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411063255401.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-06 05:00:30",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.033
    },
    {
        "id": 263036982,
        "title": "Amid uproar over resolution on Article 370, J&K Assembly adjourned till Thursday (Ld)",
        "text": "Srinagar, Nov 6 (IANS) Following the pandemonium in the J&K Assembly on Wednesday by the BJP MLAs over the passing of a resolution to restore Article 370, Speaker Abdul Rahim Rather adjourned the House till Thursday. \n\nAs the BJP MLAs refused to maintain calm and allow the House to continue, a visibly distrusted Speaker told them to bring forth a no-confidence motion against him if the BJP was not satisfied with his conducting of the proceedings.\n\nAs heated exchanges continued inside the Assembly, senior BJP leader Sham Lal Choudhary called the deputy chief minister Surinder Choudhary to have become the ‘Jaichand of Jammu’ by piloting the resolution for restoration of Article 370.\n\nThe Assembly on Wednesday passed a resolution for the restoration of Article 370.\n\nThe resolution was moved by the deputy chief minister Surinder Choudhary and NC leader and minister Sakina Masood seconded the move. The resolution was moved by the government on the third day of the Assembly’s current session.\n\nBJP leader Sunil Sharma, who is also the Leader of the Opposition in the Assembly, resented the move strongly holding that when the business of the House was a debate on the Lt Governor’s address, how could the government move such a resolution?\n\nThe resolution moved by the government said, “This Assembly reaffirms the importance of the special and constitutional guarantees, which safeguarded the identity, culture and rights of the people of Jammu and Kashmir and expresses concern over the unilateral removal.\n\n“This Assembly calls upon the Government of India to initiate dialogue with elected representatives of people of J&K for restoration of special status, constitutional guarantees and to work out the constitutional mechanisms for restoring these provisions,” it said.\n\n“This Assembly emphasises that any process for restoration must safeguard both national unity and the legitimate aspirations of the people of J&K,” the resolution read.\n\nThe move evoked strong opposition and uproar from BJP leader Sunil Sharma, who said amid din in the House, “When business was about discussion on Lt Governor’s address, how this resolution could be moved,” he said.\n\nIndependent MLAs Sheikh Khurshid Ahmed, Shabir Ahmad, and Sajad Lone of the Peoples Conference (PC), CPI (M) MLA, Tusuf Tarigami and three MLAs of the Peoples Democratic Party (PDP) supported the resolution.\n\nSpeaker Abdul Rahim Rather put the motion to vote and it was passed by the majority of the House.\n\nInitially, the Speaker adjourned the House for 15 minutes after the chaos continued in the Assembly.\n\nThe passing of the resolution seeking restoration of statehood to J&K by the ruling National Conference (NC) would constitutionally have little impact, but at the political level, the passing of the resolution has brought the J&K government into direct confrontation with the Centre.\n\nArticle 370 and 35A were abrogated by the Parliament on August 5, 2019, and the power of the Parliament to do so was upheld by a constitutional bench of the Supreme Court.",
        "summary": "Srinagar, Nov 6 (IANS) Following the pandemonium in the J&#38;K Assembly on Wednesday by the BJP MLAs over the passing of a resolution to restore Article 370, Speaker Abdul Rahim Rather adjourned the House till Thursday. As the BJP MLAs refused to maintain calm and allow the House to continue, a visibly distrusted Speaker told [&#8230;]",
        "url": "https://bhaskarlive.in/amid-uproar-over-resolution-on-article-370-jk-assembly-adjourned-till-thursday-ld/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411063255569.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-06 09:45:57",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.164
    },
    {
        "id": 262992568,
        "title": "Ranbir Kapoor’s ‘Ramayana’ to release on Diwali 2026",
        "text": "Mumbai: The makers of the Ranbir Kapoor-starrer 'Ramayana Part 1 and Ramayana Part 2' have set Diwali 2026 and Diwali 2027 as the release dates for his upcoming films.\r\n\r\nThe film's first poster, revealing Ranbir in the role of Lord Ram, has also been unveiled. This two-part epic is directed by Nitesh Tiwari, with the release dates confirmed by Namit Malhotra from Prime Focus Studios.\r\n\r\nIn a statement, Namit shared, \"More than a decade ago, I embarked on a noble quest to bring this epic that has ruled billions of hearts for over 5000 years to the big screen. And today, I am thrilled to see it taking shape beautifully as our teams work tirelessly with only one purpose: to present the most authentic, sacred, and visually stunning adaptation of our history, our truth, and our culture our 'RAMAYANA' for people across the world. Join us as we fulfill our dream of bringing our greatest epic to life with pride and reverence; Part 1 in Diwali 2026 and Part 2 in Diwali 2027.\"\u009d\r\n\r\nNamit Malhotra also revealed the first poster of the film on his Instagram handle. The poster features a magical arrow glowing with a golden aura. The poster reads, \"Namit Malhotra's Ramayana\" along with the release date, which has been announced two years before. 'Ramayana' will be a two-part film and will be released over the course of 2026 and 2027.\r\n\r\nBesides Ranbir Kapoor, the upcoming film will star Sai Pallavi as Sita and Yash as Raavan. Ranbir will be seen essaying the role of Lord Ram in the same. Lara Dutta will portray Kaikeyi, Sunny Deol takes on the role of Hanuman, and Sheeba Chaddha will appear as Manthara.\r\n\r\nEarlier this year, a leaked photo from the set showing Ranbir and Sai in full costume went viral on social media. Namit Malhotra has been a key player in some of Hollywood's major productions, such as \"Dune\" and \"Inception\", along with recent releases like \"The Garfield Movie\". He also recently announced the upcoming \"Angry Birds 3.\"",
        "summary": "The film's first poster, revealing Ranbir in the role of Lord Ram, has also been unveiled. This two-part epic is directed by Nitesh Tiwari, with the release dates confirmed by Namit Malhotra from Prime Focus Studios.",
        "url": "https://telanganatoday.com/ranbir-kapoors-ramayana-to-release-on-diwali-2026",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/ramatana.jpg",
        "video": null,
        "publish_date": "2024-11-06 07:00:43",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "entertainment",
        "source_country": "in",
        "sentiment": 0.334
    },
    {
        "id": 263036972,
        "title": "Malyalam actor Nivin Pauly gets clean chit in sexual assault case",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Kochi, Nov 6 (IANS) Malayalam actor Nivin Pauly on Wednesday got a clean chit by police in the sexual assault case. The police team, probing the case, filed a report in the local court for dropping the name of Pauly from the list of accused, while the investigation against the other five will continue. In [&#8230;]",
        "url": "https://bhaskarlive.in/malyalam-actor-nivin-pauly-gets-clean-chit-in-sexual-assault-case/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411063255571.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-06 09:48:35",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 263032214,
        "title": "Malayalam actor Nivin Pauly gets clean chit in sexual assault case",
        "text": "Kochi: Malayalam actor Nivin Pauly on Wednesday got a clean chit by police in the sexual assault case.\r\n\r\nThe police team, probing the case, filed a report in the local court for dropping the name of Pauly from the list of accused, while the investigation against the other five will continue.\r\n\r\nIn September, a woman accused the actor and five others of sexually assaulting her. Soon after the woman levelled the allegations, 40-year-old Pauly denied the accusations, saying he had never seen nor spoken to the complainant.\r\n\r\nAfter two days, Pauly filed a complaint with the State Police Chief (SPC) seeking a probe into what he termed were \"baseless\" accusations.\r\n\r\nPauly said that he would fight it legally to prove his innocence. He said that he would fight the case not only for himself but also for people facing similar accusations by women.\r\n\r\nIncidentally, when the name of Pauly surfaced, it attracted a lot of traction as on August 19, the Justice Hema Committee report was made public and highlighted the pitiable conditions of women in the film industry including sexual exploitation.\r\n\r\nPauly, who has won two Kerala Film Awards, started as a software engineer before joining the film industry in 2010. He has worked in over 50 films, of which many were box-office hits.\r\n\r\nHe turned producer with 'Action Hero Biju' in 2016 under his banner Pauly Jr. Pictures, which turned out to be a super grosser.",
        "summary": "The police team, probing the case, filed a report in the local court for dropping the name of Pauly from the list of accused, while the investigation against the other five will continue",
        "url": "https://telanganatoday.com/malayalam-actor-nivin-pauly-gets-clean-chit-in-sexual-assault-case",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Nivin-Pauly.jpg",
        "video": null,
        "publish_date": "2024-11-06 10:04:56",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.213
    },
    {
        "id": 263023568,
        "title": "Ranji Trophy: Jalaj Saxena becomes first player with 6000 runs and 400 wickets",
        "text": "The information contained in this website is for general information purposes only. The information is provided by BhaskarLive.in and while we endeavour to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\n\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n\nThrough this website you are able to link to other websites which are not under the control of BhaskarLive.in We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\n\nEvery effort is made to keep the website up and running smoothly. However, BhaskarLive.in takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n\nFor any legal details or query please visit original source link given with news or click on Go to Source.\n\nOur translation service aims to offer the most accurate translation possible and we rarely experience any issues with news post. However, as the translation is carried out by third part tool there is a possibility for error to cause the occasional inaccuracy. We therefore require you to accept this disclaimer before confirming any translation news with us.\n\nIf you are not willing to accept this disclaimer then we recommend reading news post in its original language.",
        "summary": "Thumba (Kerala), Nov 6 (IANS) Kerala’s all-rounder Jalaj Saxena became the first player to achieve the remarkable double of 6000 runs and 400 wickets in the Ranji Trophy during Elite Group C fourth round match against Uttar Pradesh at St Xavier&#8217;s College Ground. Saxena, who crossed the 6000-run mark in Kerala&#8217;s previous match in Kolkata, [&#8230;]",
        "url": "https://bhaskarlive.in/ranji-trophy-jalaj-saxena-becomes-first-player-with-6000-runs-and-400-wickets/",
        "image": "https://i0.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411063255528.jfif?ssl=1",
        "video": null,
        "publish_date": "2024-11-06 09:12:53",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "sports",
        "source_country": "in",
        "sentiment": -0.375
    },
    {
        "id": 263036970,
        "title": "Cabinet okays PM-Vidyalaxmi scheme to provide financial aid to\n meritorious students",
        "text": "New Delhi, Nov 6 (IANS) The Union Cabinet, chaired by Prime Minister Narendra Modi, on Wednesday approved the PM-Vidyalaxmi scheme to provide financial support to meritorious students in a mission mode. \n\nThe mechanism will facilitate and drive the extension of education loans to meritorious students who get admission in the top 860 quality higher educational institutions of the nation, translating to covering more than 22 lakh students every year.\n\nThese students will be eligible to get collateral-free, guarantor-free loans from banks and financial institutions to cover the full amount of tuition fees and other expenses related to the course.\n\nAccording to the Cabinet, for loan amounts up to Rs 7.5 lakh, the student will also be eligible for a credit guarantee of 75 per cent of outstanding default.\n\n“This will give support to banks in making education loans available to students under the scheme,” it said.\n\nIn addition, for students having an annual family income of up to Rs 8 lakh, and not eligible for benefits under any other government scholarship or interest subvention schemes, 3 per cent interest subvention for loans up to Rs 10 lakh will also be provided during the moratorium period.\n\n“The interest subvention support will be given to one lakh students every year. Preference will be given to students who are from government institutions and have opted for technical/ professional courses,” according to a Cabinet note.\n\nAn outlay of Rs 3,600 crore has been made from 2024-25 to 2030-31, and seven lakh fresh students are expected to get the benefit of this interest subvention during the period. This is in addition to the full interest subvention already being offered to students with up to Rs 4.5 lakh annual family income.\n\nPM-Vidyalaxmi is another key initiative stemming from the National Education Policy, 2020, which had recommended that financial assistance should be made available to meritorious students through various measures in both public and private higher education institutions (HEIs).\n\nThe scheme will be applicable to the top quality higher educational institutions of the nation, as determined by the NIRF rankings – including all HEIs, government and private, that are ranked within the top 100 in NIRF in overall, category-specific and domain-specific rankings; state government HEIs ranked in 101-200 in NIRF, and all Central government governed institutions.\n\nThe Department of Higher Education will have a unified portal “PM-Vidyalaxmi” on which students will be able to apply for the education loan as well as interest subvention, through a simplified application process to be used by all banks. Payment of interest subvention will be made through E-vouchers and Central Bank Digital Currency (CBDC) wallets.",
        "summary": "New Delhi, Nov 6 (IANS) The Union Cabinet, chaired by Prime Minister Narendra Modi, on Wednesday approved the PM-Vidyalaxmi scheme to provide financial support to meritorious students in a mission mode. The mechanism will facilitate and drive the extension of education loans to meritorious students who get admission in the top 860 quality higher educational [&#8230;]",
        "url": "https://bhaskarlive.in/cabinet-okays-pm-vidyalaxmi-scheme-to-provide-financial-aid-to-meritorious-students/",
        "image": "https://i3.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411063255604.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-06 10:15:37",
        "author": "IANS,Prime Minister Narendra",
        "authors": [
            "IANS",
            "Prime Minister Narendra"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.146
    },
    {
        "id": 263011296,
        "title": "J&K: Search operation continues in Bandipora, terrorist killed in Kupwara",
        "text": "Srinagar, Nov 6 (IANS) One terrorist was killed on Wednesday in a gunfight in Jammu & Kashmir’s Kupwara district, while a search operation continued for the second day in Bandipora district.\n\nOfficials said that a terrorist was killed in a gunfight between the security forces and terrorists in the Lolab area of Kupwara district.\n\n“One terrorist was killed in the Lolab area of Kupwara district in an encounter with the security forces. Operation continues against the terrorists in Lolab,” officials said.\n\n“Searches continued for the second day in Ketsun forest area of Bandipora district where one terrorist was killed yesterday and two security men were injured,” officials added.\n\nEver since an elected government took office in J&K, terrorists have increased their activities. The intelligence agencies believe that the terror handlers sitting across the border in Pakistan have been frustrated due to people-participative and peaceful Lok Sabha and Assembly elections in J&K.\n\nOn November 2, a top commander of the LeT identified as Usman Bhai alias Chota Waleed of Pakistan was killed after a day-long gunfight in the old Srinagar city Khanyar area.\n\nTwo local policemen and two CRPF troopers were injured in the Khanyar gunfight.\n\nLast month, terrorists killed six workers of an infrastructure project company and a local doctor in the Gagangir area of Ganderbal district. The workers were building a tunnel from Gagangir to Sonamarg tourist resort to make the Srinagar-Sonamarg an all-weather road and generate economic growth and employment in the area. Those killed in the Gagangir attack include six non-local workers and a local doctor belonging to Budgam district.\n\nLater, terrorists killed three army soldiers and two porters in the Botapathri area of Gulmarg in Baramulla district.\n\nTerrorists have also targeted non-local semi-skilled workers in Shopian and Budgam districts although the targets escaped with minor injuries.\n\nLt Governor Manoj Sinha has given clear orders to police and other security forces to go after terrorists, their harbourers, sympathisers and overground workers (OGWs).\n\nThe occurrence of terrorist attacks in places hitherto believed to be free of militancy has been a worrisome development for the security forces as a single terror-related incident disturbs peace that has been painstakingly achieved by the security forces.\n\nMeanwhile, taking a tough stand, Lt Governor Sinha said on Tuesday that those houses would be destroyed where shelter is provided to the terrorists.",
        "summary": "Srinagar, Nov 6 (IANS) One terrorist was killed on Wednesday in a gunfight in Jammu &#38; Kashmir’s Kupwara district, while a search operation continued for the second day in Bandipora district. Officials said that a terrorist was killed in a gunfight between the security forces and terrorists in the Lolab area of Kupwara district. “One [&#8230;]",
        "url": "https://bhaskarlive.in/jk-search-operation-continues-in-bandipora-terrorist-killed-in-kupwara/",
        "image": "https://i1.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202410293251255.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-06 08:01:14",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.131
    },
    {
        "id": 263014724,
        "title": "Andhra Pradesh HC quashes poll code violation case against Allu Arjun",
        "text": "Amaravati: In a huge relief to Tollywood actor Allu Arjun, the Andhra Pradesh High Court on Wednesday quashed a poll code violation case against him.\r\n\r\nOn a petition filed by the 'Pushpa' actor, the High Court quashed the First Information Report (FIR) booked by the Nandyal town police which alleged that he violated the poll code during the Assembly elections in May.\r\n\r\nThe actor on May 11 had visited the house of the Nandyal MLA and his friend Silpa Ravi, who was seeking re-election. As no prior permission was taken from the Returning Officer, a case was booked against him and the then MLA and YSR Congress candidate.\r\n\r\nAllu Arjun visited the then MLA's house to show his support on the last day of the campaigning. On getting to know about Allu Arjun's visit, a large number of his fans gathered outside the then MLA's house to see him.\r\n\r\nA local government official lodged a complaint against the actor at the Two Town Police Station for disobedience to an order duly promulgated by a public servant. Since Section 144 of the Election Code and Section 31 of the AP Police Act were in force, a case was registered against the actor and the YSRCP leader.\r\n\r\nTaking serious note of the incident, the Election Commission of India (ECI) ordered action against then Nandyal District Superintendent of Police Raghuveer Reddy for failing to implement the election code of conduct.\r\n\r\nThe poll panel had asked Andhra Pradesh Director General of Police to file charges against the SP. It also ordered a departmental inquiry against SP and two others.\r\n\r\nAllu Arjun had moved the High Court seeking quashing of the case against him. In an interim order on October 25, the court had directed that no legal action be taken against him until November 6.\r\n\r\nThe actor's counsel had argued that his visit to Nandyal was a personal one and had nothing to do with elections. He submitted to the court that Allu Arjun could not be held liable for the gathering outside the house of Silpa Ravi.\r\n\r\nSilpa Ravi, whose real name is Singareddy Ravichandra Kishore Reddy, suffered a defeat in the elections held on May 13.",
        "summary": "The actor on May 11 had visited the house of the Nandyal MLA and his friend Silpa Ravi, who was seeking re-election. As no prior permission was taken from the Returning Officer, a case was booked against him and the then MLA and YSR Congress candidate",
        "url": "https://telanganatoday.com/andhra-pradesh-hc-quashes-poll-code-violation-case-against-allu-arjun",
        "image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/allu-arjun.jpg",
        "video": null,
        "publish_date": "2024-11-06 08:33:04",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.584
    },
    {
        "id": 263011286,
        "title": "Andhra Pradesh HC quashes poll code violation case against Allu Arjun",
        "text": "Amaravati, Nov 6 (IANS) In a huge relief to Tollywood actor Allu Arjun, the Andhra Pradesh High Court on Wednesday quashed a poll code violation case against him.\n\nOn a petition filed by the ‘Pushpa’ actor, the High Court quashed the First Information Report (FIR) booked by the Nandyal town police which alleged that he violated the poll code during the Assembly elections in May.\n\nThe actor on May 11 had visited the house of the Nandyal MLA and his friend Silpa Ravi, who was seeking re-election.\n\nAs no prior permission was taken from the Returning Officer, a case was booked against him and the then MLA and YSR Congress candidate.\n\nAllu Arjun visited the then MLA’s house to show his support on the last day of the campaigning. On getting to know about Allu Arjun’s visit, a large number of his fans gathered outside the then MLA’s house to see him.\n\nA local government official lodged a complaint against the actor at the Two Town Police Station for disobedience to an order duly promulgated by a public servant.\n\nSince Section 144 of the Election Code and Section 31 of the AP Police Act were in force, a case was registered against the actor and the YSRCP leader.\n\nTaking serious note of the incident, the Election Commission of India (ECI) ordered action against then Nandyal District Superintendent of Police Raghuveer Reddy for failing to implement the election code of conduct.\n\nThe poll panel had asked Andhra Pradesh Director General of Police to file charges against the SP. It also ordered a departmental inquiry against SP and two others.\n\nAllu Arjun had moved the High Court seeking quashing of the case against him. In an interim order on October 25, the court had directed that no legal action be taken against him until November 6.\n\nThe actor’s counsel had argued that his visit to Nandyal was a personal one and had nothing to do with elections. He submitted to the court that Allu Arjun could not be held liable for the gathering outside the house of Silpa Ravi.\n\nSilpa Ravi, whose real name is Singareddy Ravichandra Kishore Reddy, suffered a defeat in the elections held on May 13.",
        "summary": "Amaravati, Nov 6 (IANS) In a huge relief to Tollywood actor Allu Arjun, the Andhra Pradesh High Court on Wednesday quashed a poll code violation case against him. On a petition filed by the &#8216;Pushpa&#8217; actor, the High Court quashed the First Information Report (FIR) booked by the Nandyal town police which alleged that he [&#8230;]",
        "url": "https://bhaskarlive.in/andhra-pradesh-hc-quashes-poll-code-violation-case-against-allu-arjun/",
        "image": "https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202411063255493.jpg?ssl=1",
        "video": null,
        "publish_date": "2024-11-06 08:01:57",
        "author": "IANS",
        "authors": [
            "IANS"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.614
    }
]