[
    {
        "id": 261761728,
        "title": "'Disengagement Process Is Nearly Complete,' Says Defence Minister Rajnath Singh On India-China Truce At LAC",
        "text": "The border standoff between India and China began in eastern Ladakh along the LAC in 2020, sparked by Chinese military actions. This incident led to prolonged tensions between the two nations, significantly straining their relations.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/disengagement-process-is-nearly-complete-says-defence-minister-rajnath-singh-on-india-china-truce-at-lac",
        "image": "https://media.assettype.com/freepressjournal/2024-10-31/9kltptk5/Untitled-design-49.jpg",
        "video": null,
        "publish_date": "2024-10-31 07:12:37",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.371
    },
    {
        "id": 261772620,
        "title": "'We Are Now Working Towards One Nation, One Election,' Says PM Modi On Rashtriya Ekta Diwas",
        "text": "\"...We are now working towards One Nation One Election, which will strengthen India's democracy, give optimum outcome of India's resources and the country will gain new momentum in achieving the dream of a developed India. Today, India is moving towards One Nation One Civil Code that is a Secular Civil Code,\" he said.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/we-are-now-working-towards-one-nation-one-election-says-pm-modi-on-rashtriya-ekta-diwas",
        "image": "https://media.assettype.com/freepressjournal/2024-10-31/852iaj2t/Untitled-design-51.jpg",
        "video": null,
        "publish_date": "2024-10-31 08:30:58",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "IN",
        "sentiment": 0.301
    },
    {
        "id": 261776970,
        "title": "PM Modi spends Diwali with troops in Kachchh, Gujarat",
        "text": "Prime Minister Narendra Modi on Thursday celebrated Diwali with the Border Security Force (BSF), Army, Navy, and Air Force personnel at Lakki Nala in Sir Creek area in Kachchh, Gujarat. The area PM is spending time in is an extremely inhospitable place, due to the very hot days and very cold nights. The terrain is also challenging. Prime Minister Modi has been spending Diwali with the troops since he took over in 2014. PM Modi also extended Diwali greetings to the people earlier today. “Many happy wishes to the countrymen on Deepawali. On this divine festival of lights, I wish everyone a healthy, happy and prosperous life. May everyone prosper with the blessings of Maa Lakshmi and Lord Shri Ganesha,” PM Modi said on X.Moreover, the PM honoured Sardar Vallabhbhai Patel at the Statue of Unity in Kevadia, Gujarat on the occasion of National Unity Day. “My salutations to Bharat Ratna Sardar Vallabhbhai Patel on his birth anniversary. Protecting the unity and sovereignty of the nation was the top priority of his life. His personality and work will continue to inspire every generation of the country,” PM Modi said on X.He also attended the parade organised and observed the air show by the Suryakiran Aerobatic Team of the Indian Air Force.Similarly, in line with the Prime Minister, the top defence brass of the country is also spending time with troops in different forward locations of the country. Defence Minister Rajnath Singh virtually inaugurated ‘Desh ka Vallabh’ statue of Sardar Vallabhbhai Patel and Major Ralengnao ‘Bob’ Khathing ‘Museum of Valour’ at Tawang from Tezpur. Chief of Defence Staff Gen Anil Chauhan is celebrating with troops deployed in the Andaman and Nicobar Command in Port Blair and took part in festivities there.Indian Army chief Gen Upendra Dwivedi is celebrating with troops in Arunachal Pradesh. Navy Chief Admiral Dinesh Tripathi is celebrating the festival with naval troops at Porbandar in Gujarat which sees a lot of action related to nefarious activities from the Pakistan side and smuggling of contraband.Indian Air Force chief Air Chief Marshal AP Singh is celebrating the festival with troops in the Jammu and Kashmir sector",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/pm-modi-spends-diwali-with-troops-in-kachchh-gujarat/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/pm-modi-spends-diwali-with-troops-in-kachchh-gujarat.jpg",
        "video": null,
        "publish_date": "2024-10-31 09:04:39",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.522
    },
    {
        "id": 261772104,
        "title": "Gujarat CM Bhupendra Pate pays tribute to Sardar Patel on his birth anniversary",
        "text": "Gujarat Chief Minister Bhupendra Patel and Assembly Speaker Shankar Chaudhary on Thursday Paid floral tribute to the Iron Man of India, Sardar Vallabhbhai Patel, on his birth anniversaryOn the 149th birth anniversary of Sardar Vallabhbhai Patel, the Iron Man of India and architect of a united India, Chief Minister Bhupendra Patel and Assembly Speaker Shankar Chaudhary paid floral tribute to Sardar Patel’s statue at the Gujarat Assembly complex and to his oil painting at the Assembly podium.On this occasion, Gandhinagar MLA Smt. Ritaben Patel, Mayor of Gandhinagar Smt. Miraben Patel, In-Charge Secretary of the Gujarat Assembly Chetan Pandya, Deputy Secretaries, other officials, employees, and municipal corporation corporators gathered to pay their tributes to Sardar Vallabhbhai Patel.In a post on X, Gujarat CM Bhupendra Patel shared the picture at the time of paying floral tribute and wrote, “On the occasion of the birth anniversary of Iron Man, Sardar Vallabhbhai Patel, expressed his gratitude by offering floral tributes to Sardar Saheb’s statue in the Gujarat Assembly premises and his oil painting in the assembly podium.”Earlier in the day, Prime Minister Narendra Modi paid tribute to Sardar Vallabhbhai Patel on his birth anniversary at the Statue of Unity in Kevadia, Gujarat.“My salutations to Bharat Ratna Sardar Vallabhbhai Patel on his birth anniversary. Protecting the unity and sovereignty of the nation was the top priority of his life. His personality and work will continue to inspire every generation of the country,” PM Modi said on X.After honouring Patel, the Prime Minister administered the Unity Oath and attended the ‘Rashtriya Ekta Diwas’ parade or the Unity Day Parade at the Parade Ground in Kevadia.Union Home Minister Amit Shah also paid tributes to Sardar Patel, “On his birth anniversary, a grateful nation salutes Bharat Ratna Sardar Vallabhbhai Patel, synonymous with unity and integrity, and wishes of National Unity Day to all the countrymen. On one hand, Sardar Saheb, with his strong will and hard work, united India divided into different princely states, and on the other hand, he contributed immensely in making the Constitution far-reaching and effective. Sardar Saheb’s loyalty, struggle and sacrifice towards the country will continue to inspire everyone on the path of national interest for ages.”Sardar Vallabhbhai Patel’s birth anniversary is celebrated as National Unity Day or Rashtriya Ekta Diwas on October 31. Since 2014, this day has been marked by ‘Run for Unity’ events nationwide, with participation from people from all walks of life. Born on October 31, 1875, in Nadiad, Gujarat, Sardar Patel is credited with uniting all 562 princely states of pre-independent India, helping to establish the Republic of India. He served as the country’s first Deputy Prime Minister and Home Minister from 1947 to 1950 and passed away on December 15, 1950",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/gujarat-cm-bhupendra-pate-pays-tribute-to-sardar-patel-on-his-birth-anniversary/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/gujarat-cm-bhupendra-pate-pays-tribute-to-sardar-patel-on-his-birth-anniversary.jpg",
        "video": null,
        "publish_date": "2024-10-31 08:48:36",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.333
    },
    {
        "id": 261769826,
        "title": "Himachal Pradesh Governor pays tribute to Sardar Patel on his birth anniversary",
        "text": "Himachal Pradesh Governor Shiv Pratap Shukla on Thursday paid tribute to Sadar Vallabhbhai Patel on his birth anniversary in Raj Bhavan. Secretary to the Governor, C.P. Verma was also present at the function organised at the Raj Bhavan in Himachal Pradesh. Employees and Officers at Raj Bhawan were administered to take an oath on National Unity Day.While speaking at the event organised at Raj Bhavan, HP Governor said that Sardar Patel was a symbol of national unity and made significant contribution to India’s independence. “Patelji, a symbol of national unity, made a significant contribution to the independence of the country and struggled throughout his life. His life was dedicated to national integration,” he said.The Governor congratulated everyone on the occasion of National Unity Day, which is celebrated on the birth anniversary of the ‘Iron Man of India’ Sardar Vallabhbhai Patel. Employess and Officers at Raj Bhawan were administered to take an oath on National Unity Day.During the oath, the participants dedicated themselves to maintan unity, integrity and security of the nation and made every effort to spread this message among the countrymen.Earlier on Thursday, President Droupadi Murmu paid floral tribute to country’s first Home Minister Sardar Vallabhbhai Patel in the national capital on his birth anniversary, which is also celebrated as ‘National Unity Day’.President Murmu urged people to take inspiration from Sardar Patel’s ideals to work relentlessly for nation building.In a post on X, she wrote, “Humble tributes from the grateful nation on the birth anniversary of Sardar Vallabhbhai Patel, the Iron Man who ensured the unification of the country! Sardar Patel was a great patriot and a leading nation builder. We should take inspiration from his ideals to work relentlessly for nation building.”On this occasion, Prime Minister Narendra Modi also paid tribute to Sardar Vallabhbhai Patel on his birth anniversary, at the Statue of Unity in Gujarat’s Kevadia. PM Modi also attended the Unity Day Parade at the Parade Ground in Kevadia.National Unity Day is celebrated on October 31 every year on the birth anniversary of Sardar Vallabhbhai Patel",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/himachal-pradesh-governor-pays-tribute-to-sardar-patel-on-his-birth-anniversary/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/himachal-pradesh-governor-pays-tribute-to-sardar-patel-on-his-birth-anniversary.jpg",
        "video": null,
        "publish_date": "2024-10-31 08:28:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.348
    },
    {
        "id": 261745944,
        "title": "Gujarat: PM Modi Pays Tribute To Sardar Vallabhbhai Patel On His 150th Birth Anniversary At Statue Of Unity, Attends Unity Day Parade (Watch)",
        "text": "Born on October 31, 1875, in Nadiad, Gujarat, Sardar Patel is credited with uniting all 562 princely states of pre-independent India, helping to establish the Republic of India. He served as the country's first Deputy Prime Minister and Home Minister from 1947 to 1950. He passed away on December 15, 1950.",
        "summary": "",
        "url": "https://www.freepressjournal.in/india/gujarat-pm-modi-pays-tribute-to-sardar-vallabhbhai-patel-on-his-150th-birth-anniversary-at-statue-of-unity-attends-unity-day-parade-watch",
        "image": "https://media.assettype.com/freepressjournal/2024-10-31/t4tqp8ii/Untitled-design-45.jpg",
        "video": null,
        "publish_date": "2024-10-31 03:41:31",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.599
    },
    {
        "id": 261744998,
        "title": "Gujarat: PM Modi pays tribute to Sardar Patel on birth anniversary at Statue of Unity, attends Unity Day parade",
        "text": "Prime Minister Narendra Modi paid tribute to Sardar Vallabhbhai Patel on his birth anniversary at the Statue of Unity in Kevadia, Gujarat, on Thursday. After honouring Patel, the Prime Minister administered the Unity Oath and attended the ‘Rashtriya Ekta Diwas’ parade or the Unity Day Parade at the Parade Ground in Kevadia.Earlier today, Prime Minister Modi paid tribute to Sardar Vallabhbhai Patel on his 150th birth anniversary, stating that Patel’s work continues to inspire future generations.“My salutations to Bharat Ratna Sardar Vallabhbhai Patel on his birth anniversary. Protecting the unity and sovereignty of the nation was the top priority of his life. His personality and work will continue to inspire every generation of the country,” PM Modi said on X. Ekta Diwas Parade comprises 16 marching contingents from nine states and one UT, four Central Armed Police Forces, NCC and a marching band. Special attractions include a Hell March contingent of the NSG, daredevil show by BSF and CRPF women and men bikers, a show on combination of Indian Martial Arts by BSF, a piped band show by school children and ‘Surya Kiran’ flypast by Indian Air Force.Sardar Vallabhbhai Patel’s birth anniversary is celebrated as National Unity Day or Rashtriya Ekta Diwas on October 31. Since 2014, this day has been marked by ‘Run for Unity’ events nationwide, which is participated by people from all walks of life.Born on October 31, 1875, in Nadiad, Gujarat, Sardar Patel is credited with uniting all 562 princely states of pre-independent India, helping to establish the Republic of India. He served as the country’s first Deputy Prime Minister and Home Minister from 1947 to 1950. He passed away on December 15, 1950",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/gujarat-pm-modi-pays-tribute-to-sardar-patel-on-birth-anniversary-at-statue-of-unity-attends-unity-day-parade/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-31 03:18:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.318
    },
    {
        "id": 261776968,
        "title": "Disengagement almost done, India-China armies exchange sweets at various border points in Ladakh on Diwali",
        "text": "Indian and Chinese Army troops on Thursday exchanged sweets at various border points in the Ladakh sector on the occasion of DiwaliIndian and Chinese Army exchange took place at Hot Springs, Karakoram Pass, Daulat Beg Oldi, KongkLa and Chushul-Moldo border meeting point in Ladakh on the occasion of Diwali. Earlier today, Defence Minister Rajnath Singh said that the disengagement process in LAC (Line of Actual Control) in eastern Ladakh is nearly complete.Defence Minister Rajnath Singh, while speaking during the inauguration ceremony of Bob Khathing Museum in Assam’s Tezpur, said, “At some areas along the LAC, discussions have been ongoing between India and China at both diplomatic and military levels to resolve conflicts.”“Following recent talks, there has been a broad consensus to restore the ground situation. This consensus has developed on the basis of equal and mutual security. Based on this consensus, the disengagement process is nearly complete. We will strive to move beyond just disengagement, but for that, we will need to wait a little longer,” Defence Minister Singh added. On Wednesday, Chinese Ambassador to India Xu Feihong said that it is natural for India and China to have differences as neighbouring countries but the important thing is how to handle and solve these differences. With India and China having completed the disengagement process between in Depsang and Demchok in eastern Ladakh, Xu Feihong said he is looking forward to smooth cooperation of between India and China in every field including politics, business and education.India and China have recently agreed on patrol arrangements along the Line of Actual Control (LAC) at the India-China border.The border standoff between India and China began in eastern Ladakh along the LAC in 2020, sparked by Chinese military actions. This incident led to prolonged tensions between the two nations, significantly straining their relations.Earlir, Chief of Army Staff, General Upendra Dwivedi stressed that restoring trust along the Line of Actual Control (LAC) would be a gradual process, to return to the April 2020 status quo, highlighting the steps of disengagement, de-escalation, and buffer zone management as crucial for easing tensions between the two nations. He further explained that the process will take place in phases, with each step aimed at reducing tensions",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/disengagement-almost-done-india-china-armies-exchange-sweets-at-various-border-points-in-ladakh-on-diwali/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-31 09:03:32",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.079
    },
    {
        "id": 261769236,
        "title": "Indian, Chinese army exchange sweets on Diwali at Chushul-Moldo border meeting point",
        "text": "Indian and Chinese Army on Thursday exchanged sweets and greetings at the Chushul-Moldo border meeting point in Eastern Ladakh on the occasion of Diwali. This comes amid the disengagement process in LAC (Line of Actual Control) in eastern Ladakh by the two armies. Earlier today, Defence Minister Rajnath Singh said on Thursday that the disengagement process in LAC (Line of Actual Control) in eastern Ladakh is nearly complete.Defence Minister Rajnath Singh, while speaking during the inauguration ceremony of Bob Khathing Museum in Assam’s Tezpur, said, “At some areas along the LAC, discussions have been ongoing between India and China at both diplomatic and military levels to resolve conflicts.”“Following recent talks, there has been a broad consensus to restore the ground situation. This consensus has developed on the basis of equal and mutual security. Based on this consensus, the disengagement process is nearly complete. We will strive to move beyond just disengagement, but for that, we will need to wait a little longer,” Defence Minister Singh added. On Wednesday, Chinese Ambassador to India Xu Feihong said that it is natural for India and China to have differences as neighbouring countries but the important thing is how to handle and solve these differences. With India and China having completed the disengagement process between in Depsang and Demchok in eastern Ladakh, Xu Feihong said he is looking forward to smooth cooperation of between India and China in every field including politics, business and education.India and China have recently agreed on patrol arrangements along the Line of Actual Control (LAC) at the India-China border.The border standoff between India and China began in eastern Ladakh along the LAC in 2020, sparked by Chinese military actions. This incident led to prolonged tensions between the two nations, significantly straining their relations.Earlir, Chief of Army Staff, General Upendra Dwivedi stressed that restoring trust along the Line of Actual Control (LAC) would be a gradual process, to return to the April 2020 status quo, highlighting the steps of disengagement, de-escalation, and buffer zone management as crucial for easing tensions between the two nations. He further explained that the process will take place in phases, with each step aimed at reducing tensions",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/indian-chinese-army-exchange-sweets-on-diwali-at-chushul-moldo-border-meeting-point/",
        "image": "https://thenewsmill.com/wp-content/uploads/2024/10/indian-chinese-army-exchange-sweets-on-diwali-at-chushul-moldo-border-meeting-point.jpg",
        "video": null,
        "publish_date": "2024-10-31 08:18:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.178
    },
    {
        "id": 261334780,
        "title": "Congress leader Priyanka Gandhi Vadra leaves from residence to kick off election campaign in Wayanad",
        "text": "Congress leader Priyanka Gandhi Vadra on Monday left her residence for Wayanad Lok Sabha by-elections. Vadra will be kicking off her election campaign on Monday. The Wayanad seat was vacated by Congress leader Rahul Gandhi after he was also elected to Lok Sabha from Raebareli in Uttar Pradesh in the general elections held earlier this year.Congress party approved Priyanka Gandhi’s candidature on October 15, after the bypoll schedule was announced by the Election Commission of India.On October 26, after Vadra filed her nomination papers for the Wayanad Lok Sabha polls, she penned down an open letter to the people of Wayanad. In a post on X, the letter is titled “My Dear Sisters and Brothers of Wayanad”, where she expressed her deep connection with the constituency and her commitment to serving the people. She said she would work closely with the people and address their challenges, especially those faced by the women and the tribal communities.Furthermore, talking about her brother’s relationship with Wayanad, Priyanka Gandhi acknowledged the pride and sadness Rahul Gandhi felt when he asked her to contest from the constituency. She assured the people of her dedication to building upon her brother’s establishment and vowed to continue representing their needs and concerns in Parliament.“I promised Rahul Gandhi that my work here will serve to deepen this bong and that I will do all I can to fight for you and represent you in the way that you wish to be represented in the Parliament,” added Priyanka Gandhi in her letter.Priyanka Gandhi further emphasised that she would prioritise issues affecting tribal communities as well as new opportunities for women. She expressed a deep commitment to “creating new opportunities to strengthen your future.“In her letter, Priyanka Gandhi also spoke about the devastation caused by the landslide and the losses suffered by the people. “Through the darkness of the tragedy, what shone through to me was your immense courage and fortitude as a community,” she wrote.Congress leader also talked about the importance of protecting Wayanad’s natural beauty and rich cultural heritage as central to the region’s development.She held a massive roadshow before the filing of her nomination. Congress leader Rahul Gandhi and other top leaders of the UDF participated in the roadshow.Wayanad will go to the polls on November 13 along with voting for bye-elections in 47 assembly seats across 15 states. The first phase of assembly polls in Jharkhand will also be held on November 13",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/congress-leader-priyanka-gandhi-vadra-leaves-from-residence-to-kick-off-election-campaign-in-wayanad/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-28 05:13:33",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": 0.308
    },
    {
        "id": 261356130,
        "title": "Rashid Engineer surrenders after interim bail expires, Delhi court defers order on regular bail",
        "text": "Independent Lok Sabha MP from Baramulla in Jammu and Kashmir, Engineer Rashid surrendered at Tihar Jail on Monday after his interim bail in a terror-funding case currently being investigated by the NIA expired.The Patiala House Court in New Delhi has deferred the pronouncement of order on regular bail for him till November 19 this year. On October 14, the court extended his interim bail on the health grounds of his ailing father and directed him to surrender to Tihar on October 28. The engineer initially got interim bail for campaigning in the recently held Jammu and Kashmir assembly elections.Polls for the 90-member Jammu and Kashmir Assembly were conducted in three phases from September 18 to October 1, with results announced on October 8, revealing a decisive victory for the National Conference-Congress alliance, which secured 48 seats.In 2005, Engineer Rashid was arrested by the Special Operations Group (SOG) in Srinagar for allegedly supporting militants and was held for three months and 17 days. He faced charges of anti-national activities and was incarcerated in Cargo, Humhama, and Raj Bagh prisons. However, the Chief Judicial Magistrate of Srinagar later dropped all charges against him on humanitarian grounds. In August 2019, Rashid was again arrested under the Unlawful Activities (Prevention) Act (UAPA). During his incarceration, he filed his nomination for the 2024 parliamentary elections from jail and won by a margin of 204,000 votes, defeating former Jammu and Kashmir Chief Minister Omar Abdullah",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/rashid-engineer-surrenders-after-interim-bail-expires-delhi-court-defers-order-on-regular-bail/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-28 09:18:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.096
    },
    {
        "id": 261322948,
        "title": "Hyderabad Police impose order prohibiting protests, gatherings to maintain public order",
        "text": "The Hyderabad Commissioner of Police imposed an order prohibiting public gatherings, dharnas and protests across the city for one month beginning from Sunday, October 27, in bid to maintain public order.Hyderabad City Police Commissioner CV Anand has issued the order under section 163 of Bharatiya Nagarik Suraksha Sanhita 2023 (earlier known as Section 144).This order prohibits the gathering of five or more persons, processions, rallies, public meetings and any display of symbols or messages that could incite a public disturbance.The notification issued by the Telangana police department stated that several organisations and parties are trying to create disturbances affecting public peace and order in Hyderabad city by resorting to dharna and protests.“Reliable information has been placed before me that several organizations, and parties are trying to create disturbances affecting public peace and order in Hyderabad City, by resorting to dharnas and protests,” the order read.“With a view to maintain public order. peace and tranquillity in Hyderabad City, I, CV Anand, IPS., Commissioner of Police, Hyderabad City in the exercise of the powers vested in me under section 163 of the Bharatiya Nagarik Suraksha Sanhita 2023 (earlier under section 144 CrPC) do hereby prohibit every kind of gathering of five or more persons, processions, dharnas, rallies or public meetings and prohibit any individual, groups of individuals from making any speeches, gestures or displaying pictures, any symbols, placards, flags and any type of messages of electronic form etc., which is likely to cause disturbance to the public peace and order in the limits of Hyderabad and Secunderabad,” it added.The police order further mentioned that peaceful dhamas and protests would allowed only at Indira Park Dharna Chowk, and any dharna or protest anywhere else in Hyderabad and Secunderabad is not permitted.“The public is hereby informed that any person violating the above orders, especially around the Secretariat and other sensitive places shall be liable for prosecution under appropriate penal provisions,” added the order",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/hyderabad-police-impose-order-prohibiting-protests-gatherings-to-maintain-public-order/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-28 01:18:34",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "category": "politics",
        "source_country": "in",
        "sentiment": -0.027
    },
    {
        "id": 261331478,
        "title": "Test stars absent as Australia announce T20I squad for Pakistan series",
        "text": "Australia named a 13-player squad for next month’s three-match T20I series at home against Pakistan, with the captain’s name yet to be announced due to their regular leaders being absent for Test cricket duties. There is no room for Australia’s Test stars as they will continue their preparation for the crucial five-match Test series against India that starts on November 22, meaning the Aussies will need to find a new skipper for the Pakistan series.Fast bowling trio Xavier Bartlett, Nathan Ellis and Spencer Johnson all return to the squad after recovering from injury, with white-ball regulars Glenn Maxwell, Marcus Stoinis, Adam Zampa and Josh Inglis also named for the series that commences in Brisbane on November 14, as per ICC. Regular white-ball skipper Mitch Marsh and Test captain Pat Cummins will be in Perth ahead of the opening Test against India, leaving selectors with the chance to appoint a new player to lead the side for the first time against Pakistan.Selection Chair George Bailey is looking forward to seeing what the group can produce in the absence of many of their first-choice player away on Test duties.“This group of players have all represented Australia in T20 cricket, so we look forward to them continuing to enhance their international experience throughout this series. We are excited by the mix of experience combined with those closer to the start of their international journeys,” Bailey said as quoted by ICC. “It is particularly encouraging to have Xavier, Spencer and Nathan back in the national setup. It’s another opportunity for them to continue to show their ability on the international stage, as they have done in the past,” he added. Australia T20I squad: Sean Abbott, Xavier Bartlett, Cooper Connolly, Tim David, Nathan Ellis, Jake Fraser-McGurk, Aaron Hardie, Josh Inglis, Spencer Johnson, Glenn Maxwell, Matthew Short, Marcus Stoinis, Adam ZampaSeries schedule:First T20I: November 14, BrisbaneSecond T20I: November 16, SydneyThird T20I: November 18, Hobart. (ANI)",
        "summary": "The News Mill",
        "url": "https://thenewsmill.com/2024/10/test-stars-absent-as-australia-announce-t20i-squad-for-pakistan-series/",
        "image": "https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg",
        "video": null,
        "publish_date": "2024-10-28 04:33:29",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.47
    },
    {
        "id": 261358568,
        "title": "A New Era In Healthcare: PM Modi To Launch Multiple Projects Worth Around ₹13,000 Crore On Ayurveda Day",
        "text": "As a major addition to the flagship scheme Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (PM-JAY), Prime Minister will launch expansion of health coverage to all senior citizens aged 70 years and above.",
        "summary": "",
        "url": "https://www.freepressjournal.in/business/a-new-era-in-healthcare-pm-modi-to-launch-multiple-projects-worth-around-13000-crore-on-ayurveda-day",
        "image": "https://media.assettype.com/freepressjournal/2024-10-03/anjq32yu/Narendra-Modi.jpg",
        "video": null,
        "publish_date": "2024-10-28 09:36:47",
        "author": "ANI",
        "authors": [
            "ANI"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": -0.043
    }
]